; ModuleID = 'a2dp_media_codec.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp_media_codec.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.a2dp_media_codec = type { i32, i32 (i32)*, i32 (i8*)*, i32 (i8*, i16)*, i32 (...)*, i32 (i8*)* }
%struct.user_interface_handler = type { void (i8*, i32, i32)*, void (i8, i8*, i8*)*, void (i8*, i32)*, i32 ()*, void (i8, i16, i8*, i16)*, void (i8*, i32, i32, i8)*, i32 ()*, void (i32)*, void (i8, i32, i8*, i16)*, i32 (i8*, i8, i8)*, void ()*, void (i8)*, i8 (i8*, i8, i8*, i32, i8)*, void (i8, i16, i8*, i16)*, i32 ()* }
%struct.a2dp_conn = type { [6 x i8], %struct.a2dp_core_data_t, %struct.avdtp, %struct.a2dp_media }
%struct.a2dp_core_data_t = type { i8 }
%struct.avdtp = type { [2 x %struct._avdtp_local_sep], %struct.avdtp_core_data_t }
%struct._avdtp_local_sep = type { %struct._avdtp_sep_ind*, %struct.avdtp*, %struct._seid_info, i8, [16 x i8] }
%struct._avdtp_sep_ind = type { i8 (i8, i8*, i8*)*, i8 (%struct._avdtp_local_sep*, i8*, i8, i8*)*, i8 (%struct._avdtp_local_sep*, %struct._avdtp_stream*, i8)*, i8 (%struct._avdtp_local_sep*, %struct._avdtp_stream*)*, i8 (%struct._avdtp_local_sep*, %struct._avdtp_stream*)*, i8 (%struct._avdtp_local_sep*, %struct._avdtp_stream*, i8*)*, void (%struct._avdtp_local_sep*)*, i8 (...)*, i8 (i8, i16)* }
%struct._avdtp_stream = type { i8 }

!15 = !DIEnumerator(name: "BT_STATUS_ENCRY_COMPLETE", value: 8)
!16 = !DIEnumerator(name: "BT_STATUS_FIRST_DISCONNECT", value: 9)
!17 = !DIEnumerator(name: "BT_STATUS_SECOND_DISCONNECT", value: 10)
!18 = !DIEnumerator(name: "BT_STATUS_PHONE_INCOME", value: 11)
!19 = !DIEnumerator(name: "BT_STATUS_PHONE_NUMBER", value: 12)
!20 = !DIEnumerator(name: "BT_STATUS_PHONE_MANUFACTURER", value: 13)
!21 = !DIEnumerator(name: "BT_STATUS_PHONE_OUT", value: 14)
!22 = !DIEnumerator(name: "BT_STATUS_PHONE_ACTIVE", value: 15)
!23 = !DIEnumerator(name: "BT_STATUS_PHONE_HANGUP", value: 16)
!24 = !DIEnumerator(name: "BT_STATUS_BEGIN_AUTO_CON", value: 17)
!25 = !DIEnumerator(name: "BT_STATUS_MUSIC_SOUND_COME", value: 18)
!26 = !DIEnumerator(name: "BT_STATUS_MUSIC_SOUND_GO", value: 19)
!27 = !DIEnumerator(name: "BT_STATUS_RESUME", value: 20)
!28 = !DIEnumerator(name: "BT_STATUS_RESUME_BTSTACK", value: 21)
!29 = !DIEnumerator(name: "BT_STATUS_SUSPEND", value: 22)
!30 = !DIEnumerator(name: "BT_STATUS_LAST_CALL_TYPE_CHANGE", value: 23)
!31 = !DIEnumerator(name: "BT_STATUS_CALL_VOL_CHANGE", value: 24)
!32 = !DIEnumerator(name: "BT_STATUS_SCO_STATUS_CHANGE", value: 25)
!33 = !DIEnumerator(name: "BT_STATUS_CONNECT_WITHOUT_LINKKEY", value: 26)
!34 = !DIEnumerator(name: "BT_STATUS_PHONE_BATTERY_CHANGE", value: 27)
!35 = !DIEnumerator(name: "BT_STATUS_RECONNECT_LINKKEY_LOST", value: 28)
!36 = !DIEnumerator(name: "BT_STATUS_RECONN_OR_CONN", value: 29)
!37 = !DIEnumerator(name: "BT_STATUS_BT_TEST_BOX_CMD", value: 30)
!38 = !DIEnumerator(name: "BT_STATUS_BT_TWS_CONNECT_CMD", value: 31)
!39 = !DIEnumerator(name: "BT_STATUS_SNIFF_STATE_UPDATE", value: 32)
!40 = !DIEnumerator(name: "BT_STATUS_TONE_BY_FILE_NAME", value: 33)
!41 = !DIEnumerator(name: "BT_STATUS_PHONE_DATE_AND_TIME", value: 34)
!42 = !DIEnumerator(name: "BT_STATUS_INBAND_RINGTONE", value: 35)
!43 = !DIEnumerator(name: "BT_STATUS_VOICE_RECOGNITION", value: 36)
!44 = !DIEnumerator(name: "BT_STATUS_AVRCP_INCOME_OPID", value: 37)
!45 = !DIEnumerator(name: "BT_STATUS_HFP_SERVICE_LEVEL_CONNECTION_OK", value: 38)
!46 = !DIEnumerator(name: "BT_STATUS_CONN_A2DP_CH", value: 39)
!47 = !DIEnumerator(name: "BT_STATUS_CONN_HFP_CH", value: 40)
!48 = !DIEnumerator(name: "BT_STATUS_INQUIRY_TIMEOUT", value: 41)
!49 = !DIEnumerator(name: "BT_STATUS_INITING", value: 42)
!50 = !DIEnumerator(name: "BT_STATUS_WAITINT_CONN", value: 43)
!51 = !DIEnumerator(name: "BT_STATUS_AUTO_CONNECTINT", value: 44)
!52 = !DIEnumerator(name: "BT_STATUS_CONNECTING", value: 45)
!53 = !DIEnumerator(name: "BT_STATUS_TAKEING_PHONE", value: 46)
!54 = !DIEnumerator(name: "BT_STATUS_PLAYING_MUSIC", value: 47)
!55 = !DIEnumerator(name: "BT_STATUS_A2DP_MEDIA_START", value: 48)
!56 = !DIEnumerator(name: "BT_STATUS_A2DP_MEDIA_STOP", value: 49)
!57 = !DIEnumerator(name: "BT_STATUS_BROADCAST_STATE", value: 50)
!58 = !DIEnumerator(name: "BT_STATUS_TRIM_OVER", value: 51)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 6, size: 32, elements: !61)
!60 = !DIFile(filename: "../btstack/Host/include/bredr/multi_bd.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!61 = !{!62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75}
!62 = !DIEnumerator(name: "MULTI_BD_SCO_REQ", value: 1)
!63 = !DIEnumerator(name: "MULTI_BD_SCO_CONNECTED", value: 2)
!64 = !DIEnumerator(name: "MULTI_BD_SCO_DISCONN", value: 3)
!65 = !DIEnumerator(name: "MULTI_BD_A2DP_ACTIVE", value: 4)
!66 = !DIEnumerator(name: "MULTI_BD_A2DP_STOP", value: 5)
!67 = !DIEnumerator(name: "MULTI_BD_CALL_INCOMING", value: 6)
!68 = !DIEnumerator(name: "MULTI_BD_CALL_OUTGOING", value: 7)
!69 = !DIEnumerator(name: "MULTI_BD_CALL_HANGUP", value: 8)
!70 = !DIEnumerator(name: "MULTI_BD_SET_WORK_TIME", value: 9)
!71 = !DIEnumerator(name: "MULTI_BD_CLR_WORK_TIME", value: 10)
!72 = !DIEnumerator(name: "MULTI_BD_SCAN_STATUS", value: 11)
!73 = !DIEnumerator(name: "MULTI_BD_SIRI_ACTIVE", value: 12)
!74 = !DIEnumerator(name: "MULTI_BD_SIRI_STOP", value: 13)
!75 = !DIEnumerator(name: "MULTI_BD_A2DP_CONN_CH", value: 14)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !77, line: 59, size: 32, elements: !78)
!77 = !DIFile(filename: "../btstack/Profile/include/bredr/profile_common.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!78 = !{!79, !80, !81}
!79 = !DIEnumerator(name: "A2DP_INDSTA_MUSIC_STA_CHANGED", value: 13)
!80 = !DIEnumerator(name: "A2DP_INDSTA_DECCODE_CHANGED", value: 14)
!81 = !DIEnumerator(name: "A2DP_INDSTA_MAX", value: 15)
!82 = !{!83, !84, !164, !124, !222}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 32)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "a2dp_conn", file: !86, line: 237, size: 1024, elements: !87)
!86 = !DIFile(filename: "../btstack/Profile/include/bredr/a2dp.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!87 = !{!88, !97, !105, !212}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !85, file: !86, line: 238, baseType: !89, size: 48)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_addr_t", file: !90, line: 7, baseType: !91)
!90 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 48, elements: !95)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !93, line: 44, baseType: !94)
!93 = !DIFile(filename: "../btcommon/typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!94 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!95 = !{!96}
!96 = !DISubrange(count: 6)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "a2dp_core_data", scope: !85, file: !86, line: 239, baseType: !98, size: 8, offset: 48)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "a2dp_core_data_t", file: !86, line: 229, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 225, size: 8, elements: !100)
!100 = !{!101, !103, !104}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "inused", scope: !99, file: !86, line: 226, baseType: !102, size: 1, flags: DIFlagBitField, extraData: i64 0)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !93, line: 44, baseType: !94)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "discover_req", scope: !99, file: !86, line: 227, baseType: !102, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "bqb_test_cnt", scope: !99, file: !86, line: 228, baseType: !102, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !85, file: !86, line: 240, baseType: !106, size: 768, offset: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "avdtp", file: !107, line: 335, size: 768, elements: !108)
!107 = !DIFile(filename: "../btstack/Profile/include/bredr/avdtp.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!108 = !{!109, !186}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "local_seps", scope: !106, file: !107, line: 337, baseType: !110, size: 448)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 448, elements: !184)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "avdtp_local_sep", file: !107, line: 293, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_avdtp_local_sep", file: !107, line: 282, size: 224, elements: !113)
!113 = !{!114, !166, !168, !178, !179, !180}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ind", scope: !112, file: !107, line: 283, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_avdtp_sep_ind", file: !107, line: 350, size: 288, elements: !118)
!118 = !{!119, !125, !130, !143, !147, !148, !152, !156, !160}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "get_capability", scope: !117, file: !107, line: 351, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!121 = !DISubroutineType(types: !122)
!122 = !{!123, !102, !83, !124}
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !93, line: 44, baseType: !94)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "set_configuration", scope: !117, file: !107, line: 353, baseType: !126, size: 32, offset: 32)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DISubroutineType(types: !128)
!128 = !{!123, !129, !124, !102, !83}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !117, file: !107, line: 355, baseType: !131, size: 32, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!132 = !DISubroutineType(types: !133)
!133 = !{!123, !129, !134, !102}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "avdtp_stream", file: !107, line: 280, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_avdtp_stream", file: !107, line: 268, size: 8, elements: !137)
!137 = !{!138, !139, !140, !141, !142}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "rseid", scope: !136, file: !107, line: 270, baseType: !102, size: 4, flags: DIFlagBitField, extraData: i64 0)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "int_role", scope: !136, file: !107, line: 271, baseType: !102, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "open_acp", scope: !136, file: !107, line: 272, baseType: !102, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "starting", scope: !136, file: !107, line: 278, baseType: !102, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reserve", scope: !136, file: !107, line: 279, baseType: !102, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !117, file: !107, line: 356, baseType: !144, size: 32, offset: 96)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!145 = !DISubroutineType(types: !146)
!146 = !{!123, !129, !134}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "suspend", scope: !117, file: !107, line: 357, baseType: !144, size: 32, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !117, file: !107, line: 359, baseType: !149, size: 32, offset: 160)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DISubroutineType(types: !151)
!151 = !{!123, !129, !134, !124}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "abort", scope: !117, file: !107, line: 361, baseType: !153, size: 32, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DISubroutineType(types: !155)
!155 = !{null, !129}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "reconfigure", scope: !117, file: !107, line: 362, baseType: !157, size: 32, offset: 224)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!158 = !DISubroutineType(types: !159)
!159 = !{!123, null}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "delayreport", scope: !117, file: !107, line: 363, baseType: !161, size: 32, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DISubroutineType(types: !163)
!163 = !{!123, !102, !164}
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !93, line: 46, baseType: !165)
!165 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !112, file: !107, line: 284, baseType: !167, size: 32, offset: 32)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !112, file: !107, line: 286, baseType: !169, size: 16, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "seid_info", file: !107, line: 124, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_seid_info", file: !107, line: 117, size: 16, elements: !171)
!171 = !{!172, !173, !174, !175, !176, !177}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "rfa0", scope: !170, file: !107, line: 118, baseType: !102, size: 1, flags: DIFlagBitField, extraData: i64 0)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !170, file: !107, line: 119, baseType: !102, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "seid", scope: !170, file: !107, line: 120, baseType: !102, size: 6, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "rfa2", scope: !170, file: !107, line: 121, baseType: !102, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !170, file: !107, line: 122, baseType: !102, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "media_type", scope: !170, file: !107, line: 123, baseType: !102, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !112, file: !107, line: 288, baseType: !102, size: 4, offset: 80, flags: DIFlagBitField, extraData: i64 80)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !112, file: !107, line: 289, baseType: !102, size: 4, offset: 84, flags: DIFlagBitField, extraData: i64 80)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !112, file: !107, line: 290, baseType: !181, size: 128, offset: 88)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 128, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 16)
!184 = !{!185}
!185 = !DISubrange(count: 2)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "adp_core_data", scope: !106, file: !107, line: 338, baseType: !187, size: 320, offset: 448)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "avdtp_core_data_t", file: !107, line: 333, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !107, line: 318, size: 320, elements: !189)
!189 = !{!190, !191, !192, !193, !194, !203, !204, !205, !206, !207, !208, !209, !210, !211}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !188, file: !107, line: 319, baseType: !135, size: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "local_sep", scope: !188, file: !107, line: 320, baseType: !129, size: 32, offset: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "local_sep_ind", scope: !188, file: !107, line: 321, baseType: !102, size: 8, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !188, file: !107, line: 322, baseType: !164, size: 16, offset: 80)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "acp_seid", scope: !188, file: !107, line: 323, baseType: !195, size: 64, offset: 96)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 64, elements: !201)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "seid_req", file: !107, line: 129, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_seid_req", file: !107, line: 126, size: 8, elements: !198)
!198 = !{!199, !200}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "rfa0", scope: !197, file: !107, line: 127, baseType: !102, size: 2, flags: DIFlagBitField, extraData: i64 0)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "acp_seid", scope: !197, file: !107, line: 128, baseType: !102, size: 6, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!201 = !{!202}
!202 = !DISubrange(count: 8)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !188, file: !107, line: 324, baseType: !181, size: 128, offset: 160)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "seid_ind", scope: !188, file: !107, line: 325, baseType: !102, size: 8, offset: 288)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "pending_req", scope: !188, file: !107, line: 326, baseType: !102, size: 8, offset: 296)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "max_acp_seid", scope: !188, file: !107, line: 327, baseType: !102, size: 4, offset: 304, flags: DIFlagBitField, extraData: i64 304)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "cur_acp_seid", scope: !188, file: !107, line: 328, baseType: !102, size: 4, offset: 308, flags: DIFlagBitField, extraData: i64 304)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "aac_codec_prior", scope: !188, file: !107, line: 329, baseType: !102, size: 4, offset: 312, flags: DIFlagBitField, extraData: i64 304)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "role", scope: !188, file: !107, line: 330, baseType: !102, size: 2, offset: 316, flags: DIFlagBitField, extraData: i64 304)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "get_discover", scope: !188, file: !107, line: 331, baseType: !102, size: 1, offset: 318, flags: DIFlagBitField, extraData: i64 304)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "reserve", scope: !188, file: !107, line: 332, baseType: !102, size: 1, offset: 319, flags: DIFlagBitField, extraData: i64 304)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "media", scope: !85, file: !86, line: 241, baseType: !213, size: 192, offset: 832)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "a2dp_media", file: !86, line: 215, size: 192, elements: !214)
!214 = !{!215, !224, !248, !267, !268, !269, !270}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "media_core_data", scope: !213, file: !86, line: 216, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "media_core_data_t", file: !86, line: 213, baseType: !217)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 209, size: 64, elements: !218)
!218 = !{!219, !220, !221}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !217, file: !86, line: 210, baseType: !164, size: 16)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "cp_type", scope: !217, file: !86, line: 211, baseType: !164, size: 16, offset: 16)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "samplerate", scope: !217, file: !86, line: 212, baseType: !222, size: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !93, line: 48, baseType: !223)
!223 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "probe", scope: !213, file: !86, line: 217, baseType: !225, size: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "a2dp_media_probe", file: !86, line: 190, size: 192, elements: !227)
!227 = !{!228, !230, !237, !242, !246, !247}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !226, file: !86, line: 192, baseType: !229, size: 32)
!229 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !226, file: !86, line: 193, baseType: !231, size: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DISubroutineType(types: !233)
!233 = !{!229, !83, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!235 = !DISubroutineType(types: !236)
!236 = !{!229, !83, !124, !164}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "probe", scope: !226, file: !86, line: 194, baseType: !238, size: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32)
!239 = !DISubroutineType(types: !240)
!240 = !{!229, !241, !124, !164}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !226, file: !86, line: 195, baseType: !243, size: 32, offset: 96)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = !DISubroutineType(types: !245)
!245 = !{!229, null}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "suspend", scope: !226, file: !86, line: 196, baseType: !243, size: 32, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !226, file: !86, line: 197, baseType: !243, size: 32, offset: 160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !213, file: !86, line: 218, baseType: !249, size: 32, offset: 96)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 32)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "a2dp_media_codec", file: !86, line: 200, size: 192, elements: !251)
!251 = !{!252, !253, !257, !261, !265, !266}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !250, file: !86, line: 201, baseType: !229, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "inused", scope: !250, file: !86, line: 202, baseType: !254, size: 32, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DISubroutineType(types: !256)
!256 = !{!229, !229}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !250, file: !86, line: 203, baseType: !258, size: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 32)
!259 = !DISubroutineType(types: !260)
!260 = !{!229, !83}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !250, file: !86, line: 204, baseType: !262, size: 32, offset: 96)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!263 = !DISubroutineType(types: !264)
!264 = !{!229, !124, !164}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "suspend", scope: !250, file: !86, line: 205, baseType: !243, size: 32, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !250, file: !86, line: 206, baseType: !258, size: 32, offset: 160)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "bitrate", scope: !213, file: !86, line: 219, baseType: !222, size: 32, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "nchannels", scope: !213, file: !86, line: 220, baseType: !102, size: 4, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "reserve", scope: !213, file: !86, line: 221, baseType: !102, size: 4, offset: 164, flags: DIFlagBitField, extraData: i64 160)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !213, file: !86, line: 222, baseType: !102, size: 8, offset: 168)
!271 = !{!0, !272, !275, !277, !279}
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "a2dp_1sbc_codec_private", scope: !2, file: !3, line: 555, type: !274, isLocal: false, isDefinition: true)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !250)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "a2dp_2aac_sink_codec", scope: !2, file: !3, line: 565, type: !274, isLocal: false, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "current_conn", scope: !2, file: !3, line: 22, type: !83, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "channel", scope: !2, file: !3, line: 21, type: !83, isLocal: true, isDefinition: true)
!281 = !DIFile(filename: "../btcommon/profile_stack_debug.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!282 = !{i32 2, !"Dwarf Version", i32 4}
!283 = !{i32 2, !"Debug Info Version", i32 3}
!284 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!285 = distinct !DISubprogram(name: "a2dp_media_get_packet", scope: !3, file: !3, line: 237, type: !286, isLocal: false, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !289)
!286 = !DISubroutineType(types: !287)
!287 = !{!229, !288}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!289 = !{!290, !291, !292}
!290 = !DILocalVariable(name: "frame", arg: 1, scope: !285, file: !3, line: 237, type: !288)
!291 = !DILocalVariable(name: "error_code", scope: !285, file: !3, line: 239, type: !229)
!292 = !DILocalVariable(name: "len", scope: !285, file: !3, line: 245, type: !229)
!293 = !DILocation(line: 237, column: 32, scope: !285)
!294 = !DILocation(line: 241, column: 9, scope: !295)
!295 = distinct !DILexicalBlock(scope: !285, file: !3, line: 241, column: 9)
!296 = !{!297, !297, i64 0}
!297 = !{!"any pointer", !298, i64 0}
!298 = !{!"omnipotent char", !299, i64 0}
!299 = !{!"Simple C/C++ TBAA"}
!300 = !DILocation(line: 241, column: 22, scope: !295)
!301 = !DILocation(line: 241, column: 9, scope: !285)
!302 = !DILocation(line: 245, column: 42, scope: !285)
!303 = !DILocation(line: 245, column: 15, scope: !285)
!304 = !DILocation(line: 245, column: 9, scope: !285)
!305 = !DILocation(line: 254, column: 1, scope: !306)
!306 = !DILexicalBlockFile(scope: !285, file: !3, discriminator: 1)
!307 = distinct !DISubprogram(name: "a2dp_media_try_get_packet", scope: !3, file: !3, line: 256, type: !286, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !308)
!308 = !{!309, !310, !311}
!309 = !DILocalVariable(name: "frame", arg: 1, scope: !307, file: !3, line: 256, type: !288)
!310 = !DILocalVariable(name: "error_code", scope: !307, file: !3, line: 258, type: !229)
!311 = !DILocalVariable(name: "len", scope: !307, file: !3, line: 264, type: !229)
!312 = !DILocation(line: 256, column: 36, scope: !307)
!313 = !DILocation(line: 260, column: 9, scope: !314)
!314 = distinct !DILexicalBlock(scope: !307, file: !3, line: 260, column: 9)
!315 = !DILocation(line: 260, column: 22, scope: !314)
!316 = !DILocation(line: 260, column: 9, scope: !307)
!317 = !DILocation(line: 264, column: 42, scope: !307)
!318 = !DILocation(line: 264, column: 15, scope: !307)
!319 = !DILocation(line: 264, column: 9, scope: !307)
!320 = !DILocation(line: 273, column: 1, scope: !321)
!321 = !DILexicalBlockFile(scope: !307, file: !3, discriminator: 1)
