; ModuleID = 'a2dp.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct._avdtp_media_codec_capability = type { i8, i8 }
%struct._mpeg24_codec_cap = type { %struct._avdtp_media_codec_capability, i8, i8, i8, i8, i8, i8 }
%struct._a2dp_aptx_cap = type { %struct._avdtp_media_codec_capability, %struct.a2dp_vendor_codec_t, i8 }
%struct.a2dp_vendor_codec_t = type <{ i32, i16 }>
%struct._a2dp_ldac_cap = type { %struct._avdtp_media_codec_capability, %struct.a2dp_vendor_codec_t, i8, i8 }
%struct._a2dp_lc3_cap = type { %struct._avdtp_media_codec_capability, %struct.a2dp_vendor_codec_t, i8, i8 }
%struct.a2dp_stack_t = type { [1 x %struct.a2dp_conn] }
%struct.a2dp_conn = type { [6 x i8], %struct.a2dp_core_data_t, %struct.avdtp, %struct.a2dp_media }
%struct.a2dp_core_data_t = type { i8 }
%struct.avdtp = type { [2 x %struct._avdtp_local_sep], %struct.avdtp_core_data_t }
%struct._avdtp_local_sep = type { %struct._avdtp_sep_ind*, %struct.avdtp*, %struct._seid_info, i8, [16 x i8] }

!113 = !DIEnumerator(name: "USER_CTRL_HID_BOTH", value: 80)
!114 = !DIEnumerator(name: "USER_CTRL_HID_DISCONNECT", value: 81)
!115 = !DIEnumerator(name: "USER_CTRL_HID_HOME", value: 82)
!116 = !DIEnumerator(name: "USER_CTRL_HID_RETURN", value: 83)
!117 = !DIEnumerator(name: "USER_CTRL_HID_LEFTARROW", value: 84)
!118 = !DIEnumerator(name: "USER_CTRL_HID_RIGHTARROW", value: 85)
!119 = !DIEnumerator(name: "USER_CTRL_HID_VOL_UP", value: 86)
!120 = !DIEnumerator(name: "USER_CTRL_HID_VOL_DOWN", value: 87)
!121 = !DIEnumerator(name: "USER_CTRL_HID_SEND_DATA", value: 88)
!122 = !DIEnumerator(name: "USER_CTRL_HID_CMD_END", value: 89)
!123 = !DIEnumerator(name: "USER_CTRL_TWS_CMD_BEGIN", value: 90)
!124 = !DIEnumerator(name: "USER_CTRL_SYNC_TRAIN", value: 91)
!125 = !DIEnumerator(name: "USER_CTRL_SYNC_TRAIN_SCAN", value: 92)
!126 = !DIEnumerator(name: "USER_CTRL_MONITOR", value: 93)
!127 = !DIEnumerator(name: "USER_CTRL_TWS_CONNEC_VIA_ADDR", value: 94)
!128 = !DIEnumerator(name: "USER_CTRL_TWS_COTROL_CDM", value: 95)
!129 = !DIEnumerator(name: "USER_CTRL_TWS_CLEAR_INFO", value: 96)
!130 = !DIEnumerator(name: "USER_CTRL_TWS_DISCONNECTION_HCI", value: 97)
!131 = !DIEnumerator(name: "USER_CTRL_TWS_START_CONNECTION", value: 98)
!132 = !DIEnumerator(name: "USER_CTRL_TWS_SYNC_CDM", value: 99)
!133 = !DIEnumerator(name: "USER_CTRL_TWS_SYNC_SBC_CDM", value: 100)
!134 = !DIEnumerator(name: "USER_CTRL_TWS_RESTART_SBC_CDM", value: 101)
!135 = !DIEnumerator(name: "USER_CTRL_SYNC_TRAIN_CANCEL", value: 102)
!136 = !DIEnumerator(name: "USER_CTRL_SYNC_TRAIN_SCAN_CANCEL", value: 103)
!137 = !DIEnumerator(name: "USER_CTRL_TWS_SYNC_CDM_FUN", value: 104)
!138 = !DIEnumerator(name: "USER_CTRL_TWS_LINEIN_START", value: 105)
!139 = !DIEnumerator(name: "USER_CTRL_TWS_LINEIN_CLOSE", value: 106)
!140 = !DIEnumerator(name: "USER_CTRL_TWS_CMD_END", value: 107)
!141 = !DIEnumerator(name: "USER_CTRL_SPP_CMD_BEGIN", value: 108)
!142 = !DIEnumerator(name: "USER_CTRL_SPP_SEND_DATA", value: 109)
!143 = !DIEnumerator(name: "USER_CTRL_SPP_TRY_SEND_DATA", value: 110)
!144 = !DIEnumerator(name: "USER_CTRL_SPP_UPDATA_DATA", value: 111)
!145 = !DIEnumerator(name: "USER_CTRL_SPP_DISCONNECT", value: 112)
!146 = !DIEnumerator(name: "USER_CTRL_SPP_CMD_END", value: 113)
!147 = !DIEnumerator(name: "USER_CTRL_PBG_CMD_BEGIN", value: 114)
!148 = !DIEnumerator(name: "USER_CTRL_PBG_SEND_DATA", value: 115)
!149 = !DIEnumerator(name: "USER_CTRL_PBG_TRY_SEND_DATA", value: 116)
!150 = !DIEnumerator(name: "USER_CTRL_PBG_CMD_END", value: 117)
!151 = !DIEnumerator(name: "USER_CTRL_ADT_CMD_BEGIN", value: 118)
!152 = !DIEnumerator(name: "USER_CTRL_ADT_CONNECT", value: 119)
!153 = !DIEnumerator(name: "USER_CTRL_ADT_KEY_MIC_OPEN", value: 120)
!154 = !DIEnumerator(name: "USER_CTRL_ADT_SEND_DATA", value: 121)
!155 = !DIEnumerator(name: "USER_CTRL_ADT_TRY_SEND_DATA", value: 122)
!156 = !DIEnumerator(name: "USER_CTRL_ADT_CMD_END", value: 123)
!157 = !DIEnumerator(name: "USER_CTRL_PBAP_CMD_BEGIN", value: 124)
!158 = !DIEnumerator(name: "USER_CTRL_PBAP_READ_PART", value: 125)
!159 = !DIEnumerator(name: "USER_CTRL_PBAP_READ_ALL", value: 126)
!160 = !DIEnumerator(name: "USER_CTRL_PBAP_STOP_READING", value: 127)
!161 = !DIEnumerator(name: "USER_CTRL_PBAP_CMD_END", value: 128)
!162 = !DIEnumerator(name: "USER_CTRL_DEL_ALL_REMOTE_INFO", value: 129)
!163 = !DIEnumerator(name: "USER_CTRL_TEST_KEY", value: 130)
!164 = !DIEnumerator(name: "USER_CTRL_SEND_USER_INFO", value: 131)
!165 = !DIEnumerator(name: "USER_CTRL_KEYPRESS", value: 132)
!166 = !DIEnumerator(name: "USER_CTRL_PAIR", value: 133)
!167 = !DIEnumerator(name: "USER_CTRL_AFH_CHANNEL", value: 134)
!168 = !DIEnumerator(name: "USER_CTRL_HALF_SEC_LOOP_CREATE", value: 135)
!169 = !DIEnumerator(name: "USER_CTRL_HALF_SEC_LOOP_DEL", value: 136)
!170 = !DIEnumerator(name: "USER_CTRL_CMD_SYNC_VOL_INC", value: 137)
!171 = !DIEnumerator(name: "USER_CTRL_CMD_SYNC_VOL_DEC", value: 138)
!172 = !DIEnumerator(name: "USER_CTRL_CMD_CHANGE_PROFILE_MODE", value: 139)
!173 = !DIEnumerator(name: "USER_CTRL_CMD_RESERVE_INDEX4", value: 140)
!174 = !DIEnumerator(name: "USER_CTRL_CMD_RESUME_STACK", value: 141)
!175 = !DIEnumerator(name: "USER_CTRL_AVCTP_OPID_GET_MUSIC_INFO", value: 142)
!176 = !DIEnumerator(name: "USER_CTRL_LAST", value: 143)
!177 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !178, line: 58, size: 32, elements: !179)
!178 = !DIFile(filename: "../btstack/Profile/include/bredr/avdtp.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!179 = !{!180, !181, !182, !183, !184, !185}
!180 = !DIEnumerator(name: "AVDTP_STATE_IDLE", value: 0)
!181 = !DIEnumerator(name: "AVDTP_STATE_CONFIGURED", value: 1)
!182 = !DIEnumerator(name: "AVDTP_STATE_OPEN", value: 2)
!183 = !DIEnumerator(name: "AVDTP_STATE_STREAMING", value: 3)
!184 = !DIEnumerator(name: "AVDTP_STATE_CLOSING", value: 4)
!185 = !DIEnumerator(name: "AVDTP_STATE_ABORTING", value: 5)
!186 = !{!187, !188, !197, !198, !382, !384, !385, !392, !404, !275, !417}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "avdtp_service_capability", file: !178, line: 71, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_avdtp_service_capability", file: !178, line: 68, size: 16, elements: !191)
!191 = !{!192, !196}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !190, file: !178, line: 69, baseType: !193, size: 8)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !194, line: 11, baseType: !195)
!194 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!195 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !190, file: !178, line: 70, baseType: !193, size: 8, offset: 8)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "a2dp_conn", file: !17, line: 237, size: 1024, elements: !200)
!200 = !{!201, !211, !218, !323}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !199, file: !17, line: 238, baseType: !202, size: 48)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_addr_t", file: !203, line: 66, baseType: !204)
!203 = !DIFile(filename: "../btcommon/utils.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 48, elements: !209)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !206, line: 20, baseType: !207)
!206 = !DIFile(filename: "/opt/q32s/include/sys/_stdint.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !208, line: 29, baseType: !195)
!208 = !DIFile(filename: "/opt/q32s/include/machine/_default_types.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!209 = !{!210}
!210 = !DISubrange(count: 6)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "a2dp_core_data", scope: !199, file: !17, line: 239, baseType: !212, size: 8, offset: 48)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "a2dp_core_data_t", file: !17, line: 229, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 225, size: 8, elements: !214)
!214 = !{!215, !216, !217}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "inused", scope: !213, file: !17, line: 226, baseType: !193, size: 1, flags: DIFlagBitField, extraData: i64 0)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "discover_req", scope: !213, file: !17, line: 227, baseType: !193, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "bqb_test_cnt", scope: !213, file: !17, line: 228, baseType: !193, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !199, file: !17, line: 240, baseType: !219, size: 768, offset: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "avdtp", file: !178, line: 335, size: 768, elements: !220)
!220 = !{!221, !297}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "local_seps", scope: !219, file: !178, line: 337, baseType: !222, size: 448)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 448, elements: !295)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "avdtp_local_sep", file: !178, line: 293, baseType: !224)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_avdtp_local_sep", file: !178, line: 282, size: 224, elements: !225)
!225 = !{!226, !277, !279, !289, !290, !291}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ind", scope: !224, file: !178, line: 283, baseType: !227, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_avdtp_sep_ind", file: !178, line: 350, size: 288, elements: !230)
!230 = !{!231, !236, !241, !254, !258, !259, !263, !267, !271}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "get_capability", scope: !229, file: !178, line: 351, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DISubroutineType(types: !234)
!234 = !{!235, !193, !187, !197}
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !194, line: 11, baseType: !195)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "set_configuration", scope: !229, file: !178, line: 353, baseType: !237, size: 32, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = !DISubroutineType(types: !239)
!239 = !{!235, !240, !197, !193, !187}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !229, file: !178, line: 355, baseType: !242, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!243 = !DISubroutineType(types: !244)
!244 = !{!235, !240, !245, !193}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "avdtp_stream", file: !178, line: 280, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_avdtp_stream", file: !178, line: 268, size: 8, elements: !248)
!248 = !{!249, !250, !251, !252, !253}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "rseid", scope: !247, file: !178, line: 270, baseType: !193, size: 4, flags: DIFlagBitField, extraData: i64 0)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "int_role", scope: !247, file: !178, line: 271, baseType: !193, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "open_acp", scope: !247, file: !178, line: 272, baseType: !193, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "starting", scope: !247, file: !178, line: 278, baseType: !193, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "reserve", scope: !247, file: !178, line: 279, baseType: !193, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !229, file: !178, line: 356, baseType: !255, size: 32, offset: 96)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 32)
!256 = !DISubroutineType(types: !257)
!257 = !{!235, !240, !245}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "suspend", scope: !229, file: !178, line: 357, baseType: !255, size: 32, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !229, file: !178, line: 359, baseType: !260, size: 32, offset: 160)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!261 = !DISubroutineType(types: !262)
!262 = !{!235, !240, !245, !197}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "abort", scope: !229, file: !178, line: 361, baseType: !264, size: 32, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !240}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "reconfigure", scope: !229, file: !178, line: 362, baseType: !268, size: 32, offset: 224)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DISubroutineType(types: !270)
!270 = !{!235, null}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "delayreport", scope: !229, file: !178, line: 363, baseType: !272, size: 32, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!273 = !DISubroutineType(types: !274)
!274 = !{!235, !193, !275}
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !194, line: 13, baseType: !276)
!276 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !224, file: !178, line: 284, baseType: !278, size: 32, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !224, file: !178, line: 286, baseType: !280, size: 16, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "seid_info", file: !178, line: 124, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_seid_info", file: !178, line: 117, size: 16, elements: !282)
!282 = !{!283, !284, !285, !286, !287, !288}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "rfa0", scope: !281, file: !178, line: 118, baseType: !193, size: 1, flags: DIFlagBitField, extraData: i64 0)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !281, file: !178, line: 119, baseType: !193, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "seid", scope: !281, file: !178, line: 120, baseType: !193, size: 6, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "rfa2", scope: !281, file: !178, line: 121, baseType: !193, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !281, file: !178, line: 122, baseType: !193, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "media_type", scope: !281, file: !178, line: 123, baseType: !193, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !224, file: !178, line: 288, baseType: !193, size: 4, offset: 80, flags: DIFlagBitField, extraData: i64 80)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !224, file: !178, line: 289, baseType: !193, size: 4, offset: 84, flags: DIFlagBitField, extraData: i64 80)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !224, file: !178, line: 290, baseType: !292, size: 128, offset: 88)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 128, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 16)
!295 = !{!296}
!296 = !DISubrange(count: 2)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "adp_core_data", scope: !219, file: !178, line: 338, baseType: !298, size: 320, offset: 448)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "avdtp_core_data_t", file: !178, line: 333, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !178, line: 318, size: 320, elements: !300)
!300 = !{!301, !302, !303, !304, !305, !314, !315, !316, !317, !318, !319, !320, !321, !322}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !299, file: !178, line: 319, baseType: !246, size: 8)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "local_sep", scope: !299, file: !178, line: 320, baseType: !240, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "local_sep_ind", scope: !299, file: !178, line: 321, baseType: !193, size: 8, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !299, file: !178, line: 322, baseType: !275, size: 16, offset: 80)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "acp_seid", scope: !299, file: !178, line: 323, baseType: !306, size: 64, offset: 96)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 64, elements: !312)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "seid_req", file: !178, line: 129, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_seid_req", file: !178, line: 126, size: 8, elements: !309)
!309 = !{!310, !311}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "rfa0", scope: !308, file: !178, line: 127, baseType: !193, size: 2, flags: DIFlagBitField, extraData: i64 0)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "acp_seid", scope: !308, file: !178, line: 128, baseType: !193, size: 6, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!312 = !{!313}
!313 = !DISubrange(count: 8)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !299, file: !178, line: 324, baseType: !292, size: 128, offset: 160)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "seid_ind", scope: !299, file: !178, line: 325, baseType: !193, size: 8, offset: 288)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "pending_req", scope: !299, file: !178, line: 326, baseType: !193, size: 8, offset: 296)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "max_acp_seid", scope: !299, file: !178, line: 327, baseType: !193, size: 4, offset: 304, flags: DIFlagBitField, extraData: i64 304)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "cur_acp_seid", scope: !299, file: !178, line: 328, baseType: !193, size: 4, offset: 308, flags: DIFlagBitField, extraData: i64 304)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "aac_codec_prior", scope: !299, file: !178, line: 329, baseType: !193, size: 4, offset: 312, flags: DIFlagBitField, extraData: i64 304)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "role", scope: !299, file: !178, line: 330, baseType: !193, size: 2, offset: 316, flags: DIFlagBitField, extraData: i64 304)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "get_discover", scope: !299, file: !178, line: 331, baseType: !193, size: 1, offset: 318, flags: DIFlagBitField, extraData: i64 304)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "reserve", scope: !299, file: !178, line: 332, baseType: !193, size: 1, offset: 319, flags: DIFlagBitField, extraData: i64 304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "media", scope: !199, file: !17, line: 241, baseType: !324, size: 192, offset: 832)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "a2dp_media", file: !17, line: 215, size: 192, elements: !325)
!325 = !{!326, !335, !359, !378, !379, !380, !381}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "media_core_data", scope: !324, file: !17, line: 216, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "media_core_data_t", file: !17, line: 213, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 209, size: 64, elements: !329)
!329 = !{!330, !331, !332}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !328, file: !17, line: 210, baseType: !275, size: 16)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "cp_type", scope: !328, file: !17, line: 211, baseType: !275, size: 16, offset: 16)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "samplerate", scope: !328, file: !17, line: 212, baseType: !333, size: 32, offset: 32)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !194, line: 15, baseType: !334)
!334 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "probe", scope: !324, file: !17, line: 217, baseType: !336, size: 32, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "a2dp_media_probe", file: !17, line: 190, size: 192, elements: !338)
!338 = !{!339, !341, !348, !353, !357, !358}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !337, file: !17, line: 192, baseType: !340, size: 32)
!340 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !337, file: !17, line: 193, baseType: !342, size: 32, offset: 32)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 32)
!343 = !DISubroutineType(types: !344)
!344 = !{!340, !187, !345}
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 32)
!346 = !DISubroutineType(types: !347)
!347 = !{!340, !187, !197, !275}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "probe", scope: !337, file: !17, line: 194, baseType: !349, size: 32, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 32)
!350 = !DISubroutineType(types: !351)
!351 = !{!340, !352, !197, !275}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !337, file: !17, line: 195, baseType: !354, size: 32, offset: 96)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 32)
!355 = !DISubroutineType(types: !356)
!356 = !{!340, null}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "suspend", scope: !337, file: !17, line: 196, baseType: !354, size: 32, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !337, file: !17, line: 197, baseType: !354, size: 32, offset: 160)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !324, file: !17, line: 218, baseType: !360, size: 32, offset: 96)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 32)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "a2dp_media_codec", file: !17, line: 200, size: 192, elements: !362)
!362 = !{!363, !364, !368, !372, !376, !377}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !361, file: !17, line: 201, baseType: !340, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "inused", scope: !361, file: !17, line: 202, baseType: !365, size: 32, offset: 32)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 32)
!366 = !DISubroutineType(types: !367)
!367 = !{!340, !340}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !361, file: !17, line: 203, baseType: !369, size: 32, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 32)
!370 = !DISubroutineType(types: !371)
!371 = !{!340, !187}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !361, file: !17, line: 204, baseType: !373, size: 32, offset: 96)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!374 = !DISubroutineType(types: !375)
!375 = !{!340, !197, !275}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "suspend", scope: !361, file: !17, line: 205, baseType: !354, size: 32, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !361, file: !17, line: 206, baseType: !369, size: 32, offset: 160)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "bitrate", scope: !324, file: !17, line: 219, baseType: !333, size: 32, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "nchannels", scope: !324, file: !17, line: 220, baseType: !193, size: 4, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "reserve", scope: !324, file: !17, line: 221, baseType: !193, size: 4, offset: 164, flags: DIFlagBitField, extraData: i64 160)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !324, file: !17, line: 222, baseType: !193, size: 8, offset: 168)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 32)
!383 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!384 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "avdtp_media_codec_capability", file: !178, line: 162, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_avdtp_media_codec_capability", file: !178, line: 158, size: 16, elements: !388)
!388 = !{!389, !390, !391}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "rfa0", scope: !387, file: !178, line: 159, baseType: !193, size: 4, flags: DIFlagBitField, extraData: i64 0)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "media_type", scope: !387, file: !178, line: 160, baseType: !193, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "media_codec_type", scope: !387, file: !178, line: 161, baseType: !193, size: 8, offset: 8)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "sbc_codec_cap", file: !17, line: 46, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sbc_codec_cap", file: !17, line: 37, size: 48, elements: !395)
!395 = !{!396, !397, !398, !399, !400, !401, !402, !403}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !394, file: !17, line: 38, baseType: !386, size: 16)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "channel_mode", scope: !394, file: !17, line: 39, baseType: !193, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 16)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !394, file: !17, line: 40, baseType: !193, size: 4, offset: 20, flags: DIFlagBitField, extraData: i64 16)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "allocation_method", scope: !394, file: !17, line: 41, baseType: !193, size: 2, offset: 24, flags: DIFlagBitField, extraData: i64 16)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "subbands", scope: !394, file: !17, line: 42, baseType: !193, size: 2, offset: 26, flags: DIFlagBitField, extraData: i64 16)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "block_length", scope: !394, file: !17, line: 43, baseType: !193, size: 4, offset: 28, flags: DIFlagBitField, extraData: i64 16)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "min_bitpool", scope: !394, file: !17, line: 44, baseType: !193, size: 8, offset: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "max_bitpool", scope: !394, file: !17, line: 45, baseType: !193, size: 8, offset: 40)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpeg24_codec_cap", file: !17, line: 70, baseType: !406)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mpeg24_codec_cap", file: !17, line: 60, size: 64, elements: !407)
!407 = !{!408, !409, !410, !411, !412, !413, !414, !415, !416}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !406, file: !17, line: 61, baseType: !386, size: 16)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !406, file: !17, line: 62, baseType: !193, size: 8, offset: 16)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_l", scope: !406, file: !17, line: 63, baseType: !193, size: 8, offset: 24)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "rfa", scope: !406, file: !17, line: 64, baseType: !193, size: 2, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !406, file: !17, line: 65, baseType: !193, size: 2, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_h", scope: !406, file: !17, line: 66, baseType: !193, size: 4, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "bitrate_h", scope: !406, file: !17, line: 67, baseType: !193, size: 8, offset: 40)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "bitrate_m", scope: !406, file: !17, line: 68, baseType: !193, size: 8, offset: 48)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "bitrate_l", scope: !406, file: !17, line: 69, baseType: !193, size: 8, offset: 56)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !206, line: 26, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !208, line: 43, baseType: !276)
!419 = !{!0, !420, !423, !425, !442, !452, !462, !464, !466, !468, !477, !487, !492, !496, !507}
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "a2dp_sbc", scope: !2, file: !3, line: 62, type: !422, isLocal: false, isDefinition: true)
!422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !393)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "a2dp_mpeg_acc", scope: !2, file: !3, line: 73, type: !405, isLocal: false, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "a2dp_aptx", scope: !2, file: !3, line: 86, type: !427, isLocal: false, isDefinition: true)
!427 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "a2dp_aptx_cap", file: !17, line: 81, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_a2dp_aptx_cap", file: !17, line: 72, size: 72, elements: !430)
!430 = !{!431, !432, !440, !441}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !429, file: !17, line: 73, baseType: !386, size: 16)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !429, file: !17, line: 74, baseType: !433, size: 48, offset: 16)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "a2dp_vendor_codec_t", file: !17, line: 33, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 30, size: 48, elements: !435)
!435 = !{!436, !439}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_id", scope: !434, file: !17, line: 31, baseType: !437, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !206, line: 32, baseType: !438)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !208, line: 65, baseType: !334)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !434, file: !17, line: 32, baseType: !417, size: 16, offset: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "channel_mode", scope: !429, file: !17, line: 75, baseType: !205, size: 4, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !429, file: !17, line: 76, baseType: !205, size: 4, offset: 68, flags: DIFlagBitField, extraData: i64 64)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "a2dp_ldac", scope: !2, file: !3, line: 92, type: !444, isLocal: false, isDefinition: true)
!444 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "a2dp_ldac_cap", file: !17, line: 89, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_a2dp_ldac_cap", file: !17, line: 83, size: 80, elements: !447)
!447 = !{!448, !449, !450, !451}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !446, file: !17, line: 84, baseType: !386, size: 16)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !446, file: !17, line: 85, baseType: !433, size: 48, offset: 16)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !446, file: !17, line: 87, baseType: !205, size: 8, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "channel_mode", scope: !446, file: !17, line: 88, baseType: !205, size: 8, offset: 72)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "a2dp_lc3", scope: !2, file: !3, line: 99, type: !454, isLocal: false, isDefinition: true)
!454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "a2dp_lc3_cap", file: !17, line: 97, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_a2dp_lc3_cap", file: !17, line: 91, size: 80, elements: !457)
!457 = !{!458, !459, !460, !461}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !456, file: !17, line: 92, baseType: !386, size: 16)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !456, file: !17, line: 93, baseType: !433, size: 48, offset: 16)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !456, file: !17, line: 95, baseType: !205, size: 8, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "channel_mode", scope: !456, file: !17, line: 96, baseType: !205, size: 8, offset: 72)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "reconnect_after_disconnect", scope: !2, file: !3, line: 415, type: !193, isLocal: false, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "try_cmd_step", scope: !2, file: !3, line: 1464, type: !193, isLocal: false, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "a2dp_wait_remote_discovecr", scope: !2, file: !3, line: 1539, type: !193, isLocal: false, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "bt_suspend_a2dp_resumea2dp_release", scope: !2, file: !3, line: 1698, type: !470, isLocal: false, isDefinition: true)
!470 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bt_sleep", file: !472, line: 313, size: 96, elements: !473)
!472 = !DIFile(filename: "../btstack/Host/include/common/bt_config.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!473 = !{!474, !475, !476}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "suspend", scope: !471, file: !472, line: 314, baseType: !354, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "resume", scope: !471, file: !472, line: 315, baseType: !354, size: 32, offset: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !471, file: !472, line: 316, baseType: !354, size: 32, offset: 64)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "a2dp_stack", scope: !2, file: !3, line: 20, type: !479, isLocal: true, isDefinition: true)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "a2dp_stack_t", file: !17, line: 250, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 247, size: 1024, elements: !482)
!482 = !{!483}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !481, file: !17, line: 248, baseType: !484, size: 1024)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 1024, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 1)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "a2dp_status_update", scope: !2, file: !3, line: 417, type: !489, isLocal: true, isDefinition: true)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 32)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !193}
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "a2dp_sep_ind_sbc", scope: !2, file: !3, line: 937, type: !494, isLocal: true, isDefinition: true)
!494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "avdtp_sep_ind", file: !178, line: 364, baseType: !229)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "content_protect", scope: !498, file: !3, line: 776, type: !505, isLocal: true, isDefinition: true)
!498 = distinct !DISubprogram(name: "a2dp_getcap_ind_sbc", scope: !3, file: !3, line: 772, type: !233, isLocal: true, isDefinition: true, scopeLine: 773, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !499)
!499 = !{!500, !501, !502, !503, !504}
!500 = !DILocalVariable(name: "seid", arg: 1, scope: !498, file: !3, line: 772, type: !193)
!501 = !DILocalVariable(name: "user_data", arg: 2, scope: !498, file: !3, line: 772, type: !187)
!502 = !DILocalVariable(name: "data_len", arg: 3, scope: !498, file: !3, line: 772, type: !197)
!503 = !DILocalVariable(name: "temp_a2dp_sbc", scope: !498, file: !3, line: 774, type: !393)
!504 = !DILocalVariable(name: "service_cap", scope: !498, file: !3, line: 775, type: !188)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 16, elements: !295)
!506 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "a2dp_sep_ind_mpeg24", scope: !2, file: !3, line: 1069, type: !494, isLocal: true, isDefinition: true)
!509 = !DIFile(filename: "../btcommon/profile_stack_debug.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!510 = !{i32 2, !"Dwarf Version", i32 4}
!511 = !{i32 2, !"Debug Info Version", i32 3}
!512 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!513 = distinct !DISubprogram(name: "__set_aac_bitrate", scope: !3, file: !3, line: 141, type: !514, isLocal: false, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !516)
!514 = !DISubroutineType(types: !515)
!515 = !{null, !333}
!516 = !{!517, !518}
!517 = !DILocalVariable(name: "bitrate", arg: 1, scope: !513, file: !3, line: 141, type: !333)
!518 = !DILocalVariable(name: "vbr_bit", scope: !513, file: !3, line: 143, type: !193)
!519 = !DILocation(line: 141, column: 28, scope: !513)
!520 = !DILocation(line: 143, column: 32, scope: !513)
!521 = !{!522, !524, i64 5}
!522 = !{!"_mpeg24_codec_cap", !523, i64 0, !524, i64 2, !524, i64 3, !524, i64 4, !524, i64 4, !524, i64 4, !524, i64 5, !524, i64 6, !524, i64 7}
!523 = !{!"_avdtp_media_codec_capability", !524, i64 0, !524, i64 0, !524, i64 1}
!524 = !{!"omnipotent char", !525, i64 0}
!525 = !{!"Simple C/C++ TBAA"}
!526 = !DILocation(line: 143, column: 42, scope: !513)
!527 = !DILocation(line: 143, column: 8, scope: !513)
!528 = !DILocation(line: 145, column: 41, scope: !513)
!529 = !DILocation(line: 145, column: 48, scope: !513)
!530 = !DILocation(line: 145, column: 58, scope: !513)
!531 = !DILocation(line: 145, column: 56, scope: !513)
!532 = !DILocation(line: 145, column: 31, scope: !513)
!533 = !DILocation(line: 145, column: 29, scope: !513)
!534 = !DILocation(line: 146, column: 40, scope: !513)
!535 = !DILocation(line: 146, column: 31, scope: !513)
!536 = !DILocation(line: 146, column: 29, scope: !513)
!537 = !{!522, !524, i64 6}
!538 = !DILocation(line: 147, column: 31, scope: !513)
!539 = !DILocation(line: 147, column: 29, scope: !513)
!540 = !{!522, !524, i64 7}
!541 = !DILocation(line: 151, column: 1, scope: !513)
!542 = distinct !DISubprogram(name: "find_a2dp_conn_number", scope: !3, file: !3, line: 175, type: !543, isLocal: false, isDefinition: true, scopeLine: 176, isOptimized: true, unit: !2, variables: !545)
!543 = !DISubroutineType(types: !544)
!544 = !{!193}
!545 = !{!546, !547}
!546 = !DILocalVariable(name: "conn", scope: !542, file: !3, line: 177, type: !198)
!547 = !DILocalVariable(name: "num", scope: !542, file: !3, line: 178, type: !193)
!548 = !DILocation(line: 178, column: 8, scope: !542)
!549 = !DILocation(line: 179, column: 5, scope: !550)
!550 = distinct !DILexicalBlock(scope: !542, file: !3, line: 179, column: 5)
!551 = !{!552, !552, i64 0}
!552 = !{!"any pointer", !524, i64 0}
!553 = !DILocation(line: 180, column: 34, scope: !554)
!554 = distinct !DILexicalBlock(scope: !555, file: !3, line: 180, column: 13)
!555 = distinct !DILexicalBlock(scope: !556, file: !3, line: 179, column: 35)
!556 = distinct !DILexicalBlock(scope: !550, file: !3, line: 179, column: 5)
!557 = !DILocation(line: 184, column: 5, scope: !542)
!558 = distinct !DISubprogram(name: "a2dp_connect_status_register", scope: !3, file: !3, line: 418, type: !559, isLocal: false, isDefinition: true, scopeLine: 419, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !561)
!559 = !DISubroutineType(types: !560)
!560 = !{null, !489}
!561 = !{!562}
!562 = !DILocalVariable(name: "cbk", arg: 1, scope: !558, file: !3, line: 418, type: !489)
!563 = !DILocation(line: 418, column: 42, scope: !558)
!564 = !DILocation(line: 420, column: 24, scope: !558)
!565 = !DILocation(line: 421, column: 1, scope: !558)
!566 = distinct !DISubprogram(name: "__a2dp_conn_for_addr", scope: !3, file: !3, line: 465, type: !567, isLocal: false, isDefinition: true, scopeLine: 466, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !569)
!567 = !DISubroutineType(types: !568)
!568 = !{!198, !352}
!569 = !{!570, !571}
!570 = !DILocalVariable(name: "addr", arg: 1, scope: !566, file: !3, line: 465, type: !352)
!571 = !DILocalVariable(name: "conn", scope: !566, file: !3, line: 467, type: !198)
!572 = !DILocation(line: 465, column: 50, scope: !566)
!573 = !DILocation(line: 467, column: 23, scope: !566)
!574 = !DILocation(line: 469, column: 5, scope: !575)
!575 = distinct !DILexicalBlock(scope: !566, file: !3, line: 469, column: 5)
!576 = !DILocation(line: 469, column: 5, scope: !577)
!577 = !DILexicalBlockFile(scope: !575, file: !3, discriminator: 1)
!578 = !DILocation(line: 470, column: 21, scope: !579)
!579 = distinct !DILexicalBlock(scope: !580, file: !3, line: 470, column: 13)
!580 = distinct !DILexicalBlock(scope: !581, file: !3, line: 469, column: 35)
!581 = distinct !DILexicalBlock(scope: !575, file: !3, line: 469, column: 5)
!582 = !DILocation(line: 470, column: 14, scope: !579)
!583 = !DILocation(line: 470, column: 13, scope: !580)
!584 = !DILocation(line: 469, column: 5, scope: !585)
!585 = !DILexicalBlockFile(scope: !581, file: !3, discriminator: 2)
!586 = !DILocation(line: 469, column: 5, scope: !587)
!587 = !DILexicalBlockFile(scope: !581, file: !3, discriminator: 1)
!588 = distinct !{!588, !574, !589}
!589 = !DILocation(line: 473, column: 5, scope: !575)
!590 = !DILocation(line: 476, column: 1, scope: !566)
!591 = distinct !DISubprogram(name: "__a2dp_conn_for_channel", scope: !3, file: !3, line: 478, type: !592, isLocal: false, isDefinition: true, scopeLine: 479, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !594)
!592 = !DISubroutineType(types: !593)
!593 = !{!198, !275}
!594 = !{!595, !596}
!595 = !DILocalVariable(name: "channel", arg: 1, scope: !591, file: !3, line: 478, type: !275)
!596 = !DILocalVariable(name: "conn", scope: !591, file: !3, line: 480, type: !198)
!597 = !DILocation(line: 478, column: 47, scope: !591)
!598 = !DILocation(line: 482, column: 9, scope: !599)
!599 = distinct !DILexicalBlock(scope: !591, file: !3, line: 482, column: 9)
!600 = !DILocation(line: 482, column: 20, scope: !599)
!601 = !DILocation(line: 482, column: 9, scope: !591)
!602 = !DILocation(line: 480, column: 23, scope: !591)
!603 = !DILocation(line: 486, column: 5, scope: !604)
!604 = !DILexicalBlockFile(scope: !605, file: !3, discriminator: 1)
!605 = distinct !DILexicalBlock(scope: !606, file: !3, line: 486, column: 5)
!606 = distinct !DILexicalBlock(scope: !591, file: !3, line: 486, column: 5)
!607 = !DILocation(line: 486, column: 5, scope: !606)
!608 = !DILocation(line: 486, column: 5, scope: !609)
!609 = !DILexicalBlockFile(scope: !606, file: !3, discriminator: 1)
!610 = !DILocation(line: 487, column: 41, scope: !611)
!611 = distinct !DILexicalBlock(scope: !612, file: !3, line: 487, column: 13)
!612 = distinct !DILexicalBlock(scope: !605, file: !3, line: 486, column: 35)
!613 = !{!614, !619, i64 74}
!614 = !{!"a2dp_conn", !524, i64 0, !615, i64 6, !616, i64 8, !620, i64 104}
!615 = !{!"", !524, i64 0, !524, i64 0, !524, i64 0}
!616 = !{!"avdtp", !524, i64 0, !617, i64 56}
!617 = !{!"", !618, i64 0, !552, i64 4, !524, i64 8, !619, i64 10, !524, i64 12, !524, i64 20, !524, i64 36, !524, i64 37, !524, i64 38, !524, i64 38, !524, i64 39, !524, i64 39, !524, i64 39, !524, i64 39}
!618 = !{!"_avdtp_stream", !524, i64 0, !524, i64 0, !524, i64 0, !524, i64 0, !524, i64 0}
!619 = !{!"short", !524, i64 0}
!620 = !{!"a2dp_media", !621, i64 0, !552, i64 8, !552, i64 12, !622, i64 16, !524, i64 20, !524, i64 20, !524, i64 21}
!621 = !{!"", !619, i64 0, !619, i64 2, !622, i64 4}
!622 = !{!"int", !524, i64 0}
!623 = !DILocation(line: 487, column: 49, scope: !611)
!624 = !DILocation(line: 487, column: 60, scope: !611)
!625 = !DILocation(line: 487, column: 91, scope: !626)
!626 = !DILexicalBlockFile(scope: !611, file: !3, discriminator: 1)
!627 = !{!614, !619, i64 104}
!628 = !DILocation(line: 487, column: 99, scope: !626)
!629 = !DILocation(line: 487, column: 13, scope: !630)
!630 = !DILexicalBlockFile(scope: !612, file: !3, discriminator: 1)
!631 = !DILocation(line: 486, column: 5, scope: !632)
!632 = !DILexicalBlockFile(scope: !605, file: !3, discriminator: 2)
!633 = distinct !{!633, !607, !634}
!634 = !DILocation(line: 490, column: 5, scope: !606)
!635 = !DILocation(line: 493, column: 1, scope: !591)
!636 = distinct !DISubprogram(name: "__close_all_a2dp_media_coder", scope: !3, file: !3, line: 675, type: !637, isLocal: false, isDefinition: true, scopeLine: 676, isOptimized: true, unit: !2, variables: !639)
!637 = !DISubroutineType(types: !638)
!638 = !{null}
!639 = !{!640}
!640 = !DILocalVariable(name: "conn", scope: !636, file: !3, line: 680, type: !198)
!641 = !DILocation(line: 677, column: 9, scope: !642)
!642 = distinct !DILexicalBlock(scope: !636, file: !3, line: 677, column: 9)
!643 = !DILocation(line: 677, column: 20, scope: !642)
!644 = !DILocation(line: 677, column: 9, scope: !636)
!645 = !DILocation(line: 680, column: 23, scope: !636)
!646 = !DILocation(line: 681, column: 5, scope: !647)
!647 = distinct !DILexicalBlock(scope: !636, file: !3, line: 681, column: 5)
!648 = !DILocation(line: 682, column: 9, scope: !649)
!649 = distinct !DILexicalBlock(scope: !650, file: !3, line: 681, column: 35)
!650 = distinct !DILexicalBlock(scope: !647, file: !3, line: 681, column: 5)
!651 = !DILocation(line: 681, column: 5, scope: !652)
!652 = !DILexicalBlockFile(scope: !650, file: !3, discriminator: 2)
!653 = !DILocation(line: 681, column: 5, scope: !654)
!654 = !DILexicalBlockFile(scope: !650, file: !3, discriminator: 1)
!655 = !DILocation(line: 681, column: 5, scope: !656)
!656 = !DILexicalBlockFile(scope: !647, file: !3, discriminator: 1)
!657 = distinct !{!657, !646, !658}
!658 = !DILocation(line: 683, column: 5, scope: !647)
!659 = !DILocation(line: 684, column: 1, scope: !660)
!660 = !DILexicalBlockFile(scope: !636, file: !3, discriminator: 1)
!661 = distinct !DISubprogram(name: "__a2dp_conn_send_discover_cnt", scope: !3, file: !3, line: 1465, type: !543, isLocal: false, isDefinition: true, scopeLine: 1466, isOptimized: true, unit: !2, variables: !662)
!662 = !{!663, !664}
!663 = !DILocalVariable(name: "a2dp_discover_req_status", scope: !661, file: !3, line: 1467, type: !193)
!664 = !DILocalVariable(name: "conn", scope: !661, file: !3, line: 1468, type: !198)
!665 = !DILocation(line: 1467, column: 8, scope: !661)
!666 = !DILocation(line: 1469, column: 9, scope: !667)
!667 = distinct !DILexicalBlock(scope: !661, file: !3, line: 1469, column: 9)
!668 = !DILocation(line: 1469, column: 20, scope: !667)
!669 = !DILocation(line: 1469, column: 9, scope: !661)
!670 = !DILocation(line: 1468, column: 23, scope: !661)
!671 = !DILocation(line: 1515, column: 5, scope: !672)
!672 = distinct !DILexicalBlock(scope: !661, file: !3, line: 1515, column: 5)
!673 = !DILocation(line: 1516, column: 13, scope: !674)
!674 = distinct !DILexicalBlock(scope: !675, file: !3, line: 1516, column: 13)
!675 = distinct !DILexicalBlock(scope: !676, file: !3, line: 1515, column: 35)
!676 = distinct !DILexicalBlock(scope: !672, file: !3, line: 1515, column: 5)
!677 = !DILocation(line: 1516, column: 18, scope: !674)
!678 = !DILocation(line: 1516, column: 28, scope: !679)
!679 = !DILexicalBlockFile(scope: !674, file: !3, discriminator: 1)
!680 = !DILocation(line: 1516, column: 50, scope: !679)
!681 = !DILocation(line: 1516, column: 59, scope: !679)
!682 = !DILocation(line: 1516, column: 13, scope: !683)
!683 = !DILexicalBlockFile(scope: !675, file: !3, discriminator: 1)
!684 = !DILocation(line: 1517, column: 38, scope: !685)
!685 = distinct !DILexicalBlock(scope: !686, file: !3, line: 1517, column: 17)
!686 = distinct !DILexicalBlock(scope: !674, file: !3, line: 1516, column: 65)
!687 = !DILocation(line: 1517, column: 51, scope: !685)
!688 = !DILocation(line: 1517, column: 17, scope: !686)
!689 = !DILocation(line: 1518, column: 50, scope: !690)
!690 = distinct !DILexicalBlock(scope: !685, file: !3, line: 1517, column: 57)
!691 = !DILocation(line: 1519, column: 17, scope: !692)
!692 = distinct !DILexicalBlock(scope: !690, file: !3, line: 1519, column: 17)
!693 = !{!524, !524, i64 0}
!694 = !DILocation(line: 1519, column: 17, scope: !690)
!695 = !DILocation(line: 1519, column: 17, scope: !696)
!696 = !DILexicalBlockFile(scope: !692, file: !3, discriminator: 1)
!697 = !DILocation(line: 1520, column: 47, scope: !698)
!698 = distinct !DILexicalBlock(scope: !690, file: !3, line: 1520, column: 21)
!699 = !DILocation(line: 1520, column: 23, scope: !698)
!700 = !DILocation(line: 1520, column: 21, scope: !690)
!701 = !DILocation(line: 1521, column: 55, scope: !702)
!702 = distinct !DILexicalBlock(scope: !698, file: !3, line: 1520, column: 61)
!703 = !DILocation(line: 1522, column: 56, scope: !702)
!704 = !DILocation(line: 1522, column: 65, scope: !702)
!705 = !DILocation(line: 1523, column: 21, scope: !702)
!706 = !DILocation(line: 1524, column: 21, scope: !702)
!707 = !DILocation(line: 1525, column: 17, scope: !702)
!708 = !DILocation(line: 1515, column: 5, scope: !709)
!709 = !DILexicalBlockFile(scope: !676, file: !3, discriminator: 2)
!710 = !DILocation(line: 1515, column: 5, scope: !711)
!711 = !DILexicalBlockFile(scope: !676, file: !3, discriminator: 1)
!712 = !DILocation(line: 1515, column: 5, scope: !713)
!713 = !DILexicalBlockFile(scope: !672, file: !3, discriminator: 1)
!714 = distinct !{!714, !671, !715}
!715 = !DILocation(line: 1530, column: 5, scope: !672)
!716 = !DILocation(line: 1536, column: 5, scope: !661)
!717 = !DILocation(line: 1537, column: 1, scope: !661)
!718 = distinct !DISubprogram(name: "a2dp_send_cmd", scope: !3, file: !3, line: 1598, type: !719, isLocal: false, isDefinition: true, scopeLine: 1599, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !721)
!719 = !DISubroutineType(types: !720)
!720 = !{!340, !352, !333}
!721 = !{!722, !723, !724}
!722 = !DILocalVariable(name: "addr", arg: 1, scope: !718, file: !3, line: 1598, type: !352)
!723 = !DILocalVariable(name: "cmd", arg: 2, scope: !718, file: !3, line: 1598, type: !333)
!724 = !DILocalVariable(name: "conn", scope: !718, file: !3, line: 1600, type: !198)
!725 = !DILocation(line: 1598, column: 29, scope: !718)
!726 = !DILocation(line: 1598, column: 39, scope: !718)
!727 = !DILocation(line: 1601, column: 9, scope: !728)
!728 = distinct !DILexicalBlock(scope: !718, file: !3, line: 1601, column: 9)
!729 = !DILocation(line: 1601, column: 20, scope: !728)
!730 = !DILocation(line: 1601, column: 9, scope: !718)
!731 = !DILocation(line: 1604, column: 26, scope: !732)
!732 = distinct !DILexicalBlock(scope: !718, file: !3, line: 1604, column: 9)
!733 = !DILocation(line: 1604, column: 9, scope: !718)
!734 = !DILocation(line: 1545, column: 12, scope: !735, inlinedAt: !741)
!735 = distinct !DISubprogram(name: "a2dp_connection", scope: !3, file: !3, line: 1541, type: !736, isLocal: true, isDefinition: true, scopeLine: 1542, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !738)
!736 = !DISubroutineType(types: !737)
!737 = !{!340, !352}
!738 = !{!739, !740}
!739 = !DILocalVariable(name: "addr", arg: 1, scope: !735, file: !3, line: 1541, type: !352)
!740 = !DILocalVariable(name: "conn", scope: !735, file: !3, line: 1543, type: !198)
!741 = distinct !DILocation(line: 1605, column: 16, scope: !742)
!742 = distinct !DILexicalBlock(scope: !732, file: !3, line: 1604, column: 34)
!743 = !DILocation(line: 1543, column: 23, scope: !735, inlinedAt: !741)
!744 = !DILocation(line: 1547, column: 10, scope: !745, inlinedAt: !741)
!745 = distinct !DILexicalBlock(scope: !735, file: !3, line: 1547, column: 9)
!746 = !DILocation(line: 1547, column: 9, scope: !735, inlinedAt: !741)
!747 = !DILocation(line: 1548, column: 16, scope: !748, inlinedAt: !741)
!748 = distinct !DILexicalBlock(scope: !745, file: !3, line: 1547, column: 16)
!749 = !DILocation(line: 1551, column: 9, scope: !750, inlinedAt: !741)
!750 = distinct !DILexicalBlock(scope: !735, file: !3, line: 1551, column: 9)
!751 = !DILocation(line: 1551, column: 9, scope: !735, inlinedAt: !741)
!752 = !DILocation(line: 1552, column: 27, scope: !753, inlinedAt: !741)
!753 = distinct !DILexicalBlock(scope: !754, file: !3, line: 1552, column: 13)
!754 = distinct !DILexicalBlock(scope: !750, file: !3, line: 1551, column: 15)
!755 = !DILocation(line: 1552, column: 41, scope: !753, inlinedAt: !741)
!756 = !DILocation(line: 1552, column: 49, scope: !753, inlinedAt: !741)
!757 = !DILocation(line: 1552, column: 13, scope: !754, inlinedAt: !741)
!758 = !DILocation(line: 1553, column: 17, scope: !759, inlinedAt: !741)
!759 = distinct !DILexicalBlock(scope: !760, file: !3, line: 1553, column: 17)
!760 = distinct !DILexicalBlock(scope: !753, file: !3, line: 1552, column: 55)
!761 = !DILocation(line: 1553, column: 17, scope: !760, inlinedAt: !741)
!762 = !DILocation(line: 1554, column: 38, scope: !763, inlinedAt: !741)
!763 = distinct !DILexicalBlock(scope: !759, file: !3, line: 1553, column: 45)
!764 = !DILocation(line: 1554, column: 51, scope: !763, inlinedAt: !741)
!765 = !DILocation(line: 1555, column: 13, scope: !763, inlinedAt: !741)
!766 = !DILocation(line: 1556, column: 54, scope: !767, inlinedAt: !741)
!767 = distinct !DILexicalBlock(scope: !768, file: !3, line: 1556, column: 21)
!768 = distinct !DILexicalBlock(scope: !759, file: !3, line: 1555, column: 20)
!769 = !DILocation(line: 1556, column: 21, scope: !767, inlinedAt: !741)
!770 = !DILocation(line: 1556, column: 21, scope: !768, inlinedAt: !741)
!771 = !DILocation(line: 1564, column: 38, scope: !772, inlinedAt: !741)
!772 = distinct !DILexicalBlock(scope: !760, file: !3, line: 1564, column: 17)
!773 = !DILocation(line: 1564, column: 51, scope: !772, inlinedAt: !741)
!774 = !DILocation(line: 1564, column: 17, scope: !760, inlinedAt: !741)
!775 = !DILocation(line: 1565, column: 17, scope: !776, inlinedAt: !741)
!776 = distinct !DILexicalBlock(scope: !772, file: !3, line: 1564, column: 56)
!777 = !DILocation(line: 1566, column: 13, scope: !776, inlinedAt: !741)
!778 = !DILocation(line: 1568, column: 48, scope: !760, inlinedAt: !741)
!779 = !DILocation(line: 1568, column: 57, scope: !760, inlinedAt: !741)
!780 = !DILocation(line: 1569, column: 13, scope: !760, inlinedAt: !741)
!781 = !DILocation(line: 1571, column: 9, scope: !760, inlinedAt: !741)
!782 = !DILocation(line: 1571, column: 48, scope: !783, inlinedAt: !741)
!783 = !DILexicalBlockFile(scope: !784, file: !3, discriminator: 1)
!784 = distinct !DILexicalBlock(scope: !753, file: !3, line: 1571, column: 20)
!785 = !DILocation(line: 1571, column: 56, scope: !783, inlinedAt: !741)
!786 = !DILocation(line: 1571, column: 20, scope: !787, inlinedAt: !741)
!787 = !DILexicalBlockFile(scope: !753, file: !3, discriminator: 1)
!788 = !DILocation(line: 1575, column: 34, scope: !789, inlinedAt: !741)
!789 = distinct !DILexicalBlock(scope: !784, file: !3, line: 1571, column: 62)
!790 = !DILocation(line: 1575, column: 47, scope: !789, inlinedAt: !741)
!791 = !DILocation(line: 1576, column: 48, scope: !789, inlinedAt: !741)
!792 = !DILocation(line: 1576, column: 57, scope: !789, inlinedAt: !741)
!793 = !DILocation(line: 1577, column: 13, scope: !789, inlinedAt: !741)
!794 = !DILocation(line: 1578, column: 9, scope: !789, inlinedAt: !741)
!795 = !DILocation(line: 1608, column: 12, scope: !718)
!796 = !DILocation(line: 1600, column: 23, scope: !718)
!797 = !DILocation(line: 1609, column: 14, scope: !798)
!798 = distinct !DILexicalBlock(scope: !718, file: !3, line: 1609, column: 9)
!799 = !DILocation(line: 1609, column: 9, scope: !718)
!800 = !DILocation(line: 1613, column: 9, scope: !801)
!801 = distinct !DILexicalBlock(scope: !802, file: !3, line: 1612, column: 15)
!802 = distinct !DILexicalBlock(scope: !718, file: !3, line: 1612, column: 9)
!803 = !DILocation(line: 1615, column: 67, scope: !804)
!804 = distinct !DILexicalBlock(scope: !801, file: !3, line: 1613, column: 22)
!805 = !DILocation(line: 1615, column: 13, scope: !804)
!806 = !DILocation(line: 1616, column: 67, scope: !804)
!807 = !DILocation(line: 1616, column: 13, scope: !804)
!808 = !DILocation(line: 1617, column: 13, scope: !804)
!809 = !DILocation(line: 1653, column: 43, scope: !804)
!810 = !DILocation(line: 1653, column: 13, scope: !804)
!811 = !DILocation(line: 1654, column: 13, scope: !804)
!812 = !DILocation(line: 1659, column: 1, scope: !718)
!813 = distinct !DISubprogram(name: "a2dp_init", scope: !3, file: !3, line: 1765, type: !814, isLocal: false, isDefinition: true, scopeLine: 1766, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !816)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !479}
!816 = !{!817}
!817 = !DILocalVariable(name: "stack", arg: 1, scope: !813, file: !3, line: 1765, type: !479)
!818 = !DILocation(line: 1765, column: 30, scope: !813)
!819 = !DILocation(line: 1767, column: 16, scope: !813)
!820 = !DILocation(line: 1769, column: 5, scope: !813)
!821 = !DILocation(line: 1772, column: 5, scope: !813)
!822 = !DILocation(line: 1773, column: 1, scope: !813)
!823 = distinct !DISubprogram(name: "__a2dp_packet_handler", scope: !3, file: !3, line: 1749, type: !824, isLocal: true, isDefinition: true, scopeLine: 1750, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !826)
!824 = !DISubroutineType(types: !825)
!825 = !{null, !193, !275, !197, !275}
!826 = !{!827, !828, !829, !830, !831}
!827 = !DILocalVariable(name: "packet_type", arg: 1, scope: !823, file: !3, line: 1749, type: !193)
!828 = !DILocalVariable(name: "channel", arg: 2, scope: !823, file: !3, line: 1749, type: !275)
!829 = !DILocalVariable(name: "packet", arg: 3, scope: !823, file: !3, line: 1749, type: !197)
!830 = !DILocalVariable(name: "size", arg: 4, scope: !823, file: !3, line: 1749, type: !275)
!831 = !DILocalVariable(name: "conn", scope: !823, file: !3, line: 1751, type: !198)
!832 = !DILocalVariable(name: "addr", scope: !833, file: !3, line: 501, type: !841)
!833 = distinct !DISubprogram(name: "a2dp_incoming_connection", scope: !3, file: !3, line: 499, type: !834, isLocal: true, isDefinition: true, scopeLine: 500, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !836)
!834 = !DISubroutineType(types: !835)
!835 = !{null, !275, !197, !275}
!836 = !{!837, !838, !839, !832, !840}
!837 = !DILocalVariable(name: "channel", arg: 1, scope: !833, file: !3, line: 499, type: !275)
!838 = !DILocalVariable(name: "packet", arg: 2, scope: !833, file: !3, line: 499, type: !197)
!839 = !DILocalVariable(name: "size", arg: 3, scope: !833, file: !3, line: 499, type: !275)
!840 = !DILocalVariable(name: "conn", scope: !833, file: !3, line: 502, type: !198)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_addr_t", file: !842, line: 7, baseType: !204)
!842 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!843 = !DILocation(line: 501, column: 15, scope: !833, inlinedAt: !844)
!844 = distinct !DILocation(line: 1718, column: 13, scope: !845, inlinedAt: !854)
!845 = distinct !DILexicalBlock(scope: !846, file: !3, line: 1716, column: 28)
!846 = distinct !DILexicalBlock(scope: !847, file: !3, line: 1705, column: 26)
!847 = distinct !DISubprogram(name: "a2dp_packet_handler", scope: !3, file: !3, line: 1702, type: !824, isLocal: true, isDefinition: true, scopeLine: 1703, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !848)
!848 = !{!849, !850, !851, !852, !853}
!849 = !DILocalVariable(name: "packet_type", arg: 1, scope: !847, file: !3, line: 1702, type: !193)
!850 = !DILocalVariable(name: "channel", arg: 2, scope: !847, file: !3, line: 1702, type: !275)
!851 = !DILocalVariable(name: "packet", arg: 3, scope: !847, file: !3, line: 1702, type: !197)
!852 = !DILocalVariable(name: "size", arg: 4, scope: !847, file: !3, line: 1702, type: !275)
!853 = !DILocalVariable(name: "conn", scope: !847, file: !3, line: 1704, type: !198)
!854 = distinct !DILocation(line: 1761, column: 5, scope: !823)
!855 = !DILocation(line: 1749, column: 38, scope: !823)
!856 = !DILocation(line: 1749, column: 55, scope: !823)
!857 = !DILocation(line: 1749, column: 68, scope: !823)
!858 = !DILocation(line: 1749, column: 80, scope: !823)
!859 = !DILocation(line: 1753, column: 9, scope: !823)
!860 = !DILocation(line: 1754, column: 17, scope: !861)
!861 = distinct !DILexicalBlock(scope: !862, file: !3, line: 1753, column: 42)
!862 = distinct !DILexicalBlock(scope: !823, file: !3, line: 1753, column: 9)
!863 = !DILocation(line: 1754, column: 9, scope: !861)
!864 = !DILocation(line: 1756, column: 13, scope: !865)
!865 = distinct !DILexicalBlock(scope: !861, file: !3, line: 1754, column: 28)
!866 = !DILocation(line: 1757, column: 13, scope: !865)
!867 = !DILocation(line: 1707, column: 16, scope: !846, inlinedAt: !854)
!868 = !DILocation(line: 1704, column: 23, scope: !847, inlinedAt: !854)
!869 = !DILocation(line: 1708, column: 41, scope: !870, inlinedAt: !854)
!870 = distinct !DILexicalBlock(scope: !846, file: !3, line: 1708, column: 13)
!871 = !DILocation(line: 1708, column: 49, scope: !870, inlinedAt: !854)
!872 = !DILocation(line: 1708, column: 13, scope: !846, inlinedAt: !854)
!873 = !DILocation(line: 1708, column: 19, scope: !870, inlinedAt: !854)
!874 = !DILocation(line: 1709, column: 13, scope: !875, inlinedAt: !854)
!875 = distinct !DILexicalBlock(scope: !870, file: !3, line: 1708, column: 61)
!876 = !DILocation(line: 1710, column: 9, scope: !875, inlinedAt: !854)
!877 = !DILocation(line: 1710, column: 48, scope: !878, inlinedAt: !854)
!878 = !DILexicalBlockFile(scope: !879, file: !3, discriminator: 1)
!879 = distinct !DILexicalBlock(scope: !870, file: !3, line: 1710, column: 20)
!880 = !DILocation(line: 1710, column: 56, scope: !878, inlinedAt: !854)
!881 = !DILocation(line: 1710, column: 20, scope: !882, inlinedAt: !854)
!882 = !DILexicalBlockFile(scope: !870, file: !3, discriminator: 1)
!883 = !DILocalVariable(name: "conn", arg: 1, scope: !884, file: !3, line: 224, type: !198)
!884 = distinct !DISubprogram(name: "a2dp_media_packet", scope: !3, file: !3, line: 224, type: !885, isLocal: true, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !887)
!885 = !DISubroutineType(types: !886)
!886 = !{null, !198, !197, !275}
!887 = !{!883, !888, !889, !890}
!888 = !DILocalVariable(name: "packet", arg: 2, scope: !884, file: !3, line: 224, type: !197)
!889 = !DILocalVariable(name: "size", arg: 3, scope: !884, file: !3, line: 224, type: !275)
!890 = !DILocalVariable(name: "handler", scope: !884, file: !3, line: 236, type: !891)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 32)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "a2dp_event_handler", file: !17, line: 252, size: 224, elements: !893)
!893 = !{!894, !895, !899, !903, !905, !909, !910}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "role", scope: !892, file: !17, line: 253, baseType: !340, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "channel_open", scope: !892, file: !17, line: 254, baseType: !896, size: 32, offset: 32)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 32)
!897 = !DISubroutineType(types: !898)
!898 = !{!340, !198, !340, !193}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "event_credits", scope: !892, file: !17, line: 255, baseType: !900, size: 32, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 32)
!901 = !DISubroutineType(types: !902)
!902 = !{null, !198}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "media_packet", scope: !892, file: !17, line: 256, baseType: !904, size: 32, offset: 96)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !892, file: !17, line: 257, baseType: !906, size: 32, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 32)
!907 = !DISubroutineType(types: !908)
!908 = !{null, !198, !352}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "suspend", scope: !892, file: !17, line: 258, baseType: !906, size: 32, offset: 160)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !892, file: !17, line: 259, baseType: !900, size: 32, offset: 192)
!911 = !DILocation(line: 224, column: 49, scope: !884, inlinedAt: !912)
!912 = distinct !DILocation(line: 1711, column: 13, scope: !913, inlinedAt: !854)
!913 = distinct !DILexicalBlock(scope: !879, file: !3, line: 1710, column: 68)
!914 = !DILocation(line: 224, column: 59, scope: !884, inlinedAt: !912)
!915 = !DILocation(line: 224, column: 71, scope: !884, inlinedAt: !912)
!916 = !DILocation(line: 231, column: 37, scope: !917, inlinedAt: !912)
!917 = distinct !DILexicalBlock(scope: !884, file: !3, line: 231, column: 9)
!918 = !{!614, !552, i64 68}
!919 = !DILocation(line: 231, column: 48, scope: !917, inlinedAt: !912)
!920 = !DILocation(line: 231, column: 9, scope: !917, inlinedAt: !912)
!921 = !DILocation(line: 231, column: 54, scope: !917, inlinedAt: !912)
!922 = !DILocation(line: 231, column: 9, scope: !884, inlinedAt: !912)
!923 = !DILocation(line: 232, column: 9, scope: !924, inlinedAt: !912)
!924 = distinct !DILexicalBlock(scope: !925, file: !3, line: 232, column: 9)
!925 = distinct !DILexicalBlock(scope: !917, file: !3, line: 231, column: 80)
!926 = !DILocation(line: 232, column: 9, scope: !925, inlinedAt: !912)
!927 = !DILocation(line: 232, column: 9, scope: !928, inlinedAt: !912)
!928 = !DILexicalBlockFile(scope: !924, file: !3, discriminator: 1)
!929 = !DILocation(line: 237, column: 9, scope: !930, inlinedAt: !912)
!930 = distinct !DILexicalBlock(scope: !884, file: !3, line: 237, column: 9)
!931 = !DILocation(line: 237, column: 29, scope: !930, inlinedAt: !912)
!932 = !DILocation(line: 237, column: 9, scope: !884, inlinedAt: !912)
!933 = !DILocation(line: 241, column: 9, scope: !934, inlinedAt: !912)
!934 = distinct !DILexicalBlock(scope: !884, file: !3, line: 241, column: 9)
!935 = !DILocation(line: 247, column: 9, scope: !936, inlinedAt: !912)
!936 = distinct !DILexicalBlock(scope: !884, file: !3, line: 247, column: 9)
!937 = !DILocation(line: 247, column: 9, scope: !884, inlinedAt: !912)
!938 = !DILocation(line: 254, column: 9, scope: !939, inlinedAt: !912)
!939 = distinct !DILexicalBlock(scope: !884, file: !3, line: 254, column: 9)
!940 = !{!622, !622, i64 0}
!941 = !DILocation(line: 254, column: 9, scope: !884, inlinedAt: !912)
!942 = !DILocation(line: 236, column: 32, scope: !884, inlinedAt: !912)
!943 = !DILocation(line: 274, column: 5, scope: !944, inlinedAt: !912)
!944 = !DILexicalBlockFile(scope: !945, file: !3, discriminator: 1)
!945 = distinct !DILexicalBlock(scope: !884, file: !3, line: 274, column: 5)
!946 = !DILocation(line: 255, column: 14, scope: !947, inlinedAt: !912)
!947 = distinct !DILexicalBlock(scope: !948, file: !3, line: 255, column: 13)
!948 = distinct !DILexicalBlock(scope: !939, file: !3, line: 254, column: 36)
!949 = !DILocation(line: 255, column: 37, scope: !947, inlinedAt: !912)
!950 = !DILocation(line: 255, column: 65, scope: !947, inlinedAt: !912)
!951 = !DILocation(line: 255, column: 70, scope: !952, inlinedAt: !912)
!952 = !DILexicalBlockFile(scope: !947, file: !3, discriminator: 1)
!953 = !DILocation(line: 255, column: 93, scope: !952, inlinedAt: !912)
!954 = !DILocation(line: 255, column: 13, scope: !955, inlinedAt: !912)
!955 = !DILexicalBlockFile(scope: !948, file: !3, discriminator: 1)
!956 = !DILocation(line: 257, column: 13, scope: !957, inlinedAt: !912)
!957 = distinct !DILexicalBlock(scope: !947, file: !3, line: 255, column: 118)
!958 = !DILocation(line: 258, column: 13, scope: !957, inlinedAt: !912)
!959 = !DILocation(line: 275, column: 22, scope: !960, inlinedAt: !912)
!960 = distinct !DILexicalBlock(scope: !961, file: !3, line: 275, column: 13)
!961 = distinct !DILexicalBlock(scope: !962, file: !3, line: 274, column: 42)
!962 = distinct !DILexicalBlock(scope: !945, file: !3, line: 274, column: 5)
!963 = !{!964, !622, i64 0}
!964 = !{!"a2dp_event_handler", !622, i64 0, !552, i64 4, !552, i64 8, !552, i64 12, !552, i64 16, !552, i64 20, !552, i64 24}
