temp.o:	file format ELF32-i386

.debug_info contents:
0x00000000: Compile Unit: length = 0x000009d9 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x000009dd)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)")
              DW_AT_language	(DW_LANG_C99)
              DW_AT_name	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp_sink.c")
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
              DW_AT_GNU_pubnames	(true)
              DW_AT_low_pc	(0x0000000000000000)
              DW_AT_high_pc	(0x00000000000002fa)

0x00000026:   DW_TAG_variable
                DW_AT_name	("app_info_debug_enable")
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/profile_stack_debug.h")
                DW_AT_decl_line	(190)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000037:   DW_TAG_base_type
                DW_AT_name	("int")
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_byte_size	(0x04)

0x0000003e:   DW_TAG_variable
                DW_AT_name	("a2dp_sink_event_handler")
                DW_AT_type	(cu + 0x004f "const a2dp_event_handler")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp_sink.c")
                DW_AT_decl_line	(169)
                DW_AT_location	(DW_OP_addr 0x0)

0x0000004f:   DW_TAG_const_type
                DW_AT_type	(cu + 0x0054 "a2dp_event_handler")

0x00000054:   DW_TAG_structure_type
                DW_AT_name	("a2dp_event_handler")
                DW_AT_byte_size	(0x1c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(252)

0x0000005c:     DW_TAG_member
                  DW_AT_name	("role")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(253)
                  DW_AT_data_member_location	(0x00)

0x00000068:     DW_TAG_member
                  DW_AT_name	("channel_open")
                  DW_AT_type	(cu + 0x00b5 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(254)
                  DW_AT_data_member_location	(0x04)

0x00000074:     DW_TAG_member
                  DW_AT_name	("event_credits")
                  DW_AT_type	(cu + 0x0770 "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(255)
                  DW_AT_data_member_location	(0x08)

0x00000080:     DW_TAG_member
                  DW_AT_name	("media_packet")
                  DW_AT_type	(cu + 0x077c "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(256)
                  DW_AT_data_member_location	(0x0c)

0x0000008d:     DW_TAG_member
                  DW_AT_name	("start")
                  DW_AT_type	(cu + 0x0792 "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(257)
                  DW_AT_data_member_location	(0x10)

0x0000009a:     DW_TAG_member
                  DW_AT_name	("suspend")
                  DW_AT_type	(cu + 0x0792 "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(258)
                  DW_AT_data_member_location	(0x14)

0x000000a7:     DW_TAG_member
                  DW_AT_name	("close")
                  DW_AT_type	(cu + 0x0770 "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(259)
                  DW_AT_data_member_location	(0x18)

0x000000b4:     NULL

0x000000b5:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x00ba "subroutine int")

0x000000ba:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_prototyped	(true)

0x000000bf:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x00cf "a2dp_conn*")

0x000000c4:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0037 "int")

0x000000c9:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0185 "u8")

0x000000ce:     NULL

0x000000cf:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x00d4 "a2dp_conn")

0x000000d4:   DW_TAG_structure_type
                DW_AT_name	("a2dp_conn")
                DW_AT_byte_size	(0x80)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(237)

0x000000dc:     DW_TAG_member
                  DW_AT_name	("addr")
                  DW_AT_type	(cu + 0x010d "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(238)
                  DW_AT_data_member_location	(0x00)

0x000000e8:     DW_TAG_member
                  DW_AT_name	("a2dp_core_data")
                  DW_AT_type	(cu + 0x0148 "a2dp_core_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(239)
                  DW_AT_data_member_location	(0x06)

0x000000f4:     DW_TAG_member
                  DW_AT_name	("session")
                  DW_AT_type	(cu + 0x0190 "avdtp")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(240)
                  DW_AT_data_member_location	(0x08)

0x00000100:     DW_TAG_member
                  DW_AT_name	("media")
                  DW_AT_type	(cu + 0x058c "a2dp_media")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(241)
                  DW_AT_data_member_location	(0x68)

0x0000010c:     NULL

0x0000010d:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0118 "uint8_t[]")
                DW_AT_name	("bd_addr_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/utils.h")
                DW_AT_decl_line	(66)

0x00000118:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0124 "uint8_t")

0x0000011d:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0141 "sizetype")
                  DW_AT_count	(0x06)

0x00000123:     NULL

0x00000124:   DW_TAG_typedef
                DW_AT_type	(cu + 0x012f "__uint8_t")
                DW_AT_name	("uint8_t")
                DW_AT_decl_file	("/opt/q32s/include/sys/_stdint.h")
                DW_AT_decl_line	(20)

0x0000012f:   DW_TAG_typedef
                DW_AT_type	(cu + 0x013a "unsigned char")
                DW_AT_name	("__uint8_t")
                DW_AT_decl_file	("/opt/q32s/include/machine/_default_types.h")
                DW_AT_decl_line	(29)

0x0000013a:   DW_TAG_base_type
                DW_AT_name	("unsigned char")
                DW_AT_encoding	(DW_ATE_unsigned_char)
                DW_AT_byte_size	(0x01)

0x00000141:   DW_TAG_base_type
                DW_AT_name	("sizetype")
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_unsigned)

0x00000148:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0153 "structure ")
                DW_AT_name	("a2dp_core_data_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(229)

0x00000153:   DW_TAG_structure_type
                DW_AT_byte_size	(0x01)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(225)

0x00000157:     DW_TAG_member
                  DW_AT_name	("inused")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(226)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x07)
                  DW_AT_data_member_location	(0x00)

0x00000166:     DW_TAG_member
                  DW_AT_name	("discover_req")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(227)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x03)
                  DW_AT_data_member_location	(0x00)

0x00000175:     DW_TAG_member
                  DW_AT_name	("bqb_test_cnt")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(228)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x03)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x00)

0x00000184:     NULL

0x00000185:   DW_TAG_typedef
                DW_AT_type	(cu + 0x013a "unsigned char")
                DW_AT_name	("u8")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(11)

0x00000190:   DW_TAG_structure_type
                DW_AT_name	("avdtp")
                DW_AT_byte_size	(0x60)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(335)

0x00000199:     DW_TAG_member
                  DW_AT_name	("local_seps")
                  DW_AT_type	(cu + 0x01b4 "avdtp_local_sep[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(337)
                  DW_AT_data_member_location	(0x00)

0x000001a6:     DW_TAG_member
                  DW_AT_name	("adp_core_data")
                  DW_AT_type	(cu + 0x0474 "avdtp_core_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(338)
                  DW_AT_data_member_location	(0x38)

0x000001b3:     NULL

0x000001b4:   DW_TAG_array_type
                DW_AT_type	(cu + 0x01c0 "avdtp_local_sep")

0x000001b9:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0141 "sizetype")
                  DW_AT_count	(0x02)

0x000001bf:     NULL

0x000001c0:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01cc "_avdtp_local_sep")
                DW_AT_name	("avdtp_local_sep")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(293)

0x000001cc:   DW_TAG_structure_type
                DW_AT_name	("_avdtp_local_sep")
                DW_AT_byte_size	(0x1c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(282)

0x000001d5:     DW_TAG_member
                  DW_AT_name	("ind")
                  DW_AT_type	(cu + 0x022a "const _avdtp_sep_ind*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(283)
                  DW_AT_data_member_location	(0x00)

0x000001e2:     DW_TAG_member
                  DW_AT_name	("session")
                  DW_AT_type	(cu + 0x03f5 "avdtp*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(284)
                  DW_AT_data_member_location	(0x04)

0x000001ef:     DW_TAG_member
                  DW_AT_name	("info")
                  DW_AT_type	(cu + 0x03fa "seid_info")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(286)
                  DW_AT_data_member_location	(0x08)

0x000001fc:     DW_TAG_member
                  DW_AT_name	("state")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(288)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x0a)

0x0000020c:     DW_TAG_member
                  DW_AT_name	("codec_type")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(289)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x0a)

0x0000021c:     DW_TAG_member
                  DW_AT_name	("config")
                  DW_AT_type	(cu + 0x0468 "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(290)
                  DW_AT_data_member_location	(0x0b)

0x00000229:     NULL

0x0000022a:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x022f "const _avdtp_sep_ind")

0x0000022f:   DW_TAG_const_type
                DW_AT_type	(cu + 0x0234 "_avdtp_sep_ind")

0x00000234:   DW_TAG_structure_type
                DW_AT_name	("_avdtp_sep_ind")
                DW_AT_byte_size	(0x24)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(350)

0x0000023d:     DW_TAG_member
                  DW_AT_name	("get_capability")
                  DW_AT_type	(cu + 0x02b3 "subroutine bool*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(351)
                  DW_AT_data_member_location	(0x00)

0x0000024a:     DW_TAG_member
                  DW_AT_name	("set_configuration")
                  DW_AT_type	(cu + 0x02de "subroutine bool*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(353)
                  DW_AT_data_member_location	(0x04)

0x00000257:     DW_TAG_member
                  DW_AT_name	("open")
                  DW_AT_type	(cu + 0x0302 "subroutine bool*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(355)
                  DW_AT_data_member_location	(0x08)

0x00000264:     DW_TAG_member
                  DW_AT_name	("start")
                  DW_AT_type	(cu + 0x0387 "subroutine bool*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(356)
                  DW_AT_data_member_location	(0x0c)

0x00000271:     DW_TAG_member
                  DW_AT_name	("suspend")
                  DW_AT_type	(cu + 0x0387 "subroutine bool*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(357)
                  DW_AT_data_member_location	(0x10)

0x0000027e:     DW_TAG_member
                  DW_AT_name	("close")
                  DW_AT_type	(cu + 0x039c "subroutine bool*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(359)
                  DW_AT_data_member_location	(0x14)

0x0000028b:     DW_TAG_member
                  DW_AT_name	("abort")
                  DW_AT_type	(cu + 0x03b6 "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(361)
                  DW_AT_data_member_location	(0x18)

0x00000298:     DW_TAG_member
                  DW_AT_name	("reconfigure")
                  DW_AT_type	(cu + 0x03c2 "subroutine bool*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(362)
                  DW_AT_data_member_location	(0x1c)

0x000002a5:     DW_TAG_member
                  DW_AT_name	("delayreport")
                  DW_AT_type	(cu + 0x03ce "subroutine bool*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(363)
                  DW_AT_data_member_location	(0x20)

0x000002b2:     NULL

0x000002b3:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x02b8 "subroutine bool")

0x000002b8:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x02cd "bool")
                DW_AT_prototyped	(true)

0x000002bd:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0185 "u8")

0x000002c2:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x02d8 "*")

0x000002c7:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x02d9 "u8*")

0x000002cc:     NULL

0x000002cd:   DW_TAG_typedef
                DW_AT_type	(cu + 0x013a "unsigned char")
                DW_AT_name	("bool")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(11)

0x000002d8:   DW_TAG_pointer_type

0x000002d9:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0185 "u8")

0x000002de:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x02e3 "subroutine bool")

0x000002e3:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x02cd "bool")
                DW_AT_prototyped	(true)

0x000002e8:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x02fd "avdtp_local_sep*")

0x000002ed:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x02d9 "u8*")

0x000002f2:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0185 "u8")

0x000002f7:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x02d8 "*")

0x000002fc:     NULL

0x000002fd:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x01c0 "avdtp_local_sep")

0x00000302:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0307 "subroutine bool")

0x00000307:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x02cd "bool")
                DW_AT_prototyped	(true)

0x0000030c:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x02fd "avdtp_local_sep*")

0x00000311:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x031c "avdtp_stream*")

0x00000316:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0185 "u8")

0x0000031b:     NULL

0x0000031c:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0321 "avdtp_stream")

0x00000321:   DW_TAG_typedef
                DW_AT_type	(cu + 0x032d "_avdtp_stream")
                DW_AT_name	("avdtp_stream")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(280)

0x0000032d:   DW_TAG_structure_type
                DW_AT_name	("_avdtp_stream")
                DW_AT_byte_size	(0x01)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(268)

0x00000336:     DW_TAG_member
                  DW_AT_name	("rseid")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(270)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x00)

0x00000346:     DW_TAG_member
                  DW_AT_name	("int_role")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(271)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x03)
                  DW_AT_data_member_location	(0x00)

0x00000356:     DW_TAG_member
                  DW_AT_name	("open_acp")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(272)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x02)
                  DW_AT_data_member_location	(0x00)

0x00000366:     DW_TAG_member
                  DW_AT_name	("starting")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(278)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x01)
                  DW_AT_data_member_location	(0x00)

0x00000376:     DW_TAG_member
                  DW_AT_name	("reserve")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(279)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x00)

0x00000386:     NULL

0x00000387:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x038c "subroutine bool")

0x0000038c:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x02cd "bool")
                DW_AT_prototyped	(true)

0x00000391:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x02fd "avdtp_local_sep*")

0x00000396:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x031c "avdtp_stream*")

0x0000039b:     NULL

0x0000039c:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x03a1 "subroutine bool")

0x000003a1:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x02cd "bool")
                DW_AT_prototyped	(true)

0x000003a6:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x02fd "avdtp_local_sep*")

0x000003ab:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x031c "avdtp_stream*")

0x000003b0:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x02d9 "u8*")

0x000003b5:     NULL

0x000003b6:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x03bb "subroutine ")

0x000003bb:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x000003bc:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x02fd "avdtp_local_sep*")

0x000003c1:     NULL

0x000003c2:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x03c7 "subroutine bool")

0x000003c7:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x02cd "bool")

0x000003cc:     DW_TAG_unspecified_parameters

0x000003cd:     NULL

0x000003ce:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x03d3 "subroutine bool")

0x000003d3:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x02cd "bool")
                DW_AT_prototyped	(true)

0x000003d8:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0185 "u8")

0x000003dd:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x03e3 "u16")

0x000003e2:     NULL

0x000003e3:   DW_TAG_typedef
                DW_AT_type	(cu + 0x03ee "unsigned short")
                DW_AT_name	("u16")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(13)

0x000003ee:   DW_TAG_base_type
                DW_AT_name	("unsigned short")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x02)

0x000003f5:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0190 "avdtp")

0x000003fa:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0405 "_seid_info")
                DW_AT_name	("seid_info")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(124)

0x00000405:   DW_TAG_structure_type
                DW_AT_name	("_seid_info")
                DW_AT_byte_size	(0x02)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(117)

0x0000040d:     DW_TAG_member
                  DW_AT_name	("rfa0")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(118)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x07)
                  DW_AT_data_member_location	(0x00)

0x0000041c:     DW_TAG_member
                  DW_AT_name	("inuse")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(119)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x06)
                  DW_AT_data_member_location	(0x00)

0x0000042b:     DW_TAG_member
                  DW_AT_name	("seid")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(120)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x06)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x00)

0x0000043a:     DW_TAG_member
                  DW_AT_name	("rfa2")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(121)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x03)
                  DW_AT_bit_offset	(0x05)
                  DW_AT_data_member_location	(0x01)

0x00000449:     DW_TAG_member
                  DW_AT_name	("type")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(122)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x01)

0x00000458:     DW_TAG_member
                  DW_AT_name	("media_type")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(123)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x01)

0x00000467:     NULL

0x00000468:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0185 "u8")

0x0000046d:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0141 "sizetype")
                  DW_AT_count	(0x10)

0x00000473:     NULL

0x00000474:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0480 "structure ")
                DW_AT_name	("avdtp_core_data_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(333)

0x00000480:   DW_TAG_structure_type
                DW_AT_byte_size	(0x28)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(318)

0x00000485:     DW_TAG_member
                  DW_AT_name	("stream")
                  DW_AT_type	(cu + 0x0321 "avdtp_stream")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(319)
                  DW_AT_data_member_location	(0x00)

0x00000492:     DW_TAG_member
                  DW_AT_name	("local_sep")
                  DW_AT_type	(cu + 0x02fd "avdtp_local_sep*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(320)
                  DW_AT_data_member_location	(0x04)

0x0000049f:     DW_TAG_member
                  DW_AT_name	("local_sep_ind")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(321)
                  DW_AT_data_member_location	(0x08)

0x000004ac:     DW_TAG_member
                  DW_AT_name	("channel")
                  DW_AT_type	(cu + 0x03e3 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(322)
                  DW_AT_data_member_location	(0x0a)

0x000004b9:     DW_TAG_member
                  DW_AT_name	("acp_seid")
                  DW_AT_type	(cu + 0x054e "seid_req[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(323)
                  DW_AT_data_member_location	(0x0c)

0x000004c6:     DW_TAG_member
                  DW_AT_name	("config")
                  DW_AT_type	(cu + 0x0468 "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(324)
                  DW_AT_data_member_location	(0x14)

0x000004d3:     DW_TAG_member
                  DW_AT_name	("seid_ind")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(325)
                  DW_AT_data_member_location	(0x24)

0x000004e0:     DW_TAG_member
                  DW_AT_name	("pending_req")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(326)
                  DW_AT_data_member_location	(0x25)

0x000004ed:     DW_TAG_member
                  DW_AT_name	("max_acp_seid")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(327)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x26)

0x000004fd:     DW_TAG_member
                  DW_AT_name	("cur_acp_seid")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(328)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x26)

0x0000050d:     DW_TAG_member
                  DW_AT_name	("aac_codec_prior")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(329)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x27)

0x0000051d:     DW_TAG_member
                  DW_AT_name	("role")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(330)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x02)
                  DW_AT_data_member_location	(0x27)

0x0000052d:     DW_TAG_member
                  DW_AT_name	("get_discover")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(331)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x01)
                  DW_AT_data_member_location	(0x27)

0x0000053d:     DW_TAG_member
                  DW_AT_name	("reserve")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(332)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x27)

0x0000054d:     NULL

0x0000054e:   DW_TAG_array_type
                DW_AT_type	(cu + 0x055a "seid_req")

0x00000553:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0141 "sizetype")
                  DW_AT_count	(0x08)

0x00000559:     NULL

0x0000055a:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0565 "_seid_req")
                DW_AT_name	("seid_req")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(129)

0x00000565:   DW_TAG_structure_type
                DW_AT_name	("_seid_req")
                DW_AT_byte_size	(0x01)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(126)

0x0000056d:     DW_TAG_member
                  DW_AT_name	("rfa0")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(127)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x06)
                  DW_AT_data_member_location	(0x00)

0x0000057c:     DW_TAG_member
                  DW_AT_name	("acp_seid")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(128)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x06)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x00)

0x0000058b:     NULL

0x0000058c:   DW_TAG_structure_type
                DW_AT_name	("a2dp_media")
                DW_AT_byte_size	(0x18)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(215)

0x00000594:     DW_TAG_member
                  DW_AT_name	("media_core_data")
                  DW_AT_type	(cu + 0x05ef "media_core_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(216)
                  DW_AT_data_member_location	(0x00)

0x000005a0:     DW_TAG_member
                  DW_AT_name	("probe")
                  DW_AT_type	(cu + 0x0635 "a2dp_media_probe*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(217)
                  DW_AT_data_member_location	(0x08)

0x000005ac:     DW_TAG_member
                  DW_AT_name	("codec")
                  DW_AT_type	(cu + 0x06e5 "a2dp_media_codec*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(218)
                  DW_AT_data_member_location	(0x0c)

0x000005b8:     DW_TAG_member
                  DW_AT_name	("bitrate")
                  DW_AT_type	(cu + 0x0623 "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(219)
                  DW_AT_data_member_location	(0x10)

0x000005c4:     DW_TAG_member
                  DW_AT_name	("nchannels")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(220)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x14)

0x000005d3:     DW_TAG_member
                  DW_AT_name	("reserve")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(221)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x14)

0x000005e2:     DW_TAG_member
                  DW_AT_name	("type")
                  DW_AT_type	(cu + 0x0185 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(222)
                  DW_AT_data_member_location	(0x15)

0x000005ee:     NULL

0x000005ef:   DW_TAG_typedef
                DW_AT_type	(cu + 0x05fa "structure ")
                DW_AT_name	("media_core_data_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(213)

0x000005fa:   DW_TAG_structure_type
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(209)

0x000005fe:     DW_TAG_member
                  DW_AT_name	("channel")
                  DW_AT_type	(cu + 0x03e3 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(210)
                  DW_AT_data_member_location	(0x00)

0x0000060a:     DW_TAG_member
                  DW_AT_name	("cp_type")
                  DW_AT_type	(cu + 0x03e3 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(211)
                  DW_AT_data_member_location	(0x02)

0x00000616:     DW_TAG_member
                  DW_AT_name	("samplerate")
                  DW_AT_type	(cu + 0x0623 "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(212)
                  DW_AT_data_member_location	(0x04)

0x00000622:     NULL

0x00000623:   DW_TAG_typedef
                DW_AT_type	(cu + 0x062e "unsigned int")
                DW_AT_name	("u32")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(15)

0x0000062e:   DW_TAG_base_type
                DW_AT_name	("unsigned int")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x04)

0x00000635:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x063a "a2dp_media_probe")

0x0000063a:   DW_TAG_structure_type
                DW_AT_name	("a2dp_media_probe")
                DW_AT_byte_size	(0x18)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(190)

0x00000642:     DW_TAG_member
                  DW_AT_name	("type")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(192)
                  DW_AT_data_member_location	(0x00)

0x0000064e:     DW_TAG_member
                  DW_AT_name	("init")
                  DW_AT_type	(cu + 0x068b "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(193)
                  DW_AT_data_member_location	(0x04)

0x0000065a:     DW_TAG_member
                  DW_AT_name	("probe")
                  DW_AT_type	(cu + 0x06ba "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(194)
                  DW_AT_data_member_location	(0x08)

0x00000666:     DW_TAG_member
                  DW_AT_name	("start")
                  DW_AT_type	(cu + 0x06d9 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(195)
                  DW_AT_data_member_location	(0x0c)

0x00000672:     DW_TAG_member
                  DW_AT_name	("suspend")
                  DW_AT_type	(cu + 0x06d9 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(196)
                  DW_AT_data_member_location	(0x10)

0x0000067e:     DW_TAG_member
                  DW_AT_name	("close")
                  DW_AT_type	(cu + 0x06d9 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(197)
                  DW_AT_data_member_location	(0x14)

0x0000068a:     NULL

0x0000068b:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0690 "subroutine int")

0x00000690:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_prototyped	(true)

0x00000695:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x02d8 "*")

0x0000069a:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x06a0 "subroutine int*")

0x0000069f:     NULL

0x000006a0:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x06a5 "subroutine int")

0x000006a5:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_prototyped	(true)

0x000006aa:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x02d8 "*")

0x000006af:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x02d9 "u8*")

0x000006b4:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x03e3 "u16")

0x000006b9:     NULL

0x000006ba:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x06bf "subroutine int")

0x000006bf:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_prototyped	(true)

0x000006c4:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x06d4 "uint8_t*")

0x000006c9:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x02d9 "u8*")

0x000006ce:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x03e3 "u16")

0x000006d3:     NULL

0x000006d4:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0124 "uint8_t")

0x000006d9:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x06de "subroutine int")

0x000006de:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")

0x000006e3:     DW_TAG_unspecified_parameters

0x000006e4:     NULL

0x000006e5:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x06ea "a2dp_media_codec")

0x000006ea:   DW_TAG_structure_type
                DW_AT_name	("a2dp_media_codec")
                DW_AT_byte_size	(0x18)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(200)

0x000006f2:     DW_TAG_member
                  DW_AT_name	("type")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(201)
                  DW_AT_data_member_location	(0x00)

0x000006fe:     DW_TAG_member
                  DW_AT_name	("inused")
                  DW_AT_type	(cu + 0x073b "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(202)
                  DW_AT_data_member_location	(0x04)

0x0000070a:     DW_TAG_member
                  DW_AT_name	("init")
                  DW_AT_type	(cu + 0x074b "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(203)
                  DW_AT_data_member_location	(0x08)

0x00000716:     DW_TAG_member
                  DW_AT_name	("start")
                  DW_AT_type	(cu + 0x075b "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(204)
                  DW_AT_data_member_location	(0x0c)

0x00000722:     DW_TAG_member
                  DW_AT_name	("suspend")
                  DW_AT_type	(cu + 0x06d9 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(205)
                  DW_AT_data_member_location	(0x10)

0x0000072e:     DW_TAG_member
                  DW_AT_name	("stop")
                  DW_AT_type	(cu + 0x074b "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(206)
                  DW_AT_data_member_location	(0x14)

0x0000073a:     NULL

0x0000073b:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0740 "subroutine int")

0x00000740:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_prototyped	(true)

0x00000745:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0037 "int")

0x0000074a:     NULL

0x0000074b:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0750 "subroutine int")

0x00000750:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_prototyped	(true)

0x00000755:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x02d8 "*")

0x0000075a:     NULL

0x0000075b:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0760 "subroutine int")

0x00000760:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_prototyped	(true)

0x00000765:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x02d9 "u8*")

0x0000076a:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x03e3 "u16")

0x0000076f:     NULL

0x00000770:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0775 "subroutine ")

0x00000775:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x00000776:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x00cf "a2dp_conn*")

0x0000077b:     NULL

0x0000077c:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0781 "subroutine ")

0x00000781:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x00000782:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x00cf "a2dp_conn*")

0x00000787:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x02d9 "u8*")

0x0000078c:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x03e3 "u16")

0x00000791:     NULL

0x00000792:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0797 "subroutine ")

0x00000797:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x00000798:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x00cf "a2dp_conn*")

0x0000079d:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x06d4 "uint8_t*")

0x000007a2:     NULL

0x000007a3:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x07a8 "rtp_header")

0x000007a8:   DW_TAG_typedef
                DW_AT_type	(cu + 0x07b3 "_rtp_header")
                DW_AT_name	("rtp_header")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/Rtp.h")
                DW_AT_decl_line	(25)

0x000007b3:   DW_TAG_structure_type
                DW_AT_name	("_rtp_header")
                DW_AT_byte_size	(0x0c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/Rtp.h")
                DW_AT_decl_line	(12)

0x000007bb:     DW_TAG_member
                  DW_AT_name	("cc")
                  DW_AT_type	(cu + 0x03e3 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/Rtp.h")
                  DW_AT_decl_line	(13)
                  DW_AT_byte_size	(0x02)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x0c)
                  DW_AT_data_member_location	(0x00)

0x000007ca:     DW_TAG_member
                  DW_AT_name	("x")
                  DW_AT_type	(cu + 0x03e3 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/Rtp.h")
                  DW_AT_decl_line	(14)
                  DW_AT_byte_size	(0x02)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x0b)
                  DW_AT_data_member_location	(0x00)

0x000007d9:     DW_TAG_member
                  DW_AT_name	("p")
                  DW_AT_type	(cu + 0x03e3 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/Rtp.h")
                  DW_AT_decl_line	(15)
                  DW_AT_byte_size	(0x02)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x0a)
                  DW_AT_data_member_location	(0x00)

0x000007e8:     DW_TAG_member
                  DW_AT_name	("v")
                  DW_AT_type	(cu + 0x03e3 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/Rtp.h")
                  DW_AT_decl_line	(16)
                  DW_AT_byte_size	(0x02)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x08)
                  DW_AT_data_member_location	(0x00)

0x000007f7:     DW_TAG_member
                  DW_AT_name	("pt")
                  DW_AT_type	(cu + 0x03e3 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/Rtp.h")
                  DW_AT_decl_line	(18)
                  DW_AT_byte_size	(0x02)
                  DW_AT_bit_size	(0x07)
                  DW_AT_bit_offset	(0x01)
                  DW_AT_data_member_location	(0x00)

0x00000806:     DW_TAG_member
                  DW_AT_name	("m")
                  DW_AT_type	(cu + 0x03e3 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/Rtp.h")
                  DW_AT_decl_line	(19)
                  DW_AT_byte_size	(0x02)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x00)

0x00000815:     DW_TAG_member
                  DW_AT_name	("sequence_number")
                  DW_AT_type	(cu + 0x03e3 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/Rtp.h")
                  DW_AT_decl_line	(21)
                  DW_AT_data_member_location	(0x02)

0x00000821:     DW_TAG_member
                  DW_AT_name	("timestamp")
                  DW_AT_type	(cu + 0x0623 "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/Rtp.h")
                  DW_AT_decl_line	(22)
                  DW_AT_data_member_location	(0x04)

0x0000082d:     DW_TAG_member
                  DW_AT_name	("ssrc")
                  DW_AT_type	(cu + 0x0623 "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/Rtp.h")
                  DW_AT_decl_line	(23)
                  DW_AT_data_member_location	(0x08)

0x00000839:     DW_TAG_member
                  DW_AT_name	("csrc")
                  DW_AT_type	(cu + 0x0846 "u32[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/Rtp.h")
                  DW_AT_decl_line	(24)
                  DW_AT_data_member_location	(0x0c)

0x00000845:     NULL

0x00000846:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0623 "u32")

0x0000084b:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0141 "sizetype")
                  DW_AT_count	(0x00)

0x00000851:     NULL

0x00000852:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000000)
                DW_AT_high_pc	(0x0000000000000078)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("__sink_media_probe")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp_sink.c")
                DW_AT_decl_line	(18)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0635 "a2dp_media_probe*")
                DW_AT_external	(true)

0x00000867:     DW_TAG_formal_parameter
                  DW_AT_name	("type")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp_sink.c")
                  DW_AT_decl_line	(18)
                  DW_AT_type	(cu + 0x0037 "int")

0x00000872:     DW_TAG_variable
                  DW_AT_location	(0x00000000
                     0x000000000000005c - 0x000000000000006a: DW_OP_reg2 EDX)
                  DW_AT_name	("p")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp_sink.c")
                  DW_AT_decl_line	(20)
                  DW_AT_type	(cu + 0x0635 "a2dp_media_probe*")

0x00000881:     NULL

0x00000882:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000078)
                DW_AT_high_pc	(0x0000000000000123)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("__sink_media_close")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp_sink.c")
                DW_AT_decl_line	(48)
                DW_AT_prototyped	(true)
                DW_AT_external	(true)

0x00000893:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000013
                     0x0000000000000078 - 0x000000000000008f: DW_OP_reg0 EAX
                     0x000000000000008f - 0x0000000000000123: DW_OP_breg5 EBP-4)
                  DW_AT_name	("conn")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp_sink.c")
                  DW_AT_decl_line	(48)
                  DW_AT_type	(cu + 0x00cf "a2dp_conn*")

0x000008a2:     DW_TAG_variable
                  DW_AT_name	("media")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp_sink.c")
                  DW_AT_decl_line	(50)
                  DW_AT_type	(cu + 0x09d7 "a2dp_media*")

0x000008ad:     NULL

0x000008ae:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000123)
                DW_AT_high_pc	(0x000000000000016d)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("__sink_channel_open")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp_sink.c")
                DW_AT_decl_line	(76)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0037 "int")

0x000008c3:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000032
                     0x0000000000000123 - 0x0000000000000135: DW_OP_reg1 ECX
                     0x0000000000000135 - 0x000000000000016d: DW_OP_breg5 EBP-4)
                  DW_AT_name	("conn")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp_sink.c")
