temp.o:	file format ELF32-i386

.debug_info contents:
0x00000000: Compile Unit: length = 0x00001cab version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x00001caf)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)")
              DW_AT_language	(DW_LANG_C99)
              DW_AT_name	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp.c")
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
              DW_AT_GNU_pubnames	(true)
              DW_AT_low_pc	(0x0000000000000000)
              DW_AT_high_pc	(0x0000000000002583)

0x00000026:   DW_TAG_variable
                DW_AT_name	("app_info_debug_enable")
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/profile_stack_debug.h")
                DW_AT_decl_line	(190)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000037:   DW_TAG_base_type
                DW_AT_name	("int")
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_byte_size	(0x04)

0x0000003e:   DW_TAG_variable
                DW_AT_name	("a2dp_sbc")
                DW_AT_type	(cu + 0x004f "const sbc_codec_cap")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp.c")
                DW_AT_decl_line	(62)
                DW_AT_location	(DW_OP_addr 0x0)

0x0000004f:   DW_TAG_const_type
                DW_AT_type	(cu + 0x0054 "sbc_codec_cap")

0x00000054:   DW_TAG_typedef
                DW_AT_type	(cu + 0x005f "_sbc_codec_cap")
                DW_AT_name	("sbc_codec_cap")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(46)

0x0000005f:   DW_TAG_structure_type
                DW_AT_name	("_sbc_codec_cap")
                DW_AT_byte_size	(0x06)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(37)

0x00000067:     DW_TAG_member
                  DW_AT_name	("cap")
                  DW_AT_type	(cu + 0x00d7 "avdtp_media_codec_capability")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(38)
                  DW_AT_data_member_location	(0x00)

0x00000073:     DW_TAG_member
                  DW_AT_name	("channel_mode")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(39)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x02)

0x00000082:     DW_TAG_member
                  DW_AT_name	("frequency")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(40)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x02)

0x00000091:     DW_TAG_member
                  DW_AT_name	("allocation_method")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(41)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x06)
                  DW_AT_data_member_location	(0x03)

0x000000a0:     DW_TAG_member
                  DW_AT_name	("subbands")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(42)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x03)

0x000000af:     DW_TAG_member
                  DW_AT_name	("block_length")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(43)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x03)

0x000000be:     DW_TAG_member
                  DW_AT_name	("min_bitpool")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(44)
                  DW_AT_data_member_location	(0x04)

0x000000ca:     DW_TAG_member
                  DW_AT_name	("max_bitpool")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(45)
                  DW_AT_data_member_location	(0x05)

0x000000d6:     NULL

0x000000d7:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00e2 "_avdtp_media_codec_capability")
                DW_AT_name	("avdtp_media_codec_capability")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(162)

0x000000e2:   DW_TAG_structure_type
                DW_AT_name	("_avdtp_media_codec_capability")
                DW_AT_byte_size	(0x02)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(158)

0x000000ea:     DW_TAG_member
                  DW_AT_name	("rfa0")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(159)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x00)

0x000000f9:     DW_TAG_member
                  DW_AT_name	("media_type")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(160)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x00)

0x00000108:     DW_TAG_member
                  DW_AT_name	("media_codec_type")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(161)
                  DW_AT_data_member_location	(0x01)

0x00000114:     NULL

0x00000115:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0120 "unsigned char")
                DW_AT_name	("u8")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(11)

0x00000120:   DW_TAG_base_type
                DW_AT_name	("unsigned char")
                DW_AT_encoding	(DW_ATE_unsigned_char)
                DW_AT_byte_size	(0x01)

0x00000127:   DW_TAG_variable
                DW_AT_name	("a2dp_mpeg_acc")
                DW_AT_type	(cu + 0x0138 "mpeg24_codec_cap")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp.c")
                DW_AT_decl_line	(73)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000138:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0143 "_mpeg24_codec_cap")
                DW_AT_name	("mpeg24_codec_cap")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(70)

0x00000143:   DW_TAG_structure_type
                DW_AT_name	("_mpeg24_codec_cap")
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(60)

0x0000014b:     DW_TAG_member
                  DW_AT_name	("cap")
                  DW_AT_type	(cu + 0x00d7 "avdtp_media_codec_capability")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(61)
                  DW_AT_data_member_location	(0x00)

0x00000157:     DW_TAG_member
                  DW_AT_name	("object_type")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(62)
                  DW_AT_data_member_location	(0x02)

0x00000163:     DW_TAG_member
                  DW_AT_name	("frequency_l")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(63)
                  DW_AT_data_member_location	(0x03)

0x0000016f:     DW_TAG_member
                  DW_AT_name	("rfa")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(64)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x06)
                  DW_AT_data_member_location	(0x04)

0x0000017e:     DW_TAG_member
                  DW_AT_name	("channels")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(65)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x04)

0x0000018d:     DW_TAG_member
                  DW_AT_name	("frequency_h")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(66)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x04)

0x0000019c:     DW_TAG_member
                  DW_AT_name	("bitrate_h")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(67)
                  DW_AT_data_member_location	(0x05)

0x000001a8:     DW_TAG_member
                  DW_AT_name	("bitrate_m")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(68)
                  DW_AT_data_member_location	(0x06)

0x000001b4:     DW_TAG_member
                  DW_AT_name	("bitrate_l")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(69)
                  DW_AT_data_member_location	(0x07)

0x000001c0:     NULL

0x000001c1:   DW_TAG_variable
                DW_AT_name	("a2dp_aptx")
                DW_AT_type	(cu + 0x01d2 "const a2dp_aptx_cap")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp.c")
                DW_AT_decl_line	(86)
                DW_AT_location	(DW_OP_addr 0x0)

0x000001d2:   DW_TAG_const_type
                DW_AT_type	(cu + 0x01d7 "a2dp_aptx_cap")

0x000001d7:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01e2 "_a2dp_aptx_cap")
                DW_AT_name	("a2dp_aptx_cap")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(81)

0x000001e2:   DW_TAG_structure_type
                DW_AT_name	("_a2dp_aptx_cap")
                DW_AT_byte_size	(0x09)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(72)

0x000001ea:     DW_TAG_member
                  DW_AT_name	("cap")
                  DW_AT_type	(cu + 0x00d7 "avdtp_media_codec_capability")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(73)
                  DW_AT_data_member_location	(0x00)

0x000001f6:     DW_TAG_member
                  DW_AT_name	("info")
                  DW_AT_type	(cu + 0x0221 "a2dp_vendor_codec_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(74)
                  DW_AT_data_member_location	(0x02)

0x00000202:     DW_TAG_member
                  DW_AT_name	("channel_mode")
                  DW_AT_type	(cu + 0x0283 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(75)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x08)

0x00000211:     DW_TAG_member
                  DW_AT_name	("frequency")
                  DW_AT_type	(cu + 0x0283 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(76)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x08)

0x00000220:     NULL

0x00000221:   DW_TAG_typedef
                DW_AT_type	(cu + 0x022c "structure ")
                DW_AT_name	("a2dp_vendor_codec_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(33)

0x0000022c:   DW_TAG_structure_type
                DW_AT_byte_size	(0x06)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(30)

0x00000230:     DW_TAG_member
                  DW_AT_name	("vendor_id")
                  DW_AT_type	(cu + 0x0249 "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(31)
                  DW_AT_data_member_location	(0x00)

0x0000023c:     DW_TAG_member
                  DW_AT_name	("codec_id")
                  DW_AT_type	(cu + 0x0266 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(32)
                  DW_AT_data_member_location	(0x04)

0x00000248:     NULL

0x00000249:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0254 "__uint32_t")
                DW_AT_name	("uint32_t")
                DW_AT_decl_file	("/opt/q32s/include/sys/_stdint.h")
                DW_AT_decl_line	(32)

0x00000254:   DW_TAG_typedef
                DW_AT_type	(cu + 0x025f "unsigned int")
                DW_AT_name	("__uint32_t")
                DW_AT_decl_file	("/opt/q32s/include/machine/_default_types.h")
                DW_AT_decl_line	(65)

0x0000025f:   DW_TAG_base_type
                DW_AT_name	("unsigned int")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x04)

0x00000266:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0271 "__uint16_t")
                DW_AT_name	("uint16_t")
                DW_AT_decl_file	("/opt/q32s/include/sys/_stdint.h")
                DW_AT_decl_line	(26)

0x00000271:   DW_TAG_typedef
                DW_AT_type	(cu + 0x027c "unsigned short")
                DW_AT_name	("__uint16_t")
                DW_AT_decl_file	("/opt/q32s/include/machine/_default_types.h")
                DW_AT_decl_line	(43)

0x0000027c:   DW_TAG_base_type
                DW_AT_name	("unsigned short")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x02)

0x00000283:   DW_TAG_typedef
                DW_AT_type	(cu + 0x028e "__uint8_t")
                DW_AT_name	("uint8_t")
                DW_AT_decl_file	("/opt/q32s/include/sys/_stdint.h")
                DW_AT_decl_line	(20)

0x0000028e:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0120 "unsigned char")
                DW_AT_name	("__uint8_t")
                DW_AT_decl_file	("/opt/q32s/include/machine/_default_types.h")
                DW_AT_decl_line	(29)

0x00000299:   DW_TAG_variable
                DW_AT_name	("a2dp_ldac")
                DW_AT_type	(cu + 0x02aa "const a2dp_ldac_cap")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp.c")
                DW_AT_decl_line	(92)
                DW_AT_location	(DW_OP_addr 0x0)

0x000002aa:   DW_TAG_const_type
                DW_AT_type	(cu + 0x02af "a2dp_ldac_cap")

0x000002af:   DW_TAG_typedef
                DW_AT_type	(cu + 0x02ba "_a2dp_ldac_cap")
                DW_AT_name	("a2dp_ldac_cap")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(89)

0x000002ba:   DW_TAG_structure_type
                DW_AT_name	("_a2dp_ldac_cap")
                DW_AT_byte_size	(0x0a)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(83)

0x000002c2:     DW_TAG_member
                  DW_AT_name	("cap")
                  DW_AT_type	(cu + 0x00d7 "avdtp_media_codec_capability")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(84)
                  DW_AT_data_member_location	(0x00)

0x000002ce:     DW_TAG_member
                  DW_AT_name	("info")
                  DW_AT_type	(cu + 0x0221 "a2dp_vendor_codec_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(85)
                  DW_AT_data_member_location	(0x02)

0x000002da:     DW_TAG_member
                  DW_AT_name	("frequency")
                  DW_AT_type	(cu + 0x0283 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(87)
                  DW_AT_data_member_location	(0x08)

0x000002e6:     DW_TAG_member
                  DW_AT_name	("channel_mode")
                  DW_AT_type	(cu + 0x0283 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(88)
                  DW_AT_data_member_location	(0x09)

0x000002f2:     NULL

0x000002f3:   DW_TAG_variable
                DW_AT_name	("a2dp_lc3")
                DW_AT_type	(cu + 0x0304 "const a2dp_lc3_cap")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp.c")
                DW_AT_decl_line	(99)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000304:   DW_TAG_const_type
                DW_AT_type	(cu + 0x0309 "a2dp_lc3_cap")

0x00000309:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0314 "_a2dp_lc3_cap")
                DW_AT_name	("a2dp_lc3_cap")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(97)

0x00000314:   DW_TAG_structure_type
                DW_AT_name	("_a2dp_lc3_cap")
                DW_AT_byte_size	(0x0a)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(91)

0x0000031c:     DW_TAG_member
                  DW_AT_name	("cap")
                  DW_AT_type	(cu + 0x00d7 "avdtp_media_codec_capability")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(92)
                  DW_AT_data_member_location	(0x00)

0x00000328:     DW_TAG_member
                  DW_AT_name	("info")
                  DW_AT_type	(cu + 0x0221 "a2dp_vendor_codec_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(93)
                  DW_AT_data_member_location	(0x02)

0x00000334:     DW_TAG_member
                  DW_AT_name	("frequency")
                  DW_AT_type	(cu + 0x0283 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(95)
                  DW_AT_data_member_location	(0x08)

0x00000340:     DW_TAG_member
                  DW_AT_name	("channel_mode")
                  DW_AT_type	(cu + 0x0283 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(96)
                  DW_AT_data_member_location	(0x09)

0x0000034c:     NULL

0x0000034d:   DW_TAG_variable
                DW_AT_name	("reconnect_after_disconnect")
                DW_AT_type	(cu + 0x0115 "u8")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp.c")
                DW_AT_decl_line	(415)
                DW_AT_location	(DW_OP_addr 0x0)

0x0000035f:   DW_TAG_variable
                DW_AT_name	("try_cmd_step")
                DW_AT_type	(cu + 0x0115 "u8")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp.c")
                DW_AT_decl_line	(1464)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000371:   DW_TAG_variable
                DW_AT_name	("a2dp_wait_remote_discovecr")
                DW_AT_type	(cu + 0x0115 "u8")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp.c")
                DW_AT_decl_line	(1539)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000383:   DW_TAG_variable
                DW_AT_name	("bt_suspend_a2dp_resumea2dp_release")
                DW_AT_type	(cu + 0x0395 "const bt_sleep")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp.c")
                DW_AT_decl_line	(1698)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000395:   DW_TAG_const_type
                DW_AT_type	(cu + 0x039a "bt_sleep")

0x0000039a:   DW_TAG_structure_type
                DW_AT_name	("bt_sleep")
                DW_AT_byte_size	(0x0c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/bt_config.h")
                DW_AT_decl_line	(313)

0x000003a3:     DW_TAG_member
                  DW_AT_name	("suspend")
                  DW_AT_type	(cu + 0x03cb "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/bt_config.h")
                  DW_AT_decl_line	(314)
                  DW_AT_data_member_location	(0x00)

0x000003b0:     DW_TAG_member
                  DW_AT_name	("resume")
                  DW_AT_type	(cu + 0x03cb "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/bt_config.h")
                  DW_AT_decl_line	(315)
                  DW_AT_data_member_location	(0x04)

0x000003bd:     DW_TAG_member
                  DW_AT_name	("release")
                  DW_AT_type	(cu + 0x03cb "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/bt_config.h")
                  DW_AT_decl_line	(316)
                  DW_AT_data_member_location	(0x08)

0x000003ca:     NULL

0x000003cb:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x03d0 "subroutine int")

0x000003d0:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")

0x000003d5:     DW_TAG_unspecified_parameters

0x000003d6:     NULL

0x000003d7:   DW_TAG_variable
                DW_AT_name	("a2dp_stack")
                DW_AT_type	(cu + 0x03e8 "a2dp_stack_t*")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp.c")
                DW_AT_decl_line	(20)
                DW_AT_location	(DW_OP_addr 0x8)

0x000003e8:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x03ed "a2dp_stack_t")

0x000003ed:   DW_TAG_typedef
                DW_AT_type	(cu + 0x03f8 "structure ")
                DW_AT_name	("a2dp_stack_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(250)

0x000003f8:   DW_TAG_structure_type
                DW_AT_byte_size	(0x80)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(247)

0x000003fc:     DW_TAG_member
                  DW_AT_name	("conn")
                  DW_AT_type	(cu + 0x0409 "a2dp_conn[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(248)
                  DW_AT_data_member_location	(0x00)

0x00000408:     NULL

0x00000409:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0415 "a2dp_conn")

0x0000040e:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0465 "sizetype")
                  DW_AT_count	(0x01)

0x00000414:     NULL

0x00000415:   DW_TAG_structure_type
                DW_AT_name	("a2dp_conn")
                DW_AT_byte_size	(0x80)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(237)

0x0000041d:     DW_TAG_member
                  DW_AT_name	("addr")
                  DW_AT_type	(cu + 0x044e "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(238)
                  DW_AT_data_member_location	(0x00)

0x00000429:     DW_TAG_member
                  DW_AT_name	("a2dp_core_data")
                  DW_AT_type	(cu + 0x046c "a2dp_core_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(239)
                  DW_AT_data_member_location	(0x06)

0x00000435:     DW_TAG_member
                  DW_AT_name	("session")
                  DW_AT_type	(cu + 0x04a9 "avdtp")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(240)
                  DW_AT_data_member_location	(0x08)

0x00000441:     DW_TAG_member
                  DW_AT_name	("media")
                  DW_AT_type	(cu + 0x089e "a2dp_media")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(241)
                  DW_AT_data_member_location	(0x68)

0x0000044d:     NULL

0x0000044e:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0459 "uint8_t[]")
                DW_AT_name	("bd_addr_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/utils.h")
                DW_AT_decl_line	(66)

0x00000459:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0283 "uint8_t")

0x0000045e:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0465 "sizetype")
                  DW_AT_count	(0x06)

0x00000464:     NULL

0x00000465:   DW_TAG_base_type
                DW_AT_name	("sizetype")
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_unsigned)

0x0000046c:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0477 "structure ")
                DW_AT_name	("a2dp_core_data_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(229)

0x00000477:   DW_TAG_structure_type
                DW_AT_byte_size	(0x01)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(225)

0x0000047b:     DW_TAG_member
                  DW_AT_name	("inused")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(226)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x07)
                  DW_AT_data_member_location	(0x00)

0x0000048a:     DW_TAG_member
                  DW_AT_name	("discover_req")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(227)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x03)
                  DW_AT_data_member_location	(0x00)

0x00000499:     DW_TAG_member
                  DW_AT_name	("bqb_test_cnt")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(228)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x03)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x00)

0x000004a8:     NULL

0x000004a9:   DW_TAG_structure_type
                DW_AT_name	("avdtp")
                DW_AT_byte_size	(0x60)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(335)

0x000004b2:     DW_TAG_member
                  DW_AT_name	("local_seps")
                  DW_AT_type	(cu + 0x04cd "avdtp_local_sep[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(337)
                  DW_AT_data_member_location	(0x00)

0x000004bf:     DW_TAG_member
                  DW_AT_name	("adp_core_data")
                  DW_AT_type	(cu + 0x0786 "avdtp_core_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(338)
                  DW_AT_data_member_location	(0x38)

0x000004cc:     NULL

0x000004cd:   DW_TAG_array_type
                DW_AT_type	(cu + 0x04d9 "avdtp_local_sep")

0x000004d2:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0465 "sizetype")
                  DW_AT_count	(0x02)

0x000004d8:     NULL

0x000004d9:   DW_TAG_typedef
                DW_AT_type	(cu + 0x04e5 "_avdtp_local_sep")
                DW_AT_name	("avdtp_local_sep")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(293)

0x000004e5:   DW_TAG_structure_type
                DW_AT_name	("_avdtp_local_sep")
                DW_AT_byte_size	(0x1c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(282)

0x000004ee:     DW_TAG_member
                  DW_AT_name	("ind")
                  DW_AT_type	(cu + 0x0543 "const _avdtp_sep_ind*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(283)
                  DW_AT_data_member_location	(0x00)

0x000004fb:     DW_TAG_member
                  DW_AT_name	("session")
                  DW_AT_type	(cu + 0x0707 "avdtp*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(284)
                  DW_AT_data_member_location	(0x04)

0x00000508:     DW_TAG_member
                  DW_AT_name	("info")
                  DW_AT_type	(cu + 0x070c "seid_info")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(286)
                  DW_AT_data_member_location	(0x08)

0x00000515:     DW_TAG_member
                  DW_AT_name	("state")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(288)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x0a)

0x00000525:     DW_TAG_member
                  DW_AT_name	("codec_type")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(289)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x0a)

0x00000535:     DW_TAG_member
                  DW_AT_name	("config")
                  DW_AT_type	(cu + 0x077a "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(290)
                  DW_AT_data_member_location	(0x0b)

0x00000542:     NULL

0x00000543:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0548 "const _avdtp_sep_ind")

0x00000548:   DW_TAG_const_type
                DW_AT_type	(cu + 0x054d "_avdtp_sep_ind")

0x0000054d:   DW_TAG_structure_type
                DW_AT_name	("_avdtp_sep_ind")
                DW_AT_byte_size	(0x24)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(350)

0x00000556:     DW_TAG_member
                  DW_AT_name	("get_capability")
                  DW_AT_type	(cu + 0x05cc "subroutine bool*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(351)
                  DW_AT_data_member_location	(0x00)

0x00000563:     DW_TAG_member
                  DW_AT_name	("set_configuration")
                  DW_AT_type	(cu + 0x05f7 "subroutine bool*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(353)
                  DW_AT_data_member_location	(0x04)

0x00000570:     DW_TAG_member
                  DW_AT_name	("open")
                  DW_AT_type	(cu + 0x061b "subroutine bool*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(355)
                  DW_AT_data_member_location	(0x08)

0x0000057d:     DW_TAG_member
                  DW_AT_name	("start")
                  DW_AT_type	(cu + 0x06a0 "subroutine bool*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(356)
                  DW_AT_data_member_location	(0x0c)

0x0000058a:     DW_TAG_member
                  DW_AT_name	("suspend")
                  DW_AT_type	(cu + 0x06a0 "subroutine bool*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(357)
                  DW_AT_data_member_location	(0x10)

0x00000597:     DW_TAG_member
                  DW_AT_name	("close")
                  DW_AT_type	(cu + 0x06b5 "subroutine bool*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(359)
                  DW_AT_data_member_location	(0x14)

0x000005a4:     DW_TAG_member
                  DW_AT_name	("abort")
                  DW_AT_type	(cu + 0x06cf "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(361)
                  DW_AT_data_member_location	(0x18)

0x000005b1:     DW_TAG_member
                  DW_AT_name	("reconfigure")
                  DW_AT_type	(cu + 0x06db "subroutine bool*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(362)
                  DW_AT_data_member_location	(0x1c)

0x000005be:     DW_TAG_member
                  DW_AT_name	("delayreport")
                  DW_AT_type	(cu + 0x06e7 "subroutine bool*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(363)
                  DW_AT_data_member_location	(0x20)

0x000005cb:     NULL

0x000005cc:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x05d1 "subroutine bool")

0x000005d1:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x05e6 "bool")
                DW_AT_prototyped	(true)

0x000005d6:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0115 "u8")

0x000005db:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x05f1 "*")

0x000005e0:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x05f2 "u8*")

0x000005e5:     NULL

0x000005e6:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0120 "unsigned char")
                DW_AT_name	("bool")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(11)

0x000005f1:   DW_TAG_pointer_type

0x000005f2:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0115 "u8")

0x000005f7:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x05fc "subroutine bool")

0x000005fc:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x05e6 "bool")
                DW_AT_prototyped	(true)

0x00000601:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0616 "avdtp_local_sep*")

0x00000606:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x05f2 "u8*")

0x0000060b:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0115 "u8")

0x00000610:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x05f1 "*")

0x00000615:     NULL

0x00000616:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x04d9 "avdtp_local_sep")

0x0000061b:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0620 "subroutine bool")

0x00000620:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x05e6 "bool")
                DW_AT_prototyped	(true)

0x00000625:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0616 "avdtp_local_sep*")

0x0000062a:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0635 "avdtp_stream*")

0x0000062f:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0115 "u8")

0x00000634:     NULL

0x00000635:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x063a "avdtp_stream")

0x0000063a:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0646 "_avdtp_stream")
                DW_AT_name	("avdtp_stream")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(280)

0x00000646:   DW_TAG_structure_type
                DW_AT_name	("_avdtp_stream")
                DW_AT_byte_size	(0x01)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(268)

0x0000064f:     DW_TAG_member
                  DW_AT_name	("rseid")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(270)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x00)

0x0000065f:     DW_TAG_member
                  DW_AT_name	("int_role")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(271)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x03)
                  DW_AT_data_member_location	(0x00)

0x0000066f:     DW_TAG_member
                  DW_AT_name	("open_acp")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(272)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x02)
                  DW_AT_data_member_location	(0x00)

0x0000067f:     DW_TAG_member
                  DW_AT_name	("starting")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(278)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x01)
                  DW_AT_data_member_location	(0x00)

0x0000068f:     DW_TAG_member
                  DW_AT_name	("reserve")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(279)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x00)

0x0000069f:     NULL

0x000006a0:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x06a5 "subroutine bool")

0x000006a5:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x05e6 "bool")
                DW_AT_prototyped	(true)

0x000006aa:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0616 "avdtp_local_sep*")

0x000006af:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0635 "avdtp_stream*")

0x000006b4:     NULL

0x000006b5:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x06ba "subroutine bool")

0x000006ba:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x05e6 "bool")
                DW_AT_prototyped	(true)

0x000006bf:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0616 "avdtp_local_sep*")

0x000006c4:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0635 "avdtp_stream*")

0x000006c9:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x05f2 "u8*")

0x000006ce:     NULL

0x000006cf:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x06d4 "subroutine ")

0x000006d4:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x000006d5:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0616 "avdtp_local_sep*")

0x000006da:     NULL

0x000006db:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x06e0 "subroutine bool")

0x000006e0:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x05e6 "bool")

0x000006e5:     DW_TAG_unspecified_parameters

0x000006e6:     NULL

0x000006e7:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x06ec "subroutine bool")

0x000006ec:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x05e6 "bool")
                DW_AT_prototyped	(true)

0x000006f1:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0115 "u8")

0x000006f6:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x06fc "u16")

0x000006fb:     NULL

0x000006fc:   DW_TAG_typedef
                DW_AT_type	(cu + 0x027c "unsigned short")
                DW_AT_name	("u16")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(13)

0x00000707:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x04a9 "avdtp")

0x0000070c:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0717 "_seid_info")
                DW_AT_name	("seid_info")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(124)

0x00000717:   DW_TAG_structure_type
                DW_AT_name	("_seid_info")
                DW_AT_byte_size	(0x02)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(117)

0x0000071f:     DW_TAG_member
                  DW_AT_name	("rfa0")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(118)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x07)
                  DW_AT_data_member_location	(0x00)

0x0000072e:     DW_TAG_member
                  DW_AT_name	("inuse")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(119)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x06)
                  DW_AT_data_member_location	(0x00)

0x0000073d:     DW_TAG_member
                  DW_AT_name	("seid")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(120)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x06)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x00)

0x0000074c:     DW_TAG_member
                  DW_AT_name	("rfa2")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(121)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x03)
                  DW_AT_bit_offset	(0x05)
                  DW_AT_data_member_location	(0x01)

0x0000075b:     DW_TAG_member
                  DW_AT_name	("type")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(122)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x01)

0x0000076a:     DW_TAG_member
                  DW_AT_name	("media_type")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(123)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x01)

0x00000779:     NULL

0x0000077a:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0115 "u8")

0x0000077f:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0465 "sizetype")
                  DW_AT_count	(0x10)

0x00000785:     NULL

0x00000786:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0792 "structure ")
                DW_AT_name	("avdtp_core_data_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(333)

0x00000792:   DW_TAG_structure_type
                DW_AT_byte_size	(0x28)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(318)

0x00000797:     DW_TAG_member
                  DW_AT_name	("stream")
                  DW_AT_type	(cu + 0x063a "avdtp_stream")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(319)
                  DW_AT_data_member_location	(0x00)

0x000007a4:     DW_TAG_member
                  DW_AT_name	("local_sep")
                  DW_AT_type	(cu + 0x0616 "avdtp_local_sep*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(320)
                  DW_AT_data_member_location	(0x04)

0x000007b1:     DW_TAG_member
                  DW_AT_name	("local_sep_ind")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(321)
                  DW_AT_data_member_location	(0x08)

0x000007be:     DW_TAG_member
                  DW_AT_name	("channel")
                  DW_AT_type	(cu + 0x06fc "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(322)
                  DW_AT_data_member_location	(0x0a)

0x000007cb:     DW_TAG_member
                  DW_AT_name	("acp_seid")
                  DW_AT_type	(cu + 0x0860 "seid_req[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(323)
                  DW_AT_data_member_location	(0x0c)

0x000007d8:     DW_TAG_member
                  DW_AT_name	("config")
                  DW_AT_type	(cu + 0x077a "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(324)
                  DW_AT_data_member_location	(0x14)

0x000007e5:     DW_TAG_member
                  DW_AT_name	("seid_ind")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(325)
                  DW_AT_data_member_location	(0x24)

0x000007f2:     DW_TAG_member
                  DW_AT_name	("pending_req")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(326)
                  DW_AT_data_member_location	(0x25)

0x000007ff:     DW_TAG_member
                  DW_AT_name	("max_acp_seid")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(327)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x26)

0x0000080f:     DW_TAG_member
                  DW_AT_name	("cur_acp_seid")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(328)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x26)

0x0000081f:     DW_TAG_member
                  DW_AT_name	("aac_codec_prior")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(329)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x27)

0x0000082f:     DW_TAG_member
                  DW_AT_name	("role")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(330)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x02)
                  DW_AT_data_member_location	(0x27)

0x0000083f:     DW_TAG_member
                  DW_AT_name	("get_discover")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(331)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x01)
                  DW_AT_data_member_location	(0x27)

0x0000084f:     DW_TAG_member
                  DW_AT_name	("reserve")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(332)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x27)

0x0000085f:     NULL

0x00000860:   DW_TAG_array_type
                DW_AT_type	(cu + 0x086c "seid_req")

0x00000865:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0465 "sizetype")
                  DW_AT_count	(0x08)

0x0000086b:     NULL

0x0000086c:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0877 "_seid_req")
                DW_AT_name	("seid_req")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(129)

0x00000877:   DW_TAG_structure_type
                DW_AT_name	("_seid_req")
                DW_AT_byte_size	(0x01)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(126)

0x0000087f:     DW_TAG_member
                  DW_AT_name	("rfa0")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(127)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x06)
                  DW_AT_data_member_location	(0x00)

0x0000088e:     DW_TAG_member
                  DW_AT_name	("acp_seid")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(128)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x06)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x00)

0x0000089d:     NULL

0x0000089e:   DW_TAG_structure_type
                DW_AT_name	("a2dp_media")
                DW_AT_byte_size	(0x18)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(215)

0x000008a6:     DW_TAG_member
                  DW_AT_name	("media_core_data")
                  DW_AT_type	(cu + 0x0901 "media_core_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(216)
                  DW_AT_data_member_location	(0x00)

0x000008b2:     DW_TAG_member
                  DW_AT_name	("probe")
                  DW_AT_type	(cu + 0x0940 "a2dp_media_probe*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(217)
                  DW_AT_data_member_location	(0x08)

0x000008be:     DW_TAG_member
                  DW_AT_name	("codec")
                  DW_AT_type	(cu + 0x09e4 "a2dp_media_codec*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(218)
                  DW_AT_data_member_location	(0x0c)

0x000008ca:     DW_TAG_member
                  DW_AT_name	("bitrate")
                  DW_AT_type	(cu + 0x0935 "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(219)
                  DW_AT_data_member_location	(0x10)

0x000008d6:     DW_TAG_member
                  DW_AT_name	("nchannels")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(220)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x14)

0x000008e5:     DW_TAG_member
                  DW_AT_name	("reserve")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(221)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x14)

0x000008f4:     DW_TAG_member
                  DW_AT_name	("type")
                  DW_AT_type	(cu + 0x0115 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(222)
                  DW_AT_data_member_location	(0x15)

0x00000900:     NULL

0x00000901:   DW_TAG_typedef
                DW_AT_type	(cu + 0x090c "structure ")
                DW_AT_name	("media_core_data_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(213)

0x0000090c:   DW_TAG_structure_type
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(209)

0x00000910:     DW_TAG_member
                  DW_AT_name	("channel")
                  DW_AT_type	(cu + 0x06fc "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(210)
                  DW_AT_data_member_location	(0x00)

0x0000091c:     DW_TAG_member
                  DW_AT_name	("cp_type")
                  DW_AT_type	(cu + 0x06fc "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(211)
                  DW_AT_data_member_location	(0x02)

0x00000928:     DW_TAG_member
                  DW_AT_name	("samplerate")
                  DW_AT_type	(cu + 0x0935 "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(212)
                  DW_AT_data_member_location	(0x04)

0x00000934:     NULL

0x00000935:   DW_TAG_typedef
                DW_AT_type	(cu + 0x025f "unsigned int")
                DW_AT_name	("u32")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(15)

0x00000940:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0945 "a2dp_media_probe")

0x00000945:   DW_TAG_structure_type
                DW_AT_name	("a2dp_media_probe")
                DW_AT_byte_size	(0x18)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(190)

0x0000094d:     DW_TAG_member
                  DW_AT_name	("type")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(192)
                  DW_AT_data_member_location	(0x00)

0x00000959:     DW_TAG_member
                  DW_AT_name	("init")
                  DW_AT_type	(cu + 0x0996 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(193)
                  DW_AT_data_member_location	(0x04)

0x00000965:     DW_TAG_member
                  DW_AT_name	("probe")
                  DW_AT_type	(cu + 0x09c5 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(194)
                  DW_AT_data_member_location	(0x08)

0x00000971:     DW_TAG_member
                  DW_AT_name	("start")
                  DW_AT_type	(cu + 0x03cb "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(195)
                  DW_AT_data_member_location	(0x0c)

0x0000097d:     DW_TAG_member
                  DW_AT_name	("suspend")
                  DW_AT_type	(cu + 0x03cb "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(196)
                  DW_AT_data_member_location	(0x10)

0x00000989:     DW_TAG_member
                  DW_AT_name	("close")
                  DW_AT_type	(cu + 0x03cb "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(197)
                  DW_AT_data_member_location	(0x14)

0x00000995:     NULL

0x00000996:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x099b "subroutine int")

0x0000099b:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_prototyped	(true)

0x000009a0:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x05f1 "*")

0x000009a5:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x09ab "subroutine int*")

0x000009aa:     NULL

0x000009ab:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x09b0 "subroutine int")

0x000009b0:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_prototyped	(true)

0x000009b5:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x05f1 "*")

0x000009ba:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x05f2 "u8*")

0x000009bf:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x06fc "u16")

0x000009c4:     NULL

0x000009c5:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x09ca "subroutine int")

0x000009ca:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_prototyped	(true)

0x000009cf:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x09df "uint8_t*")

0x000009d4:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x05f2 "u8*")

0x000009d9:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x06fc "u16")

0x000009de:     NULL

0x000009df:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0283 "uint8_t")

0x000009e4:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x09e9 "a2dp_media_codec")

0x000009e9:   DW_TAG_structure_type
                DW_AT_name	("a2dp_media_codec")
                DW_AT_byte_size	(0x18)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(200)

0x000009f1:     DW_TAG_member
                  DW_AT_name	("type")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(201)
                  DW_AT_data_member_location	(0x00)

0x000009fd:     DW_TAG_member
                  DW_AT_name	("inused")
                  DW_AT_type	(cu + 0x0a3a "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(202)
                  DW_AT_data_member_location	(0x04)

0x00000a09:     DW_TAG_member
                  DW_AT_name	("init")
                  DW_AT_type	(cu + 0x0a4a "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(203)
                  DW_AT_data_member_location	(0x08)

0x00000a15:     DW_TAG_member
                  DW_AT_name	("start")
                  DW_AT_type	(cu + 0x0a5a "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(204)
                  DW_AT_data_member_location	(0x0c)

0x00000a21:     DW_TAG_member
                  DW_AT_name	("suspend")
                  DW_AT_type	(cu + 0x03cb "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(205)
                  DW_AT_data_member_location	(0x10)

0x00000a2d:     DW_TAG_member
                  DW_AT_name	("stop")
                  DW_AT_type	(cu + 0x0a4a "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(206)
                  DW_AT_data_member_location	(0x14)

0x00000a39:     NULL

0x00000a3a:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0a3f "subroutine int")

0x00000a3f:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_prototyped	(true)

0x00000a44:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0037 "int")

0x00000a49:     NULL

0x00000a4a:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0a4f "subroutine int")

0x00000a4f:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_prototyped	(true)

0x00000a54:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x05f1 "*")

0x00000a59:     NULL

0x00000a5a:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0a5f "subroutine int")

0x00000a5f:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_prototyped	(true)

0x00000a64:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x05f2 "u8*")

0x00000a69:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x06fc "u16")

0x00000a6e:     NULL

0x00000a6f:   DW_TAG_variable
                DW_AT_name	("a2dp_status_update")
                DW_AT_type	(cu + 0x0a81 "subroutine *")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp.c")
                DW_AT_decl_line	(417)
                DW_AT_location	(DW_OP_addr 0x10)

0x00000a81:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0a86 "subroutine ")

0x00000a86:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x00000a87:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0115 "u8")

0x00000a8c:     NULL

0x00000a8d:   DW_TAG_variable
                DW_AT_name	("a2dp_sep_ind_sbc")
                DW_AT_type	(cu + 0x0a9f "const avdtp_sep_ind")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp.c")
                DW_AT_decl_line	(937)
                DW_AT_location	(DW_OP_addr 0x24)

0x00000a9f:   DW_TAG_const_type
                DW_AT_type	(cu + 0x0aa4 "avdtp_sep_ind")

0x00000aa4:   DW_TAG_typedef
                DW_AT_type	(cu + 0x054d "_avdtp_sep_ind")
                DW_AT_name	("avdtp_sep_ind")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(364)

0x00000ab0:   DW_TAG_subprogram
                DW_AT_low_pc	(0x000000000000111d)
                DW_AT_high_pc	(0x00000000000011ba)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("a2dp_getcap_ind_sbc")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp.c")
                DW_AT_decl_line	(772)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x05e6 "bool")

0x00000ac6:     DW_TAG_variable
                  DW_AT_name	("content_protect")
                  DW_AT_type	(cu + 0x0b1b "const u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp.c")
                  DW_AT_decl_line	(776)

0x00000ad2:     DW_TAG_formal_parameter
                  DW_AT_name	("seid")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp.c")
                  DW_AT_decl_line	(772)
                  DW_AT_type	(cu + 0x0115 "u8")

0x00000ade:     DW_TAG_formal_parameter
                  DW_AT_location	(0x0000055f
                     0x000000000000111d - 0x0000000000001168: DW_OP_reg1 ECX
                     0x0000000000001168 - 0x00000000000011ba: DW_OP_breg5 EBP-16)
                  DW_AT_name	("user_data")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp.c")
                  DW_AT_decl_line	(772)
                  DW_AT_type	(cu + 0x05f1 "*")

0x00000aee:     DW_TAG_formal_parameter
                  DW_AT_location	(0x0000057e
                     0x000000000000111d - 0x0000000000001165: DW_OP_reg0 EAX
                     0x0000000000001165 - 0x00000000000011ba: DW_OP_breg5 EBP-12)
                  DW_AT_name	("data_len")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp.c")
                  DW_AT_decl_line	(772)
                  DW_AT_type	(cu + 0x05f2 "u8*")

0x00000afe:     DW_TAG_variable
                  DW_AT_location	(0x0000059d
                     0x0000000000001146 - 0x000000000000116b: DW_OP_piece 0x5, DW_OP_reg3 EBX, DW_OP_piece 0x1
                     0x000000000000116b - 0x00000000000011ba: DW_OP_piece 0x5, DW_OP_breg5 EBP-17, DW_OP_piece 0x1)
                  DW_AT_name	("temp_a2dp_sbc")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp.c")
                  DW_AT_decl_line	(774)
                  DW_AT_type	(cu + 0x0054 "sbc_codec_cap")

0x00000b0e:     DW_TAG_variable
                  DW_AT_name	("service_cap")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp.c")
                  DW_AT_decl_line	(775)
                  DW_AT_type	(cu + 0x0f9f "avdtp_service_capability*")

0x00000b1a:     NULL

0x00000b1b:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0b27 "const u8")

0x00000b20:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0465 "sizetype")
                  DW_AT_count	(0x02)

0x00000b26:     NULL

0x00000b27:   DW_TAG_const_type
                DW_AT_type	(cu + 0x0115 "u8")

0x00000b2c:   DW_TAG_variable
                DW_AT_name	("a2dp_sep_ind_mpeg24")
                DW_AT_type	(cu + 0x0a9f "const avdtp_sep_ind")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/a2dp.c")
                DW_AT_decl_line	(1069)
                DW_AT_location	(DW_OP_addr 0x48)

0x00000b3e:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/profile_common.h")
                DW_AT_decl_line	(31)

0x00000b42:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_OK")
                  DW_AT_const_value	(0)

0x00000b48:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_DEVICE_NO_FOUND")
                  DW_AT_const_value	(-1000)

0x00000b4f:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_NO_FOUND")
                  DW_AT_const_value	(-1001)

0x00000b56:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_SEND_ERROR")
                  DW_AT_const_value	(-1002)

0x00000b5d:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_REMOTE_NOT_SUPPORT")
                  DW_AT_const_value	(-1003)

0x00000b64:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_TRY_AGAIN_LATER")
                  DW_AT_const_value	(-1004)

0x00000b6b:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_DATA_PARSE_ERROE")
                  DW_AT_const_value	(-1005)

0x00000b72:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_PROFILE_NOT_SUPPORT")
                  DW_AT_const_value	(-1006)

0x00000b79:     NULL

0x00000b7a:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(164)

0x00000b7e:     DW_TAG_enumerator
                  DW_AT_name	("A2DP_CMD_CONNECT")
                  DW_AT_const_value	(50)

0x00000b84:     DW_TAG_enumerator
                  DW_AT_name	("A2DP_CMD_DISCONNECT")
                  DW_AT_const_value	(51)

0x00000b8a:     DW_TAG_enumerator
                  DW_AT_name	("A2DP_CMD_START")
                  DW_AT_const_value	(52)

0x00000b90:     DW_TAG_enumerator
                  DW_AT_name	("A2DP_CMD_CLOSE")
                  DW_AT_const_value	(53)

0x00000b96:     DW_TAG_enumerator
                  DW_AT_name	("A2DP_CMD_SUSPEND")
                  DW_AT_const_value	(54)

0x00000b9c:     DW_TAG_enumerator
                  DW_AT_name	("A2DP_CMD_GET_CONFIGURATION")
                  DW_AT_const_value	(55)

0x00000ba2:     DW_TAG_enumerator
                  DW_AT_name	("A2DP_CMD_ABORT")
                  DW_AT_const_value	(56)

0x00000ba8:     DW_TAG_enumerator
                  DW_AT_name	("A2DP_CMD_EMITTER_START_CMD")
                  DW_AT_const_value	(57)

0x00000bae:     DW_TAG_enumerator
                  DW_AT_name	("A2DP_CMD_EMITTER_SUSPEND_CMD")
                  DW_AT_const_value	(58)

0x00000bb4:     DW_TAG_enumerator
                  DW_AT_name	("A2DP_CMD_EMITTER_CLOSE_CMD")
                  DW_AT_const_value	(59)

0x00000bba:     DW_TAG_enumerator
                  DW_AT_name	("A2DP_CMD_CONNECT_MEDIA_CHANNEL")
                  DW_AT_const_value	(60)

0x00000bc0:     NULL

0x00000bc1:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                DW_AT_decl_line	(12)

0x00000bc5:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_START_CONNECTION")
                  DW_AT_const_value	(0)

0x00000bcb:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_START_CONNEC_VIA_ADDR")
                  DW_AT_const_value	(1)

0x00000bd1:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_START_CONNEC_VIA_ADDR_MANUALLY")
                  DW_AT_const_value	(2)

0x00000bd7:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_START_CONNEC_SPP_VIA_ADDR")
                  DW_AT_const_value	(3)

0x00000bdd:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_DISCONNECTION_HCI")
                  DW_AT_const_value	(4)

0x00000be3:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_CONNECTION_CANCEL")
                  DW_AT_const_value	(5)

0x00000be9:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_READ_REMOTE_NAME")
                  DW_AT_const_value	(6)

0x00000bef:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_PAUSE_MUSIC")
                  DW_AT_const_value	(7)

0x00000bf5:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SCO_LINK")
                  DW_AT_const_value	(8)

0x00000bfb:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_CONN_SCO")
                  DW_AT_const_value	(9)

0x00000c01:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_DISCONN_SCO")
                  DW_AT_const_value	(10)

0x00000c07:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_DISCONN_SDP_MASTER")
                  DW_AT_const_value	(11)

0x00000c0d:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_WRITE_SCAN_DISABLE")
                  DW_AT_const_value	(12)

0x00000c13:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_WRITE_SCAN_ENABLE")
                  DW_AT_const_value	(13)

0x00000c19:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_WRITE_CONN_DISABLE")
                  DW_AT_const_value	(14)

0x00000c1f:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_WRITE_CONN_ENABLE")
                  DW_AT_const_value	(15)

0x00000c25:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SEARCH_DEVICE")
                  DW_AT_const_value	(16)

0x00000c2b:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_INQUIRY_CANCEL")
                  DW_AT_const_value	(17)

0x00000c31:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_PAGE_CANCEL")
                  DW_AT_const_value	(18)

0x00000c37:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SNIFF_IN")
                  DW_AT_const_value	(19)

0x00000c3d:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SNIFF_EXIT")
                  DW_AT_const_value	(20)

0x00000c43:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_ALL_SNIFF_EXIT")
                  DW_AT_const_value	(21)

0x00000c49:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CMD_BEGIN")
                  DW_AT_const_value	(22)

0x00000c4f:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CALL_VOLUME_UP")
                  DW_AT_const_value	(23)

0x00000c55:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CALL_VOLUME_DOWN")
                  DW_AT_const_value	(24)

0x00000c5b:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CALL_SET_VOLUME")
                  DW_AT_const_value	(25)

0x00000c61:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CALL_GET_VOLUME")
                  DW_AT_const_value	(26)

0x00000c67:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CALL_ANSWER")
                  DW_AT_const_value	(27)

0x00000c6d:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CALL_HANGUP")
                  DW_AT_const_value	(28)

0x00000c73:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CALL_LAST_NO")
                  DW_AT_const_value	(29)

0x00000c79:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CALL_CURRENT")
                  DW_AT_const_value	(30)

0x00000c7f:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_DTMF_TONES")
                  DW_AT_const_value	(31)

0x00000c85:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_DIAL_NUMBER")
                  DW_AT_const_value	(32)

0x00000c8b:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SEND_BATTERY")
                  DW_AT_const_value	(33)

0x00000c91:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_GET_SIRI_STATUS")
                  DW_AT_const_value	(34)

0x00000c97:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_GET_SIRI_OPEN")
                  DW_AT_const_value	(35)

0x00000c9d:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_GET_SIRI_CLOSE")
                  DW_AT_const_value	(36)

0x00000ca3:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_GET_PHONE_DATE_TIME")
                  DW_AT_const_value	(37)

0x00000ca9:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CMD_SEND_BIA")
                  DW_AT_const_value	(38)

0x00000caf:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CMD_GET_MANUFACTURER")
                  DW_AT_const_value	(39)

0x00000cb5:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CMD_UPDATE_BATTARY")
                  DW_AT_const_value	(40)

0x00000cbb:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_THREE_WAY_ANSWER1")
                  DW_AT_const_value	(41)

0x00000cc1:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_THREE_WAY_ANSWER2")
                  DW_AT_const_value	(42)

0x00000cc7:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_THREE_WAY_ANSWER1X")
                  DW_AT_const_value	(43)

0x00000ccd:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_THREE_WAY_ANSWER2X")
                  DW_AT_const_value	(44)

0x00000cd3:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_THREE_WAY_ANSWER3")
                  DW_AT_const_value	(45)

0x00000cd9:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_THREE_WAY_REJECT")
                  DW_AT_const_value	(46)

0x00000cdf:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_DISCONNECT")
                  DW_AT_const_value	(47)

0x00000ce5:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CMD_END")
                  DW_AT_const_value	(48)

0x00000ceb:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_CMD_BEGIN")
                  DW_AT_const_value	(49)

0x00000cf1:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_PLAY")
                  DW_AT_const_value	(50)

0x00000cf7:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_PAUSE")
                  DW_AT_const_value	(51)

0x00000cfd:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_STOP")
                  DW_AT_const_value	(52)

0x00000d03:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_NEXT")
                  DW_AT_const_value	(53)

0x00000d09:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_PREV")
                  DW_AT_const_value	(54)

0x00000d0f:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_FORWARD")
                  DW_AT_const_value	(55)

0x00000d15:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_REWIND")
                  DW_AT_const_value	(56)

0x00000d1b:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_REPEAT_MODE")
                  DW_AT_const_value	(57)

0x00000d21:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_SHUFFLE_MODE")
                  DW_AT_const_value	(58)

0x00000d27:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_GET_PLAY_TIME")
                  DW_AT_const_value	(59)

0x00000d2d:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_SEND_VOL")
                  DW_AT_const_value	(60)

0x00000d33:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_DISCONNECT")
                  DW_AT_const_value	(61)

0x00000d39:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_CONN")
                  DW_AT_const_value	(62)

0x00000d3f:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_CMD_END")
                  DW_AT_const_value	(63)

0x00000d45:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_A2DP_CMD_BEGIN")
                  DW_AT_const_value	(64)

0x00000d4c:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AUTO_CONN_A2DP")
                  DW_AT_const_value	(65)

0x00000d53:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_CONN_A2DP")
                  DW_AT_const_value	(66)

0x00000d5a:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_DISCONN_A2DP")
                  DW_AT_const_value	(67)

0x00000d61:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_A2DP_CMD_START")
                  DW_AT_const_value	(68)

0x00000d68:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_A2DP_CMD_CLOSE")
                  DW_AT_const_value	(69)

0x00000d6f:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_A2DP_CMD_SUSPEND")
                  DW_AT_const_value	(70)

0x00000d76:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_A2DP_CMD_GET_CONFIGURATION")
                  DW_AT_const_value	(71)

0x00000d7d:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_A2DP_CMD_ABORT")
                  DW_AT_const_value	(72)

0x00000d84:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_A2DP_CMD_END")
                  DW_AT_const_value	(73)

0x00000d8b:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_POWER_OFF")
                  DW_AT_const_value	(74)

0x00000d92:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_POWER_ON")
                  DW_AT_const_value	(75)

0x00000d99:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_CMD_BEGIN")
                  DW_AT_const_value	(76)

0x00000da0:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_CONN")
                  DW_AT_const_value	(77)

0x00000da7:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_ANDROID")
                  DW_AT_const_value	(78)

0x00000dae:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_IOS")
                  DW_AT_const_value	(79)

0x00000db5:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_BOTH")
                  DW_AT_const_value	(80)

0x00000dbc:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_DISCONNECT")
                  DW_AT_const_value	(81)

0x00000dc3:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_HOME")
                  DW_AT_const_value	(82)

0x00000dca:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_RETURN")
                  DW_AT_const_value	(83)

0x00000dd1:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_LEFTARROW")
                  DW_AT_const_value	(84)

0x00000dd8:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_RIGHTARROW")
                  DW_AT_const_value	(85)

0x00000ddf:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_VOL_UP")
                  DW_AT_const_value	(86)

0x00000de6:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_VOL_DOWN")
                  DW_AT_const_value	(87)

0x00000ded:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_SEND_DATA")
                  DW_AT_const_value	(88)

0x00000df4:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_CMD_END")
                  DW_AT_const_value	(89)

0x00000dfb:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_CMD_BEGIN")
                  DW_AT_const_value	(90)

0x00000e02:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SYNC_TRAIN")
                  DW_AT_const_value	(91)

0x00000e09:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SYNC_TRAIN_SCAN")
                  DW_AT_const_value	(92)

0x00000e10:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_MONITOR")
                  DW_AT_const_value	(93)

0x00000e17:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_CONNEC_VIA_ADDR")
                  DW_AT_const_value	(94)

0x00000e1e:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_COTROL_CDM")
                  DW_AT_const_value	(95)

0x00000e25:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_CLEAR_INFO")
                  DW_AT_const_value	(96)

0x00000e2c:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_DISCONNECTION_HCI")
                  DW_AT_const_value	(97)

0x00000e33:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_START_CONNECTION")
