; ModuleID = 'ancs_client.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.ancs_info_t = type { i32, %struct.gatt_client_notification, %struct.gatt_client_notification, i16, i16, %struct.le_service_t, %struct.le_characteristic_t, %struct.le_characteristic_t, %struct.le_characteristic_t, i32, void (i8, i16, i8*, i16)*, %struct.btstack_packet_callback_registration_t, i16, i16, i16, i16, i8, i16, i8*, i32, i32 }
%struct.gatt_client_notification = type { %struct.btstack_linked_item, void (i8, i16, i8*, i16)*, i16, i16 }
%struct.btstack_linked_item = type { %struct.btstack_linked_item* }
%struct.le_service_t = type { i16, i16, i16, [16 x i8] }
%struct.le_characteristic_t = type { i16, i16, i16, i16, i16, [16 x i8] }
%struct.btstack_packet_callback_registration_t = type { %struct.btstack_linked_item, void (i8, i16, i8*, i16)* }

@app_info_debug_enable = weak hidden local_unnamed_addr global i32 0, align 4, !dbg !0
@ancs_client_global_info = internal global %struct.ancs_info_t zeroinitializer, align 4, !dbg !26

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "app_info_debug_enable", scope: !2, file: !155, line: 190, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !20, globals: !22)
!3 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!4 = !{!5, !15}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 74, size: 32, elements: !6)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14}
!7 = !DIEnumerator(name: "TC_IDLE", value: 0)
!8 = !DIEnumerator(name: "TC_W4_ENCRYPTED_CONNECTION", value: 1)
!9 = !DIEnumerator(name: "TC_W4_SERVICE_RESULT", value: 2)
!10 = !DIEnumerator(name: "TC_W4_CHARACTERISTIC_RESULT", value: 3)
!11 = !DIEnumerator(name: "TC_W4_DATA_SOURCE_SUBSCRIBED", value: 4)
!12 = !DIEnumerator(name: "TC_W4_NOTIFICATION_SOURCE_SUBSCRIBED", value: 5)
!13 = !DIEnumerator(name: "TC_SUBSCRIBED", value: 6)
!14 = !DIEnumerator(name: "TC_W4_DISCONNECT", value: 7)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ancs_chunk_parser_state", file: !3, line: 68, size: 32, elements: !16)
!16 = !{!17, !18, !19}
!17 = !DIEnumerator(name: "W4_ATTRIBUTE_ID", value: 0)
!18 = !DIEnumerator(name: "W4_ATTRIBUTE_LEN", value: 1)
!19 = !DIEnumerator(name: "W4_ATTRIBUTE_COMPLETE", value: 2)
!20 = !{!21}
!21 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!22 = !{!0, !23, !26, !110, !118, !125, !145, !149, !151, !153}
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression(DW_OP_constu, 8, DW_OP_stack_value))
!24 = distinct !DIGlobalVariable(name: "ANCS_ATTRBUTE_NAMES_COUNT", scope: !2, file: !3, line: 95, type: !25, isLocal: true, isDefinition: true)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "ancs_client_global_info", scope: !2, file: !3, line: 129, type: !28, isLocal: true, isDefinition: true)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "ancs_info_t", file: !3, line: 127, baseType: !29)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 104, size: 1376, elements: !30)
!30 = !{!31, !35, !63, !64, !66, !67, !79, !89, !90, !91, !92, !93, !99, !100, !101, !102, !103, !104, !105, !106, !108}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ancs_notification_uid", scope: !29, file: !3, line: 105, baseType: !32, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !33, line: 48, baseType: !34)
!33 = !DIFile(filename: "../btcommon/typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!34 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ancs_notification_source_notification", scope: !29, file: !3, line: 106, baseType: !36, size: 96, offset: 32)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "gatt_client_notification_t", file: !37, line: 198, baseType: !38)
!37 = !DIFile(filename: "../btstack/Protocol/include/ble/gatt_client.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gatt_client_notification", file: !37, line: 193, size: 96, elements: !39)
!39 = !{!40, !48, !59, !62}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !38, file: !37, line: 194, baseType: !41, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_item_t", file: !42, line: 100, baseType: !43)
!42 = !DIFile(filename: "../btcommon/btstack_linked_list.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_linked_item_t", file: !42, line: 55, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btstack_linked_item", file: !42, line: 53, size: 32, elements: !45)
!45 = !{!46}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !44, file: !42, line: 54, baseType: !47, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !38, file: !37, line: 195, baseType: !49, size: 32, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_packet_handler_t", file: !50, line: 58, baseType: !51)
!50 = !DIFile(filename: "../btcommon/hci_cmds.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 32)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !54, !56, !58, !56}
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !33, line: 44, baseType: !55)
!55 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !33, line: 46, baseType: !57)
!57 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "con_handle", scope: !38, file: !37, line: 196, baseType: !60, size: 16, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "hci_con_handle_t", file: !61, line: 60, baseType: !56)
!61 = !DIFile(filename: "../btcommon/utils.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!62 = !DIDerivedType(tag: DW_TAG_member, name: "attribute_handle", scope: !38, file: !37, line: 197, baseType: !56, size: 16, offset: 80)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ancs_data_source_notification", scope: !29, file: !3, line: 107, baseType: !36, size: 96, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "ancs_service_found", scope: !29, file: !3, line: 108, baseType: !65, size: 16, offset: 224)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !33, line: 46, baseType: !57)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ancs_encrypted_complete", scope: !29, file: !3, line: 109, baseType: !65, size: 16, offset: 240)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "ancs_service", scope: !29, file: !3, line: 110, baseType: !68, size: 176, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "gatt_client_service_t", file: !69, line: 24, baseType: !70)
!69 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/le/gatt.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 19, size: 176, elements: !71)
!71 = !{!72, !73, !74, !75}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "start_group_handle", scope: !70, file: !69, line: 20, baseType: !56, size: 16)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "end_group_handle", scope: !70, file: !69, line: 21, baseType: !56, size: 16, offset: 16)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "uuid16", scope: !70, file: !69, line: 22, baseType: !56, size: 16, offset: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "uuid128", scope: !70, file: !69, line: 23, baseType: !76, size: 128, offset: 48)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 128, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 16)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ancs_notification_source_characteristic", scope: !29, file: !3, line: 111, baseType: !80, size: 208, offset: 432)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "gatt_client_characteristic_t", file: !69, line: 34, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 27, size: 208, elements: !82)
!82 = !{!83, !84, !85, !86, !87, !88}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "start_handle", scope: !81, file: !69, line: 28, baseType: !56, size: 16)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "value_handle", scope: !81, file: !69, line: 29, baseType: !56, size: 16, offset: 16)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "end_handle", scope: !81, file: !69, line: 30, baseType: !56, size: 16, offset: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !81, file: !69, line: 31, baseType: !56, size: 16, offset: 48)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "uuid16", scope: !81, file: !69, line: 32, baseType: !56, size: 16, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "uuid128", scope: !81, file: !69, line: 33, baseType: !76, size: 128, offset: 80)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ancs_control_point_characteristic", scope: !29, file: !3, line: 112, baseType: !80, size: 208, offset: 640)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ancs_data_source_characteristic", scope: !29, file: !3, line: 113, baseType: !80, size: 208, offset: 848)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ancs_characteristcs", scope: !29, file: !3, line: 114, baseType: !21, size: 32, offset: 1056)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "client_handler", scope: !29, file: !3, line: 115, baseType: !49, size: 32, offset: 1088)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "hci_event_callback_registration", scope: !29, file: !3, line: 116, baseType: !94, size: 64, offset: 1120)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_packet_callback_registration_t", file: !50, line: 64, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !50, line: 61, size: 64, elements: !96)
!96 = !{!97, !98}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !95, file: !50, line: 62, baseType: !41, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !95, file: !50, line: 63, baseType: !49, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ancs_bytes_received", scope: !29, file: !3, line: 118, baseType: !56, size: 16, offset: 1184)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ancs_bytes_needed", scope: !29, file: !3, line: 119, baseType: !56, size: 16, offset: 1200)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ancs_attribute_len", scope: !29, file: !3, line: 120, baseType: !56, size: 16, offset: 1216)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "gc_handle", scope: !29, file: !3, line: 121, baseType: !56, size: 16, offset: 1232)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "ancs_attribute_id", scope: !29, file: !3, line: 122, baseType: !54, size: 8, offset: 1248)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "ancs_notification_buffer_size", scope: !29, file: !3, line: 123, baseType: !56, size: 16, offset: 1264)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ancs_notification_buffer", scope: !29, file: !3, line: 124, baseType: !58, size: 32, offset: 1280)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tc_state", scope: !29, file: !3, line: 125, baseType: !107, size: 32, offset: 1312)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "tc_state_t", file: !3, line: 83, baseType: !5)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_parser_state", scope: !29, file: !3, line: 126, baseType: !109, size: 32, offset: 1344)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ancs_chunk_parser_state_t", file: !3, line: 72, baseType: !15)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "ancs_attribute_names", scope: !2, file: !3, line: 85, type: !112, isLocal: true, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 256, elements: !116)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!115 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!116 = !{!117}
!117 = !DISubrange(count: 8)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "ancs_out_callback", scope: !2, file: !3, line: 97, type: !120, isLocal: true, isDefinition: true)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!121 = !DISubroutineType(types: !122)
!122 = !{null, !123, !65}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !33, line: 44, baseType: !55)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "get_notification_attributes", scope: !127, file: !3, line: 440, type: !142, isLocal: true, isDefinition: true)
!127 = distinct !DISubprogram(name: "handle_hci_event", scope: !3, file: !3, line: 262, type: !52, isLocal: true, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !128)
!128 = !{!129, !130, !131, !132, !133, !134, !135, !136, !137, !138}
!129 = !DILocalVariable(name: "packet_type", arg: 1, scope: !127, file: !3, line: 262, type: !54)
!130 = !DILocalVariable(name: "channel", arg: 2, scope: !127, file: !3, line: 262, type: !56)
!131 = !DILocalVariable(name: "packet", arg: 3, scope: !127, file: !3, line: 262, type: !58)
!132 = !DILocalVariable(name: "size", arg: 4, scope: !127, file: !3, line: 262, type: !56)
!133 = !DILocalVariable(name: "connection_encrypted", scope: !127, file: !3, line: 269, type: !21)
!134 = !DILocalVariable(name: "characteristic", scope: !127, file: !3, line: 324, type: !80)
!135 = !DILocalVariable(name: "value", scope: !127, file: !3, line: 325, type: !58)
!136 = !DILocalVariable(name: "value_handle", scope: !127, file: !3, line: 326, type: !56)
!137 = !DILocalVariable(name: "value_length", scope: !127, file: !3, line: 327, type: !56)
!138 = !DILocalVariable(name: "i", scope: !139, file: !3, line: 430, type: !21)
!139 = distinct !DILexicalBlock(scope: !140, file: !3, line: 429, column: 83)
!140 = distinct !DILexicalBlock(scope: !141, file: !3, line: 429, column: 13)
!141 = distinct !DILexicalBlock(scope: !127, file: !3, line: 329, column: 31)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 136, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 17)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "ancs_service_uuid", scope: !2, file: !3, line: 99, type: !147, isLocal: true, isDefinition: true)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 128, elements: !77)
!148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "ancs_notification_source_uuid", scope: !2, file: !3, line: 100, type: !147, isLocal: true, isDefinition: true)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "ancs_control_point_uuid", scope: !2, file: !3, line: 101, type: !147, isLocal: true, isDefinition: true)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
