temp.o:	file format ELF32-i386

.debug_info contents:
0x00000000: Compile Unit: length = 0x00000831 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x00000835)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)")
              DW_AT_language	(DW_LANG_C99)
              DW_AT_name	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
              DW_AT_GNU_pubnames	(true)
              DW_AT_low_pc	(0x0000000000000000)
              DW_AT_high_pc	(0x000000000000106f)

0x00000026:   DW_TAG_variable
                DW_AT_name	("app_info_debug_enable")
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/profile_stack_debug.h")
                DW_AT_decl_line	(190)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000037:   DW_TAG_base_type
                DW_AT_name	("int")
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_byte_size	(0x04)

0x0000003e:   DW_TAG_variable
                DW_AT_name	("ANCS_ATTRBUTE_NAMES_COUNT")
                DW_AT_type	(cu + 0x004a "const int")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                DW_AT_decl_line	(95)
                DW_AT_const_value	(8)

0x0000004a:   DW_TAG_const_type
                DW_AT_type	(cu + 0x0037 "int")

0x0000004f:   DW_TAG_variable
                DW_AT_name	("ancs_client_global_info")
                DW_AT_type	(cu + 0x0060 "ancs_info_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                DW_AT_decl_line	(129)
                DW_AT_location	(DW_OP_addr 0x4)

0x00000060:   DW_TAG_typedef
                DW_AT_type	(cu + 0x006b "structure ")
                DW_AT_name	("ancs_info_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                DW_AT_decl_line	(127)

0x0000006b:   DW_TAG_structure_type
                DW_AT_byte_size	(0xac)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                DW_AT_decl_line	(104)

0x0000006f:     DW_TAG_member
                  DW_AT_name	("ancs_notification_uid")
                  DW_AT_type	(cu + 0x016c "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                  DW_AT_decl_line	(105)
                  DW_AT_data_member_location	(0x00)

0x0000007b:     DW_TAG_member
                  DW_AT_name	("ancs_notification_source_notification")
                  DW_AT_type	(cu + 0x017e "gatt_client_notification_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                  DW_AT_decl_line	(106)
                  DW_AT_data_member_location	(0x04)

0x00000087:     DW_TAG_member
                  DW_AT_name	("ancs_data_source_notification")
                  DW_AT_type	(cu + 0x017e "gatt_client_notification_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                  DW_AT_decl_line	(107)
                  DW_AT_data_member_location	(0x10)

0x00000093:     DW_TAG_member
                  DW_AT_name	("ancs_service_found")
                  DW_AT_type	(cu + 0x024c "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                  DW_AT_decl_line	(108)
                  DW_AT_data_member_location	(0x1c)

0x0000009f:     DW_TAG_member
                  DW_AT_name	("ancs_encrypted_complete")
                  DW_AT_type	(cu + 0x024c "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                  DW_AT_decl_line	(109)
                  DW_AT_data_member_location	(0x1e)

0x000000ab:     DW_TAG_member
                  DW_AT_name	("ancs_service")
                  DW_AT_type	(cu + 0x0257 "gatt_client_service_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                  DW_AT_decl_line	(110)
                  DW_AT_data_member_location	(0x20)

0x000000b7:     DW_TAG_member
                  DW_AT_name	("ancs_notification_source_characteristic")
                  DW_AT_type	(cu + 0x02aa "gatt_client_characteristic_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                  DW_AT_decl_line	(111)
                  DW_AT_data_member_location	(0x36)

0x000000c3:     DW_TAG_member
                  DW_AT_name	("ancs_control_point_characteristic")
                  DW_AT_type	(cu + 0x02aa "gatt_client_characteristic_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                  DW_AT_decl_line	(112)
                  DW_AT_data_member_location	(0x50)

0x000000cf:     DW_TAG_member
                  DW_AT_name	("ancs_data_source_characteristic")
                  DW_AT_type	(cu + 0x02aa "gatt_client_characteristic_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                  DW_AT_decl_line	(113)
                  DW_AT_data_member_location	(0x6a)

0x000000db:     DW_TAG_member
                  DW_AT_name	("ancs_characteristcs")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                  DW_AT_decl_line	(114)
                  DW_AT_data_member_location	(0x84)

0x000000e7:     DW_TAG_member
                  DW_AT_name	("client_handler")
                  DW_AT_type	(cu + 0x01f2 "btstack_packet_handler_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                  DW_AT_decl_line	(115)
                  DW_AT_data_member_location	(0x88)

0x000000f3:     DW_TAG_member
                  DW_AT_name	("hci_event_callback_registration")
                  DW_AT_type	(cu + 0x0302 "btstack_packet_callback_registration_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                  DW_AT_decl_line	(116)
                  DW_AT_data_member_location	(0x8c)

0x000000ff:     DW_TAG_member
                  DW_AT_name	("ancs_bytes_received")
                  DW_AT_type	(cu + 0x022a "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                  DW_AT_decl_line	(118)
                  DW_AT_data_member_location	(0x94)

0x0000010b:     DW_TAG_member
                  DW_AT_name	("ancs_bytes_needed")
                  DW_AT_type	(cu + 0x022a "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                  DW_AT_decl_line	(119)
                  DW_AT_data_member_location	(0x96)

0x00000117:     DW_TAG_member
                  DW_AT_name	("ancs_attribute_len")
                  DW_AT_type	(cu + 0x022a "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                  DW_AT_decl_line	(120)
                  DW_AT_data_member_location	(0x98)

0x00000123:     DW_TAG_member
                  DW_AT_name	("gc_handle")
                  DW_AT_type	(cu + 0x022a "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                  DW_AT_decl_line	(121)
                  DW_AT_data_member_location	(0x9a)

0x0000012f:     DW_TAG_member
                  DW_AT_name	("ancs_attribute_id")
                  DW_AT_type	(cu + 0x0218 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                  DW_AT_decl_line	(122)
                  DW_AT_data_member_location	(0x9c)

0x0000013b:     DW_TAG_member
                  DW_AT_name	("ancs_notification_buffer_size")
                  DW_AT_type	(cu + 0x022a "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                  DW_AT_decl_line	(123)
                  DW_AT_data_member_location	(0x9e)

0x00000147:     DW_TAG_member
                  DW_AT_name	("ancs_notification_buffer")
                  DW_AT_type	(cu + 0x023c "uint8_t*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                  DW_AT_decl_line	(124)
                  DW_AT_data_member_location	(0xa0)

0x00000153:     DW_TAG_member
                  DW_AT_name	("tc_state")
                  DW_AT_type	(cu + 0x032a "tc_state_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                  DW_AT_decl_line	(125)
                  DW_AT_data_member_location	(0xa4)

0x0000015f:     DW_TAG_member
                  DW_AT_name	("chunk_parser_state")
                  DW_AT_type	(cu + 0x036a "ancs_chunk_parser_state_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                  DW_AT_decl_line	(126)
                  DW_AT_data_member_location	(0xa8)

0x0000016b:     NULL

0x0000016c:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0177 "unsigned int")
                DW_AT_name	("uint32_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(48)

0x00000177:   DW_TAG_base_type
                DW_AT_name	("unsigned int")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x04)

0x0000017e:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0189 "gatt_client_notification")
                DW_AT_name	("gatt_client_notification_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                DW_AT_decl_line	(198)

0x00000189:   DW_TAG_structure_type
                DW_AT_name	("gatt_client_notification")
                DW_AT_byte_size	(0x0c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                DW_AT_decl_line	(193)

0x00000191:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x01c2 "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(194)
                  DW_AT_data_member_location	(0x00)

0x0000019d:     DW_TAG_member
                  DW_AT_name	("callback")
                  DW_AT_type	(cu + 0x01f2 "btstack_packet_handler_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(195)
                  DW_AT_data_member_location	(0x04)

0x000001a9:     DW_TAG_member
                  DW_AT_name	("con_handle")
                  DW_AT_type	(cu + 0x0241 "hci_con_handle_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(196)
                  DW_AT_data_member_location	(0x08)

0x000001b5:     DW_TAG_member
                  DW_AT_name	("attribute_handle")
                  DW_AT_type	(cu + 0x022a "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(197)
                  DW_AT_data_member_location	(0x0a)

0x000001c1:     NULL

0x000001c2:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01cd "btstack_linked_item_t")
                DW_AT_name	("linked_item_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(100)

0x000001cd:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01d8 "btstack_linked_item")
                DW_AT_name	("btstack_linked_item_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(55)

0x000001d8:   DW_TAG_structure_type
                DW_AT_name	("btstack_linked_item")
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(53)

0x000001e0:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(cu + 0x01ed "btstack_linked_item*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                  DW_AT_decl_line	(54)
                  DW_AT_data_member_location	(0x00)

0x000001ec:     NULL

0x000001ed:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x01d8 "btstack_linked_item")

0x000001f2:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01fd "subroutine *")
                DW_AT_name	("btstack_packet_handler_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(58)

0x000001fd:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0202 "subroutine ")

0x00000202:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x00000203:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0218 "uint8_t")

0x00000208:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x022a "uint16_t")

0x0000020d:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x023c "uint8_t*")

0x00000212:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x022a "uint16_t")

0x00000217:     NULL

0x00000218:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0223 "unsigned char")
                DW_AT_name	("uint8_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(44)

0x00000223:   DW_TAG_base_type
                DW_AT_name	("unsigned char")
                DW_AT_encoding	(DW_ATE_unsigned_char)
                DW_AT_byte_size	(0x01)

0x0000022a:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0235 "unsigned short")
                DW_AT_name	("uint16_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(46)

0x00000235:   DW_TAG_base_type
                DW_AT_name	("unsigned short")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x02)

0x0000023c:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0218 "uint8_t")

0x00000241:   DW_TAG_typedef
                DW_AT_type	(cu + 0x022a "uint16_t")
                DW_AT_name	("hci_con_handle_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/utils.h")
                DW_AT_decl_line	(60)

0x0000024c:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0235 "unsigned short")
                DW_AT_name	("u16")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(46)

0x00000257:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0262 "structure ")
                DW_AT_name	("gatt_client_service_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/le/gatt.h")
                DW_AT_decl_line	(24)

0x00000262:   DW_TAG_structure_type
                DW_AT_byte_size	(0x16)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/le/gatt.h")
                DW_AT_decl_line	(19)

0x00000266:     DW_TAG_member
                  DW_AT_name	("start_group_handle")
                  DW_AT_type	(cu + 0x022a "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/le/gatt.h")
                  DW_AT_decl_line	(20)
                  DW_AT_data_member_location	(0x00)

0x00000272:     DW_TAG_member
                  DW_AT_name	("end_group_handle")
                  DW_AT_type	(cu + 0x022a "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/le/gatt.h")
                  DW_AT_decl_line	(21)
                  DW_AT_data_member_location	(0x02)

0x0000027e:     DW_TAG_member
                  DW_AT_name	("uuid16")
                  DW_AT_type	(cu + 0x022a "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/le/gatt.h")
                  DW_AT_decl_line	(22)
                  DW_AT_data_member_location	(0x04)

0x0000028a:     DW_TAG_member
                  DW_AT_name	("uuid128")
                  DW_AT_type	(cu + 0x0297 "uint8_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/le/gatt.h")
                  DW_AT_decl_line	(23)
                  DW_AT_data_member_location	(0x06)

0x00000296:     NULL

0x00000297:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0218 "uint8_t")

0x0000029c:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x02a3 "sizetype")
                  DW_AT_count	(0x10)

0x000002a2:     NULL

0x000002a3:   DW_TAG_base_type
                DW_AT_name	("sizetype")
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_unsigned)

0x000002aa:   DW_TAG_typedef
                DW_AT_type	(cu + 0x02b5 "structure ")
                DW_AT_name	("gatt_client_characteristic_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/le/gatt.h")
                DW_AT_decl_line	(34)

0x000002b5:   DW_TAG_structure_type
                DW_AT_byte_size	(0x1a)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/le/gatt.h")
                DW_AT_decl_line	(27)

0x000002b9:     DW_TAG_member
                  DW_AT_name	("start_handle")
                  DW_AT_type	(cu + 0x022a "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/le/gatt.h")
                  DW_AT_decl_line	(28)
                  DW_AT_data_member_location	(0x00)

0x000002c5:     DW_TAG_member
                  DW_AT_name	("value_handle")
                  DW_AT_type	(cu + 0x022a "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/le/gatt.h")
                  DW_AT_decl_line	(29)
                  DW_AT_data_member_location	(0x02)

0x000002d1:     DW_TAG_member
                  DW_AT_name	("end_handle")
                  DW_AT_type	(cu + 0x022a "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/le/gatt.h")
                  DW_AT_decl_line	(30)
                  DW_AT_data_member_location	(0x04)

0x000002dd:     DW_TAG_member
                  DW_AT_name	("properties")
                  DW_AT_type	(cu + 0x022a "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/le/gatt.h")
                  DW_AT_decl_line	(31)
                  DW_AT_data_member_location	(0x06)

0x000002e9:     DW_TAG_member
                  DW_AT_name	("uuid16")
                  DW_AT_type	(cu + 0x022a "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/le/gatt.h")
                  DW_AT_decl_line	(32)
                  DW_AT_data_member_location	(0x08)

0x000002f5:     DW_TAG_member
                  DW_AT_name	("uuid128")
                  DW_AT_type	(cu + 0x0297 "uint8_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/le/gatt.h")
                  DW_AT_decl_line	(33)
                  DW_AT_data_member_location	(0x0a)

0x00000301:     NULL

0x00000302:   DW_TAG_typedef
                DW_AT_type	(cu + 0x030d "structure ")
                DW_AT_name	("btstack_packet_callback_registration_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(64)

0x0000030d:   DW_TAG_structure_type
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(61)

0x00000311:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x01c2 "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                  DW_AT_decl_line	(62)
                  DW_AT_data_member_location	(0x00)

0x0000031d:     DW_TAG_member
                  DW_AT_name	("callback")
                  DW_AT_type	(cu + 0x01f2 "btstack_packet_handler_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                  DW_AT_decl_line	(63)
                  DW_AT_data_member_location	(0x04)

0x00000329:     NULL

0x0000032a:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0335 "enumeration ")
                DW_AT_name	("tc_state_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                DW_AT_decl_line	(83)

0x00000335:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                DW_AT_decl_line	(74)

0x00000339:     DW_TAG_enumerator
                  DW_AT_name	("TC_IDLE")
                  DW_AT_const_value	(0)

0x0000033f:     DW_TAG_enumerator
                  DW_AT_name	("TC_W4_ENCRYPTED_CONNECTION")
                  DW_AT_const_value	(1)

0x00000345:     DW_TAG_enumerator
                  DW_AT_name	("TC_W4_SERVICE_RESULT")
                  DW_AT_const_value	(2)

0x0000034b:     DW_TAG_enumerator
                  DW_AT_name	("TC_W4_CHARACTERISTIC_RESULT")
                  DW_AT_const_value	(3)

0x00000351:     DW_TAG_enumerator
                  DW_AT_name	("TC_W4_DATA_SOURCE_SUBSCRIBED")
                  DW_AT_const_value	(4)

0x00000357:     DW_TAG_enumerator
                  DW_AT_name	("TC_W4_NOTIFICATION_SOURCE_SUBSCRIBED")
                  DW_AT_const_value	(5)

0x0000035d:     DW_TAG_enumerator
                  DW_AT_name	("TC_SUBSCRIBED")
                  DW_AT_const_value	(6)

0x00000363:     DW_TAG_enumerator
                  DW_AT_name	("TC_W4_DISCONNECT")
                  DW_AT_const_value	(7)

0x00000369:     NULL

0x0000036a:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0375 "ancs_chunk_parser_state")
                DW_AT_name	("ancs_chunk_parser_state_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                DW_AT_decl_line	(72)

0x00000375:   DW_TAG_enumeration_type
                DW_AT_name	("ancs_chunk_parser_state")
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                DW_AT_decl_line	(68)

0x0000037d:     DW_TAG_enumerator
                  DW_AT_name	("W4_ATTRIBUTE_ID")
                  DW_AT_const_value	(0)

0x00000383:     DW_TAG_enumerator
                  DW_AT_name	("W4_ATTRIBUTE_LEN")
                  DW_AT_const_value	(1)

0x00000389:     DW_TAG_enumerator
                  DW_AT_name	("W4_ATTRIBUTE_COMPLETE")
                  DW_AT_const_value	(2)

0x0000038f:     NULL

0x00000390:   DW_TAG_variable
                DW_AT_name	("ancs_attribute_names")
                DW_AT_type	(cu + 0x03a1 "const char*[]")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/ancs_client.c")
                DW_AT_decl_line	(85)
                DW_AT_location	(DW_OP_addr 0x14)

0x000003a1:   DW_TAG_array_type
                DW_AT_type	(cu + 0x03ad "const char*")

0x000003a6:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x02a3 "sizetype")
                  DW_AT_count	(0x08)

0x000003ac:     NULL

0x000003ad:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x03b2 "const char")

0x000003b2:   DW_TAG_const_type
                DW_AT_type	(cu + 0x03b7 "char")

0x000003b7:   DW_TAG_base_type
                DW_AT_name	("char")
                DW_AT_encoding	(DW_ATE_signed_char)
                DW_AT_byte_size	(0x01)

0x000003be:   DW_TAG_variable
                DW_AT_name	("ancs_out_callback")
                DW_AT_type	(cu + 0x03cf "subroutine *")
