; ModuleID = 'att_server.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.att_info_t = type { void (i8, i16, i8*, i16)*, void (i8, i16, i8*, i16)*, i8, i8*, i16 (i16, i16, i16, i8*, i16)*, i32 (i16, i16, i16, i16, i8*, i16)*, i8, i16, %struct.btstack_linked_item*, %struct.btstack_packet_callback_registration_t, %struct.btstack_packet_callback_registration_t, void (i8, i16, i8*, i16)*, %struct.btstack_linked_item*, i8 }
%struct.btstack_packet_callback_registration_t = type { %struct.btstack_linked_item, void (i8, i16, i8*, i16)* }
%struct.btstack_linked_item = type { %struct.btstack_linked_item* }
%struct.att_server_t = type { i32, i8, [6 x i8], i32, i32, i32, %struct.btstack_timer_source, %struct.att_connection, i16, [517 x i8], i8, void (i16, i8)* }
%struct.btstack_timer_source = type { %struct.btstack_linked_item, i32, i32, void (%struct.btstack_timer_source*)*, i8* }
%struct.att_connection = type { i16, i16, i16, i8, i8, i8 }
%struct.__le_hci_connection = type { %struct.btstack_linked_item, [6 x i8], i16, i32, i8, i32, i8, i16, i16, i16, i16, %struct.sm_connection, %struct.att_server_t, [529 x i8], i16, i16, i8, [6 x i8], [6 x i8], i32 }
%struct.sm_connection = type { i16, i8, i8, i8, i8, [6 x i8], i32, i32, i8, i8, i8, [7 x i8], i32, i16, [8 x i8], i8, i32, i32 }

!137 = !DIEnumerator(name: "IRK_LOOKUP_W4_READY", value: 1)
!138 = !DIEnumerator(name: "IRK_LOOKUP_STARTED", value: 2)
!139 = !DIEnumerator(name: "IRK_LOOKUP_SUCCEEDED", value: 3)
!140 = !DIEnumerator(name: "IRK_LOOKUP_FAILED", value: 4)
!141 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 445, size: 32, elements: !142)
!142 = !{!143, !144, !145, !146}
!143 = !DIEnumerator(name: "AUTHORIZATION_UNKNOWN", value: 0)
!144 = !DIEnumerator(name: "AUTHORIZATION_PENDING", value: 1)
!145 = !DIEnumerator(name: "AUTHORIZATION_DECLINED", value: 2)
!146 = !DIEnumerator(name: "AUTHORIZATION_GRANTED", value: 3)
!147 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 30, size: 32, elements: !148)
!148 = !{!149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192}
!149 = !DIEnumerator(name: "BLE_CMD_ADV_ENABLE", value: 1)
!150 = !DIEnumerator(name: "BLE_CMD_ADV_PARAM", value: 2)
!151 = !DIEnumerator(name: "BLE_CMD_ADV_DATA", value: 3)
!152 = !DIEnumerator(name: "BLE_CMD_RSP_DATA", value: 4)
!153 = !DIEnumerator(name: "BLE_CMD_DISCONNECT", value: 5)
!154 = !DIEnumerator(name: "BLE_CMD_REGIEST_THREAD", value: 6)
!155 = !DIEnumerator(name: "BLE_CMD_ATT_SEND_INIT", value: 7)
!156 = !DIEnumerator(name: "BLE_CMD_ATT_MTU_SIZE", value: 8)
!157 = !DIEnumerator(name: "BLE_CMD_ATT_VAILD_LEN", value: 9)
!158 = !DIEnumerator(name: "BLE_CMD_ATT_SEND_DATA", value: 10)
!159 = !DIEnumerator(name: "BLE_CMD_REQ_CONN_PARAM_UPDATE", value: 11)
!160 = !DIEnumerator(name: "BLE_CMD_SCAN_ENABLE", value: 12)
!161 = !DIEnumerator(name: "BLE_CMD_SCAN_PARAM", value: 13)
!162 = !DIEnumerator(name: "BLE_CMD_STACK_EXIT", value: 14)
!163 = !DIEnumerator(name: "BLE_CMD_CREATE_CONN", value: 15)
!164 = !DIEnumerator(name: "BLE_CMD_CREATE_CONN_CANCEL", value: 16)
!165 = !DIEnumerator(name: "BLE_CMD_ADV_PARAM_EXT", value: 17)
!166 = !DIEnumerator(name: "BLE_CMD_SEND_TEST_KEY_NUM", value: 18)
!167 = !DIEnumerator(name: "BLE_CMD_LATENCY_HOLD_CNT", value: 19)
!168 = !DIEnumerator(name: "BLE_CMD_SET_DATA_LENGTH", value: 20)
!169 = !DIEnumerator(name: "BLE_CMD_SET_HCI_CFG", value: 21)
!170 = !DIEnumerator(name: "BLE_CMD_SCAN_ENABLE2", value: 22)
!171 = !DIEnumerator(name: "BLE_CMD_ATT_SERVER_REQ_RESUME", value: 23)
!172 = !DIEnumerator(name: "BLE_CMD_MULTI_ATT_SEND_INIT", value: 24)
!173 = !DIEnumerator(name: "BLE_CMD_MULTI_ATT_SET_CONN_HANDLE", value: 25)
!174 = !DIEnumerator(name: "BLE_CMD_MULTI_ATT_SEND_DATA", value: 26)
!175 = !DIEnumerator(name: "BLE_CMD_MULTI_ATT_MTU_SIZE", value: 27)
!176 = !DIEnumerator(name: "BLE_CMD_MULTI_ATT_VAILD_LEN", value: 28)
!177 = !DIEnumerator(name: "BLE_CMD_SM_REQ_RESUME", value: 29)
!178 = !DIEnumerator(name: "BLE_CMD_EXT_ADV_PARAM", value: 64)
!179 = !DIEnumerator(name: "BLE_CMD_EXT_ADV_DATA", value: 65)
!180 = !DIEnumerator(name: "BLE_CMD_EXT_RSP_DATA", value: 66)
!181 = !DIEnumerator(name: "BLE_CMD_EXT_ADV_ENABLE", value: 67)
!182 = !DIEnumerator(name: "BLE_CMD_SET_PHY", value: 68)
!183 = !DIEnumerator(name: "BLE_CMD_EXT_SCAN_PARAM", value: 69)
!184 = !DIEnumerator(name: "BLE_CMD_EXT_SCAN_ENABLE", value: 70)
!185 = !DIEnumerator(name: "BLE_CMD_EXT_CREATE_CONN", value: 71)
!186 = !DIEnumerator(name: "BLE_CMD_PERIODIC_ADV_PARAM", value: 72)
!187 = !DIEnumerator(name: "BLE_CMD_PERIODIC_ADV_DATA", value: 73)
!188 = !DIEnumerator(name: "BLE_CMD_PERIODIC_ADV_ENABLE", value: 74)
!189 = !DIEnumerator(name: "BLE_CMD_PERIODIC_ADV_CREAT_SYNC", value: 75)
!190 = !DIEnumerator(name: "BLE_CMD_SEARCH_PROFILE", value: 128)
!191 = !DIEnumerator(name: "BLE_CMD_WRITE_CCC", value: 129)
!192 = !DIEnumerator(name: "BLE_CMD_ONNN_PARAM_UPDATA", value: 130)
!193 = !{!194, !195, !200, !208, !209, !339, !349}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !196, line: 43, baseType: !197)
!196 = !DIFile(filename: "/opt/q32s/include/sys/_stdint.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintptr_t", file: !198, line: 202, baseType: !199)
!198 = !DIFile(filename: "/opt/q32s/include/machine/_default_types.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!199 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_item_t", file: !202, line: 100, baseType: !203)
!202 = !DIFile(filename: "../btcommon/btstack_linked_list.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_linked_item_t", file: !202, line: 55, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btstack_linked_item", file: !202, line: 53, size: 32, elements: !205)
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !204, file: !202, line: 54, baseType: !207, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!208 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "le_hci_connection_t", file: !27, line: 605, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__le_hci_connection", file: !27, line: 571, size: 9792, elements: !212)
!212 = !{!213, !214, !223, !227, !229, !230, !232, !233, !234, !235, !236, !237, !269, !329, !333, !334, !335, !336, !337, !338}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !211, file: !27, line: 572, baseType: !201, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !211, file: !27, line: 574, baseType: !215, size: 48, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_addr_t", file: !216, line: 7, baseType: !217)
!216 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 48, elements: !221)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !219, line: 44, baseType: !220)
!219 = !DIFile(filename: "../btcommon/typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!220 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!221 = !{!222}
!222 = !DISubrange(count: 6)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "con_handle", scope: !211, file: !27, line: 576, baseType: !224, size: 16, offset: 80)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "hci_con_handle_t", file: !216, line: 9, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !219, line: 46, baseType: !226)
!226 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "address_type", scope: !211, file: !27, line: 578, baseType: !228, size: 32, offset: 96)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_addr_type_t", file: !19, line: 1475, baseType: !18)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "role", scope: !211, file: !27, line: 581, baseType: !218, size: 8, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "le_con_parameter_update_state", scope: !211, file: !27, line: 584, baseType: !231, size: 32, offset: 160)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "le_con_parameter_update_state_t", file: !27, line: 252, baseType: !26)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "le_con_param_update_identifier", scope: !211, file: !27, line: 585, baseType: !218, size: 8, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "le_conn_interval_min", scope: !211, file: !27, line: 586, baseType: !225, size: 16, offset: 208)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "le_conn_interval_max", scope: !211, file: !27, line: 587, baseType: !225, size: 16, offset: 224)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "le_conn_latency", scope: !211, file: !27, line: 588, baseType: !225, size: 16, offset: 240)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "le_supervision_timeout", scope: !211, file: !27, line: 589, baseType: !225, size: 16, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "sm_connection", scope: !211, file: !27, line: 592, baseType: !238, size: 448, offset: 288)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "sm_connection_t", file: !27, line: 475, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sm_connection", file: !27, line: 456, size: 448, elements: !240)
!240 = !{!241, !242, !243, !244, !245, !246, !247, !249, !251, !252, !253, !254, !259, !261, !262, !266, !267, !268}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "sm_handle", scope: !239, file: !27, line: 457, baseType: !224, size: 16)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "sm_role", scope: !239, file: !27, line: 458, baseType: !218, size: 8, offset: 16)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "sm_security_request_received", scope: !239, file: !27, line: 459, baseType: !218, size: 8, offset: 24)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "sm_bonding_requested", scope: !239, file: !27, line: 460, baseType: !218, size: 8, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "sm_peer_addr_type", scope: !239, file: !27, line: 461, baseType: !218, size: 8, offset: 40)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "sm_peer_address", scope: !239, file: !27, line: 462, baseType: !215, size: 48, offset: 48)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "sm_engine_state", scope: !239, file: !27, line: 463, baseType: !248, size: 32, offset: 96)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "security_manager_state_t", file: !27, line: 433, baseType: !34)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "sm_irk_lookup_state", scope: !239, file: !27, line: 464, baseType: !250, size: 32, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "irk_lookup_state_t", file: !27, line: 442, baseType: !134)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "sm_connection_encrypted", scope: !239, file: !27, line: 465, baseType: !218, size: 8, offset: 160)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "sm_connection_authenticated", scope: !239, file: !27, line: 466, baseType: !218, size: 8, offset: 168)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "sm_actual_encryption_key_size", scope: !239, file: !27, line: 467, baseType: !218, size: 8, offset: 176)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "sm_m_preq", scope: !239, file: !27, line: 468, baseType: !255, size: 56, offset: 184)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "sm_pairing_packet_t", file: !27, line: 452, baseType: !256)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 56, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 7)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "sm_connection_authorization_state", scope: !239, file: !27, line: 469, baseType: !260, size: 32, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "authorization_state_t", file: !27, line: 450, baseType: !141)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "sm_local_ediv", scope: !239, file: !27, line: 470, baseType: !225, size: 16, offset: 288)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "sm_local_rand", scope: !239, file: !27, line: 471, baseType: !263, size: 64, offset: 304)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 64, elements: !264)
!264 = !{!265}
!265 = !DISubrange(count: 8)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "sm_disconn_reason", scope: !239, file: !27, line: 472, baseType: !218, size: 8, offset: 368)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "sm_le_db_index", scope: !239, file: !27, line: 473, baseType: !208, size: 32, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "sm_timeout_id", scope: !239, file: !27, line: 474, baseType: !208, size: 32, offset: 416)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "att_server", scope: !211, file: !27, line: 595, baseType: !270, size: 4640, offset: 736)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_server_t", file: !6, line: 187, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 164, size: 4640, elements: !272)
!272 = !{!273, !275, !276, !277, !278, !279, !280, !300, !313, !314, !318, !319, !320, !321, !322, !323}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !271, file: !6, line: 165, baseType: !274, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_server_state_t", file: !6, line: 162, baseType: !5)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "peer_addr_type", scope: !271, file: !6, line: 167, baseType: !218, size: 8, offset: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "peer_address", scope: !271, file: !6, line: 168, baseType: !215, size: 48, offset: 40)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "ir_le_device_db_index", scope: !271, file: !6, line: 170, baseType: !208, size: 32, offset: 96)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "ir_lookup_active", scope: !271, file: !6, line: 171, baseType: !208, size: 32, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "value_indication_handle", scope: !271, file: !6, line: 173, baseType: !208, size: 32, offset: 160)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "value_indication_timer", scope: !271, file: !6, line: 174, baseType: !281, size: 160, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_timer_source_t", file: !282, line: 19, baseType: !283)
!282 = !DIFile(filename: "../btcommon/btstack_sys_timer.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btstack_timer_source", file: !282, line: 7, size: 160, elements: !284)
!284 = !{!285, !286, !289, !290, !291, !292, !293, !294, !299}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !283, file: !282, line: 8, baseType: !203, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !283, file: !282, line: 10, baseType: !287, size: 32, offset: 32)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !219, line: 48, baseType: !288)
!288 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_interval", scope: !283, file: !282, line: 11, baseType: !287, size: 16, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "timer_type", scope: !283, file: !282, line: 12, baseType: !287, size: 4, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "timer_tick_overflow", scope: !283, file: !282, line: 13, baseType: !287, size: 1, offset: 84, flags: DIFlagBitField, extraData: i64 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "loop_flag", scope: !283, file: !282, line: 14, baseType: !287, size: 1, offset: 85, flags: DIFlagBitField, extraData: i64 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "loop_times", scope: !283, file: !282, line: 15, baseType: !287, size: 10, offset: 86, flags: DIFlagBitField, extraData: i64 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !283, file: !282, line: 17, baseType: !295, size: 32, offset: 96)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !298}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !283, file: !282, line: 18, baseType: !194, size: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !271, file: !6, line: 176, baseType: !301, size: 80, offset: 352)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_connection_t", file: !302, line: 41, baseType: !303)
!302 = !DIFile(filename: "../btstack/Protocol/include/ble/att_db.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "att_connection", file: !302, line: 34, size: 80, elements: !304)
!304 = !{!305, !308, !309, !310, !311, !312}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "con_handle", scope: !303, file: !302, line: 35, baseType: !306, size: 16)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "hci_con_handle_t", file: !307, line: 60, baseType: !225)
!307 = !DIFile(filename: "../btcommon/utils.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!308 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !303, file: !302, line: 36, baseType: !225, size: 16, offset: 16)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "max_mtu", scope: !303, file: !302, line: 37, baseType: !225, size: 16, offset: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "encryption_key_size", scope: !303, file: !302, line: 38, baseType: !218, size: 8, offset: 48)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !303, file: !302, line: 39, baseType: !218, size: 8, offset: 56)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "authorized", scope: !303, file: !302, line: 40, baseType: !218, size: 8, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "request_size", scope: !271, file: !6, line: 178, baseType: !225, size: 16, offset: 432)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "request_buffer", scope: !271, file: !6, line: 179, baseType: !315, size: 4136, offset: 448)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 4136, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 517)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flow_hold_flag", scope: !271, file: !6, line: 181, baseType: !218, size: 1, offset: 4584, flags: DIFlagBitField, extraData: i64 4584)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "mtu_request_flag", scope: !271, file: !6, line: 182, baseType: !218, size: 1, offset: 4585, flags: DIFlagBitField, extraData: i64 4584)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "check_remote_tag", scope: !271, file: !6, line: 183, baseType: !218, size: 3, offset: 4586, flags: DIFlagBitField, extraData: i64 4584)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "request_busy", scope: !271, file: !6, line: 184, baseType: !218, size: 1, offset: 4589, flags: DIFlagBitField, extraData: i64 4584)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "reserverd", scope: !271, file: !6, line: 185, baseType: !218, size: 2, offset: 4590, flags: DIFlagBitField, extraData: i64 4584)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "result_callback", scope: !271, file: !6, line: 186, baseType: !324, size: 32, offset: 4608)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!325 = !DISubroutineType(types: !326)
!326 = !{null, !327, !328}
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !219, line: 46, baseType: !226)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !219, line: 44, baseType: !220)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "acl_recombination_buffer", scope: !211, file: !27, line: 597, baseType: !330, size: 4232, offset: 5376)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 4232, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 529)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "acl_recombination_pos", scope: !211, file: !27, line: 598, baseType: !225, size: 16, offset: 9616)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "acl_recombination_length", scope: !211, file: !27, line: 599, baseType: !225, size: 16, offset: 9632)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "num_acl_packets_sent", scope: !211, file: !27, line: 600, baseType: !218, size: 8, offset: 9648)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "own_id_address", scope: !211, file: !27, line: 602, baseType: !215, size: 48, offset: 9656)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "own_address", scope: !211, file: !27, line: 603, baseType: !215, size: 48, offset: 9704)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "own_address_type", scope: !211, file: !27, line: 604, baseType: !228, size: 32, offset: 9760)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_context_callback_registration_t", file: !19, line: 71, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 67, size: 96, elements: !342)
!342 = !{!343, !344, !348}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !341, file: !19, line: 68, baseType: !200, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !341, file: !19, line: 69, baseType: !345, size: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 32)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !194}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !341, file: !19, line: 70, baseType: !194, size: 32, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!350 = !{!0, !351}
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "search_ios_ancs_server", scope: !2, file: !3, line: 362, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 184, elements: !355)
!354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !328)
!355 = !{!356}
!356 = !DISubrange(count: 23)
!357 = !DIFile(filename: "../btcommon/profile_stack_debug.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!358 = !{i32 2, !"Dwarf Version", i32 4}
!359 = !{i32 2, !"Debug Info Version", i32 3}
!360 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!361 = distinct !DISubprogram(name: "att_server_set_exchange_mtu", scope: !3, file: !3, line: 344, type: !362, isLocal: false, isDefinition: true, scopeLine: 345, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !364)
!362 = !DISubroutineType(types: !363)
!363 = !{null, !327}
!364 = !{!365, !366}
!365 = !DILocalVariable(name: "con_handle", arg: 1, scope: !361, file: !3, line: 344, type: !327)
!366 = !DILocalVariable(name: "att_server", scope: !361, file: !3, line: 346, type: !349)
!367 = !DILocation(line: 344, column: 38, scope: !361)
!368 = !DILocation(line: 348, column: 10, scope: !369)
!369 = distinct !DILexicalBlock(scope: !361, file: !3, line: 348, column: 9)
!370 = !DILocation(line: 348, column: 9, scope: !361)
!371 = !DILocation(line: 352, column: 18, scope: !361)
!372 = !DILocation(line: 346, column: 19, scope: !361)
!373 = !DILocation(line: 353, column: 10, scope: !374)
!374 = distinct !DILexicalBlock(scope: !361, file: !3, line: 353, column: 9)
!375 = !DILocation(line: 353, column: 9, scope: !361)
!376 = !DILocation(line: 354, column: 36, scope: !377)
!377 = distinct !DILexicalBlock(scope: !374, file: !3, line: 353, column: 22)
!378 = !DILocation(line: 354, column: 9, scope: !377)
!379 = !DILocation(line: 355, column: 9, scope: !377)
!380 = !DILocation(line: 357, column: 5, scope: !381)
!381 = distinct !DILexicalBlock(scope: !361, file: !3, line: 357, column: 5)
!382 = !{!383, !383, i64 0}
!383 = !{!"omnipotent char", !384, i64 0}
!384 = !{!"Simple C/C++ TBAA"}
!385 = !DILocation(line: 357, column: 5, scope: !361)
!386 = !DILocation(line: 357, column: 5, scope: !387)
!387 = !DILexicalBlockFile(scope: !381, file: !3, discriminator: 1)
!388 = !DILocation(line: 358, column: 17, scope: !361)
!389 = !DILocation(line: 358, column: 34, scope: !361)
!390 = !DILocation(line: 359, column: 5, scope: !361)
!391 = !DILocation(line: 360, column: 1, scope: !361)
!392 = !DILocation(line: 360, column: 1, scope: !393)
!393 = !DILexicalBlockFile(scope: !361, file: !3, discriminator: 2)
!394 = distinct !DISubprogram(name: "att_server_for_handle", scope: !3, file: !3, line: 82, type: !395, isLocal: true, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !397)
!395 = !DISubroutineType(types: !396)
!396 = !{!349, !224}
!397 = !{!398, !399}
!398 = !DILocalVariable(name: "con_handle", arg: 1, scope: !394, file: !3, line: 82, type: !224)
!399 = !DILocalVariable(name: "hci_connection", scope: !394, file: !3, line: 88, type: !209)
!400 = !DILocation(line: 82, column: 61, scope: !394)
!401 = !DILocation(line: 84, column: 10, scope: !402)
!402 = distinct !DILexicalBlock(scope: !394, file: !3, line: 84, column: 9)
!403 = !{!404, !404, i64 0}
!404 = !{!"int", !383, i64 0}
!405 = !DILocation(line: 84, column: 9, scope: !394)
!406 = !DILocation(line: 88, column: 43, scope: !394)
!407 = !DILocation(line: 88, column: 26, scope: !394)
!408 = !DILocation(line: 89, column: 10, scope: !409)
!409 = distinct !DILexicalBlock(scope: !394, file: !3, line: 89, column: 9)
!410 = !DILocation(line: 92, column: 29, scope: !394)
!411 = !DILocation(line: 89, column: 9, scope: !394)
!412 = !DILocation(line: 93, column: 1, scope: !413)
!413 = !DILexicalBlockFile(scope: !394, file: !3, discriminator: 1)
!414 = distinct !DISubprogram(name: "att_server_init", scope: !3, file: !3, line: 650, type: !415, isLocal: false, isDefinition: true, scopeLine: 651, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !429)
!415 = !DISubroutineType(types: !416)
!416 = !{null, !417, !419, !425}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_read_callback_t", file: !420, line: 116, baseType: !421)
!420 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/le/att.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 32)
!422 = !DISubroutineType(types: !423)
!423 = !{!225, !225, !225, !225, !424, !225}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_write_callback_t", file: !420, line: 127, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 32)
!427 = !DISubroutineType(types: !428)
!428 = !{!208, !225, !225, !225, !225, !424, !225}
!429 = !{!430, !431, !432}
!430 = !DILocalVariable(name: "db", arg: 1, scope: !414, file: !3, line: 650, type: !417)
!431 = !DILocalVariable(name: "read_callback", arg: 2, scope: !414, file: !3, line: 650, type: !419)
!432 = !DILocalVariable(name: "write_callback", arg: 3, scope: !414, file: !3, line: 650, type: !425)
!433 = !DILocation(line: 650, column: 37, scope: !414)
!434 = !DILocation(line: 650, column: 61, scope: !414)
!435 = !DILocation(line: 650, column: 97, scope: !414)
!436 = !DILocation(line: 652, column: 10, scope: !437)
!437 = distinct !DILexicalBlock(scope: !414, file: !3, line: 652, column: 9)
!438 = !DILocation(line: 652, column: 9, scope: !414)
!439 = !DILocation(line: 658, column: 54, scope: !414)
!440 = !{!441, !442, i64 36}
!441 = !{!"", !442, i64 0, !442, i64 4, !383, i64 8, !383, i64 8, !383, i64 8, !383, i64 8, !442, i64 12, !442, i64 16, !442, i64 20, !383, i64 24, !443, i64 26, !442, i64 28, !444, i64 32, !444, i64 40, !442, i64 48, !442, i64 52, !383, i64 56, !383, i64 56, !383, i64 56}
!442 = !{!"any pointer", !383, i64 0}
!443 = !{!"short", !383, i64 0}
!444 = !{!"", !445, i64 0, !442, i64 4}
!445 = !{!"btstack_linked_item", !442, i64 0}
!446 = !DILocation(line: 659, column: 5, scope: !414)
!447 = !DILocation(line: 661, column: 9, scope: !448)
!448 = distinct !DILexicalBlock(scope: !414, file: !3, line: 661, column: 9)
!449 = !DILocation(line: 661, column: 9, scope: !414)
!450 = !DILocation(line: 663, column: 57, scope: !451)
!451 = distinct !DILexicalBlock(scope: !448, file: !3, line: 661, column: 38)
!452 = !{!441, !442, i64 44}
!453 = !DILocation(line: 664, column: 9, scope: !451)
!454 = !DILocation(line: 665, column: 5, scope: !451)
!455 = !DILocation(line: 668, column: 5, scope: !414)
!456 = !DILocation(line: 669, column: 5, scope: !457)
!457 = distinct !DILexicalBlock(scope: !414, file: !3, line: 669, column: 5)
!458 = !DILocation(line: 669, column: 5, scope: !414)
!459 = !DILocation(line: 669, column: 5, scope: !460)
!460 = !DILexicalBlockFile(scope: !457, file: !3, discriminator: 1)
!461 = !DILocation(line: 670, column: 5, scope: !414)
!462 = !DILocation(line: 671, column: 5, scope: !414)
!463 = !DILocation(line: 672, column: 5, scope: !414)
!464 = !DILocation(line: 674, column: 1, scope: !414)
!465 = !DILocation(line: 674, column: 1, scope: !466)
!466 = !DILexicalBlockFile(scope: !414, file: !3, discriminator: 1)
!467 = distinct !DISubprogram(name: "att_event_packet_handler", scope: !3, file: !3, line: 175, type: !468, isLocal: true, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !470)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !218, !225, !424, !225}
!470 = !{!471, !472, !473, !474, !475, !476}
!471 = !DILocalVariable(name: "packet_type", arg: 1, scope: !467, file: !3, line: 175, type: !218)
!472 = !DILocalVariable(name: "channel", arg: 2, scope: !467, file: !3, line: 175, type: !225)
!473 = !DILocalVariable(name: "packet", arg: 3, scope: !467, file: !3, line: 175, type: !424)
!474 = !DILocalVariable(name: "size", arg: 4, scope: !467, file: !3, line: 175, type: !225)
!475 = !DILocalVariable(name: "att_server", scope: !467, file: !3, line: 185, type: !349)
!476 = !DILocalVariable(name: "con_handle", scope: !467, file: !3, line: 186, type: !224)
!477 = !DILocation(line: 175, column: 46, scope: !467)
!478 = !DILocation(line: 175, column: 68, scope: !467)
!479 = !DILocation(line: 175, column: 86, scope: !467)
!480 = !DILocation(line: 175, column: 103, scope: !467)
!481 = !DILocation(line: 181, column: 10, scope: !482)
!482 = distinct !DILexicalBlock(scope: !467, file: !3, line: 181, column: 9)
!483 = !DILocation(line: 188, column: 5, scope: !467)
!484 = !DILocation(line: 181, column: 9, scope: !467)
!485 = !DILocation(line: 191, column: 17, scope: !486)
!486 = distinct !DILexicalBlock(scope: !467, file: !3, line: 188, column: 26)
!487 = !DILocation(line: 191, column: 9, scope: !486)
!488 = !DILocation(line: 194, column: 21, scope: !489)
!489 = distinct !DILexicalBlock(scope: !486, file: !3, line: 191, column: 52)
!490 = !DILocation(line: 194, column: 13, scope: !489)
!491 = !DILocation(line: 196, column: 30, scope: !492)
!492 = distinct !DILexicalBlock(scope: !489, file: !3, line: 194, column: 32)
!493 = !DILocation(line: 186, column: 22, scope: !467)
!494 = !DILocation(line: 197, column: 30, scope: !492)
!495 = !DILocation(line: 185, column: 19, scope: !467)
!496 = !DILocation(line: 198, column: 22, scope: !497)
!497 = distinct !DILexicalBlock(scope: !492, file: !3, line: 198, column: 21)
!498 = !DILocation(line: 198, column: 21, scope: !492)
!499 = !DILocation(line: 202, column: 46, scope: !492)
!500 = !DILocation(line: 202, column: 29, scope: !492)
!501 = !DILocation(line: 202, column: 44, scope: !492)
!502 = !{!503, !383, i64 4}
!503 = !{!"", !383, i64 0, !383, i64 4, !383, i64 5, !404, i64 12, !404, i64 16, !404, i64 20, !504, i64 24, !505, i64 44, !443, i64 54, !383, i64 56, !383, i64 573, !383, i64 573, !383, i64 573, !383, i64 573, !383, i64 573, !442, i64 576}
!504 = !{!"btstack_timer_source", !445, i64 0, !404, i64 4, !404, i64 8, !404, i64 10, !404, i64 10, !404, i64 10, !404, i64 10, !442, i64 12, !442, i64 16}
!505 = !{!"att_connection", !443, i64 0, !443, i64 2, !443, i64 4, !383, i64 6, !383, i64 7, !383, i64 8}
!506 = !DILocation(line: 203, column: 34, scope: !492)
!507 = !DILocation(line: 203, column: 45, scope: !492)
!508 = !DILocation(line: 203, column: 17, scope: !492)
!509 = !DILocation(line: 204, column: 40, scope: !492)
!510 = !DILocation(line: 204, column: 51, scope: !492)
!511 = !{!503, !443, i64 44}
!512 = !DILocation(line: 206, column: 29, scope: !492)
!513 = !DILocation(line: 206, column: 35, scope: !492)
!514 = !{!503, !383, i64 0}
!515 = !DILocation(line: 207, column: 40, scope: !492)
!516 = !DILocation(line: 207, column: 44, scope: !492)
!517 = !{!503, !443, i64 46}
!518 = !DILocation(line: 208, column: 50, scope: !492)
!519 = !DILocation(line: 208, column: 40, scope: !492)
!520 = !DILocation(line: 209, column: 21, scope: !492)
!521 = !DILocation(line: 208, column: 48, scope: !492)
!522 = !{!503, !443, i64 48}
!523 = !DILocation(line: 212, column: 40, scope: !492)
!524 = !DILocation(line: 212, column: 60, scope: !492)
!525 = !{!503, !383, i64 50}
!526 = !DILocation(line: 213, column: 40, scope: !492)
!527 = !DILocation(line: 213, column: 54, scope: !492)
!528 = !{!503, !383, i64 51}
!529 = !DILocation(line: 214, column: 40, scope: !492)
!530 = !DILocation(line: 214, column: 51, scope: !492)
!531 = !{!503, !383, i64 52}
!532 = !DILocation(line: 215, column: 29, scope: !492)
!533 = !DILocation(line: 215, column: 51, scope: !492)
!534 = !{!503, !404, i64 12}
!535 = !DILocation(line: 216, column: 29, scope: !492)
!536 = !DILocation(line: 216, column: 44, scope: !492)
!537 = !DILocation(line: 217, column: 17, scope: !492)
!538 = !DILocation(line: 227, column: 26, scope: !489)
!539 = !DILocation(line: 228, column: 26, scope: !489)
!540 = !DILocation(line: 229, column: 18, scope: !541)
!541 = distinct !DILexicalBlock(scope: !489, file: !3, line: 229, column: 17)
!542 = !DILocation(line: 229, column: 17, scope: !489)
!543 = !DILocation(line: 232, column: 58, scope: !489)
!544 = !DILocation(line: 232, column: 36, scope: !489)
!545 = !DILocation(line: 232, column: 56, scope: !489)
!546 = !DILocation(line: 233, column: 52, scope: !489)
!547 = !DILocation(line: 233, column: 36, scope: !489)
!548 = !DILocation(line: 233, column: 50, scope: !489)
!549 = !DILocation(line: 234, column: 13, scope: !489)
!550 = !DILocation(line: 238, column: 13, scope: !489)
!551 = !DILocation(line: 239, column: 26, scope: !489)
!552 = !DILocation(line: 240, column: 26, scope: !489)
!553 = !DILocation(line: 241, column: 18, scope: !554)
!554 = distinct !DILexicalBlock(scope: !489, file: !3, line: 241, column: 17)
!555 = !DILocation(line: 241, column: 17, scope: !489)
!556 = !DILocation(line: 245, column: 36, scope: !489)
!557 = !DILocation(line: 245, column: 47, scope: !489)
!558 = !DILocation(line: 246, column: 25, scope: !489)
!559 = !DILocation(line: 246, column: 49, scope: !489)
!560 = !{!503, !404, i64 20}
!561 = !DILocation(line: 247, column: 25, scope: !489)
!562 = !DILocation(line: 247, column: 31, scope: !489)
!563 = !DILocation(line: 248, column: 13, scope: !489)
!564 = !DILocation(line: 251, column: 26, scope: !489)
!565 = !DILocation(line: 252, column: 26, scope: !489)
!566 = !DILocation(line: 253, column: 18, scope: !567)
!567 = distinct !DILexicalBlock(scope: !489, file: !3, line: 253, column: 17)
!568 = !DILocation(line: 253, column: 17, scope: !489)
!569 = !DILocation(line: 256, column: 13, scope: !570)
!570 = distinct !DILexicalBlock(scope: !489, file: !3, line: 256, column: 13)
!571 = !DILocation(line: 256, column: 13, scope: !489)
!572 = !DILocation(line: 256, column: 13, scope: !573)
!573 = !DILexicalBlockFile(scope: !570, file: !3, discriminator: 1)
!574 = !DILocation(line: 257, column: 25, scope: !489)
!575 = !DILocation(line: 257, column: 42, scope: !489)
!576 = !{!503, !404, i64 16}
!577 = !DILocation(line: 258, column: 13, scope: !489)
!578 = !DILocation(line: 260, column: 26, scope: !489)
!579 = !DILocation(line: 261, column: 26, scope: !489)
!580 = !DILocation(line: 262, column: 18, scope: !581)
!581 = distinct !DILexicalBlock(scope: !489, file: !3, line: 262, column: 17)
!582 = !DILocation(line: 262, column: 17, scope: !489)
!583 = !DILocation(line: 265, column: 25, scope: !489)
!584 = !DILocation(line: 265, column: 42, scope: !489)
!585 = !DILocation(line: 266, column: 49, scope: !489)
!586 = !DILocation(line: 266, column: 25, scope: !489)
!587 = !DILocation(line: 266, column: 47, scope: !489)
!588 = !DILocation(line: 267, column: 13, scope: !589)
!589 = distinct !DILexicalBlock(scope: !489, file: !3, line: 267, column: 13)
!590 = !DILocation(line: 267, column: 13, scope: !489)
!591 = !DILocation(line: 267, column: 13, scope: !592)
!592 = !DILexicalBlockFile(scope: !589, file: !3, discriminator: 1)
!593 = !DILocation(line: 268, column: 13, scope: !489)
!594 = !DILocation(line: 269, column: 13, scope: !489)
!595 = !DILocation(line: 271, column: 26, scope: !489)
!596 = !DILocation(line: 272, column: 26, scope: !489)
!597 = !DILocation(line: 273, column: 18, scope: !598)
!598 = distinct !DILexicalBlock(scope: !489, file: !3, line: 273, column: 17)
!599 = !DILocation(line: 273, column: 17, scope: !489)
!600 = !DILocation(line: 276, column: 13, scope: !601)
!601 = distinct !DILexicalBlock(scope: !489, file: !3, line: 276, column: 13)
!602 = !DILocation(line: 276, column: 13, scope: !489)
!603 = !DILocation(line: 276, column: 13, scope: !604)
!604 = !DILexicalBlockFile(scope: !601, file: !3, discriminator: 1)
!605 = !DILocation(line: 277, column: 25, scope: !489)
!606 = !DILocation(line: 277, column: 42, scope: !489)
!607 = !DILocation(line: 278, column: 25, scope: !489)
!608 = !DILocation(line: 278, column: 47, scope: !489)
!609 = !DILocation(line: 279, column: 13, scope: !489)
!610 = !DILocation(line: 280, column: 13, scope: !489)
!611 = !DILocation(line: 282, column: 26, scope: !612)
!612 = distinct !DILexicalBlock(scope: !489, file: !3, line: 281, column: 45)
!613 = !DILocation(line: 283, column: 26, scope: !612)
!614 = !DILocation(line: 284, column: 18, scope: !615)
!615 = distinct !DILexicalBlock(scope: !612, file: !3, line: 284, column: 17)
!616 = !DILocation(line: 284, column: 17, scope: !612)
!617 = !DILocation(line: 287, column: 49, scope: !612)
!618 = !DILocation(line: 287, column: 36, scope: !612)
!619 = !DILocation(line: 287, column: 47, scope: !612)
!620 = !DILocation(line: 288, column: 13, scope: !612)
!621 = !DILocation(line: 289, column: 13, scope: !612)
!622 = !DILocation(line: 298, column: 1, scope: !623)
!623 = !DILexicalBlockFile(scope: !467, file: !3, discriminator: 1)
!624 = distinct !DISubprogram(name: "att_packet_handler", scope: !3, file: !3, line: 562, type: !468, isLocal: true, isDefinition: true, scopeLine: 563, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !625)
!625 = !{!626, !627, !628, !629, !630, !631}
!626 = !DILocalVariable(name: "packet_type", arg: 1, scope: !624, file: !3, line: 562, type: !218)
!627 = !DILocalVariable(name: "handle", arg: 2, scope: !624, file: !3, line: 562, type: !225)
!628 = !DILocalVariable(name: "packet", arg: 3, scope: !624, file: !3, line: 562, type: !424)
!629 = !DILocalVariable(name: "size", arg: 4, scope: !624, file: !3, line: 562, type: !225)
!630 = !DILocalVariable(name: "att_server", scope: !624, file: !3, line: 565, type: !349)
!631 = !DILocalVariable(name: "att_handle", scope: !632, file: !3, line: 587, type: !225)
!632 = distinct !DILexicalBlock(scope: !633, file: !3, line: 585, column: 96)
!633 = distinct !DILexicalBlock(scope: !634, file: !3, line: 585, column: 13)
!634 = distinct !DILexicalBlock(scope: !624, file: !3, line: 567, column: 26)
!635 = !DILocation(line: 562, column: 40, scope: !624)
!636 = !DILocation(line: 562, column: 62, scope: !624)
!637 = !DILocation(line: 562, column: 79, scope: !624)
!638 = !DILocation(line: 562, column: 96, scope: !624)
!639 = !DILocation(line: 567, column: 5, scope: !624)
!640 = !DILocation(line: 570, column: 13, scope: !641)
!641 = distinct !DILexicalBlock(scope: !634, file: !3, line: 570, column: 13)
!642 = !DILocation(line: 570, column: 23, scope: !641)
!643 = !DILocation(line: 501, column: 10, scope: !644, inlinedAt: !667)
!644 = distinct !DILexicalBlock(scope: !645, file: !3, line: 501, column: 9)
!645 = distinct !DISubprogram(name: "att_server_handle_can_send_now", scope: !3, file: !3, line: 499, type: !646, isLocal: true, isDefinition: true, scopeLine: 500, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !648)
!646 = !DISubroutineType(types: !647)
!647 = !{null}
!648 = !{!649, !658, !660, !661, !664, !666}
!649 = !DILocalVariable(name: "it", scope: !645, file: !3, line: 507, type: !650)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_list_iterator_t", file: !202, line: 102, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_linked_list_iterator_t", file: !202, line: 65, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !202, line: 61, size: 96, elements: !653)
!653 = !{!654, !655, !657}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "advance_on_next", scope: !652, file: !202, line: 62, baseType: !208, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !652, file: !202, line: 63, baseType: !656, size: 32, offset: 32)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !652, file: !202, line: 64, baseType: !656, size: 32, offset: 64)
!658 = !DILocalVariable(name: "connection", scope: !659, file: !3, line: 510, type: !209)
!659 = distinct !DILexicalBlock(scope: !645, file: !3, line: 509, column: 48)
!660 = !DILocalVariable(name: "att_server", scope: !659, file: !3, line: 511, type: !349)
!661 = !DILocalVariable(name: "sent", scope: !662, file: !3, line: 519, type: !208)
!662 = distinct !DILexicalBlock(scope: !663, file: !3, line: 516, column: 77)
!663 = distinct !DILexicalBlock(scope: !659, file: !3, line: 516, column: 13)
!664 = !DILocalVariable(name: "client", scope: !665, file: !3, line: 541, type: !339)
!665 = distinct !DILexicalBlock(scope: !645, file: !3, line: 539, column: 62)
!666 = !DILocalVariable(name: "con_handle", scope: !665, file: !3, line: 542, type: !224)
!667 = distinct !DILocation(line: 573, column: 9, scope: !634)
!668 = !DILocation(line: 570, column: 13, scope: !634)
!669 = !DILocation(line: 507, column: 5, scope: !645, inlinedAt: !667)
!670 = !DILocation(line: 507, column: 28, scope: !645, inlinedAt: !667)
!671 = !DILocation(line: 508, column: 5, scope: !645, inlinedAt: !667)
!672 = !DILocation(line: 509, column: 12, scope: !673, inlinedAt: !667)
!673 = !DILexicalBlockFile(scope: !645, file: !3, discriminator: 1)
!674 = !DILocation(line: 509, column: 5, scope: !673, inlinedAt: !667)
!675 = !DILocation(line: 539, column: 13, scope: !673, inlinedAt: !667)
!676 = !DILocation(line: 510, column: 67, scope: !659, inlinedAt: !667)
!677 = !DILocation(line: 511, column: 49, scope: !659, inlinedAt: !667)
!678 = !DILocation(line: 511, column: 23, scope: !659, inlinedAt: !667)
!679 = !DILocation(line: 512, column: 25, scope: !680, inlinedAt: !667)
!680 = distinct !DILexicalBlock(scope: !659, file: !3, line: 512, column: 13)
!681 = !DILocation(line: 512, column: 13, scope: !680, inlinedAt: !667)
!682 = !DILocation(line: 512, column: 13, scope: !659, inlinedAt: !667)
!683 = distinct !{!683, !684, !685}
!684 = !DILocation(line: 509, column: 5, scope: !645)
!685 = !DILocation(line: 537, column: 5, scope: !645)
!686 = !DILocation(line: 516, column: 25, scope: !663, inlinedAt: !667)
!687 = !DILocation(line: 516, column: 31, scope: !663, inlinedAt: !667)
!688 = !DILocation(line: 516, column: 13, scope: !659, inlinedAt: !667)
!689 = !DILocation(line: 518, column: 13, scope: !690, inlinedAt: !667)
!690 = distinct !DILexicalBlock(scope: !662, file: !3, line: 518, column: 13)
!691 = !DILocation(line: 518, column: 13, scope: !662, inlinedAt: !667)
!692 = !DILocation(line: 518, column: 13, scope: !693, inlinedAt: !667)
!693 = !DILexicalBlockFile(scope: !690, file: !3, discriminator: 1)
!694 = !DILocalVariable(name: "att_server", arg: 1, scope: !695, file: !3, line: 388, type: !349)
!695 = distinct !DISubprogram(name: "att_server_process_validated_request", scope: !3, file: !3, line: 388, type: !696, isLocal: true, isDefinition: true, scopeLine: 389, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !698)
!696 = !DISubroutineType(types: !697)
!697 = !{!208, !349}
!698 = !{!694, !699, !700}
!699 = !DILocalVariable(name: "att_response_buffer", scope: !695, file: !3, line: 392, type: !424)
!700 = !DILocalVariable(name: "att_response_size", scope: !695, file: !3, line: 393, type: !225)
!701 = !DILocation(line: 388, column: 63, scope: !695, inlinedAt: !702)
!702 = distinct !DILocation(line: 519, column: 24, scope: !662, inlinedAt: !667)
!703 = !DILocation(line: 391, column: 5, scope: !695, inlinedAt: !702)
!704 = !DILocation(line: 392, column: 36, scope: !695, inlinedAt: !702)
!705 = !DILocation(line: 392, column: 14, scope: !695, inlinedAt: !702)
!706 = !DILocation(line: 393, column: 69, scope: !695, inlinedAt: !702)
!707 = !DILocation(line: 393, column: 81, scope: !695, inlinedAt: !702)
!708 = !DILocation(line: 393, column: 121, scope: !695, inlinedAt: !702)
!709 = !{!503, !443, i64 54}
