temp.o:	file format ELF32-i386

.debug_info contents:
0x00000000: Compile Unit: length = 0x000003a5 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x000003a9)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)")
              DW_AT_language	(DW_LANG_C99)
              DW_AT_name	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_dispatch.c")
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
              DW_AT_GNU_pubnames	(true)
              DW_AT_low_pc	(0x0000000000000000)
              DW_AT_high_pc	(0x00000000000003d6)

0x00000026:   DW_TAG_variable
                DW_AT_name	("app_info_debug_enable")
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/profile_stack_debug.h")
                DW_AT_decl_line	(190)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000037:   DW_TAG_base_type
                DW_AT_name	("int")
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_byte_size	(0x04)

0x0000003e:   DW_TAG_variable
                DW_AT_name	("att_global_info")
                DW_AT_type	(cu + 0x004f "att_info_t")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_dispatch.c")
                DW_AT_decl_line	(70)
                DW_AT_location	(DW_OP_addr 0x0)

0x0000004f:   DW_TAG_typedef
                DW_AT_type	(cu + 0x005a "structure ")
                DW_AT_name	("att_info_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_dispatch.h")
                DW_AT_decl_line	(82)

0x0000005a:   DW_TAG_structure_type
                DW_AT_byte_size	(0x3c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_dispatch.h")
                DW_AT_decl_line	(56)

0x0000005e:     DW_TAG_member
                  DW_AT_name	("att_client_handler")
                  DW_AT_type	(cu + 0x0158 "btstack_packet_handler_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_dispatch.h")
                  DW_AT_decl_line	(58)
                  DW_AT_data_member_location	(0x00)

0x0000006a:     DW_TAG_member
                  DW_AT_name	("att_server_handler")
                  DW_AT_type	(cu + 0x0158 "btstack_packet_handler_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_dispatch.h")
                  DW_AT_decl_line	(59)
                  DW_AT_data_member_location	(0x04)

0x00000076:     DW_TAG_member
                  DW_AT_name	("att_client_waiting_for_can_send")
                  DW_AT_type	(cu + 0x017e "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_dispatch.h")
                  DW_AT_decl_line	(60)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x07)
                  DW_AT_data_member_location	(0x08)

0x00000085:     DW_TAG_member
                  DW_AT_name	("att_server_waiting_for_can_send")
                  DW_AT_type	(cu + 0x017e "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_dispatch.h")
                  DW_AT_decl_line	(61)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x06)
                  DW_AT_data_member_location	(0x08)

0x00000094:     DW_TAG_member
                  DW_AT_name	("att_can_send_doing")
                  DW_AT_type	(cu + 0x017e "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_dispatch.h")
                  DW_AT_decl_line	(62)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x05)
                  DW_AT_data_member_location	(0x08)

0x000000a3:     DW_TAG_member
                  DW_AT_name	("att_bits_reserverd")
                  DW_AT_type	(cu + 0x017e "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_dispatch.h")
                  DW_AT_decl_line	(63)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x05)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x08)

0x000000b2:     DW_TAG_member
                  DW_AT_name	("att_db")
                  DW_AT_type	(cu + 0x01a7 "const uint8_t*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_dispatch.h")
                  DW_AT_decl_line	(66)
                  DW_AT_data_member_location	(0x0c)

0x000000be:     DW_TAG_member
                  DW_AT_name	("att_read_callback")
                  DW_AT_type	(cu + 0x01b1 "att_read_callback_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_dispatch.h")
                  DW_AT_decl_line	(67)
                  DW_AT_data_member_location	(0x10)

0x000000ca:     DW_TAG_member
                  DW_AT_name	("att_write_callback")
                  DW_AT_type	(cu + 0x01e0 "att_write_callback_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_dispatch.h")
                  DW_AT_decl_line	(68)
                  DW_AT_data_member_location	(0x14)

0x000000d6:     DW_TAG_member
                  DW_AT_name	("att_prepare_write_error_code")
                  DW_AT_type	(cu + 0x017e "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_dispatch.h")
                  DW_AT_decl_line	(69)
                  DW_AT_data_member_location	(0x18)

0x000000e2:     DW_TAG_member
                  DW_AT_name	("att_prepare_write_error_handle")
                  DW_AT_type	(cu + 0x0190 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_dispatch.h")
                  DW_AT_decl_line	(70)
                  DW_AT_data_member_location	(0x1a)

0x000000ee:     DW_TAG_member
                  DW_AT_name	("service_handlers")
                  DW_AT_type	(cu + 0x0214 "linked_list_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_dispatch.h")
                  DW_AT_decl_line	(71)
                  DW_AT_data_member_location	(0x1c)

0x000000fa:     DW_TAG_member
                  DW_AT_name	("hci_event_callback_registration")
                  DW_AT_type	(cu + 0x0249 "btstack_packet_callback_registration_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_dispatch.h")
                  DW_AT_decl_line	(74)
                  DW_AT_data_member_location	(0x20)

0x00000106:     DW_TAG_member
                  DW_AT_name	("sm_event_callback_registration")
                  DW_AT_type	(cu + 0x0249 "btstack_packet_callback_registration_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_dispatch.h")
                  DW_AT_decl_line	(75)
                  DW_AT_data_member_location	(0x28)

0x00000112:     DW_TAG_member
                  DW_AT_name	("server_packet_handler")
                  DW_AT_type	(cu + 0x0158 "btstack_packet_handler_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_dispatch.h")
                  DW_AT_decl_line	(76)
                  DW_AT_data_member_location	(0x30)

0x0000011e:     DW_TAG_member
                  DW_AT_name	("can_send_now_server")
                  DW_AT_type	(cu + 0x0214 "linked_list_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_dispatch.h")
                  DW_AT_decl_line	(77)
                  DW_AT_data_member_location	(0x34)

0x0000012a:     DW_TAG_member
                  DW_AT_name	("server_wait_for_can_send")
                  DW_AT_type	(cu + 0x017e "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_dispatch.h")
                  DW_AT_decl_line	(78)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x07)
                  DW_AT_data_member_location	(0x38)

0x00000139:     DW_TAG_member
                  DW_AT_name	("server_flow_enable")
                  DW_AT_type	(cu + 0x017e "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_dispatch.h")
                  DW_AT_decl_line	(79)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x06)
                  DW_AT_data_member_location	(0x38)

0x00000148:     DW_TAG_member
                  DW_AT_name	("server_bits_reserverd")
                  DW_AT_type	(cu + 0x017e "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_dispatch.h")
                  DW_AT_decl_line	(80)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x06)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x38)

0x00000157:     NULL

0x00000158:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0163 "subroutine *")
                DW_AT_name	("btstack_packet_handler_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(58)

0x00000163:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0168 "subroutine ")

0x00000168:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x00000169:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x017e "uint8_t")

0x0000016e:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0190 "uint16_t")

0x00000173:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x01a2 "uint8_t*")

0x00000178:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0190 "uint16_t")

0x0000017d:     NULL

0x0000017e:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0189 "unsigned char")
                DW_AT_name	("uint8_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(44)

0x00000189:   DW_TAG_base_type
                DW_AT_name	("unsigned char")
                DW_AT_encoding	(DW_ATE_unsigned_char)
                DW_AT_byte_size	(0x01)

0x00000190:   DW_TAG_typedef
                DW_AT_type	(cu + 0x019b "unsigned short")
                DW_AT_name	("uint16_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(46)

0x0000019b:   DW_TAG_base_type
                DW_AT_name	("unsigned short")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x02)

0x000001a2:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x017e "uint8_t")

0x000001a7:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x01ac "const uint8_t")

0x000001ac:   DW_TAG_const_type
                DW_AT_type	(cu + 0x017e "uint8_t")

0x000001b1:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01bc "subroutine uint16_t*")
                DW_AT_name	("att_read_callback_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/le/att.h")
                DW_AT_decl_line	(116)

0x000001bc:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x01c1 "subroutine uint16_t")

0x000001c1:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0190 "uint16_t")
                DW_AT_prototyped	(true)

0x000001c6:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0190 "uint16_t")

0x000001cb:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0190 "uint16_t")

0x000001d0:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0190 "uint16_t")

0x000001d5:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x01a2 "uint8_t*")

0x000001da:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0190 "uint16_t")

0x000001df:     NULL

0x000001e0:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01eb "subroutine int*")
                DW_AT_name	("att_write_callback_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/le/att.h")
                DW_AT_decl_line	(127)

0x000001eb:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x01f0 "subroutine int")

0x000001f0:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_prototyped	(true)

0x000001f5:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0190 "uint16_t")

0x000001fa:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0190 "uint16_t")

0x000001ff:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0190 "uint16_t")

0x00000204:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0190 "uint16_t")

0x00000209:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x01a2 "uint8_t*")

0x0000020e:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0190 "uint16_t")

0x00000213:     NULL

0x00000214:   DW_TAG_typedef
                DW_AT_type	(cu + 0x021f "btstack_linked_item_t*")
                DW_AT_name	("linked_list_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(101)

0x0000021f:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0224 "btstack_linked_item_t")

0x00000224:   DW_TAG_typedef
                DW_AT_type	(cu + 0x022f "btstack_linked_item")
                DW_AT_name	("btstack_linked_item_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(55)

0x0000022f:   DW_TAG_structure_type
                DW_AT_name	("btstack_linked_item")
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(53)

0x00000237:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(cu + 0x0244 "btstack_linked_item*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                  DW_AT_decl_line	(54)
                  DW_AT_data_member_location	(0x00)

0x00000243:     NULL

0x00000244:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x022f "btstack_linked_item")

0x00000249:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0254 "structure ")
                DW_AT_name	("btstack_packet_callback_registration_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(64)

0x00000254:   DW_TAG_structure_type
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(61)

0x00000258:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x0271 "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                  DW_AT_decl_line	(62)
                  DW_AT_data_member_location	(0x00)

0x00000264:     DW_TAG_member
                  DW_AT_name	("callback")
                  DW_AT_type	(cu + 0x0158 "btstack_packet_handler_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                  DW_AT_decl_line	(63)
                  DW_AT_data_member_location	(0x04)

0x00000270:     NULL

0x00000271:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0224 "btstack_linked_item_t")
                DW_AT_name	("linked_item_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(100)

0x0000027c:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000000)
                DW_AT_high_pc	(0x0000000000000036)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("att_global_info_init")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_dispatch.c")
                DW_AT_decl_line	(74)
                DW_AT_prototyped	(true)
                DW_AT_external	(true)

0x0000028d:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000036)
                DW_AT_high_pc	(0x000000000000005d)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("att_dispatch_register_client")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_dispatch.c")
                DW_AT_decl_line	(144)
                DW_AT_prototyped	(true)
                DW_AT_external	(true)

0x0000029e:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000000
                     0x0000000000000036 - 0x0000000000000046: DW_OP_reg0 EAX)
                  DW_AT_name	("packet_handler")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_dispatch.c")
                  DW_AT_decl_line	(144)
                  DW_AT_type	(cu + 0x0158 "btstack_packet_handler_t")

0x000002ad:     NULL

0x000002ae:   DW_TAG_subprogram
                DW_AT_low_pc	(0x000000000000005d)
                DW_AT_high_pc	(0x0000000000000305)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("att_packet_handler")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_dispatch.c")
                DW_AT_decl_line	(79)
                DW_AT_prototyped	(true)

0x000002bf:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000013
                     0x000000000000005d - 0x0000000000000087: DW_OP_reg3 EBX
                     0x0000000000000087 - 0x0000000000000305: DW_OP_breg5 EBP-23)
                  DW_AT_name	("packet_type")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_dispatch.c")
                  DW_AT_decl_line	(79)
                  DW_AT_type	(cu + 0x017e "uint8_t")

0x000002ce:     DW_TAG_formal_parameter
                  DW_AT_name	("handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_dispatch.c")
                  DW_AT_decl_line	(79)
                  DW_AT_type	(cu + 0x0190 "uint16_t")

0x000002d9:     DW_TAG_formal_parameter
                  DW_AT_name	("packet")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_dispatch.c")
                  DW_AT_decl_line	(79)
                  DW_AT_type	(cu + 0x01a2 "uint8_t*")

0x000002e4:     DW_TAG_formal_parameter
                  DW_AT_name	("size")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_dispatch.c")
                  DW_AT_decl_line	(79)
                  DW_AT_type	(cu + 0x0190 "uint16_t")

0x000002ef:     NULL

0x000002f0:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000305)
                DW_AT_high_pc	(0x000000000000032c)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("att_dispatch_register_server")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_dispatch.c")
                DW_AT_decl_line	(154)
                DW_AT_prototyped	(true)
                DW_AT_external	(true)

0x00000301:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000032
                     0x0000000000000305 - 0x0000000000000315: DW_OP_reg0 EAX)
                  DW_AT_name	("packet_handler")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_dispatch.c")
                  DW_AT_decl_line	(154)
                  DW_AT_type	(cu + 0x0158 "btstack_packet_handler_t")

0x00000310:     NULL

0x00000311:   DW_TAG_subprogram
                DW_AT_low_pc	(0x000000000000032c)
                DW_AT_high_pc	(0x000000000000034e)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("att_dispatch_client_can_send_now")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_dispatch.c")
                DW_AT_decl_line	(164)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)

0x00000326:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000045
                     0x000000000000032c - 0x0000000000000349: DW_OP_reg0 EAX)
                  DW_AT_name	("con_handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_dispatch.c")
                  DW_AT_decl_line	(164)
                  DW_AT_type	(cu + 0x039d "hci_con_handle_t")

0x00000335:     NULL

0x00000336:   DW_TAG_subprogram
                DW_AT_low_pc	(0x000000000000034e)
                DW_AT_high_pc	(0x0000000000000370)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("att_dispatch_server_can_send_now")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_dispatch.c")
                DW_AT_decl_line	(173)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)

0x0000034b:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000058
                     0x000000000000034e - 0x000000000000036b: DW_OP_reg0 EAX)
                  DW_AT_name	("con_handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_dispatch.c")
                  DW_AT_decl_line	(173)
                  DW_AT_type	(cu + 0x039d "hci_con_handle_t")

0x0000035a:     NULL

0x0000035b:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000370)
                DW_AT_high_pc	(0x00000000000003a3)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("att_dispatch_client_request_can_send_now_event")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_dispatch.c")
                DW_AT_decl_line	(184)
                DW_AT_prototyped	(true)
                DW_AT_external	(true)

0x0000036c:     DW_TAG_formal_parameter
                  DW_AT_location	(0x0000006b
                     0x0000000000000370 - 0x000000000000039d: DW_OP_reg0 EAX)
                  DW_AT_name	("con_handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_dispatch.c")
                  DW_AT_decl_line	(184)
                  DW_AT_type	(cu + 0x039d "hci_con_handle_t")

0x0000037b:     NULL

0x0000037c:   DW_TAG_subprogram
                DW_AT_low_pc	(0x00000000000003a3)
                DW_AT_high_pc	(0x00000000000003d6)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("att_dispatch_server_request_can_send_now_event")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_dispatch.c")
                DW_AT_decl_line	(196)
                DW_AT_prototyped	(true)
                DW_AT_external	(true)

0x0000038d:     DW_TAG_formal_parameter
                  DW_AT_location	(0x0000007e
                     0x00000000000003a3 - 0x00000000000003d0: DW_OP_reg0 EAX)
                  DW_AT_name	("con_handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_dispatch.c")
                  DW_AT_decl_line	(196)
                  DW_AT_type	(cu + 0x039d "hci_con_handle_t")

0x0000039c:     NULL

0x0000039d:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0190 "uint16_t")
                DW_AT_name	("hci_con_handle_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h")
                DW_AT_decl_line	(9)

0x000003a8:   NULL
