temp.o:	file format ELF32-i386

.debug_info contents:
0x00000000: Compile Unit: length = 0x00001481 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x00001485)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)")
              DW_AT_language	(DW_LANG_C99)
              DW_AT_name	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
              DW_AT_GNU_pubnames	(true)
              DW_AT_low_pc	(0x0000000000000000)
              DW_AT_ranges	(0x00000088
                 [0x00000000 - 0x000018bf)
                 [0x000018bf - 0x000018eb)
                 [0x000018eb - 0x000019b3)
                 [0x00000000 - 0x00000080)
                 [0x00000080 - 0x000000c5))

0x00000026:   DW_TAG_variable
                DW_AT_name	("app_info_debug_enable")
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/profile_stack_debug.h")
                DW_AT_decl_line	(190)

0x0000040c:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_CREATE_CONN_CANCEL")
                  DW_AT_const_value	(16)

0x00000412:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_ADV_PARAM_EXT")
                  DW_AT_const_value	(17)

0x00000418:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_SEND_TEST_KEY_NUM")
                  DW_AT_const_value	(18)

0x0000041e:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_LATENCY_HOLD_CNT")
                  DW_AT_const_value	(19)

0x00000424:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_SET_DATA_LENGTH")
                  DW_AT_const_value	(20)

0x0000042a:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_SET_HCI_CFG")
                  DW_AT_const_value	(21)

0x00000430:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_SCAN_ENABLE2")
                  DW_AT_const_value	(22)

0x00000436:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_ATT_SERVER_REQ_RESUME")
                  DW_AT_const_value	(23)

0x0000043c:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_MULTI_ATT_SEND_INIT")
                  DW_AT_const_value	(24)

0x00000442:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_MULTI_ATT_SET_CONN_HANDLE")
                  DW_AT_const_value	(25)

0x00000448:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_MULTI_ATT_SEND_DATA")
                  DW_AT_const_value	(26)

0x0000044e:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_MULTI_ATT_MTU_SIZE")
                  DW_AT_const_value	(27)

0x00000454:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_MULTI_ATT_VAILD_LEN")
                  DW_AT_const_value	(28)

0x0000045a:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_SM_REQ_RESUME")
                  DW_AT_const_value	(29)

0x00000460:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_EXT_ADV_PARAM")
                  DW_AT_const_value	(64)

0x00000467:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_EXT_ADV_DATA")
                  DW_AT_const_value	(65)

0x0000046e:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_EXT_RSP_DATA")
                  DW_AT_const_value	(66)

0x00000475:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_EXT_ADV_ENABLE")
                  DW_AT_const_value	(67)

0x0000047c:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_SET_PHY")
                  DW_AT_const_value	(68)

0x00000483:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_EXT_SCAN_PARAM")
                  DW_AT_const_value	(69)

0x0000048a:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_EXT_SCAN_ENABLE")
                  DW_AT_const_value	(70)

0x00000491:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_EXT_CREATE_CONN")
                  DW_AT_const_value	(71)

0x00000498:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_PERIODIC_ADV_PARAM")
                  DW_AT_const_value	(72)

0x0000049f:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_PERIODIC_ADV_DATA")
                  DW_AT_const_value	(73)

0x000004a6:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_PERIODIC_ADV_ENABLE")
                  DW_AT_const_value	(74)

0x000004ad:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_PERIODIC_ADV_CREAT_SYNC")
                  DW_AT_const_value	(75)

0x000004b4:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_SEARCH_PROFILE")
                  DW_AT_const_value	(128)

0x000004bb:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_WRITE_CCC")
                  DW_AT_const_value	(129)

0x000004c2:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_ONNN_PARAM_UPDATA")
                  DW_AT_const_value	(130)

0x000004c9:     NULL

0x000004ca:   DW_TAG_pointer_type

0x000004cb:   DW_TAG_typedef
                DW_AT_type	(cu + 0x04d6 "__uintptr_t")
                DW_AT_name	("uintptr_t")
                DW_AT_decl_file	("/opt/q32s/include/sys/_stdint.h")
                DW_AT_decl_line	(43)

0x000004d6:   DW_TAG_typedef
                DW_AT_type	(cu + 0x04e1 "long unsigned int")
                DW_AT_name	("__uintptr_t")
                DW_AT_decl_file	("/opt/q32s/include/machine/_default_types.h")
                DW_AT_decl_line	(202)

0x000004e1:   DW_TAG_base_type
                DW_AT_name	("long unsigned int")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x04)

0x000004e8:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x04ed "linked_item_t")

0x000004ed:   DW_TAG_typedef
                DW_AT_type	(cu + 0x04f8 "btstack_linked_item_t")
                DW_AT_name	("linked_item_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(100)

0x000004f8:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0503 "btstack_linked_item")
                DW_AT_name	("btstack_linked_item_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(55)

0x00000503:   DW_TAG_structure_type
                DW_AT_name	("btstack_linked_item")
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(53)

0x0000050b:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(cu + 0x0518 "btstack_linked_item*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                  DW_AT_decl_line	(54)
                  DW_AT_data_member_location	(0x00)

0x00000517:     NULL

0x00000518:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0503 "btstack_linked_item")

0x0000051d:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0522 "le_hci_connection_t")

0x00000522:   DW_TAG_typedef
                DW_AT_type	(cu + 0x052e "__le_hci_connection")
                DW_AT_name	("le_hci_connection_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(605)

0x0000052e:   DW_TAG_structure_type
                DW_AT_name	("__le_hci_connection")
                DW_AT_byte_size	(0x04c8)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(571)

0x00000538:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x04ed "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(572)
                  DW_AT_data_member_location	(0x00)

0x00000545:     DW_TAG_member
                  DW_AT_name	("address")
                  DW_AT_type	(cu + 0x0644 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(574)
                  DW_AT_data_member_location	(0x04)

0x00000552:     DW_TAG_member
                  DW_AT_name	("con_handle")
                  DW_AT_type	(cu + 0x0666 "hci_con_handle_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(576)
                  DW_AT_data_member_location	(0x0a)

0x0000055f:     DW_TAG_member
                  DW_AT_name	("address_type")
                  DW_AT_type	(cu + 0x0683 "bd_addr_type_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(578)
                  DW_AT_data_member_location	(0x0c)

0x0000056c:     DW_TAG_member
                  DW_AT_name	("role")
                  DW_AT_type	(cu + 0x065b "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(581)
                  DW_AT_data_member_location	(0x10)

0x00000579:     DW_TAG_member
                  DW_AT_name	("le_con_parameter_update_state")
                  DW_AT_type	(cu + 0x068f "le_con_parameter_update_state_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(584)
                  DW_AT_data_member_location	(0x14)

0x00000586:     DW_TAG_member
                  DW_AT_name	("le_con_param_update_identifier")
                  DW_AT_type	(cu + 0x065b "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(585)
                  DW_AT_data_member_location	(0x18)

0x00000593:     DW_TAG_member
                  DW_AT_name	("le_conn_interval_min")
                  DW_AT_type	(cu + 0x0671 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(586)
                  DW_AT_data_member_location	(0x1a)

0x000005a0:     DW_TAG_member
                  DW_AT_name	("le_conn_interval_max")
                  DW_AT_type	(cu + 0x0671 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(587)
                  DW_AT_data_member_location	(0x1c)

0x000005ad:     DW_TAG_member
                  DW_AT_name	("le_conn_latency")
                  DW_AT_type	(cu + 0x0671 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(588)
                  DW_AT_data_member_location	(0x1e)

0x000005ba:     DW_TAG_member
                  DW_AT_name	("le_supervision_timeout")
                  DW_AT_type	(cu + 0x0671 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(589)
                  DW_AT_data_member_location	(0x20)

0x000005c7:     DW_TAG_member
                  DW_AT_name	("sm_connection")
                  DW_AT_type	(cu + 0x069a "sm_connection_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(592)
                  DW_AT_data_member_location	(0x24)

0x000005d4:     DW_TAG_member
                  DW_AT_name	("att_server")
                  DW_AT_type	(cu + 0x07e2 "att_server_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(595)
                  DW_AT_data_member_location	(0x5c)

0x000005e1:     DW_TAG_member
                  DW_AT_name	("acl_recombination_buffer")
                  DW_AT_type	(cu + 0x0a15 "uint8_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(597)
                  DW_AT_data_member_location	(0x02a0)

0x000005ef:     DW_TAG_member
                  DW_AT_name	("acl_recombination_pos")
                  DW_AT_type	(cu + 0x0671 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(598)
                  DW_AT_data_member_location	(0x04b2)

0x000005fd:     DW_TAG_member
                  DW_AT_name	("acl_recombination_length")
                  DW_AT_type	(cu + 0x0671 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(599)
                  DW_AT_data_member_location	(0x04b4)

0x0000060b:     DW_TAG_member
                  DW_AT_name	("num_acl_packets_sent")
                  DW_AT_type	(cu + 0x065b "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(600)
                  DW_AT_data_member_location	(0x04b6)

0x00000619:     DW_TAG_member
                  DW_AT_name	("own_id_address")
                  DW_AT_type	(cu + 0x0644 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(602)
                  DW_AT_data_member_location	(0x04b7)

0x00000627:     DW_TAG_member
                  DW_AT_name	("own_address")
                  DW_AT_type	(cu + 0x0644 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(603)
                  DW_AT_data_member_location	(0x04bd)

0x00000635:     DW_TAG_member
                  DW_AT_name	("own_address_type")
                  DW_AT_type	(cu + 0x0683 "bd_addr_type_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(604)
                  DW_AT_data_member_location	(0x04c4)

0x00000643:     NULL

0x00000644:   DW_TAG_typedef
                DW_AT_type	(cu + 0x064f "uint8_t[]")
                DW_AT_name	("bd_addr_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h")
                DW_AT_decl_line	(7)

0x0000064f:   DW_TAG_array_type
                DW_AT_type	(cu + 0x065b "uint8_t")

0x00000654:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0073 "sizetype")
                  DW_AT_count	(0x06)

0x0000065a:     NULL

0x0000065b:   DW_TAG_typedef
                DW_AT_type	(cu + 0x006c "unsigned char")
                DW_AT_name	("uint8_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(44)

0x00000666:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0671 "uint16_t")
                DW_AT_name	("hci_con_handle_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h")
                DW_AT_decl_line	(9)

0x00000671:   DW_TAG_typedef
                DW_AT_type	(cu + 0x067c "unsigned short")
                DW_AT_name	("uint16_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(46)

0x0000067c:   DW_TAG_base_type
                DW_AT_name	("unsigned short")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x02)

0x00000683:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00ae "enumeration ")
                DW_AT_name	("bd_addr_type_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(1475)

0x0000068f:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00d5 "enumeration ")
                DW_AT_name	("le_con_parameter_update_state_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(252)

0x0000069a:   DW_TAG_typedef
                DW_AT_type	(cu + 0x06a6 "sm_connection")
                DW_AT_name	("sm_connection_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(475)

0x000006a6:   DW_TAG_structure_type
                DW_AT_name	("sm_connection")
                DW_AT_byte_size	(0x38)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(456)

0x000006af:     DW_TAG_member
                  DW_AT_name	("sm_handle")
                  DW_AT_type	(cu + 0x0666 "hci_con_handle_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(457)
                  DW_AT_data_member_location	(0x00)

0x000006bc:     DW_TAG_member
                  DW_AT_name	("sm_role")
                  DW_AT_type	(cu + 0x065b "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(458)
                  DW_AT_data_member_location	(0x02)

0x000006c9:     DW_TAG_member
                  DW_AT_name	("sm_security_request_received")
                  DW_AT_type	(cu + 0x065b "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(459)
                  DW_AT_data_member_location	(0x03)

0x000006d6:     DW_TAG_member
                  DW_AT_name	("sm_bonding_requested")
                  DW_AT_type	(cu + 0x065b "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(460)
                  DW_AT_data_member_location	(0x04)

0x000006e3:     DW_TAG_member
                  DW_AT_name	("sm_peer_addr_type")
                  DW_AT_type	(cu + 0x065b "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(461)
                  DW_AT_data_member_location	(0x05)

0x000006f0:     DW_TAG_member
                  DW_AT_name	("sm_peer_address")
                  DW_AT_type	(cu + 0x0644 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(462)
                  DW_AT_data_member_location	(0x06)

0x000006fd:     DW_TAG_member
                  DW_AT_name	("sm_engine_state")
                  DW_AT_type	(cu + 0x079a "security_manager_state_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(463)
                  DW_AT_data_member_location	(0x0c)

0x0000070a:     DW_TAG_member
                  DW_AT_name	("sm_irk_lookup_state")
                  DW_AT_type	(cu + 0x07a6 "irk_lookup_state_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(464)
                  DW_AT_data_member_location	(0x10)

0x00000717:     DW_TAG_member
                  DW_AT_name	("sm_connection_encrypted")
                  DW_AT_type	(cu + 0x065b "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(465)
                  DW_AT_data_member_location	(0x14)

0x00000724:     DW_TAG_member
                  DW_AT_name	("sm_connection_authenticated")
                  DW_AT_type	(cu + 0x065b "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(466)
                  DW_AT_data_member_location	(0x15)

0x00000731:     DW_TAG_member
                  DW_AT_name	("sm_actual_encryption_key_size")
                  DW_AT_type	(cu + 0x065b "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(467)
                  DW_AT_data_member_location	(0x16)

0x0000073e:     DW_TAG_member
                  DW_AT_name	("sm_m_preq")
                  DW_AT_type	(cu + 0x07b2 "sm_pairing_packet_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(468)
                  DW_AT_data_member_location	(0x17)

0x0000074b:     DW_TAG_member
                  DW_AT_name	("sm_connection_authorization_state")
                  DW_AT_type	(cu + 0x07ca "authorization_state_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(469)
                  DW_AT_data_member_location	(0x20)

0x00000758:     DW_TAG_member
                  DW_AT_name	("sm_local_ediv")
                  DW_AT_type	(cu + 0x0671 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(470)
                  DW_AT_data_member_location	(0x24)

0x00000765:     DW_TAG_member
                  DW_AT_name	("sm_local_rand")
                  DW_AT_type	(cu + 0x07d6 "uint8_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(471)
                  DW_AT_data_member_location	(0x26)

0x00000772:     DW_TAG_member
                  DW_AT_name	("sm_disconn_reason")
                  DW_AT_type	(cu + 0x065b "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(472)
                  DW_AT_data_member_location	(0x2e)

0x0000077f:     DW_TAG_member
                  DW_AT_name	("sm_le_db_index")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(473)
                  DW_AT_data_member_location	(0x30)

0x0000078c:     DW_TAG_member
                  DW_AT_name	("sm_timeout_id")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(474)
                  DW_AT_data_member_location	(0x34)

0x00000799:     NULL

0x0000079a:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00f8 "enumeration ")
                DW_AT_name	("security_manager_state_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(433)

0x000007a6:   DW_TAG_typedef
                DW_AT_type	(cu + 0x036c "enumeration ")
                DW_AT_name	("irk_lookup_state_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(442)

0x000007b2:   DW_TAG_typedef
                DW_AT_type	(cu + 0x07be "uint8_t[]")
                DW_AT_name	("sm_pairing_packet_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(452)

0x000007be:   DW_TAG_array_type
                DW_AT_type	(cu + 0x065b "uint8_t")

0x000007c3:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0073 "sizetype")
                  DW_AT_count	(0x07)

0x000007c9:     NULL

0x000007ca:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0390 "enumeration ")
                DW_AT_name	("authorization_state_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(450)

0x000007d6:   DW_TAG_array_type
                DW_AT_type	(cu + 0x065b "uint8_t")

0x000007db:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0073 "sizetype")
                  DW_AT_count	(0x08)

0x000007e1:     NULL

0x000007e2:   DW_TAG_typedef
                DW_AT_type	(cu + 0x07ed "structure ")
                DW_AT_name	("att_server_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                DW_AT_decl_line	(187)

0x000007ed:   DW_TAG_structure_type
                DW_AT_byte_size	(0x0244)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                DW_AT_decl_line	(164)

0x000007f2:     DW_TAG_member
                  DW_AT_name	("state")
                  DW_AT_type	(cu + 0x08c8 "att_server_state_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(165)
                  DW_AT_data_member_location	(0x00)

0x000007fe:     DW_TAG_member
                  DW_AT_name	("peer_addr_type")
                  DW_AT_type	(cu + 0x065b "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(167)
                  DW_AT_data_member_location	(0x04)

0x0000080a:     DW_TAG_member
                  DW_AT_name	("peer_address")
                  DW_AT_type	(cu + 0x0644 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(168)
                  DW_AT_data_member_location	(0x05)

0x00000816:     DW_TAG_member
                  DW_AT_name	("ir_le_device_db_index")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(170)
                  DW_AT_data_member_location	(0x0c)

0x00000822:     DW_TAG_member
                  DW_AT_name	("ir_lookup_active")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(171)
                  DW_AT_data_member_location	(0x10)

0x0000082e:     DW_TAG_member
                  DW_AT_name	("value_indication_handle")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(173)
                  DW_AT_data_member_location	(0x14)

0x0000083a:     DW_TAG_member
                  DW_AT_name	("value_indication_timer")
                  DW_AT_type	(cu + 0x08d3 "btstack_timer_source_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(174)
                  DW_AT_data_member_location	(0x18)

0x00000846:     DW_TAG_member
                  DW_AT_name	("connection")
                  DW_AT_type	(cu + 0x0985 "att_connection_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(176)
                  DW_AT_data_member_location	(0x2c)

0x00000852:     DW_TAG_member
                  DW_AT_name	("request_size")
                  DW_AT_type	(cu + 0x0671 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(178)
                  DW_AT_data_member_location	(0x36)

0x0000085e:     DW_TAG_member
                  DW_AT_name	("request_buffer")
                  DW_AT_type	(cu + 0x09ec "uint8_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(179)
                  DW_AT_data_member_location	(0x38)

0x0000086a:     DW_TAG_member
                  DW_AT_name	("flow_hold_flag")
                  DW_AT_type	(cu + 0x065b "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(181)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x07)
                  DW_AT_data_member_location	(0x023d)

0x0000087a:     DW_TAG_member
                  DW_AT_name	("mtu_request_flag")
                  DW_AT_type	(cu + 0x065b "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(182)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x06)
                  DW_AT_data_member_location	(0x023d)

0x0000088a:     DW_TAG_member
                  DW_AT_name	("check_remote_tag")
                  DW_AT_type	(cu + 0x065b "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(183)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x03)
                  DW_AT_bit_offset	(0x03)
                  DW_AT_data_member_location	(0x023d)

0x0000089a:     DW_TAG_member
                  DW_AT_name	("request_busy")
                  DW_AT_type	(cu + 0x065b "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(184)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x02)
                  DW_AT_data_member_location	(0x023d)

0x000008aa:     DW_TAG_member
                  DW_AT_name	("reserverd")
                  DW_AT_type	(cu + 0x065b "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(185)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x023d)

0x000008ba:     DW_TAG_member
                  DW_AT_name	("result_callback")
                  DW_AT_type	(cu + 0x09f9 "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(186)
                  DW_AT_data_member_location	(0x0240)

0x000008c7:     NULL

0x000008c8:   DW_TAG_typedef
                DW_AT_type	(cu + 0x007a "enumeration ")
                DW_AT_name	("att_server_state_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                DW_AT_decl_line	(162)

0x000008d3:   DW_TAG_typedef
                DW_AT_type	(cu + 0x08de "btstack_timer_source")
                DW_AT_name	("btstack_timer_source_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                DW_AT_decl_line	(19)

0x000008de:   DW_TAG_structure_type
                DW_AT_name	("btstack_timer_source")
                DW_AT_byte_size	(0x14)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                DW_AT_decl_line	(7)

0x000008e6:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x04f8 "btstack_linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(8)
                  DW_AT_data_member_location	(0x00)

0x000008f2:     DW_TAG_member
                  DW_AT_name	("timeout")
                  DW_AT_type	(cu + 0x0962 "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(10)
                  DW_AT_data_member_location	(0x04)

0x000008fe:     DW_TAG_member
                  DW_AT_name	("timeout_interval")
                  DW_AT_type	(cu + 0x0962 "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(11)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x10)
                  DW_AT_bit_offset	(0x10)
                  DW_AT_data_member_location	(0x08)

0x0000090d:     DW_TAG_member
                  DW_AT_name	("timer_type")
                  DW_AT_type	(cu + 0x0962 "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(12)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x0c)
                  DW_AT_data_member_location	(0x08)

0x0000091c:     DW_TAG_member
                  DW_AT_name	("timer_tick_overflow")
                  DW_AT_type	(cu + 0x0962 "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(13)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x0b)
                  DW_AT_data_member_location	(0x08)

0x0000092b:     DW_TAG_member
                  DW_AT_name	("loop_flag")
                  DW_AT_type	(cu + 0x0962 "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(14)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x0a)
                  DW_AT_data_member_location	(0x08)

0x0000093a:     DW_TAG_member
                  DW_AT_name	("loop_times")
                  DW_AT_type	(cu + 0x0962 "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(15)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x0a)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x08)

0x00000949:     DW_TAG_member
                  DW_AT_name	("process")
                  DW_AT_type	(cu + 0x0974 "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(17)
                  DW_AT_data_member_location	(0x0c)

0x00000955:     DW_TAG_member
                  DW_AT_name	("context")
                  DW_AT_type	(cu + 0x04ca "*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(18)
                  DW_AT_data_member_location	(0x10)

0x00000961:     NULL

0x00000962:   DW_TAG_typedef
                DW_AT_type	(cu + 0x096d "unsigned int")
                DW_AT_name	("uint32_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(48)

0x0000096d:   DW_TAG_base_type
                DW_AT_name	("unsigned int")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x04)

0x00000974:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0979 "subroutine ")

0x00000979:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x0000097a:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0980 "btstack_timer_source*")

0x0000097f:     NULL

0x00000980:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x08de "btstack_timer_source")

0x00000985:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0990 "att_connection")
                DW_AT_name	("att_connection_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_db.h")
                DW_AT_decl_line	(41)

0x00000990:   DW_TAG_structure_type
                DW_AT_name	("att_connection")
                DW_AT_byte_size	(0x0a)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_db.h")
                DW_AT_decl_line	(34)

0x00000998:     DW_TAG_member
                  DW_AT_name	("con_handle")
                  DW_AT_type	(cu + 0x09e1 "hci_con_handle_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_db.h")
                  DW_AT_decl_line	(35)
                  DW_AT_data_member_location	(0x00)

0x000009a4:     DW_TAG_member
                  DW_AT_name	("mtu")
                  DW_AT_type	(cu + 0x0671 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_db.h")
                  DW_AT_decl_line	(36)
                  DW_AT_data_member_location	(0x02)

0x000009b0:     DW_TAG_member
                  DW_AT_name	("max_mtu")
                  DW_AT_type	(cu + 0x0671 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_db.h")
                  DW_AT_decl_line	(37)
                  DW_AT_data_member_location	(0x04)

0x000009bc:     DW_TAG_member
                  DW_AT_name	("encryption_key_size")
                  DW_AT_type	(cu + 0x065b "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_db.h")
                  DW_AT_decl_line	(38)
                  DW_AT_data_member_location	(0x06)

0x000009c8:     DW_TAG_member
                  DW_AT_name	("authenticated")
                  DW_AT_type	(cu + 0x065b "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_db.h")
                  DW_AT_decl_line	(39)
                  DW_AT_data_member_location	(0x07)

0x000009d4:     DW_TAG_member
                  DW_AT_name	("authorized")
                  DW_AT_type	(cu + 0x065b "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_db.h")
                  DW_AT_decl_line	(40)
                  DW_AT_data_member_location	(0x08)

0x000009e0:     NULL

0x000009e1:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0671 "uint16_t")
                DW_AT_name	("hci_con_handle_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/utils.h")
                DW_AT_decl_line	(60)

0x000009ec:   DW_TAG_array_type
                DW_AT_type	(cu + 0x065b "uint8_t")

0x000009f1:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0073 "sizetype")
                  DW_AT_count	(0x0205)

0x000009f8:     NULL

0x000009f9:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x09fe "subroutine ")

0x000009fe:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x000009ff:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0a0a "u16")

0x00000a04:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0061 "u8")

0x00000a09:     NULL

0x00000a0a:   DW_TAG_typedef
                DW_AT_type	(cu + 0x067c "unsigned short")
                DW_AT_name	("u16")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(46)

0x00000a15:   DW_TAG_array_type
                DW_AT_type	(cu + 0x065b "uint8_t")

0x00000a1a:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0073 "sizetype")
                  DW_AT_count	(0x0211)

0x00000a21:     NULL

0x00000a22:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0a27 "btstack_context_callback_registration_t")

0x00000a27:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0a32 "structure ")
                DW_AT_name	("btstack_context_callback_registration_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(71)

0x00000a32:   DW_TAG_structure_type
                DW_AT_byte_size	(0x0c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(67)

0x00000a36:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x04e8 "linked_item_t*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                  DW_AT_decl_line	(68)
                  DW_AT_data_member_location	(0x00)

0x00000a42:     DW_TAG_member
                  DW_AT_name	("callback")
                  DW_AT_type	(cu + 0x0a5b "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                  DW_AT_decl_line	(69)
                  DW_AT_data_member_location	(0x04)

0x00000a4e:     DW_TAG_member
                  DW_AT_name	("context")
                  DW_AT_type	(cu + 0x04ca "*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                  DW_AT_decl_line	(70)
                  DW_AT_data_member_location	(0x08)

0x00000a5a:     NULL

0x00000a5b:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0a60 "subroutine ")

0x00000a60:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x00000a61:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x04ca "*")

0x00000a66:     NULL

0x00000a67:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x07e2 "att_server_t")

0x00000a6c:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000000)
                DW_AT_high_pc	(0x0000000000000099)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("att_server_set_exchange_mtu")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                DW_AT_decl_line	(344)
                DW_AT_prototyped	(true)
                DW_AT_external	(true)

0x00000a7e:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000000
                     0x0000000000000000 - 0x0000000000000013: DW_OP_reg0 EAX
                     0x0000000000000013 - 0x0000000000000099: DW_OP_breg5 EBP-6)
                  DW_AT_name	("con_handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                  DW_AT_decl_line	(344)
                  DW_AT_type	(cu + 0x0a0a "u16")

0x00000a8e:     DW_TAG_variable
                  DW_AT_location	(0x0000001f
                     0x0000000000000025 - 0x000000000000002b: DW_OP_reg0 EAX
                     0x000000000000002b - 0x0000000000000099: DW_OP_breg5 EBP-12)
                  DW_AT_name	("att_server")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                  DW_AT_decl_line	(346)
                  DW_AT_type	(cu + 0x0a67 "att_server_t*")

0x00000a9e:     NULL

0x00000a9f:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000099)
                DW_AT_high_pc	(0x00000000000000df)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("att_server_for_handle")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                DW_AT_decl_line	(82)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0a67 "att_server_t*")

0x00000ab4:     DW_TAG_formal_parameter
                  DW_AT_location	(0x0000003e
                     0x0000000000000099 - 0x00000000000000af: DW_OP_reg0 EAX
                     0x00000000000000af - 0x00000000000000df: DW_OP_breg5 EBP-2)
                  DW_AT_name	("con_handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                  DW_AT_decl_line	(82)
                  DW_AT_type	(cu + 0x0666 "hci_con_handle_t")

0x00000ac3:     DW_TAG_variable
                  DW_AT_location	(0x0000005d
                     0x00000000000000c9 - 0x00000000000000d7: DW_OP_reg0 EAX)
                  DW_AT_name	("hci_connection")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                  DW_AT_decl_line	(88)
                  DW_AT_type	(cu + 0x051d "le_hci_connection_t*")

0x00000ad2:     NULL

0x00000ad3:   DW_TAG_subprogram
                DW_AT_low_pc	(0x00000000000000df)
                DW_AT_high_pc	(0x00000000000001a2)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("att_server_init")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                DW_AT_decl_line	(650)
                DW_AT_prototyped	(true)
                DW_AT_external	(true)

0x00000ae5:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000070
                     0x00000000000000df - 0x00000000000000fe: DW_OP_reg2 EDX
                     0x00000000000000fe - 0x00000000000001a2: DW_OP_breg5 EBP-12)
                  DW_AT_name	("db")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                  DW_AT_decl_line	(650)
                  DW_AT_type	(cu + 0x13cb "const uint8_t*")

0x00000af5:     DW_TAG_formal_parameter
                  DW_AT_location	(0x0000008f
                     0x00000000000000df - 0x00000000000000fb: DW_OP_reg1 ECX
                     0x00000000000000fb - 0x00000000000001a2: DW_OP_breg5 EBP-8)
                  DW_AT_name	("read_callback")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                  DW_AT_decl_line	(650)
                  DW_AT_type	(cu + 0x13d5 "att_read_callback_t")

0x00000b05:     DW_TAG_formal_parameter
                  DW_AT_location	(0x000000ae
                     0x00000000000000df - 0x00000000000000f8: DW_OP_reg0 EAX
                     0x00000000000000f8 - 0x00000000000001a2: DW_OP_breg5 EBP-4)
                  DW_AT_name	("write_callback")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                  DW_AT_decl_line	(650)
                  DW_AT_type	(cu + 0x1404 "att_write_callback_t")

0x00000b15:     NULL

0x00000b16:   DW_TAG_subprogram
                DW_AT_low_pc	(0x00000000000001a2)
                DW_AT_high_pc	(0x0000000000000530)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("att_event_packet_handler")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                DW_AT_decl_line	(175)
                DW_AT_prototyped	(true)

0x00000b27:     DW_TAG_formal_parameter
                  DW_AT_location	(0x000000cd
                     0x00000000000001a2 - 0x00000000000001c0: DW_OP_reg1 ECX)
                  DW_AT_name	("packet_type")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                  DW_AT_decl_line	(175)
                  DW_AT_type	(cu + 0x065b "uint8_t")

0x00000b36:     DW_TAG_formal_parameter
                  DW_AT_name	("channel")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                  DW_AT_decl_line	(175)
                  DW_AT_type	(cu + 0x0671 "uint16_t")

0x00000b41:     DW_TAG_formal_parameter
                  DW_AT_location	(0x000000e0
                     0x00000000000001a2 - 0x00000000000001c8: DW_OP_reg0 EAX
                     0x00000000000001c8 - 0x0000000000000530: DW_OP_breg5 EBP-12)
                  DW_AT_name	("packet")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                  DW_AT_decl_line	(175)
                  DW_AT_type	(cu + 0x0c48 "uint8_t*")

0x00000b50:     DW_TAG_formal_parameter
                  DW_AT_name	("size")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                  DW_AT_decl_line	(175)
                  DW_AT_type	(cu + 0x0671 "uint16_t")

0x00000b5b:     DW_TAG_variable
                  DW_AT_location	(0x000000ff
                     0x000000000000029d - 0x00000000000002a4: DW_OP_reg0 EAX
                     0x00000000000002a4 - 0x0000000000000344: DW_OP_breg5 EBP-30
                     0x0000000000000344 - 0x000000000000034b: DW_OP_reg0 EAX
                     0x000000000000034b - 0x000000000000035c: DW_OP_breg5 EBP-42
                     0x000000000000035c - 0x00000000000003a8: DW_OP_breg5 EBP-30
                     0x00000000000003a8 - 0x00000000000003b0: DW_OP_reg0 EAX
                     0x00000000000003df - 0x00000000000003e7: DW_OP_reg0 EAX
                     0x000000000000042a - 0x0000000000000432: DW_OP_reg0 EAX
                     0x000000000000049b - 0x00000000000004a3: DW_OP_reg0 EAX
                     0x00000000000004f4 - 0x00000000000004fb: DW_OP_reg0 EAX
                     0x00000000000004fb - 0x000000000000050c: DW_OP_breg5 EBP-86
                     0x000000000000050c - 0x0000000000000530: DW_OP_breg5 EBP-30)
                  DW_AT_name	("con_handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                  DW_AT_decl_line	(186)
                  DW_AT_type	(cu + 0x0666 "hci_con_handle_t")

0x00000b6a:     DW_TAG_variable
                  DW_AT_location	(0x00000191
                     0x00000000000002a9 - 0x00000000000002af: DW_OP_reg0 EAX
                     0x00000000000002af - 0x0000000000000350: DW_OP_breg5 EBP-36
                     0x0000000000000350 - 0x0000000000000356: DW_OP_reg0 EAX
                     0x0000000000000356 - 0x000000000000035c: DW_OP_breg5 EBP-48
                     0x000000000000035c - 0x00000000000003b0: DW_OP_breg5 EBP-36
                     0x00000000000003b0 - 0x00000000000003b6: DW_OP_reg0 EAX
                     0x00000000000003b6 - 0x00000000000003bc: DW_OP_breg5 EBP-56
                     0x00000000000003bc - 0x00000000000003e7: DW_OP_breg5 EBP-36
                     0x00000000000003e7 - 0x00000000000003ed: DW_OP_reg0 EAX
                     0x00000000000003ed - 0x00000000000003f3: DW_OP_breg5 EBP-60
                     0x00000000000003f3 - 0x0000000000000432: DW_OP_breg5 EBP-36
                     0x0000000000000432 - 0x0000000000000438: DW_OP_reg0 EAX
                     0x0000000000000438 - 0x000000000000043e: DW_OP_breg5 EBP-68
                     0x000000000000043e - 0x00000000000004a3: DW_OP_breg5 EBP-36
                     0x00000000000004a3 - 0x00000000000004a9: DW_OP_reg0 EAX
                     0x00000000000004a9 - 0x00000000000004af: DW_OP_breg5 EBP-80
                     0x00000000000004af - 0x0000000000000500: DW_OP_breg5 EBP-36
                     0x0000000000000500 - 0x0000000000000506: DW_OP_reg0 EAX
                     0x0000000000000506 - 0x000000000000050c: DW_OP_breg5 EBP-92
                     0x000000000000050c - 0x0000000000000530: DW_OP_breg5 EBP-36)
                  DW_AT_name	("att_server")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                  DW_AT_decl_line	(185)
                  DW_AT_type	(cu + 0x0a67 "att_server_t*")

0x00000b79:     NULL

0x00000b7a:   DW_TAG_subprogram
                DW_AT_name	("att_server_handle_can_send_now")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                DW_AT_decl_line	(499)
                DW_AT_prototyped	(true)
                DW_AT_inline	(DW_INL_inlined)

0x00000b83:     DW_TAG_variable
                  DW_AT_name	("it")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                  DW_AT_decl_line	(507)
                  DW_AT_type	(cu + 0x0bd2 "linked_list_iterator_t")

0x00000b8f:     DW_TAG_lexical_block

0x00000b90:       DW_TAG_variable
                    DW_AT_name	("att_server")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                    DW_AT_decl_line	(511)
                    DW_AT_type	(cu + 0x0a67 "att_server_t*")

0x00000b9c:       DW_TAG_variable
                    DW_AT_name	("connection")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                    DW_AT_decl_line	(510)
                    DW_AT_type	(cu + 0x051d "le_hci_connection_t*")

0x00000ba8:       DW_TAG_lexical_block

0x00000ba9:         DW_TAG_variable
                      DW_AT_name	("sent")
                      DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                      DW_AT_decl_line	(519)
                      DW_AT_type	(cu + 0x0037 "int")

0x00000bb5:         NULL

0x00000bb6:       NULL

0x00000bb7:     DW_TAG_lexical_block

0x00000bb8:       DW_TAG_variable
                    DW_AT_name	("con_handle")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                    DW_AT_decl_line	(542)
                    DW_AT_type	(cu + 0x0666 "hci_con_handle_t")

0x00000bc4:       DW_TAG_variable
                    DW_AT_name	("client")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                    DW_AT_decl_line	(541)
                    DW_AT_type	(cu + 0x0a22 "btstack_context_callback_registration_t*")

0x00000bd0:       NULL

0x00000bd1:     NULL

0x00000bd2:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0bdd "btstack_linked_list_iterator_t")
                DW_AT_name	("linked_list_iterator_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(102)

0x00000bdd:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0be8 "structure ")
                DW_AT_name	("btstack_linked_list_iterator_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(65)

0x00000be8:   DW_TAG_structure_type
                DW_AT_byte_size	(0x0c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(61)

0x00000bec:     DW_TAG_member
                  DW_AT_name	("advance_on_next")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                  DW_AT_decl_line	(62)
                  DW_AT_data_member_location	(0x00)

0x00000bf8:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(cu + 0x0c11 "btstack_linked_item_t*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                  DW_AT_decl_line	(63)
                  DW_AT_data_member_location	(0x04)

0x00000c04:     DW_TAG_member
                  DW_AT_name	("curr")
                  DW_AT_type	(cu + 0x0c11 "btstack_linked_item_t*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                  DW_AT_decl_line	(64)
                  DW_AT_data_member_location	(0x08)

0x00000c10:     NULL

0x00000c11:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x04f8 "btstack_linked_item_t")

0x00000c16:   DW_TAG_subprogram
                DW_AT_name	("att_server_process_validated_request")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                DW_AT_decl_line	(388)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_inline	(DW_INL_inlined)

0x00000c23:     DW_TAG_formal_parameter
                  DW_AT_name	("att_server")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                  DW_AT_decl_line	(388)
                  DW_AT_type	(cu + 0x0a67 "att_server_t*")

0x00000c2f:     DW_TAG_variable
                  DW_AT_name	("att_response_buffer")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                  DW_AT_decl_line	(392)
                  DW_AT_type	(cu + 0x0c48 "uint8_t*")

0x00000c3b:     DW_TAG_variable
                  DW_AT_name	("att_response_size")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                  DW_AT_decl_line	(393)
                  DW_AT_type	(cu + 0x0671 "uint16_t")

0x00000c47:     NULL

0x00000c48:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x065b "uint8_t")

0x00000c4d:   DW_TAG_subprogram
                DW_AT_name	("att_server_exchange_mtu_request")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                DW_AT_decl_line	(327)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_inline	(DW_INL_inlined)

0x00000c5a:     DW_TAG_formal_parameter
                  DW_AT_name	("att_server")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                  DW_AT_decl_line	(327)
                  DW_AT_type	(cu + 0x0a67 "att_server_t*")

0x00000c66:     DW_TAG_variable
                  DW_AT_name	("request")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                  DW_AT_decl_line	(332)
                  DW_AT_type	(cu + 0x0c48 "uint8_t*")

0x00000c72:     NULL

0x00000c73:   DW_TAG_subprogram
                DW_AT_name	("att_server_check_remote_request")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                DW_AT_decl_line	(366)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_inline	(DW_INL_inlined)

0x00000c80:     DW_TAG_formal_parameter
                  DW_AT_name	("att_server")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                  DW_AT_decl_line	(366)
                  DW_AT_type	(cu + 0x0a67 "att_server_t*")

0x00000c8c:     DW_TAG_variable
                  DW_AT_name	("request")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_server.c")
                  DW_AT_decl_line	(371)
                  DW_AT_type	(cu + 0x0c48 "uint8_t*")

0x00000c98:     DW_TAG_variable
                  DW_AT_name	("cmd_len")
