; ModuleID = 'att_dispatch.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_dispatch.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.att_info_t = type { void (i8, i16, i8*, i16)*, void (i8, i16, i8*, i16)*, i8, i8*, i16 (i16, i16, i16, i8*, i16)*, i32 (i16, i16, i16, i16, i8*, i16)*, i8, i16, %struct.btstack_linked_item*, %struct.btstack_packet_callback_registration_t, %struct.btstack_packet_callback_registration_t, void (i8, i16, i8*, i16)*, %struct.btstack_linked_item*, i8 }
%struct.btstack_packet_callback_registration_t = type { %struct.btstack_linked_item, void (i8, i16, i8*, i16)* }
%struct.btstack_linked_item = type { %struct.btstack_linked_item* }

@app_info_debug_enable = weak hidden local_unnamed_addr global i32 0, align 4, !dbg !0
@att_global_info = hidden local_unnamed_addr global %struct.att_info_t zeroinitializer, section ".ble_att_bss", align 4, !dbg !6

; Function Attrs: nounwind optsize
define hidden void @att_global_info_init() local_unnamed_addr #0 section ".ble_att_code" !dbg !72 {
  tail call void @llvm.memset.p0i8.i32(i8* bitcast (%struct.att_info_t* @att_global_info to i8*), i8 0, i32 60, i32 4, i1 false), !dbg !75
  ret void, !dbg !76
}

; Function Attrs: argmemonly nounwind
declare void @llvm.memset.p0i8.i32(i8* nocapture writeonly, i8, i32, i32, i1) #1

; Function Attrs: nounwind optsize

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "app_info_debug_enable", scope: !2, file: !68, line: 190, type: !43, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5)
!3 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_dispatch.c", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!4 = !{}
!5 = !{!0, !6}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "att_global_info", scope: !2, file: !3, line: 70, type: !8, isLocal: false, isDefinition: true)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_info_t", file: !9, line: 82, baseType: !10)
!9 = !DIFile(filename: "../btstack/Protocol/include/ble/att_dispatch.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 56, size: 480, elements: !11)
!11 = !{!12, !24, !25, !26, !27, !28, !29, !32, !38, !44, !45, !46, !55, !62, !63, !64, !65, !66, !67}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "att_client_handler", scope: !10, file: !9, line: 58, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_packet_handler_t", file: !14, line: 58, baseType: !15)
!14 = !DIFile(filename: "../btcommon/hci_cmds.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 32)
!16 = !DISubroutineType(types: !17)
!17 = !{null, !18, !21, !23, !21}
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !19, line: 44, baseType: !20)
!19 = !DIFile(filename: "../btcommon/typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!20 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !19, line: 46, baseType: !22)
!22 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "att_server_handler", scope: !10, file: !9, line: 59, baseType: !13, size: 32, offset: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "att_client_waiting_for_can_send", scope: !10, file: !9, line: 60, baseType: !18, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "att_server_waiting_for_can_send", scope: !10, file: !9, line: 61, baseType: !18, size: 1, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "att_can_send_doing", scope: !10, file: !9, line: 62, baseType: !18, size: 1, offset: 66, flags: DIFlagBitField, extraData: i64 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "att_bits_reserverd", scope: !10, file: !9, line: 63, baseType: !18, size: 5, offset: 67, flags: DIFlagBitField, extraData: i64 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "att_db", scope: !10, file: !9, line: 66, baseType: !30, size: 32, offset: 96)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "att_read_callback", scope: !10, file: !9, line: 67, baseType: !33, size: 32, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_read_callback_t", file: !34, line: 116, baseType: !35)
!34 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/le/att.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 32)
!36 = !DISubroutineType(types: !37)
!37 = !{!21, !21, !21, !21, !23, !21}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "att_write_callback", scope: !10, file: !9, line: 68, baseType: !39, size: 32, offset: 160)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_write_callback_t", file: !34, line: 127, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 32)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !21, !21, !21, !21, !23, !21}
!43 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "att_prepare_write_error_code", scope: !10, file: !9, line: 69, baseType: !18, size: 8, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "att_prepare_write_error_handle", scope: !10, file: !9, line: 70, baseType: !21, size: 16, offset: 208)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "service_handlers", scope: !10, file: !9, line: 71, baseType: !47, size: 32, offset: 224)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_list_t", file: !48, line: 101, baseType: !49)
!48 = !DIFile(filename: "../btcommon/btstack_linked_list.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_linked_item_t", file: !48, line: 55, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btstack_linked_item", file: !48, line: 53, size: 32, elements: !52)
!52 = !{!53}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !51, file: !48, line: 54, baseType: !54, size: 32)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "hci_event_callback_registration", scope: !10, file: !9, line: 74, baseType: !56, size: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_packet_callback_registration_t", file: !14, line: 64, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 61, size: 64, elements: !58)
!58 = !{!59, !61}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !57, file: !14, line: 62, baseType: !60, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_item_t", file: !48, line: 100, baseType: !50)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !57, file: !14, line: 63, baseType: !13, size: 32, offset: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "sm_event_callback_registration", scope: !10, file: !9, line: 75, baseType: !56, size: 64, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "server_packet_handler", scope: !10, file: !9, line: 76, baseType: !13, size: 32, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "can_send_now_server", scope: !10, file: !9, line: 77, baseType: !47, size: 32, offset: 416)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "server_wait_for_can_send", scope: !10, file: !9, line: 78, baseType: !18, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "server_flow_enable", scope: !10, file: !9, line: 79, baseType: !18, size: 1, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "server_bits_reserverd", scope: !10, file: !9, line: 80, baseType: !18, size: 6, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!68 = !DIFile(filename: "../btcommon/profile_stack_debug.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!69 = !{i32 2, !"Dwarf Version", i32 4}
!70 = !{i32 2, !"Debug Info Version", i32 3}
!71 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!72 = distinct !DISubprogram(name: "att_global_info_init", scope: !3, file: !3, line: 74, type: !73, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !4)
!73 = !DISubroutineType(types: !74)
!74 = !{null}
!75 = !DILocation(line: 76, column: 5, scope: !72)
!76 = !DILocation(line: 77, column: 1, scope: !72)
!77 = distinct !DISubprogram(name: "att_dispatch_register_client", scope: !3, file: !3, line: 144, type: !78, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !80)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !13}
!80 = !{!81}
!81 = !DILocalVariable(name: "packet_handler", arg: 1, scope: !77, file: !3, line: 144, type: !13)
!82 = !DILocation(line: 144, column: 60, scope: !77)
!83 = !DILocation(line: 146, column: 32, scope: !77)
!84 = !{!85, !86, i64 0}
!85 = !{!"", !86, i64 0, !86, i64 4, !87, i64 8, !87, i64 8, !87, i64 8, !87, i64 8, !86, i64 12, !86, i64 16, !86, i64 20, !87, i64 24, !89, i64 26, !86, i64 28, !90, i64 32, !90, i64 40, !86, i64 48, !86, i64 52, !87, i64 56, !87, i64 56, !87, i64 56}
!86 = !{!"any pointer", !87, i64 0}
!87 = !{!"omnipotent char", !88, i64 0}
!88 = !{!"Simple C/C++ TBAA"}
!89 = !{!"short", !87, i64 0}
!90 = !{!"", !91, i64 0, !86, i64 4}
!91 = !{!"btstack_linked_item", !86, i64 0}
!92 = !DILocation(line: 147, column: 5, scope: !77)
!93 = !DILocation(line: 148, column: 1, scope: !77)
!94 = distinct !DISubprogram(name: "att_packet_handler", scope: !3, file: !3, line: 79, type: !16, isLocal: true, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !95)
!95 = !{!96, !97, !98, !99}
!96 = !DILocalVariable(name: "packet_type", arg: 1, scope: !94, file: !3, line: 79, type: !18)
!97 = !DILocalVariable(name: "handle", arg: 2, scope: !94, file: !3, line: 79, type: !21)
!98 = !DILocalVariable(name: "packet", arg: 3, scope: !94, file: !3, line: 79, type: !23)
!99 = !DILocalVariable(name: "size", arg: 4, scope: !94, file: !3, line: 79, type: !21)
!100 = !DILocation(line: 79, column: 40, scope: !94)
!101 = !DILocation(line: 79, column: 62, scope: !94)
!102 = !DILocation(line: 79, column: 79, scope: !94)
!103 = !DILocation(line: 79, column: 96, scope: !94)
!104 = !DILocation(line: 81, column: 5, scope: !94)
!105 = !DILocation(line: 84, column: 13, scope: !106)
!106 = distinct !DILexicalBlock(scope: !107, file: !3, line: 84, column: 13)
!107 = distinct !DILexicalBlock(scope: !94, file: !3, line: 81, column: 26)
!108 = !{!87, !87, i64 0}
!109 = !DILocation(line: 84, column: 23, scope: !106)
!110 = !DILocation(line: 84, column: 13, scope: !107)
!111 = !DILocation(line: 86, column: 26, scope: !112)
!112 = distinct !DILexicalBlock(scope: !113, file: !3, line: 86, column: 17)
!113 = distinct !DILexicalBlock(scope: !106, file: !3, line: 84, column: 28)
!114 = !DILocation(line: 86, column: 18, scope: !112)
!115 = !DILocation(line: 86, column: 17, scope: !113)
!116 = !DILocation(line: 87, column: 29, scope: !117)
!117 = distinct !DILexicalBlock(scope: !118, file: !3, line: 87, column: 21)
!118 = distinct !DILexicalBlock(scope: !112, file: !3, line: 86, column: 46)
!119 = !{!85, !86, i64 4}
!120 = !DILocation(line: 87, column: 21, scope: !117)
!121 = !DILocation(line: 87, column: 21, scope: !118)
