; ModuleID = 'att_send.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/att_send.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.att_ctl_t = type { %struct._cbuffer, %struct.user_send_head_t, [24 x %struct.server_ccc_cfg_t], [8 x %struct.dev_hdl_t], i8*, i16, i8, [6 x i8] }
%struct._cbuffer = type { i8*, i8*, i8*, i8*, i8*, i32, i32, i32, %struct.__spinlock }
%struct.__spinlock = type { i32 }
%struct.user_send_head_t = type { i16, i16, i16 }
%struct.server_ccc_cfg_t = type { i16, i16 }
%struct.dev_hdl_t = type { i16, i16 }

@app_info_debug_enable = weak hidden local_unnamed_addr global i32 0, align 4, !dbg !0
@att_s_hdl = internal unnamed_addr global %struct.att_ctl_t* null, section ".bt_stack_bss", align 4, !dbg !34
@ble_debug_enable = external local_unnamed_addr global i8, align 1
@.str.1 = private unnamed_addr constant [40 x i8] c"[ble-info] :att_send: %04x,%04x,%d,%d\0A\0A\00", align 1
@.str.2 = private unnamed_addr constant [27 x i8] c"[ble-info] :mtu_size: %d\0A\0A\00", align 1
@.str.3 = private unnamed_addr constant [33 x i8] c"ble_err_s:wlen=%d,err=%d,len=%d\0A\00", align 1
@.str.4 = private unnamed_addr constant [40 x i8] c"[ble-info] :att_payload_size[%d]= %d \0A\0A\00", align 1
@.str.5 = private unnamed_addr constant [32 x i8] c"att_send need_size >= %d+%d+%d\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "app_info_debug_enable", scope: !2, file: !108, line: 190, type: !109, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !28, globals: !33)
!3 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/att_send.c", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!4 = !{!5, !17}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 89, size: 32, elements: !7)
!6 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/le/ble_api.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16}
!8 = !DIEnumerator(name: "BLE_CMD_RET_SUCESS", value: 0)
!9 = !DIEnumerator(name: "BLE_CMD_RET_BUSY", value: -100)
!10 = !DIEnumerator(name: "BLE_CMD_PARAM_OVERFLOW", value: -99)
!11 = !DIEnumerator(name: "BLE_CMD_OPT_FAIL", value: -98)
!12 = !DIEnumerator(name: "BLE_BUFFER_FULL", value: -97)
!13 = !DIEnumerator(name: "BLE_BUFFER_ERROR", value: -96)
!14 = !DIEnumerator(name: "BLE_CMD_PARAM_ERROR", value: -95)
!15 = !DIEnumerator(name: "BLE_CMD_STACK_NOT_RUN", value: -94)
!16 = !DIEnumerator(name: "BLE_CMD_CCC_FAIL", value: -93)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !18, line: 45, size: 32, elements: !19)
!18 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/le/att.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27}
!20 = !DIEnumerator(name: "ATT_OP_AUTO_READ_CCC", value: 0)
!21 = !DIEnumerator(name: "ATT_OP_NOTIFY", value: 1)
!22 = !DIEnumerator(name: "ATT_OP_INDICATE", value: 2)
!23 = !DIEnumerator(name: "ATT_OP_READ", value: 3)
!24 = !DIEnumerator(name: "ATT_OP_READ_LONG", value: 4)
!25 = !DIEnumerator(name: "ATT_OP_WRITE", value: 5)
!26 = !DIEnumerator(name: "ATT_OP_WRITE_WITHOUT_RESPOND", value: 6)
!27 = !DIEnumerator(name: "ATT_OP_CMD_MAX", value: 15)
!28 = !{!29, !30}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !31, line: 46, baseType: !32)
!31 = !DIFile(filename: "../btcommon/typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!32 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!33 = !{!0, !34}
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "att_s_hdl", scope: !2, file: !3, line: 63, type: !36, isLocal: true, isDefinition: true)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 32)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_ctl_t", file: !3, line: 60, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 51, size: 1504, elements: !39)
!39 = !{!40, !66, !76, !86, !98, !101, !102, !104}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "user_send_cbuf", scope: !38, file: !3, line: 52, baseType: !41, size: 288)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "cbuffer_t", file: !42, line: 26, baseType: !43)
!42 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/generic/circular_buf.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cbuffer", file: !42, line: 16, size: 288, elements: !44)
!44 = !{!45, !50, !51, !52, !53, !54, !57, !58, !59}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !43, file: !42, line: 17, baseType: !46, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !48, line: 11, baseType: !49)
!48 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!49 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !43, file: !42, line: 18, baseType: !46, size: 32, offset: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !43, file: !42, line: 19, baseType: !46, size: 32, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !43, file: !42, line: 20, baseType: !46, size: 32, offset: 96)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_ptr", scope: !43, file: !42, line: 21, baseType: !46, size: 32, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_len", scope: !43, file: !42, line: 22, baseType: !55, size: 32, offset: 160)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !48, line: 15, baseType: !56)
!56 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !43, file: !42, line: 23, baseType: !55, size: 32, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "total_len", scope: !43, file: !42, line: 24, baseType: !55, size: 32, offset: 224)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !43, file: !42, line: 25, baseType: !60, size: 32, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !61, line: 13, baseType: !62)
!61 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/spinlock.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__spinlock", file: !61, line: 9, size: 32, elements: !63)
!63 = !{!64}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "rwlock", scope: !62, file: !61, line: 10, baseType: !65, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !55)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ready_send_head", scope: !38, file: !3, line: 53, baseType: !67, size: 48, offset: 288)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_send_head_t", file: !68, line: 15, baseType: !69)
!68 = !DIFile(filename: "../User/include/ble/att_send.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 10, size: 48, elements: !70)
!70 = !{!71, !73, !74, !75}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "conn_handle", scope: !69, file: !68, line: 11, baseType: !72, size: 16)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !48, line: 13, baseType: !32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "send_handle", scope: !69, file: !68, line: 12, baseType: !72, size: 16, offset: 16)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "send_len", scope: !69, file: !68, line: 13, baseType: !72, size: 12, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "send_type", scope: !69, file: !68, line: 14, baseType: !72, size: 4, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "client_configuration", scope: !38, file: !3, line: 54, baseType: !77, size: 768, offset: 336)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 768, elements: !84)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "server_ccc_cfg_t", file: !3, line: 41, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 37, size: 32, elements: !80)
!80 = !{!81, !82, !83}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !79, file: !3, line: 38, baseType: !30, size: 16)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !79, file: !3, line: 39, baseType: !30, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 16)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "conn_handle", scope: !79, file: !3, line: 40, baseType: !30, size: 12, offset: 20, flags: DIFlagBitField, extraData: i64 16)
!84 = !{!85}
!85 = !DISubrange(count: 24)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "dev_hdl_ctrl", scope: !38, file: !3, line: 55, baseType: !87, size: 256, offset: 1104)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 256, elements: !96)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_hdl_t", file: !3, line: 49, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 44, size: 32, elements: !90)
!90 = !{!91, !93, !94, !95}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "conn_role", scope: !89, file: !3, line: 45, baseType: !92, size: 2, flags: DIFlagBitField, extraData: i64 0)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !31, line: 46, baseType: !32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "conn_index", scope: !89, file: !3, line: 46, baseType: !92, size: 4, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "conn_handle", scope: !89, file: !3, line: 47, baseType: !92, size: 10, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "att_payload_size", scope: !89, file: !3, line: 48, baseType: !92, size: 16, offset: 16)
!96 = !{!97}
!97 = !DISubrange(count: 8)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "att_send_data", scope: !38, file: !3, line: 56, baseType: !99, size: 32, offset: 1376)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 32)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !31, line: 44, baseType: !49)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "att_sendbuf_size", scope: !38, file: !3, line: 57, baseType: !92, size: 16, offset: 1408)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "send_lock", scope: !38, file: !3, line: 58, baseType: !103, size: 8, offset: 1424)
!103 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !100)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !38, file: !3, line: 59, baseType: !105, size: 48, offset: 1432)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 48, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 6)
!108 = !DIFile(filename: "../btcommon/profile_stack_debug.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !{i32 2, !"Dwarf Version", i32 4}
!111 = !{i32 2, !"Debug Info Version", i32 3}
!112 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!113 = distinct !DISubprogram(name: "att_ccc_config_init", scope: !3, file: !3, line: 135, type: !114, isLocal: false, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !116)
!114 = !DISubroutineType(types: !115)
!115 = !{null}
!116 = !{}
!117 = !DILocation(line: 137, column: 5, scope: !118)
!118 = distinct !DILexicalBlock(scope: !113, file: !3, line: 137, column: 5)
!119 = !{!120, !120, i64 0}
!120 = !{!"any pointer", !121, i64 0}
!121 = !{!"omnipotent char", !122, i64 0}
!122 = !{!"Simple C/C++ TBAA"}
!123 = !DILocation(line: 137, column: 5, scope: !113)
!124 = !DILocation(line: 138, column: 5, scope: !113)
!125 = !DILocation(line: 139, column: 1, scope: !113)
!126 = !DILocation(line: 139, column: 1, scope: !127)
!127 = !DILexicalBlockFile(scope: !113, file: !3, discriminator: 1)
!128 = distinct !DISubprogram(name: "att_set_ccc_config", scope: !3, file: !3, line: 142, type: !129, isLocal: false, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !131)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !30, !30}
!131 = !{!132, !133, !134, !135, !136}
!132 = !DILocalVariable(name: "handle", arg: 1, scope: !128, file: !3, line: 142, type: !30)
!133 = !DILocalVariable(name: "cfg", arg: 2, scope: !128, file: !3, line: 142, type: !30)
!134 = !DILocalVariable(name: "cnt", scope: !128, file: !3, line: 144, type: !109)
!135 = !DILocalVariable(name: "find_handle", scope: !128, file: !3, line: 145, type: !30)
!136 = !DILocalVariable(name: "pt", scope: !128, file: !3, line: 146, type: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 32)
!138 = !DILocation(line: 142, column: 34, scope: !128)
!139 = !DILocation(line: 142, column: 51, scope: !128)
!140 = !DILocation(line: 145, column: 14, scope: !128)
!141 = !DILocation(line: 148, column: 5, scope: !142)
!142 = distinct !DILexicalBlock(scope: !128, file: !3, line: 148, column: 5)
!143 = !DILocation(line: 148, column: 5, scope: !128)
!144 = !DILocation(line: 151, column: 10, scope: !128)
!145 = !DILocation(line: 146, column: 23, scope: !128)
!146 = !DILocation(line: 144, column: 9, scope: !128)
!147 = !DILocation(line: 152, column: 5, scope: !148)
!148 = !DILexicalBlockFile(scope: !149, file: !3, discriminator: 1)
!149 = distinct !DILexicalBlock(scope: !128, file: !3, line: 152, column: 5)
!150 = !DILocation(line: 153, column: 32, scope: !151)
!151 = distinct !DILexicalBlock(scope: !152, file: !3, line: 153, column: 13)
!152 = distinct !DILexicalBlock(scope: !153, file: !3, line: 152, column: 52)
!153 = distinct !DILexicalBlock(scope: !149, file: !3, line: 152, column: 5)
!154 = !{!155, !156, i64 0}
!155 = !{!"", !156, i64 0, !156, i64 2, !156, i64 2}
!156 = !{!"short", !121, i64 0}
!157 = !DILocation(line: 153, column: 25, scope: !151)
!158 = !DILocation(line: 153, column: 13, scope: !152)
!159 = !DILocation(line: 154, column: 17, scope: !160)
!160 = distinct !DILexicalBlock(scope: !161, file: !3, line: 154, column: 17)
!161 = distinct !DILexicalBlock(scope: !151, file: !3, line: 153, column: 40)
!162 = !DILocation(line: 154, column: 17, scope: !161)
!163 = !DILocation(line: 155, column: 21, scope: !164)
