; ModuleID = 'att_db.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_db.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.att_info_t = type { void (i8, i16, i8*, i16)*, void (i8, i16, i8*, i16)*, i8, i8*, i16 (i16, i16, i16, i8*, i16)*, i32 (i16, i16, i16, i16, i8*, i16)*, i8, i16, %struct.btstack_linked_item*, %struct.btstack_packet_callback_registration_t, %struct.btstack_packet_callback_registration_t, void (i8, i16, i8*, i16)*, %struct.btstack_linked_item*, i8 }
%struct.btstack_packet_callback_registration_t = type { %struct.btstack_linked_item, void (i8, i16, i8*, i16)* }
%struct.btstack_linked_item = type { %struct.btstack_linked_item* }
%struct.att_iterator = type { i8*, i16, i16, i16, i8*, i16, i8* }
%struct.att_connection = type { i16, i16, i16, i8, i8, i8 }
%struct.btstack_linked_list_iterator_t = type { i32, %struct.btstack_linked_item*, %struct.btstack_linked_item* }
%struct.att_service_handler = type { %struct.btstack_linked_item*, i16, i16, i16 (i16, i16, i16, i8*, i16)*, i32 (i16, i16, i16, i16, i8*, i16)* }

@app_info_debug_enable = weak hidden local_unnamed_addr global i32 0, align 4, !dbg !0
@att_global_info = external global %struct.att_info_t, align 4
@bluetooth_base_uuid = internal constant [16 x i8] c"\FB4\9B_\80\00\00\80\00\10\00\00\00\00\00\00", align 1, !dbg !43

; Function Attrs: nounwind optsize

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "app_info_debug_enable", scope: !2, file: !49, line: 190, type: !41, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !42)
!3 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/att_db.c", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!4 = !{}
!5 = !{!6, !14, !15}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_item_t", file: !8, line: 100, baseType: !9)
!8 = !DIFile(filename: "../btcommon/btstack_linked_list.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_linked_item_t", file: !8, line: 55, baseType: !10)
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btstack_linked_item", file: !8, line: 53, size: 32, elements: !11)
!11 = !{!12}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !10, file: !8, line: 54, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 32)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_service_handler_t", file: !17, line: 79, baseType: !18)
!17 = !DIFile(filename: "../btstack/Protocol/include/ble/att_db.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "att_service_handler", file: !17, line: 73, size: 128, elements: !19)
!19 = !{!20, !21, !25, !26, !36}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !18, file: !17, line: 74, baseType: !6, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "start_handle", scope: !18, file: !17, line: 75, baseType: !22, size: 16, offset: 32)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 46, baseType: !24)
!23 = !DIFile(filename: "../btcommon/typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "end_handle", scope: !18, file: !17, line: 76, baseType: !22, size: 16, offset: 48)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "read_callback", scope: !18, file: !17, line: 77, baseType: !27, size: 32, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_read_callback_t", file: !17, line: 51, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 32)
!29 = !DISubroutineType(types: !30)
!30 = !{!22, !31, !22, !22, !33, !22}
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "hci_con_handle_t", file: !32, line: 60, baseType: !22)
!32 = !DIFile(filename: "../btcommon/utils.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 32)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 44, baseType: !35)
!35 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "write_callback", scope: !18, file: !17, line: 78, baseType: !37, size: 32, offset: 96)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_write_callback_t", file: !17, line: 70, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 32)
!39 = !DISubroutineType(types: !40)
!40 = !{!41, !31, !22, !22, !22, !33, !22}
!41 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!42 = !{!0, !43}
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "bluetooth_base_uuid", scope: !2, file: !3, line: 59, type: !45, isLocal: true, isDefinition: true)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 128, elements: !47)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!47 = !{!48}
!48 = !DISubrange(count: 16)
!49 = !DIFile(filename: "../btcommon/profile_stack_debug.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!50 = !{i32 2, !"Dwarf Version", i32 4}
!51 = !{i32 2, !"Debug Info Version", i32 3}
!52 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!53 = distinct !DISubprogram(name: "att_uuid_for_handle", scope: !3, file: !3, line: 236, type: !54, isLocal: false, isDefinition: true, scopeLine: 237, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !56)
!54 = !DISubroutineType(types: !55)
!55 = !{!22, !22}
!56 = !{!57, !58, !70}
!57 = !DILocalVariable(name: "attribute_handle", arg: 1, scope: !53, file: !3, line: 236, type: !22)
!58 = !DILocalVariable(name: "it", scope: !53, file: !3, line: 238, type: !59)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_iterator_t", file: !3, line: 110, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "att_iterator", file: !3, line: 100, size: 192, elements: !61)
!61 = !{!62, !64, !65, !66, !67, !68, !69}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "att_ptr", scope: !60, file: !3, line: 102, baseType: !63, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !60, file: !3, line: 104, baseType: !22, size: 16, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !60, file: !3, line: 105, baseType: !22, size: 16, offset: 48)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !60, file: !3, line: 106, baseType: !22, size: 16, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "uuid", scope: !60, file: !3, line: 107, baseType: !63, size: 32, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "value_len", scope: !60, file: !3, line: 108, baseType: !22, size: 16, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !60, file: !3, line: 109, baseType: !63, size: 32, offset: 160)
!70 = !DILocalVariable(name: "ok", scope: !53, file: !3, line: 239, type: !41)
!71 = !DILocation(line: 236, column: 39, scope: !53)
!72 = !DILocation(line: 238, column: 5, scope: !53)
!73 = !DILocation(line: 238, column: 20, scope: !53)
!74 = !DILocation(line: 239, column: 14, scope: !53)
!75 = !DILocation(line: 239, column: 9, scope: !53)
!76 = !DILocation(line: 240, column: 10, scope: !77)
!77 = distinct !DILexicalBlock(scope: !53, file: !3, line: 240, column: 9)
!78 = !DILocation(line: 240, column: 9, scope: !53)
!79 = !DILocation(line: 243, column: 12, scope: !80)
!80 = distinct !DILexicalBlock(scope: !53, file: !3, line: 243, column: 9)
!81 = !{!82, !86, i64 6}
!82 = !{!"att_iterator", !83, i64 0, !86, i64 4, !86, i64 6, !86, i64 8, !83, i64 12, !86, i64 16, !83, i64 20}
!83 = !{!"any pointer", !84, i64 0}
!84 = !{!"omnipotent char", !85, i64 0}
!85 = !{!"Simple C/C++ TBAA"}
!86 = !{!"short", !84, i64 0}
!87 = !DILocation(line: 243, column: 18, scope: !80)
!88 = !DILocation(line: 243, column: 9, scope: !53)
!89 = !DILocation(line: 246, column: 37, scope: !53)
!90 = !{!82, !83, i64 12}
!91 = !DILocation(line: 246, column: 12, scope: !53)
!92 = !DILocation(line: 246, column: 5, scope: !53)
!93 = !DILocation(line: 247, column: 1, scope: !53)
!94 = distinct !DISubprogram(name: "att_find_handle", scope: !3, file: !3, line: 184, type: !95, isLocal: true, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !98)
!95 = !DISubroutineType(types: !96)
!96 = !{!41, !97, !22}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 32)
!98 = !{!99, !100}
!99 = !DILocalVariable(name: "it", arg: 1, scope: !94, file: !3, line: 184, type: !97)
!100 = !DILocalVariable(name: "handle", arg: 2, scope: !94, file: !3, line: 184, type: !22)
!101 = !DILocation(line: 184, column: 44, scope: !94)
!102 = !DILocation(line: 184, column: 57, scope: !94)
!103 = !DILocation(line: 186, column: 16, scope: !104)
!104 = distinct !DILexicalBlock(scope: !94, file: !3, line: 186, column: 9)
!105 = !DILocation(line: 186, column: 9, scope: !94)
!106 = !DILocalVariable(name: "it", arg: 1, scope: !107, file: !3, line: 112, type: !97)
!107 = distinct !DISubprogram(name: "att_iterator_init", scope: !3, file: !3, line: 112, type: !108, isLocal: true, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !110)
!108 = !DISubroutineType(types: !109)
!109 = !{null, !97}
!110 = !{!106}
!111 = !DILocation(line: 112, column: 47, scope: !107, inlinedAt: !112)
!112 = distinct !DILocation(line: 189, column: 5, scope: !94)
!113 = !DILocation(line: 114, column: 27, scope: !107, inlinedAt: !112)
!114 = !{!115, !83, i64 12}
!115 = !{!"", !83, i64 0, !83, i64 4, !84, i64 8, !84, i64 8, !84, i64 8, !84, i64 8, !83, i64 12, !83, i64 16, !83, i64 20, !84, i64 24, !86, i64 26, !83, i64 28, !116, i64 32, !116, i64 40, !83, i64 48, !83, i64 52, !84, i64 56, !84, i64 56, !84, i64 56}
!116 = !{!"", !117, i64 0, !83, i64 4}
!117 = !{!"btstack_linked_item", !83, i64 0}
!118 = !DILocation(line: 114, column: 17, scope: !107, inlinedAt: !112)
!119 = !{!82, !83, i64 0}
!120 = !DILocalVariable(name: "it", arg: 1, scope: !121, file: !3, line: 117, type: !97)
!121 = distinct !DISubprogram(name: "att_iterator_has_next", scope: !3, file: !3, line: 117, type: !122, isLocal: true, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !124)
!122 = !DISubroutineType(types: !123)
!123 = !{!41, !97}
!124 = !{!120}
!125 = !DILocation(line: 117, column: 50, scope: !121, inlinedAt: !126)
!126 = distinct !DILocation(line: 190, column: 12, scope: !127)
!127 = !DILexicalBlockFile(scope: !94, file: !3, discriminator: 1)
!128 = !DILocation(line: 119, column: 24, scope: !121, inlinedAt: !126)
!129 = !DILocation(line: 190, column: 5, scope: !127)
!130 = !DILocation(line: 191, column: 9, scope: !131)
!131 = distinct !DILexicalBlock(scope: !94, file: !3, line: 190, column: 39)
!132 = !DILocation(line: 192, column: 17, scope: !133)
!133 = distinct !DILexicalBlock(scope: !131, file: !3, line: 192, column: 13)
!134 = !{!82, !86, i64 8}
!135 = !DILocation(line: 192, column: 24, scope: !133)
!136 = !DILocation(line: 192, column: 13, scope: !131)
!137 = distinct !{!137, !138, !139}
!138 = !DILocation(line: 190, column: 5, scope: !94)
!139 = !DILocation(line: 196, column: 5, scope: !94)
!140 = !DILocation(line: 198, column: 1, scope: !94)
!141 = distinct !DISubprogram(name: "att_set_db", scope: !3, file: !3, line: 285, type: !142, isLocal: false, isDefinition: true, scopeLine: 286, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !144)
!142 = !DISubroutineType(types: !143)
!143 = !{null, !63}
!144 = !{!145}
!145 = !DILocalVariable(name: "db", arg: 1, scope: !141, file: !3, line: 285, type: !63)
!146 = !DILocation(line: 285, column: 32, scope: !141)
!147 = !DILocation(line: 288, column: 24, scope: !148)
!148 = distinct !DILexicalBlock(scope: !149, file: !3, line: 287, column: 17)
!149 = distinct !DILexicalBlock(scope: !141, file: !3, line: 287, column: 9)
!150 = !DILocation(line: 290, column: 1, scope: !141)
!151 = distinct !DISubprogram(name: "att_set_read_callback", scope: !3, file: !3, line: 292, type: !152, isLocal: false, isDefinition: true, scopeLine: 293, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !159)
!152 = !DISubroutineType(types: !153)
!153 = !{null, !154}
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_read_callback_t", file: !155, line: 116, baseType: !156)
!155 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/le/att.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DISubroutineType(types: !158)
!158 = !{!22, !22, !22, !22, !33, !22}
!159 = !{!160}
!160 = !DILocalVariable(name: "callback", arg: 1, scope: !151, file: !3, line: 292, type: !154)
!161 = !DILocation(line: 292, column: 48, scope: !151)
!162 = !DILocation(line: 294, column: 31, scope: !151)
!163 = !{!115, !83, i64 16}
!164 = !DILocation(line: 295, column: 1, scope: !151)
!165 = distinct !DISubprogram(name: "att_set_write_callback", scope: !3, file: !3, line: 297, type: !166, isLocal: false, isDefinition: true, scopeLine: 298, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !172)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !168}
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_write_callback_t", file: !155, line: 127, baseType: !169)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!170 = !DISubroutineType(types: !171)
!171 = !{!41, !22, !22, !22, !22, !33, !22}
!172 = !{!173}
!173 = !DILocalVariable(name: "callback", arg: 1, scope: !165, file: !3, line: 297, type: !168)
!174 = !DILocation(line: 297, column: 50, scope: !165)
!175 = !DILocation(line: 299, column: 32, scope: !165)
!176 = !{!115, !83, i64 20}
!177 = !DILocation(line: 300, column: 1, scope: !165)
!178 = distinct !DISubprogram(name: "att_dump_attributes", scope: !3, file: !3, line: 302, type: !179, isLocal: false, isDefinition: true, scopeLine: 303, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !181)
!179 = !DISubroutineType(types: !180)
!180 = !{null}
!181 = !{!182, !183}
!182 = !DILocalVariable(name: "it", scope: !178, file: !3, line: 304, type: !59)
!183 = !DILocalVariable(name: "uuid128", scope: !178, file: !3, line: 306, type: !184)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 128, elements: !47)
!185 = !DILocation(line: 304, column: 5, scope: !178)
!186 = !DILocation(line: 304, column: 20, scope: !178)
!187 = !DILocation(line: 112, column: 47, scope: !107, inlinedAt: !188)
!188 = distinct !DILocation(line: 305, column: 5, scope: !178)
!189 = !DILocation(line: 114, column: 27, scope: !107, inlinedAt: !188)
!190 = !DILocation(line: 114, column: 17, scope: !107, inlinedAt: !188)
!191 = !DILocation(line: 306, column: 5, scope: !178)
!192 = !DILocation(line: 306, column: 13, scope: !178)
!193 = !DILocation(line: 117, column: 50, scope: !121, inlinedAt: !194)
!194 = distinct !DILocation(line: 307, column: 12, scope: !195)
!195 = !DILexicalBlockFile(scope: !178, file: !3, discriminator: 1)
!196 = !DILocation(line: 119, column: 16, scope: !121, inlinedAt: !194)
!197 = !DILocation(line: 119, column: 24, scope: !121, inlinedAt: !194)
!198 = !DILocation(line: 307, column: 5, scope: !195)
!199 = !DILocation(line: 308, column: 9, scope: !200)
!200 = distinct !DILexicalBlock(scope: !178, file: !3, line: 307, column: 40)
!201 = !DILocation(line: 309, column: 16, scope: !202)
!202 = distinct !DILexicalBlock(scope: !200, file: !3, line: 309, column: 13)
!203 = !DILocation(line: 309, column: 23, scope: !202)
!204 = !DILocation(line: 309, column: 13, scope: !200)
!205 = !DILocation(line: 314, column: 16, scope: !206)
!206 = distinct !DILexicalBlock(scope: !200, file: !3, line: 314, column: 13)
!207 = !DILocation(line: 314, column: 22, scope: !206)
!208 = !DILocation(line: 314, column: 13, scope: !200)
!209 = !DILocation(line: 315, column: 28, scope: !210)
!210 = distinct !DILexicalBlock(scope: !206, file: !3, line: 314, column: 46)
!211 = !DILocation(line: 315, column: 13, scope: !210)
!212 = !DILocation(line: 317, column: 9, scope: !210)
!213 = distinct !{!213, !214, !215}
!214 = !DILocation(line: 307, column: 5, scope: !178)
!215 = !DILocation(line: 322, column: 5, scope: !178)
!216 = !DILocation(line: 323, column: 1, scope: !178)
!217 = !DILocation(line: 323, column: 1, scope: !218)
!218 = !DILexicalBlockFile(scope: !178, file: !3, discriminator: 2)
!219 = distinct !DISubprogram(name: "att_iterator_fetch_next", scope: !3, file: !3, line: 122, type: !108, isLocal: true, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !220)
!220 = !{!221}
!221 = !DILocalVariable(name: "it", arg: 1, scope: !219, file: !3, line: 122, type: !97)
!222 = !DILocation(line: 122, column: 53, scope: !219)
!223 = !DILocation(line: 124, column: 44, scope: !219)
!224 = !DILocation(line: 124, column: 18, scope: !219)
!225 = !DILocation(line: 124, column: 9, scope: !219)
!226 = !DILocation(line: 124, column: 16, scope: !219)
!227 = !{!82, !86, i64 4}
!228 = !DILocation(line: 125, column: 18, scope: !229)
!229 = distinct !DILexicalBlock(scope: !219, file: !3, line: 125, column: 9)
!230 = !DILocation(line: 125, column: 9, scope: !219)
!231 = !DILocation(line: 126, column: 13, scope: !232)
!232 = distinct !DILexicalBlock(scope: !229, file: !3, line: 125, column: 24)
!233 = !DILocation(line: 126, column: 19, scope: !232)
!234 = !DILocation(line: 132, column: 9, scope: !232)
!235 = !DILocation(line: 134, column: 44, scope: !219)
!236 = !DILocation(line: 134, column: 18, scope: !219)
!237 = !DILocation(line: 134, column: 9, scope: !219)
!238 = !DILocation(line: 134, column: 16, scope: !219)
!239 = !DILocation(line: 135, column: 44, scope: !219)
!240 = !DILocation(line: 135, column: 18, scope: !219)
!241 = !DILocation(line: 136, column: 23, scope: !219)
!242 = !DILocation(line: 136, column: 19, scope: !219)
!243 = !DILocation(line: 138, column: 13, scope: !244)
!244 = distinct !DILexicalBlock(scope: !219, file: !3, line: 138, column: 9)
!245 = !DILocation(line: 138, column: 19, scope: !244)
!246 = !DILocation(line: 138, column: 9, scope: !219)
!247 = !DILocation(line: 146, column: 20, scope: !219)
!248 = !DILocation(line: 146, column: 17, scope: !219)
!249 = !DILocation(line: 147, column: 1, scope: !219)
!250 = !DILocation(line: 135, column: 9, scope: !219)
!251 = !DILocation(line: 135, column: 16, scope: !219)
!252 = !DILocation(line: 136, column: 9, scope: !219)
!253 = !DILocation(line: 136, column: 16, scope: !219)
!254 = !DILocation(line: 131, column: 21, scope: !232)
!255 = !DILocation(line: 147, column: 1, scope: !256)
!256 = !DILexicalBlockFile(scope: !219, file: !3, discriminator: 1)
!257 = distinct !DISubprogram(name: "att_clear_transaction_queue", scope: !3, file: !3, line: 1173, type: !258, isLocal: false, isDefinition: true, scopeLine: 1174, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !270)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !260}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_connection_t", file: !17, line: 41, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "att_connection", file: !17, line: 34, size: 80, elements: !263)
!263 = !{!264, !265, !266, !267, !268, !269}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "con_handle", scope: !262, file: !17, line: 35, baseType: !31, size: 16)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !262, file: !17, line: 36, baseType: !22, size: 16, offset: 16)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "max_mtu", scope: !262, file: !17, line: 37, baseType: !22, size: 16, offset: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "encryption_key_size", scope: !262, file: !17, line: 38, baseType: !34, size: 8, offset: 48)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !262, file: !17, line: 39, baseType: !34, size: 8, offset: 56)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "authorized", scope: !262, file: !17, line: 40, baseType: !34, size: 8, offset: 64)
!270 = !{!271}
!271 = !DILocalVariable(name: "att_connection", arg: 1, scope: !257, file: !3, line: 1173, type: !260)
!272 = !DILocation(line: 1173, column: 52, scope: !257)
!273 = !DILocation(line: 1175, column: 5, scope: !257)
!274 = !DILocation(line: 1176, column: 1, scope: !257)
!275 = distinct !DISubprogram(name: "att_notify_write_callbacks", scope: !3, file: !3, line: 1131, type: !276, isLocal: true, isDefinition: true, scopeLine: 1132, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !278)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !260, !22}
!278 = !{!279, !280, !281, !290}
!279 = !DILocalVariable(name: "att_connection", arg: 1, scope: !275, file: !3, line: 1131, type: !260)
!280 = !DILocalVariable(name: "transaction_mode", arg: 2, scope: !275, file: !3, line: 1131, type: !22)
!281 = !DILocalVariable(name: "it", scope: !275, file: !3, line: 1134, type: !282)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_list_iterator_t", file: !8, line: 102, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_linked_list_iterator_t", file: !8, line: 65, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 61, size: 96, elements: !285)
!285 = !{!286, !287, !289}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "advance_on_next", scope: !284, file: !8, line: 62, baseType: !41, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !284, file: !8, line: 63, baseType: !288, size: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !284, file: !8, line: 64, baseType: !288, size: 32, offset: 64)
!290 = !DILocalVariable(name: "handler", scope: !291, file: !3, line: 1137, type: !15)
!291 = distinct !DILexicalBlock(scope: !275, file: !3, line: 1136, column: 48)
!292 = !DILocation(line: 1131, column: 58, scope: !275)
!293 = !DILocation(line: 1131, column: 83, scope: !275)
!294 = !DILocation(line: 1134, column: 5, scope: !275)
!295 = !DILocation(line: 1134, column: 28, scope: !275)
!296 = !DILocation(line: 1135, column: 5, scope: !275)
!297 = !DILocation(line: 1136, column: 12, scope: !298)
!298 = !DILexicalBlockFile(scope: !275, file: !3, discriminator: 1)
!299 = !DILocation(line: 1136, column: 5, scope: !298)
!300 = !DILocation(line: 1137, column: 68, scope: !291)
!301 = !DILocation(line: 1138, column: 23, scope: !302)
!302 = distinct !DILexicalBlock(scope: !291, file: !3, line: 1138, column: 13)
!303 = !{!304, !83, i64 12}
!304 = !{!"att_service_handler", !83, i64 0, !86, i64 4, !86, i64 6, !83, i64 8, !83, i64 12}
!305 = !DILocation(line: 1138, column: 14, scope: !302)
!306 = !DILocation(line: 1138, column: 13, scope: !291)
!307 = distinct !{!307, !308, !309}
!308 = !DILocation(line: 1136, column: 5, scope: !275)
!309 = !DILocation(line: 1142, column: 5, scope: !275)
!310 = !DILocation(line: 1141, column: 52, scope: !291)
!311 = !{!312, !86, i64 0}
!312 = !{!"att_connection", !86, i64 0, !86, i64 2, !86, i64 4, !84, i64 6, !84, i64 7, !84, i64 8}
!313 = !DILocation(line: 1141, column: 9, scope: !291)
!314 = !DILocation(line: 1143, column: 18, scope: !315)
!315 = distinct !DILexicalBlock(scope: !275, file: !3, line: 1143, column: 9)
!316 = !DILocation(line: 1143, column: 10, scope: !315)
!317 = !DILocation(line: 1143, column: 9, scope: !275)
!318 = !DILocation(line: 1146, column: 48, scope: !275)
!319 = !DILocation(line: 1146, column: 5, scope: !275)
!320 = !DILocation(line: 1147, column: 1, scope: !275)
!321 = !DILocation(line: 1147, column: 1, scope: !322)
!322 = !DILexicalBlockFile(scope: !275, file: !3, discriminator: 2)
!323 = distinct !DISubprogram(name: "att_prepare_handle_value_notification", scope: !3, file: !3, line: 1258, type: !324, isLocal: false, isDefinition: true, scopeLine: 1263, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !326)
!324 = !DISubroutineType(types: !325)
!325 = !{!22, !260, !22, !33, !22, !33}
!326 = !{!327, !328, !329, !330, !331}
!327 = !DILocalVariable(name: "att_connection", arg: 1, scope: !323, file: !3, line: 1258, type: !260)
!328 = !DILocalVariable(name: "handle", arg: 2, scope: !323, file: !3, line: 1259, type: !22)
!329 = !DILocalVariable(name: "value", arg: 3, scope: !323, file: !3, line: 1260, type: !33)
!330 = !DILocalVariable(name: "value_len", arg: 4, scope: !323, file: !3, line: 1261, type: !22)
!331 = !DILocalVariable(name: "response_buffer", arg: 5, scope: !323, file: !3, line: 1262, type: !33)
!332 = !DILocation(line: 1258, column: 66, scope: !323)
!333 = !DILocation(line: 1259, column: 18, scope: !323)
!334 = !DILocation(line: 1260, column: 18, scope: !323)
!335 = !DILocation(line: 1261, column: 18, scope: !323)
!336 = !DILocation(line: 1262, column: 18, scope: !323)
!337 = !DILocation(line: 1265, column: 24, scope: !323)
!338 = !{!84, !84, i64 0}
!339 = !DILocalVariable(name: "att_connection", arg: 1, scope: !340, file: !3, line: 1243, type: !260)
!340 = distinct !DISubprogram(name: "prepare_handle_value", scope: !3, file: !3, line: 1243, type: !324, isLocal: true, isDefinition: true, scopeLine: 1248, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !341)
!341 = !{!339, !342, !343, !344, !345}
!342 = !DILocalVariable(name: "handle", arg: 2, scope: !340, file: !3, line: 1244, type: !22)
!343 = !DILocalVariable(name: "value", arg: 3, scope: !340, file: !3, line: 1245, type: !33)
!344 = !DILocalVariable(name: "value_len", arg: 4, scope: !340, file: !3, line: 1246, type: !22)
