temp.o:	file format ELF32-i386

.debug_info contents:
0x00000000: Compile Unit: length = 0x00000c20 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x00000c24)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)")
              DW_AT_language	(DW_LANG_C99)
              DW_AT_name	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/att_send.c")
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
              DW_AT_GNU_pubnames	(true)
              DW_AT_low_pc	(0x0000000000000000)
              DW_AT_ranges	(0x00000000
                 [0x00000000 - 0x0000174f)
                 [0x0000174f - 0x00001a1f)
                 [0x00000000 - 0x00000009))

0x00000026:   DW_TAG_variable
                DW_AT_name	("app_info_debug_enable")
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/profile_stack_debug.h")
                DW_AT_decl_line	(190)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000037:   DW_TAG_base_type
                DW_AT_name	("int")
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_byte_size	(0x04)

0x0000003e:   DW_TAG_variable
                DW_AT_name	("att_s_hdl")
                DW_AT_type	(cu + 0x004f "att_ctl_t*")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/att_send.c")
                DW_AT_decl_line	(63)
                DW_AT_location	(DW_OP_addr 0x0)

0x0000004f:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0054 "att_ctl_t")

0x00000054:   DW_TAG_typedef
                DW_AT_type	(cu + 0x005f "structure ")
                DW_AT_name	("att_ctl_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/att_send.c")
                DW_AT_decl_line	(60)

0x0000005f:   DW_TAG_structure_type
                DW_AT_byte_size	(0xbc)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/att_send.c")
                DW_AT_decl_line	(51)

0x00000063:     DW_TAG_member
                  DW_AT_name	("user_send_cbuf")
                  DW_AT_type	(cu + 0x00c4 "cbuffer_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/att_send.c")
                  DW_AT_decl_line	(52)
                  DW_AT_data_member_location	(0x00)

0x0000006f:     DW_TAG_member
                  DW_AT_name	("ready_send_head")
                  DW_AT_type	(cu + 0x0192 "user_send_head_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/att_send.c")
                  DW_AT_decl_line	(53)
                  DW_AT_data_member_location	(0x24)

0x0000007b:     DW_TAG_member
                  DW_AT_name	("client_configuration")
                  DW_AT_type	(cu + 0x01ea "server_ccc_cfg_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/att_send.c")
                  DW_AT_decl_line	(54)
                  DW_AT_data_member_location	(0x2a)

0x00000087:     DW_TAG_member
                  DW_AT_name	("dev_hdl_ctrl")
                  DW_AT_type	(cu + 0x0242 "dev_hdl_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/att_send.c")
                  DW_AT_decl_line	(55)
                  DW_AT_data_member_location	(0x8a)

0x00000093:     DW_TAG_member
                  DW_AT_name	("att_send_data")
                  DW_AT_type	(cu + 0x02a2 "u8*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/att_send.c")
                  DW_AT_decl_line	(56)
                  DW_AT_data_member_location	(0xac)

0x0000009f:     DW_TAG_member
                  DW_AT_name	("att_sendbuf_size")
                  DW_AT_type	(cu + 0x0297 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/att_send.c")
                  DW_AT_decl_line	(57)
                  DW_AT_data_member_location	(0xb0)

0x000000ab:     DW_TAG_member
                  DW_AT_name	("send_lock")
                  DW_AT_type	(cu + 0x02b2 "volatile u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/att_send.c")
                  DW_AT_decl_line	(58)
                  DW_AT_data_member_location	(0xb2)

0x000000b7:     DW_TAG_member
                  DW_AT_name	("reserved")
                  DW_AT_type	(cu + 0x02b7 "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/att_send.c")
                  DW_AT_decl_line	(59)
                  DW_AT_data_member_location	(0xb3)

0x000000c3:     NULL

0x000000c4:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00cf "_cbuffer")
                DW_AT_name	("cbuffer_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/generic/circular_buf.h")
                DW_AT_decl_line	(26)

0x000000cf:   DW_TAG_structure_type
                DW_AT_name	("_cbuffer")
                DW_AT_byte_size	(0x24)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/generic/circular_buf.h")
                DW_AT_decl_line	(16)

0x000000d7:     DW_TAG_member
                  DW_AT_name	("begin")
                  DW_AT_type	(cu + 0x0144 "u8*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/generic/circular_buf.h")
                  DW_AT_decl_line	(17)
                  DW_AT_data_member_location	(0x00)

0x000000e3:     DW_TAG_member
                  DW_AT_name	("end")
                  DW_AT_type	(cu + 0x0144 "u8*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/generic/circular_buf.h")
                  DW_AT_decl_line	(18)
                  DW_AT_data_member_location	(0x04)

0x000000ef:     DW_TAG_member
                  DW_AT_name	("read_ptr")
                  DW_AT_type	(cu + 0x0144 "u8*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/generic/circular_buf.h")
                  DW_AT_decl_line	(19)
                  DW_AT_data_member_location	(0x08)

0x000000fb:     DW_TAG_member
                  DW_AT_name	("write_ptr")
                  DW_AT_type	(cu + 0x0144 "u8*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/generic/circular_buf.h")
                  DW_AT_decl_line	(20)
                  DW_AT_data_member_location	(0x0c)

0x00000107:     DW_TAG_member
                  DW_AT_name	("tmp_ptr")
                  DW_AT_type	(cu + 0x0144 "u8*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/generic/circular_buf.h")
                  DW_AT_decl_line	(21)
                  DW_AT_data_member_location	(0x10)

0x00000113:     DW_TAG_member
                  DW_AT_name	("tmp_len")
                  DW_AT_type	(cu + 0x015b "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/generic/circular_buf.h")
                  DW_AT_decl_line	(22)
                  DW_AT_data_member_location	(0x14)

0x0000011f:     DW_TAG_member
                  DW_AT_name	("data_len")
                  DW_AT_type	(cu + 0x015b "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/generic/circular_buf.h")
                  DW_AT_decl_line	(23)
                  DW_AT_data_member_location	(0x18)

0x0000012b:     DW_TAG_member
                  DW_AT_name	("total_len")
                  DW_AT_type	(cu + 0x015b "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/generic/circular_buf.h")
                  DW_AT_decl_line	(24)
                  DW_AT_data_member_location	(0x1c)

0x00000137:     DW_TAG_member
                  DW_AT_name	("lock")
                  DW_AT_type	(cu + 0x016d "spinlock_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/generic/circular_buf.h")
                  DW_AT_decl_line	(25)
                  DW_AT_data_member_location	(0x20)

0x00000143:     NULL

0x00000144:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0149 "u8")

0x00000149:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0154 "unsigned char")
                DW_AT_name	("u8")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(11)

0x00000154:   DW_TAG_base_type
                DW_AT_name	("unsigned char")
                DW_AT_encoding	(DW_ATE_unsigned_char)
                DW_AT_byte_size	(0x01)

0x0000015b:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0166 "unsigned int")
                DW_AT_name	("u32")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(15)

0x00000166:   DW_TAG_base_type
                DW_AT_name	("unsigned int")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x04)

0x0000016d:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0178 "__spinlock")
                DW_AT_name	("spinlock_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/spinlock.h")
                DW_AT_decl_line	(13)

0x00000178:   DW_TAG_structure_type
                DW_AT_name	("__spinlock")
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/spinlock.h")
                DW_AT_decl_line	(9)

0x00000180:     DW_TAG_member
                  DW_AT_name	("rwlock")
                  DW_AT_type	(cu + 0x018d "volatile u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/spinlock.h")
                  DW_AT_decl_line	(10)
                  DW_AT_data_member_location	(0x00)

0x0000018c:     NULL

0x0000018d:   DW_TAG_volatile_type
                DW_AT_type	(cu + 0x015b "u32")

0x00000192:   DW_TAG_typedef
                DW_AT_type	(cu + 0x019d "structure ")
                DW_AT_name	("user_send_head_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../User/include/ble/att_send.h")
                DW_AT_decl_line	(15)

0x0000019d:   DW_TAG_structure_type
                DW_AT_byte_size	(0x06)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../User/include/ble/att_send.h")
                DW_AT_decl_line	(10)

0x000001a1:     DW_TAG_member
                  DW_AT_name	("conn_handle")
                  DW_AT_type	(cu + 0x01d8 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../User/include/ble/att_send.h")
                  DW_AT_decl_line	(11)
                  DW_AT_data_member_location	(0x00)

0x000001ad:     DW_TAG_member
                  DW_AT_name	("send_handle")
                  DW_AT_type	(cu + 0x01d8 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../User/include/ble/att_send.h")
                  DW_AT_decl_line	(12)
                  DW_AT_data_member_location	(0x02)

0x000001b9:     DW_TAG_member
                  DW_AT_name	("send_len")
                  DW_AT_type	(cu + 0x01d8 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../User/include/ble/att_send.h")
                  DW_AT_decl_line	(13)
                  DW_AT_byte_size	(0x02)
                  DW_AT_bit_size	(0x0c)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x04)

0x000001c8:     DW_TAG_member
                  DW_AT_name	("send_type")
                  DW_AT_type	(cu + 0x01d8 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../User/include/ble/att_send.h")
                  DW_AT_decl_line	(14)
                  DW_AT_byte_size	(0x02)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x04)

0x000001d7:     NULL

0x000001d8:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01e3 "unsigned short")
                DW_AT_name	("u16")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(13)

0x000001e3:   DW_TAG_base_type
                DW_AT_name	("unsigned short")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x02)

0x000001ea:   DW_TAG_array_type
                DW_AT_type	(cu + 0x01f6 "server_ccc_cfg_t")

0x000001ef:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x023b "sizetype")
                  DW_AT_count	(0x18)

0x000001f5:     NULL

0x000001f6:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0201 "structure ")
                DW_AT_name	("server_ccc_cfg_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/att_send.c")
                DW_AT_decl_line	(41)

0x00000201:   DW_TAG_structure_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/att_send.c")
                DW_AT_decl_line	(37)

0x00000205:     DW_TAG_member
                  DW_AT_name	("handle")
                  DW_AT_type	(cu + 0x0230 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/att_send.c")
                  DW_AT_decl_line	(38)
                  DW_AT_data_member_location	(0x00)

0x00000211:     DW_TAG_member
                  DW_AT_name	("cfg")
                  DW_AT_type	(cu + 0x0230 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/att_send.c")
                  DW_AT_decl_line	(39)
                  DW_AT_byte_size	(0x02)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x0c)
                  DW_AT_data_member_location	(0x02)

0x00000220:     DW_TAG_member
                  DW_AT_name	("conn_handle")
                  DW_AT_type	(cu + 0x0230 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/att_send.c")
                  DW_AT_decl_line	(40)
                  DW_AT_byte_size	(0x02)
                  DW_AT_bit_size	(0x0c)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x02)

0x0000022f:     NULL

0x00000230:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01e3 "unsigned short")
                DW_AT_name	("uint16_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(46)

0x0000023b:   DW_TAG_base_type
                DW_AT_name	("sizetype")
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_unsigned)

0x00000242:   DW_TAG_array_type
                DW_AT_type	(cu + 0x024e "dev_hdl_t")

0x00000247:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x023b "sizetype")
                  DW_AT_count	(0x08)

0x0000024d:     NULL

0x0000024e:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0259 "structure ")
                DW_AT_name	("dev_hdl_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/att_send.c")
                DW_AT_decl_line	(49)

0x00000259:   DW_TAG_structure_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/att_send.c")
                DW_AT_decl_line	(44)

0x0000025d:     DW_TAG_member
                  DW_AT_name	("conn_role")
                  DW_AT_type	(cu + 0x0297 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/att_send.c")
                  DW_AT_decl_line	(45)
                  DW_AT_byte_size	(0x02)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x0e)
                  DW_AT_data_member_location	(0x00)

0x0000026c:     DW_TAG_member
                  DW_AT_name	("conn_index")
                  DW_AT_type	(cu + 0x0297 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/att_send.c")
                  DW_AT_decl_line	(46)
                  DW_AT_byte_size	(0x02)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x0a)
                  DW_AT_data_member_location	(0x00)

0x0000027b:     DW_TAG_member
                  DW_AT_name	("conn_handle")
                  DW_AT_type	(cu + 0x0297 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/att_send.c")
                  DW_AT_decl_line	(47)
                  DW_AT_byte_size	(0x02)
                  DW_AT_bit_size	(0x0a)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x00)

0x0000028a:     DW_TAG_member
                  DW_AT_name	("att_payload_size")
                  DW_AT_type	(cu + 0x0297 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/att_send.c")
                  DW_AT_decl_line	(48)
                  DW_AT_data_member_location	(0x02)

0x00000296:     NULL

0x00000297:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01e3 "unsigned short")
                DW_AT_name	("u16")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(46)

0x000002a2:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x02a7 "u8")

0x000002a7:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0154 "unsigned char")
                DW_AT_name	("u8")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(44)

0x000002b2:   DW_TAG_volatile_type
                DW_AT_type	(cu + 0x02a7 "u8")

0x000002b7:   DW_TAG_array_type
                DW_AT_type	(cu + 0x02a7 "u8")

0x000002bc:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x023b "sizetype")
                  DW_AT_count	(0x06)

0x000002c2:     NULL

0x000002c3:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/le/ble_api.h")
                DW_AT_decl_line	(89)

0x000002c7:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_RET_SUCESS")
                  DW_AT_const_value	(0)

0x000002cd:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_RET_BUSY")
                  DW_AT_const_value	(-100)

0x000002d4:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_PARAM_OVERFLOW")
                  DW_AT_const_value	(-99)

0x000002db:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_OPT_FAIL")
                  DW_AT_const_value	(-98)

0x000002e2:     DW_TAG_enumerator
                  DW_AT_name	("BLE_BUFFER_FULL")
                  DW_AT_const_value	(-97)

0x000002e9:     DW_TAG_enumerator
                  DW_AT_name	("BLE_BUFFER_ERROR")
                  DW_AT_const_value	(-96)

0x000002f0:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_PARAM_ERROR")
                  DW_AT_const_value	(-95)

0x000002f7:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_STACK_NOT_RUN")
                  DW_AT_const_value	(-94)

0x000002fe:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CMD_CCC_FAIL")
                  DW_AT_const_value	(-93)

0x00000305:     NULL

0x00000306:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/le/att.h")
                DW_AT_decl_line	(45)

0x0000030a:     DW_TAG_enumerator
                  DW_AT_name	("ATT_OP_AUTO_READ_CCC")
                  DW_AT_const_value	(0)

0x00000310:     DW_TAG_enumerator
                  DW_AT_name	("ATT_OP_NOTIFY")
                  DW_AT_const_value	(1)

0x00000316:     DW_TAG_enumerator
                  DW_AT_name	("ATT_OP_INDICATE")
                  DW_AT_const_value	(2)

0x0000031c:     DW_TAG_enumerator
                  DW_AT_name	("ATT_OP_READ")
                  DW_AT_const_value	(3)

0x00000322:     DW_TAG_enumerator
                  DW_AT_name	("ATT_OP_READ_LONG")
                  DW_AT_const_value	(4)

0x00000328:     DW_TAG_enumerator
                  DW_AT_name	("ATT_OP_WRITE")
                  DW_AT_const_value	(5)

0x0000032e:     DW_TAG_enumerator
                  DW_AT_name	("ATT_OP_WRITE_WITHOUT_RESPOND")
                  DW_AT_const_value	(6)

0x00000334:     DW_TAG_enumerator
                  DW_AT_name	("ATT_OP_CMD_MAX")
                  DW_AT_const_value	(15)

0x0000033a:     NULL

0x0000033b:   DW_TAG_pointer_type

0x0000033c:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000000)
                DW_AT_high_pc	(0x0000000000000047)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
