; ModuleID = 'avctp_user.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.user_info_t = type { %struct.user_cmd_ctrl, %struct.run_loop, [1 x %struct.conn_info], %struct.user_core_data_t, %struct.btstack_timer_source, [6 x i8], [10 x [6 x i8]], [6 x i8], i8, i8, i16, [6 x i8], i8, i32 }
%struct.user_cmd_ctrl = type { i8, i8, i8, [30 x i8], i8*, i16, i8, i8, i8, [1 x i8], [1 x %struct.sniff_ctrl_config_t], [16 x i8], [10 x i8], i8, i8, [5 x i8], i8, i8, i8, i8, [10 x i8], i32, [6 x i8], [6 x i8] }
%struct.sniff_ctrl_config_t = type { i16, i16, i16, i16, [6 x i8] }
%struct.run_loop = type { %struct.btstack_linked_item, void (%struct.run_loop*)*, i8* }
%struct.btstack_linked_item = type { %struct.btstack_linked_item* }
%struct.conn_info = type { [6 x i8], i16, i16, i8, i8, [5 x i8], i8, %struct.btstack_linked_item* }
%struct.user_core_data_t = type { i8, [6 x i8], [6 x i8], [6 x i8] }
%struct.btstack_timer_source = type { %struct.btstack_linked_item, i32, i32, void (%struct.btstack_timer_source*)*, i8* }
%struct._stack_config = type <{ i32, i16, i16, i16, i16, i16, i8, i8, i8, i32, i8, i8, i8, i8, [6 x i8], i8 }>
%struct.hci_cmd_t = type { i16, i8* }

!292 = !DIEnumerator(name: "HFP_AG_OUTGOING_CALL", value: 24)
!293 = !DIEnumerator(name: "HFP_SEND_USER_AT_CMD", value: 25)
!294 = !DIEnumerator(name: "HFP_NO_OPERATE", value: 255)
!295 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !266, line: 124, size: 32, elements: !296)
!296 = !{!297, !298, !299, !300}
!297 = !DIEnumerator(name: "HFP_GAIN_INC", value: 0)
!298 = !DIEnumerator(name: "HFP_GAIN_DEC", value: 1)
!299 = !DIEnumerator(name: "HFP_GAIN_SET_GAIN", value: 2)
!300 = !DIEnumerator(name: "HFP_GAIN_GET_GAIN", value: 3)
!301 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !266, line: 132, size: 32, elements: !302)
!302 = !{!303, !304, !305, !306, !307, !308, !309}
!303 = !DIEnumerator(name: "THREE_WAY_OP_0", value: 0)
!304 = !DIEnumerator(name: "THREE_WAY_OP_1", value: 1)
!305 = !DIEnumerator(name: "THREE_WAY_OP_1X", value: 2)
!306 = !DIEnumerator(name: "THREE_WAY_OP_2", value: 3)
!307 = !DIEnumerator(name: "THREE_WAY_OP_2X", value: 4)
!308 = !DIEnumerator(name: "THREE_WAY_OP_3", value: 5)
!309 = !DIEnumerator(name: "THREE_WAY_OP_4", value: 6)
!310 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !311, line: 11, size: 32, elements: !312)
!311 = !DIFile(filename: "../btstack/Host/include/common/bt_config.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!312 = !{!313, !314, !315}
!313 = !DIEnumerator(name: "ACTIVE_MODE", value: 0)
!314 = !DIEnumerator(name: "HOLD_MODE", value: 1)
!315 = !DIEnumerator(name: "SNIFF_MODE", value: 2)
!316 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !22, line: 363, size: 32, elements: !317)
!317 = !{!318, !319, !320, !321, !322, !323, !324, !325}
!318 = !DIEnumerator(name: "BT_CALL_BATTERY_CHG", value: 0)
!319 = !DIEnumerator(name: "BT_CALL_SIGNAL_CHG", value: 1)
!320 = !DIEnumerator(name: "BT_CALL_INCOMING", value: 2)
!321 = !DIEnumerator(name: "BT_CALL_OUTGOING", value: 3)
!322 = !DIEnumerator(name: "BT_CALL_ACTIVE", value: 4)
!323 = !DIEnumerator(name: "BT_CALL_HANGUP", value: 5)
!324 = !DIEnumerator(name: "BT_CALL_ALERT", value: 6)
!325 = !DIEnumerator(name: "BT_CALL_VOL_CHANGED", value: 7)
!326 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !327, line: 70, size: 32, elements: !328)
!327 = !DIFile(filename: "../btstack/Profile/include/bredr/hid_profile.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!328 = !{!329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340}
!329 = !DIEnumerator(name: "HID_CMD_ANDROID_SHUTTER", value: 1)
!330 = !DIEnumerator(name: "HID_CMD_IOS_SHUTTER", value: 2)
!331 = !DIEnumerator(name: "HID_CMD_BOTH_SHUTTER", value: 3)
!332 = !DIEnumerator(name: "HID_CMD_HOME_KEY", value: 4)
!333 = !DIEnumerator(name: "HID_CMD_RETURN_KEY", value: 5)
!334 = !DIEnumerator(name: "HID_CMD_LEFTARROW_KEY", value: 6)
!335 = !DIEnumerator(name: "HID_CMD_RIGHTARROW_KEY", value: 7)
!336 = !DIEnumerator(name: "HID_CMD_CONNECT", value: 8)
!337 = !DIEnumerator(name: "HID_CMD_DISCONNECT", value: 9)
!338 = !DIEnumerator(name: "HID_CMD_INCREASE_VOL", value: 10)
!339 = !DIEnumerator(name: "HID_CMD_DECREASE_VOL", value: 11)
!340 = !DIEnumerator(name: "HID_CMD_DIY_RESUME_SEND", value: 12)
!341 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !342, line: 26, size: 32, elements: !343)
!342 = !DIFile(filename: "../btstack/Profile/include/bredr/iap_profile.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!343 = !{!344, !345, !346}
!344 = !DIEnumerator(name: "IAP_CMD_CONNECT", value: 1)
!345 = !DIEnumerator(name: "IAP_CMD_DISCONNECT", value: 2)
!346 = !DIEnumerator(name: "IAP_CMD_SEND_DATA", value: 3)
!347 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !348, line: 26, size: 32, elements: !349)
!348 = !DIFile(filename: "../btstack/Profile/include/bredr/spp_profile.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!349 = !{!350, !351, !352}
!350 = !DIEnumerator(name: "SPP_CMD_CONNECT", value: 1)
!351 = !DIEnumerator(name: "SPP_CMD_DISCONNECT", value: 2)
!352 = !DIEnumerator(name: "SPP_CMD_SEND_DATA", value: 3)
!353 = !{!354, !355, !359, !360, !368, !380}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !357, line: 44, baseType: !358)
!357 = !DIFile(filename: "../btcommon/typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!358 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!359 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_item_t", file: !362, line: 100, baseType: !363)
!362 = !DIFile(filename: "../btcommon/btstack_linked_list.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_linked_item_t", file: !362, line: 55, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btstack_linked_item", file: !362, line: 53, size: 32, elements: !365)
!365 = !{!366}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !364, file: !362, line: 54, baseType: !367, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "resend_t", file: !6, line: 74, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 70, size: 64, elements: !371)
!371 = !{!372, !373, !376}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !370, file: !6, line: 71, baseType: !361, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !370, file: !6, line: 72, baseType: !374, size: 16, offset: 32)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !357, line: 46, baseType: !375)
!375 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !370, file: !6, line: 73, baseType: !377, offset: 48)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 0)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !357, line: 48, baseType: !381)
!381 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!382 = !{!0, !383, !389, !400, !546}
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "base_table", scope: !2, file: !3, line: 1288, type: !385, isLocal: false, isDefinition: true)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 192, elements: !387)
!386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !380)
!387 = !{!388}
!388 = !DISubrange(count: 6)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "bt_suspend_user_cmd_loop_resumeuser_cmd_loop_release", scope: !2, file: !3, line: 3142, type: !391, isLocal: false, isDefinition: true)
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bt_sleep", file: !311, line: 313, size: 96, elements: !393)
!393 = !{!394, !398, !399}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "suspend", scope: !392, file: !311, line: 314, baseType: !395, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!396 = !DISubroutineType(types: !397)
!397 = !{!359, null}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "resume", scope: !392, file: !311, line: 315, baseType: !395, size: 32, offset: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !392, file: !311, line: 316, baseType: !395, size: 32, offset: 64)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "__user_info", scope: !2, file: !3, line: 127, type: !402, isLocal: true, isDefinition: true)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_info_t", file: !3, line: 125, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 106, size: 2304, elements: !404)
!404 = !{!405, !460, !471, !505, !513, !532, !533, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_struct", scope: !403, file: !3, line: 107, baseType: !406, size: 992)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "user_cmd_ctrl", file: !3, line: 37, size: 992, elements: !407)
!407 = !{!408, !409, !410, !411, !415, !416, !417, !418, !419, !420, !424, !437, !441, !445, !446, !447, !451, !452, !453, !454, !455, !456, !457, !459}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "pos_read", scope: !406, file: !3, line: 38, baseType: !356, size: 8)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pos_write", scope: !406, file: !3, line: 39, baseType: !356, size: 8, offset: 8)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "phone_num_len", scope: !406, file: !3, line: 40, baseType: !356, size: 8, offset: 16)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "phone_num_buf", scope: !406, file: !3, line: 41, baseType: !412, size: 240, offset: 24)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 240, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 30)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "spp_send_buf_ptr", scope: !406, file: !3, line: 43, baseType: !355, size: 32, offset: 288)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "spp_send_buf_len", scope: !406, file: !3, line: 44, baseType: !374, size: 16, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "phone_hfp_set_vol", scope: !406, file: !3, line: 56, baseType: !356, size: 8, offset: 336)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "dtmf_num", scope: !406, file: !3, line: 57, baseType: !356, size: 8, offset: 344)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "inquiry_num_time", scope: !406, file: !3, line: 58, baseType: !356, size: 8, offset: 352)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "sniff_num", scope: !406, file: !3, line: 59, baseType: !421, size: 8, offset: 360)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 8, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 1)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "sniff_ctrl_config", scope: !406, file: !3, line: 60, baseType: !425, size: 112, offset: 368)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 112, elements: !422)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sniff_ctrl_config_t", file: !22, line: 399, size: 112, elements: !427)
!427 = !{!428, !431, !432, !433, !434}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "sniff_max_interval", scope: !426, file: !22, line: 400, baseType: !429, size: 16)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !430, line: 13, baseType: !375)
!430 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!431 = !DIDerivedType(tag: DW_TAG_member, name: "sniff_mix_interval", scope: !426, file: !22, line: 401, baseType: !429, size: 16, offset: 16)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "sniff_attemp", scope: !426, file: !22, line: 402, baseType: !429, size: 16, offset: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "sniff_timeout", scope: !426, file: !22, line: 403, baseType: !429, size: 16, offset: 48)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "sniff_addr", scope: !426, file: !22, line: 404, baseType: !435, size: 48, offset: 64)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 48, elements: !387)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !430, line: 11, baseType: !358)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "user_cmd_buf", scope: !406, file: !3, line: 62, baseType: !438, size: 128, offset: 480)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 128, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 16)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "emitter_cmd_buf", scope: !406, file: !3, line: 63, baseType: !442, size: 80, offset: 608)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 80, elements: !443)
!443 = !{!444}
!444 = !DISubrange(count: 10)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "emitter_pos_read", scope: !406, file: !3, line: 64, baseType: !356, size: 8, offset: 688)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "emitter_pos_write", scope: !406, file: !3, line: 65, baseType: !356, size: 8, offset: 696)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "unactive_cmd_buf", scope: !406, file: !3, line: 66, baseType: !448, size: 40, offset: 704)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 40, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 5)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "unactive_pos_read", scope: !406, file: !3, line: 67, baseType: !356, size: 8, offset: 744)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "unactive_pos_write", scope: !406, file: !3, line: 68, baseType: !356, size: 8, offset: 752)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "keypress", scope: !406, file: !3, line: 69, baseType: !356, size: 8, offset: 760)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "pair", scope: !406, file: !3, line: 70, baseType: !356, size: 8, offset: 768)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "afh_channel", scope: !406, file: !3, line: 71, baseType: !442, size: 80, offset: 776)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !406, file: !3, line: 72, baseType: !380, size: 32, offset: 864)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "second_a2dp_source_addr", scope: !406, file: !3, line: 73, baseType: !458, size: 48, offset: 896)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 48, elements: !387)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "hci_disconn_addr", scope: !406, file: !3, line: 74, baseType: !458, size: 48, offset: 944)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !403, file: !3, line: 108, baseType: !461, size: 96, offset: 992)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "run_loop", file: !462, line: 9, size: 96, elements: !463)
!462 = !DIFile(filename: "../btcommon/run_loop.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!463 = !{!464, !465, !470}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !461, file: !462, line: 10, baseType: !363, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "run", scope: !461, file: !462, line: 11, baseType: !466, size: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 32)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !469}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !461, file: !462, line: 12, baseType: !354, size: 32, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "bt_conn", scope: !403, file: !3, line: 109, baseType: !472, size: 192, offset: 1088)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 192, elements: !422)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn_info", file: !3, line: 79, size: 192, elements: !474)
!474 = !{!475, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "mac_addr", scope: !473, file: !3, line: 80, baseType: !476, size: 48)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_addr_t", file: !477, line: 66, baseType: !478)
!477 = !DIFile(filename: "../btcommon/utils.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 48, elements: !387)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !357, line: 44, baseType: !358)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "hci_connect_handle", scope: !473, file: !3, line: 81, baseType: !374, size: 16, offset: 48)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "curr_channel", scope: !473, file: !3, line: 82, baseType: !374, size: 16, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "remote_not_support_channel", scope: !473, file: !3, line: 83, baseType: !356, size: 8, offset: 80)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "connect_status", scope: !473, file: !3, line: 84, baseType: !356, size: 8, offset: 88)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "hfp_status", scope: !473, file: !3, line: 85, baseType: !356, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "bt_hfp_flag", scope: !473, file: !3, line: 86, baseType: !356, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "second_call_status", scope: !473, file: !3, line: 87, baseType: !356, size: 4, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "a2dp_status", scope: !473, file: !3, line: 88, baseType: !356, size: 4, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "avctp_ctrl_status", scope: !473, file: !3, line: 89, baseType: !356, size: 4, offset: 112, flags: DIFlagBitField, extraData: i64 96)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "connect_a2dp_cnt", scope: !473, file: !3, line: 90, baseType: !356, size: 4, offset: 116, flags: DIFlagBitField, extraData: i64 96)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "one_call_onheld", scope: !473, file: !3, line: 91, baseType: !356, size: 2, offset: 120, flags: DIFlagBitField, extraData: i64 96)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "reserve2", scope: !473, file: !3, line: 92, baseType: !356, size: 3, offset: 122, flags: DIFlagBitField, extraData: i64 96)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "inused", scope: !473, file: !3, line: 93, baseType: !356, size: 1, offset: 125, flags: DIFlagBitField, extraData: i64 96)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "a2dp_decoder_status", scope: !473, file: !3, line: 94, baseType: !356, size: 1, offset: 126, flags: DIFlagBitField, extraData: i64 96)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "inband_ringtone", scope: !473, file: !3, line: 95, baseType: !356, size: 1, offset: 127, flags: DIFlagBitField, extraData: i64 96)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "auto_connect_a2dp", scope: !473, file: !3, line: 96, baseType: !356, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 96)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "current_mode", scope: !473, file: !3, line: 97, baseType: !356, size: 2, offset: 129, flags: DIFlagBitField, extraData: i64 96)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "avdtp_a2dp_connect_state", scope: !473, file: !3, line: 98, baseType: !356, size: 2, offset: 131, flags: DIFlagBitField, extraData: i64 96)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "hid_disconn_state", scope: !473, file: !3, line: 99, baseType: !356, size: 1, offset: 133, flags: DIFlagBitField, extraData: i64 96)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "role_type", scope: !473, file: !3, line: 100, baseType: !356, size: 1, offset: 134, flags: DIFlagBitField, extraData: i64 96)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "reserve", scope: !473, file: !3, line: 101, baseType: !356, size: 1, offset: 135, flags: DIFlagBitField, extraData: i64 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "sniff_cnt", scope: !473, file: !3, line: 102, baseType: !356, size: 8, offset: 136)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "user_at_cmd_item", scope: !473, file: !3, line: 103, baseType: !503, size: 32, offset: 160)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_list_t", file: !362, line: 101, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "user_core_data", scope: !403, file: !3, line: 110, baseType: !506, size: 152, offset: 1280)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_core_data_t", file: !3, line: 32, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 27, size: 152, elements: !508)
!508 = !{!509, !510, !511, !512}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "phone_sound_ctrl_flag", scope: !507, file: !3, line: 28, baseType: !356, size: 8)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "last_bd_addr", scope: !507, file: !3, line: 29, baseType: !476, size: 48, offset: 8)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "name_bd_addr", scope: !507, file: !3, line: 30, baseType: !476, size: 48, offset: 56)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "special_conn_addr", scope: !507, file: !3, line: 31, baseType: !476, size: 48, offset: 104)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "user_half_sec_loop", scope: !403, file: !3, line: 111, baseType: !514, size: 160, offset: 1440)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_timer_source_t", file: !515, line: 19, baseType: !516)
!515 = !DIFile(filename: "../btcommon/btstack_sys_timer.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btstack_timer_source", file: !515, line: 7, size: 160, elements: !517)
!517 = !{!518, !519, !521, !522, !523, !524, !525, !526, !531}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !516, file: !515, line: 8, baseType: !363, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !516, file: !515, line: 10, baseType: !520, size: 32, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !357, line: 48, baseType: !381)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_interval", scope: !516, file: !515, line: 11, baseType: !520, size: 16, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "timer_type", scope: !516, file: !515, line: 12, baseType: !520, size: 4, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "timer_tick_overflow", scope: !516, file: !515, line: 13, baseType: !520, size: 1, offset: 84, flags: DIFlagBitField, extraData: i64 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "loop_flag", scope: !516, file: !515, line: 14, baseType: !520, size: 1, offset: 85, flags: DIFlagBitField, extraData: i64 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "loop_times", scope: !516, file: !515, line: 15, baseType: !520, size: 10, offset: 86, flags: DIFlagBitField, extraData: i64 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !516, file: !515, line: 17, baseType: !527, size: 32, offset: 96)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 32)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !530}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !516, file: !515, line: 18, baseType: !354, size: 32, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "active_mac_addr", scope: !403, file: !3, line: 112, baseType: !476, size: 48, offset: 1600)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "more_mac_addr", scope: !403, file: !3, line: 113, baseType: !534, size: 480, offset: 1648)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 480, elements: !443)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "emitter_last_bd_addr", scope: !403, file: !3, line: 114, baseType: !476, size: 48, offset: 2128)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "bt_newest_status", scope: !403, file: !3, line: 115, baseType: !356, size: 8, offset: 2176)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "tws_host_timer_cnt", scope: !403, file: !3, line: 116, baseType: !356, size: 8, offset: 2184)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "total_connect_dev", scope: !403, file: !3, line: 117, baseType: !356, size: 3, offset: 2192, flags: DIFlagBitField, extraData: i64 2192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "current_search_index", scope: !403, file: !3, line: 118, baseType: !356, size: 3, offset: 2195, flags: DIFlagBitField, extraData: i64 2192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "stack_release", scope: !403, file: !3, line: 119, baseType: !356, size: 1, offset: 2198, flags: DIFlagBitField, extraData: i64 2192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "stack_exiting", scope: !403, file: !3, line: 120, baseType: !356, size: 1, offset: 2199, flags: DIFlagBitField, extraData: i64 2192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "in_background_flag", scope: !403, file: !3, line: 121, baseType: !356, size: 1, offset: 2200, flags: DIFlagBitField, extraData: i64 2192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "conning_mac_addr", scope: !403, file: !3, line: 122, baseType: !476, size: 48, offset: 2208)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "keypress_cnt", scope: !403, file: !3, line: 123, baseType: !356, size: 8, offset: 2256)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "keypress", scope: !403, file: !3, line: 124, baseType: !380, size: 32, offset: 2272)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "g_user_cmd", scope: !2, file: !3, line: 76, type: !548, isLocal: true, isDefinition: true)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 32)
!549 = !DIFile(filename: "../btcommon/profile_stack_debug.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!550 = !{i32 2, !"Dwarf Version", i32 4}
!551 = !{i32 2, !"Debug Info Version", i32 3}
!552 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!553 = distinct !DISubprogram(name: "set_stack_exiting", scope: !3, file: !3, line: 141, type: !554, isLocal: false, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !556)
!554 = !DISubroutineType(types: !555)
!555 = !{null, !356}
!556 = !{!557}
!557 = !DILocalVariable(name: "exit", arg: 1, scope: !553, file: !3, line: 141, type: !356)
!558 = !DILocation(line: 141, column: 27, scope: !553)
!559 = !DILocation(line: 143, column: 30, scope: !553)
!560 = !DILocation(line: 144, column: 1, scope: !553)
!561 = distinct !DISubprogram(name: "phone_sound_ctrl_flag_detect", scope: !3, file: !3, line: 205, type: !562, isLocal: false, isDefinition: true, scopeLine: 206, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !564)
!562 = !DISubroutineType(types: !563)
!563 = !{!356}
!564 = !{}
!565 = !DILocation(line: 207, column: 36, scope: !566)
!566 = distinct !DILexicalBlock(scope: !561, file: !3, line: 207, column: 9)
!567 = !{!568, !570, i64 160}
!568 = !{!"", !569, i64 0, !575, i64 124, !570, i64 136, !577, i64 160, !578, i64 180, !570, i64 200, !570, i64 206, !570, i64 266, !570, i64 272, !570, i64 273, !570, i64 274, !570, i64 274, !570, i64 274, !570, i64 274, !570, i64 275, !570, i64 276, !570, i64 282, !574, i64 284}
!569 = !{!"user_cmd_ctrl", !570, i64 0, !570, i64 1, !570, i64 2, !570, i64 3, !572, i64 36, !573, i64 40, !570, i64 42, !570, i64 43, !570, i64 44, !570, i64 45, !570, i64 46, !570, i64 60, !570, i64 76, !570, i64 86, !570, i64 87, !570, i64 88, !570, i64 93, !570, i64 94, !570, i64 95, !570, i64 96, !570, i64 97, !574, i64 108, !570, i64 112, !570, i64 118}
!570 = !{!"omnipotent char", !571, i64 0}
!571 = !{!"Simple C/C++ TBAA"}
!572 = !{!"any pointer", !570, i64 0}
!573 = !{!"short", !570, i64 0}
!574 = !{!"int", !570, i64 0}
!575 = !{!"run_loop", !576, i64 0, !572, i64 4, !572, i64 8}
!576 = !{!"btstack_linked_item", !572, i64 0}
!577 = !{!"", !570, i64 0, !570, i64 1, !570, i64 7, !570, i64 13}
!578 = !{!"btstack_timer_source", !576, i64 0, !574, i64 4, !574, i64 8, !574, i64 10, !574, i64 10, !574, i64 10, !574, i64 10, !572, i64 12, !572, i64 16}
!579 = !DILocation(line: 207, column: 63, scope: !566)
!580 = !DILocation(line: 208, column: 56, scope: !581)
!581 = distinct !DILexicalBlock(scope: !566, file: !3, line: 207, column: 121)
!582 = !DILocation(line: 209, column: 9, scope: !581)
!583 = !DILocation(line: 213, column: 1, scope: !561)
!584 = distinct !DISubprogram(name: "tws_host_timer_cnt_detect", scope: !3, file: !3, line: 215, type: !562, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !564)
!585 = !DILocation(line: 217, column: 20, scope: !586)
!586 = distinct !DILexicalBlock(scope: !584, file: !3, line: 217, column: 9)
!587 = !{!568, !570, i64 273}
!588 = !DILocation(line: 217, column: 39, scope: !586)
!589 = !DILocation(line: 217, column: 9, scope: !584)
!590 = !DILocation(line: 218, column: 38, scope: !591)
!591 = distinct !DILexicalBlock(scope: !586, file: !3, line: 217, column: 44)
!592 = !DILocation(line: 219, column: 9, scope: !591)
!593 = !DILocation(line: 223, column: 1, scope: !584)
!594 = distinct !DISubprogram(name: "b_create_bt_new_conn", scope: !3, file: !3, line: 316, type: !595, isLocal: false, isDefinition: true, scopeLine: 317, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !598)
!595 = !DISubroutineType(types: !596)
!596 = !{!597, !355, !374}
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !357, line: 44, baseType: !358)
!598 = !{!599, !600}
!599 = !DILocalVariable(name: "addr", arg: 1, scope: !594, file: !3, line: 316, type: !355)
!600 = !DILocalVariable(name: "hci_handle", arg: 2, scope: !594, file: !3, line: 316, type: !374)
!601 = !DILocation(line: 316, column: 31, scope: !594)
!602 = !DILocation(line: 316, column: 41, scope: !594)
!603 = !DILocation(line: 318, column: 9, scope: !604)
!604 = distinct !DILexicalBlock(scope: !594, file: !3, line: 318, column: 9)
!605 = !DILocation(line: 321, column: 5, scope: !594)
!606 = !DILocation(line: 322, column: 1, scope: !594)
!607 = distinct !DISubprogram(name: "create_bt_new_conn", scope: !3, file: !3, line: 284, type: !608, isLocal: true, isDefinition: true, scopeLine: 285, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !613)
!608 = !DISubroutineType(types: !609)
!609 = !{!610, !612, !374}
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_info_t", file: !3, line: 104, baseType: !473)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 32)
!613 = !{!614, !615, !616}
!614 = !DILocalVariable(name: "addr", arg: 1, scope: !607, file: !3, line: 284, type: !612)
!615 = !DILocalVariable(name: "hci_handle", arg: 2, scope: !607, file: !3, line: 284, type: !374)
!616 = !DILocalVariable(name: "conn", scope: !607, file: !3, line: 286, type: !610)
!617 = !DILocation(line: 284, column: 50, scope: !607)
!618 = !DILocation(line: 284, column: 60, scope: !607)
!619 = !DILocation(line: 287, column: 5, scope: !620)
!620 = distinct !DILexicalBlock(scope: !607, file: !3, line: 287, column: 5)
!621 = !{!570, !570, i64 0}
!622 = !DILocation(line: 287, column: 5, scope: !607)
!623 = !DILocation(line: 287, column: 5, scope: !624)
!624 = !DILexicalBlockFile(scope: !620, file: !3, discriminator: 1)
!625 = !DILocation(line: 288, column: 5, scope: !626)
!626 = distinct !DILexicalBlock(scope: !607, file: !3, line: 288, column: 5)
!627 = !DILocation(line: 288, column: 5, scope: !607)
!628 = !DILocation(line: 288, column: 5, scope: !629)
!629 = !DILexicalBlockFile(scope: !626, file: !3, discriminator: 1)
!630 = !DILocation(line: 289, column: 12, scope: !607)
!631 = !DILocation(line: 286, column: 18, scope: !607)
!632 = !DILocation(line: 290, column: 9, scope: !633)
!633 = distinct !DILexicalBlock(scope: !607, file: !3, line: 290, column: 9)
!634 = !DILocation(line: 290, column: 9, scope: !607)
!635 = !DILocation(line: 296, column: 20, scope: !636)
!636 = distinct !DILexicalBlock(scope: !637, file: !3, line: 296, column: 13)
!637 = distinct !DILexicalBlock(scope: !638, file: !3, line: 295, column: 33)
!638 = distinct !DILexicalBlock(scope: !639, file: !3, line: 295, column: 5)
!639 = distinct !DILexicalBlock(scope: !607, file: !3, line: 295, column: 5)
!640 = !DILocation(line: 292, column: 15, scope: !641)
!641 = distinct !DILexicalBlock(scope: !633, file: !3, line: 290, column: 15)
!642 = !DILocation(line: 292, column: 34, scope: !641)
!643 = !{!644, !573, i64 6}
!644 = !{!"conn_info", !570, i64 0, !573, i64 6, !573, i64 8, !570, i64 10, !570, i64 11, !570, i64 12, !570, i64 12, !570, i64 13, !570, i64 13, !570, i64 14, !570, i64 14, !570, i64 15, !570, i64 15, !570, i64 15, !570, i64 15, !570, i64 15, !570, i64 16, !570, i64 16, !570, i64 16, !570, i64 16, !570, i64 16, !570, i64 16, !570, i64 17, !572, i64 20}
!645 = !DILocation(line: 293, column: 9, scope: !641)
!646 = !DILocation(line: 296, column: 14, scope: !636)
!647 = !DILocation(line: 296, column: 13, scope: !637)
!648 = !DILocation(line: 297, column: 26, scope: !649)
!649 = distinct !DILexicalBlock(scope: !636, file: !3, line: 296, column: 28)
!650 = !DILocation(line: 298, column: 41, scope: !649)
!651 = !DILocation(line: 299, column: 30, scope: !649)
!652 = !DILocation(line: 301, column: 37, scope: !649)
!653 = !DILocation(line: 302, column: 13, scope: !649)
!654 = !DILocation(line: 303, column: 19, scope: !649)
!655 = !DILocation(line: 303, column: 46, scope: !649)
!656 = !{!644, !570, i64 10}
!657 = !DILocation(line: 304, column: 19, scope: !649)
!658 = !DILocation(line: 304, column: 38, scope: !649)
!659 = !DILocation(line: 307, column: 29, scope: !649)
!660 = !DILocation(line: 308, column: 13, scope: !649)
!661 = !{!572, !572, i64 0}
!662 = !DILocation(line: 308, column: 33, scope: !649)
!663 = !DILocation(line: 308, column: 53, scope: !649)
!664 = !DILocation(line: 310, column: 13, scope: !649)
!665 = !DILocation(line: 295, column: 5, scope: !666)
!666 = !DILexicalBlockFile(scope: !638, file: !3, discriminator: 2)
!667 = !DILocation(line: 295, column: 5, scope: !668)
!668 = !DILexicalBlockFile(scope: !638, file: !3, discriminator: 1)
!669 = !DILocation(line: 295, column: 5, scope: !670)
!670 = !DILexicalBlockFile(scope: !639, file: !3, discriminator: 1)
!671 = distinct !{!671, !672, !673}
!672 = !DILocation(line: 295, column: 5, scope: !639)
!673 = !DILocation(line: 312, column: 5, scope: !639)
!674 = !DILocation(line: 314, column: 1, scope: !607)
!675 = distinct !DISubprogram(name: "free_conn_for_addr", scope: !3, file: !3, line: 328, type: !676, isLocal: false, isDefinition: true, scopeLine: 329, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !678)
!676 = !DISubroutineType(types: !677)
!677 = !{!597, !612, !356}
!678 = !{!679, !680, !681}
!679 = !DILocalVariable(name: "addr", arg: 1, scope: !675, file: !3, line: 328, type: !612)
!680 = !DILocalVariable(name: "conn_res", arg: 2, scope: !675, file: !3, line: 328, type: !356)
!681 = !DILocalVariable(name: "conn", scope: !675, file: !3, line: 330, type: !610)
!682 = !DILocation(line: 328, column: 35, scope: !675)
!683 = !DILocation(line: 328, column: 44, scope: !675)
!684 = !DILocation(line: 330, column: 25, scope: !675)
!685 = !DILocation(line: 330, column: 18, scope: !675)
!686 = !DILocation(line: 333, column: 9, scope: !687)
!687 = distinct !DILexicalBlock(scope: !675, file: !3, line: 333, column: 9)
!688 = !DILocation(line: 334, column: 13, scope: !689)
!689 = distinct !DILexicalBlock(scope: !690, file: !3, line: 334, column: 13)
!690 = distinct !DILexicalBlock(scope: !687, file: !3, line: 333, column: 19)
!691 = !DILocation(line: 333, column: 9, scope: !675)
!692 = !DILocation(line: 335, column: 23, scope: !693)
!693 = distinct !DILexicalBlock(scope: !694, file: !3, line: 335, column: 17)
!694 = distinct !DILexicalBlock(scope: !689, file: !3, line: 334, column: 19)
!695 = !DILocation(line: 335, column: 33, scope: !693)
!696 = !DILocation(line: 335, column: 17, scope: !694)
!697 = !DILocation(line: 336, column: 17, scope: !698)
!698 = distinct !DILexicalBlock(scope: !693, file: !3, line: 335, column: 50)
!699 = !DILocation(line: 337, column: 13, scope: !698)
!700 = !DILocation(line: 338, column: 17, scope: !701)
!701 = distinct !DILexicalBlock(scope: !693, file: !3, line: 337, column: 20)
!702 = !DILocation(line: 343, column: 9, scope: !675)
!703 = !DILocation(line: 345, column: 15, scope: !704)
!704 = distinct !DILexicalBlock(scope: !705, file: !3, line: 343, column: 15)
!705 = distinct !DILexicalBlock(scope: !675, file: !3, line: 343, column: 9)
!706 = !DILocation(line: 345, column: 22, scope: !704)
!707 = !DILocation(line: 346, column: 37, scope: !704)
!708 = !DILocation(line: 350, column: 9, scope: !704)
!709 = !DILocation(line: 351, column: 5, scope: !704)
!710 = !DILocation(line: 354, column: 19, scope: !711)
!711 = distinct !DILexicalBlock(scope: !712, file: !3, line: 354, column: 13)
!712 = distinct !DILexicalBlock(scope: !713, file: !3, line: 352, column: 33)
!713 = distinct !DILexicalBlock(scope: !714, file: !3, line: 352, column: 5)
!714 = distinct !DILexicalBlock(scope: !675, file: !3, line: 352, column: 5)
!715 = !DILocation(line: 354, column: 13, scope: !711)
!716 = !DILocation(line: 354, column: 13, scope: !712)
!717 = !DILocation(line: 356, column: 13, scope: !718)
!718 = distinct !DILexicalBlock(scope: !711, file: !3, line: 354, column: 27)
!719 = !DILocation(line: 357, column: 13, scope: !718)
!720 = !DILocation(line: 352, column: 5, scope: !721)
!721 = !DILexicalBlockFile(scope: !713, file: !3, discriminator: 2)
!722 = !DILocation(line: 352, column: 5, scope: !723)
!723 = !DILexicalBlockFile(scope: !713, file: !3, discriminator: 1)
!724 = !DILocation(line: 352, column: 5, scope: !725)
!725 = !DILexicalBlockFile(scope: !714, file: !3, discriminator: 1)
!726 = distinct !{!726, !727, !728}
!727 = !DILocation(line: 352, column: 5, scope: !714)
!728 = !DILocation(line: 359, column: 5, scope: !714)
!729 = !DILocation(line: 363, column: 1, scope: !675)
!730 = distinct !DISubprogram(name: "get_conn_for_addr", scope: !3, file: !3, line: 246, type: !731, isLocal: true, isDefinition: true, scopeLine: 247, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !733)
!731 = !DISubroutineType(types: !732)
!732 = !{!610, !612}
!733 = !{!734, !735}
!734 = !DILocalVariable(name: "addr", arg: 1, scope: !730, file: !3, line: 246, type: !612)
!735 = !DILocalVariable(name: "conn", scope: !730, file: !3, line: 248, type: !610)
!736 = !DILocation(line: 246, column: 49, scope: !730)
!737 = !DILocation(line: 248, column: 18, scope: !730)
!738 = !DILocation(line: 249, column: 5, scope: !739)
!739 = !DILexicalBlockFile(scope: !740, file: !3, discriminator: 1)
!740 = distinct !DILexicalBlock(scope: !730, file: !3, line: 249, column: 5)
!741 = !DILocation(line: 250, column: 14, scope: !742)
!742 = distinct !DILexicalBlock(scope: !743, file: !3, line: 250, column: 13)
!743 = distinct !DILexicalBlock(scope: !744, file: !3, line: 249, column: 33)
!744 = distinct !DILexicalBlock(scope: !740, file: !3, line: 249, column: 5)
!745 = !DILocation(line: 251, column: 13, scope: !742)
!746 = !DILocation(line: 251, column: 22, scope: !747)
!747 = !DILexicalBlockFile(scope: !742, file: !3, discriminator: 1)
!748 = !DILocation(line: 251, column: 16, scope: !747)
!749 = !DILocation(line: 250, column: 13, scope: !750)
!750 = !DILexicalBlockFile(scope: !743, file: !3, discriminator: 1)
!751 = !DILocation(line: 249, column: 5, scope: !752)
!752 = !DILexicalBlockFile(scope: !744, file: !3, discriminator: 2)
!753 = !DILocation(line: 249, column: 5, scope: !754)
!754 = !DILexicalBlockFile(scope: !744, file: !3, discriminator: 1)
!755 = distinct !{!755, !756, !757}
!756 = !DILocation(line: 249, column: 5, scope: !740)
!757 = !DILocation(line: 254, column: 5, scope: !740)
!758 = !DILocation(line: 256, column: 1, scope: !730)
!759 = distinct !DISubprogram(name: "get_bt_current_conn", scope: !3, file: !3, line: 364, type: !760, isLocal: false, isDefinition: true, scopeLine: 365, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !762)
!760 = !DISubroutineType(types: !761)
!761 = !{!610, !356}
!762 = !{!763, !764, !765, !766}
!763 = !DILocalVariable(name: "device_type", arg: 1, scope: !759, file: !3, line: 364, type: !356)
!764 = !DILocalVariable(name: "receiver_number", scope: !759, file: !3, line: 366, type: !359)
!765 = !DILocalVariable(name: "conn", scope: !759, file: !3, line: 367, type: !610)
!766 = !DILocalVariable(name: "temp_conn", scope: !759, file: !3, line: 368, type: !610)
!767 = !DILocation(line: 364, column: 37, scope: !759)
!768 = !DILocation(line: 366, column: 9, scope: !759)
!769 = !DILocation(line: 368, column: 18, scope: !759)
!770 = !DILocation(line: 369, column: 9, scope: !759)
!771 = !DILocation(line: 384, column: 24, scope: !772)
!772 = distinct !DILexicalBlock(scope: !773, file: !3, line: 384, column: 17)
!773 = distinct !DILexicalBlock(scope: !774, file: !3, line: 383, column: 37)
!774 = distinct !DILexicalBlock(scope: !775, file: !3, line: 383, column: 9)
!775 = distinct !DILexicalBlock(scope: !776, file: !3, line: 383, column: 9)
!776 = distinct !DILexicalBlock(scope: !777, file: !3, line: 382, column: 46)
!777 = distinct !DILexicalBlock(scope: !778, file: !3, line: 382, column: 16)
!778 = distinct !DILexicalBlock(scope: !759, file: !3, line: 369, column: 9)
!779 = !DILocation(line: 372, column: 24, scope: !780)
!780 = distinct !DILexicalBlock(scope: !781, file: !3, line: 372, column: 17)
!781 = distinct !DILexicalBlock(scope: !782, file: !3, line: 371, column: 37)
!782 = distinct !DILexicalBlock(scope: !783, file: !3, line: 371, column: 9)
!783 = distinct !DILexicalBlock(scope: !784, file: !3, line: 371, column: 9)
!784 = distinct !DILexicalBlock(scope: !778, file: !3, line: 369, column: 38)
!785 = !DILocation(line: 372, column: 17, scope: !780)
!786 = !DILocation(line: 372, column: 32, scope: !780)
!787 = !DILocation(line: 372, column: 42, scope: !788)
!788 = !DILexicalBlockFile(scope: !780, file: !3, discriminator: 1)
!789 = !DILocation(line: 372, column: 61, scope: !788)
!790 = !DILocation(line: 372, column: 17, scope: !791)
!791 = !DILexicalBlockFile(scope: !781, file: !3, discriminator: 1)
!792 = !DILocation(line: 373, column: 27, scope: !793)
!793 = distinct !DILexicalBlock(scope: !794, file: !3, line: 373, column: 21)
!794 = distinct !DILexicalBlock(scope: !780, file: !3, line: 372, column: 68)
!795 = !{!644, !573, i64 8}
!796 = !DILocation(line: 373, column: 40, scope: !793)
!797 = !DILocation(line: 373, column: 21, scope: !794)
!798 = !DILocation(line: 371, column: 9, scope: !799)
!799 = !DILexicalBlockFile(scope: !782, file: !3, discriminator: 2)
!800 = !DILocation(line: 367, column: 18, scope: !759)
!801 = !DILocation(line: 371, column: 9, scope: !802)
!802 = !DILexicalBlockFile(scope: !782, file: !3, discriminator: 1)
!803 = !DILocation(line: 371, column: 9, scope: !804)
!804 = !DILexicalBlockFile(scope: !783, file: !3, discriminator: 1)
!805 = distinct !{!805, !806, !807}
!806 = !DILocation(line: 371, column: 9, scope: !783)
!807 = !DILocation(line: 378, column: 9, scope: !783)
!808 = !DILocation(line: 384, column: 17, scope: !772)
!809 = !DILocation(line: 384, column: 32, scope: !772)
!810 = !DILocation(line: 384, column: 42, scope: !811)
!811 = !DILexicalBlockFile(scope: !772, file: !3, discriminator: 1)
!812 = !DILocation(line: 384, column: 61, scope: !811)
!813 = !DILocation(line: 384, column: 17, scope: !814)
!814 = !DILexicalBlockFile(scope: !773, file: !3, discriminator: 1)
!815 = !DILocation(line: 385, column: 27, scope: !816)
!816 = distinct !DILexicalBlock(scope: !817, file: !3, line: 385, column: 21)
!817 = distinct !DILexicalBlock(scope: !772, file: !3, line: 384, column: 68)
!818 = !DILocation(line: 385, column: 40, scope: !816)
!819 = !DILocation(line: 385, column: 21, scope: !817)
!820 = !DILocation(line: 383, column: 9, scope: !821)
!821 = !DILexicalBlockFile(scope: !774, file: !3, discriminator: 2)
!822 = !DILocation(line: 383, column: 9, scope: !823)
!823 = !DILexicalBlockFile(scope: !774, file: !3, discriminator: 1)
!824 = !DILocation(line: 383, column: 9, scope: !825)
!825 = !DILexicalBlockFile(scope: !775, file: !3, discriminator: 1)
!826 = distinct !{!826, !827, !828}
!827 = !DILocation(line: 383, column: 9, scope: !775)
!828 = !DILocation(line: 392, column: 9, scope: !775)
!829 = !DILocation(line: 393, column: 13, scope: !776)
!830 = !DILocation(line: 396, column: 13, scope: !831)
!831 = distinct !DILexicalBlock(scope: !832, file: !3, line: 395, column: 42)
!832 = distinct !DILexicalBlock(scope: !833, file: !3, line: 395, column: 20)
!833 = distinct !DILexicalBlock(scope: !776, file: !3, line: 393, column: 13)
!834 = !DILocation(line: 407, column: 12, scope: !759)
!835 = !DILocation(line: 407, column: 5, scope: !759)
!836 = !DILocation(line: 408, column: 1, scope: !759)
!837 = distinct !DISubprogram(name: "is_bt_conn_hfp_hangup", scope: !3, file: !3, line: 409, type: !838, isLocal: false, isDefinition: true, scopeLine: 410, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !840)
!838 = !DISubroutineType(types: !839)
!839 = !{!436, !355}
!840 = !{!841, !842}
!841 = !DILocalVariable(name: "addr", arg: 1, scope: !837, file: !3, line: 409, type: !355)
!842 = !DILocalVariable(name: "conn", scope: !837, file: !3, line: 411, type: !610)
!843 = !DILocation(line: 409, column: 30, scope: !837)
!844 = !DILocation(line: 411, column: 18, scope: !837)
!845 = !DILocation(line: 412, column: 5, scope: !846)
!846 = !DILexicalBlockFile(scope: !847, file: !3, discriminator: 1)
!847 = distinct !DILexicalBlock(scope: !837, file: !3, line: 412, column: 5)
!848 = !DILocation(line: 413, column: 14, scope: !849)
!849 = distinct !DILexicalBlock(scope: !850, file: !3, line: 413, column: 13)
!850 = distinct !DILexicalBlock(scope: !851, file: !3, line: 412, column: 33)
!851 = distinct !DILexicalBlock(scope: !847, file: !3, line: 412, column: 5)
!852 = !DILocation(line: 414, column: 13, scope: !849)
!853 = !DILocation(line: 414, column: 23, scope: !854)
!854 = !DILexicalBlockFile(scope: !849, file: !3, discriminator: 1)
!855 = !DILocation(line: 414, column: 16, scope: !854)
!856 = !DILocation(line: 414, column: 31, scope: !854)
!857 = !DILocation(line: 414, column: 41, scope: !858)
!858 = !DILexicalBlockFile(scope: !849, file: !3, discriminator: 2)
!859 = !DILocation(line: 414, column: 60, scope: !858)
!860 = !DILocation(line: 415, column: 34, scope: !861)
!861 = distinct !DILexicalBlock(scope: !862, file: !3, line: 415, column: 17)
!862 = distinct !DILexicalBlock(scope: !849, file: !3, line: 414, column: 67)
!863 = !DILocation(line: 413, column: 13, scope: !864)
!864 = !DILexicalBlockFile(scope: !850, file: !3, discriminator: 1)
!865 = !DILocation(line: 412, column: 5, scope: !866)
!866 = !DILexicalBlockFile(scope: !851, file: !3, discriminator: 2)
!867 = !DILocation(line: 412, column: 5, scope: !868)
!868 = !DILexicalBlockFile(scope: !851, file: !3, discriminator: 1)
!869 = distinct !{!869, !870, !871}
!870 = !DILocation(line: 412, column: 5, scope: !847)
!871 = !DILocation(line: 419, column: 5, scope: !847)
!872 = !DILocation(line: 421, column: 1, scope: !837)
!873 = distinct !DISubprogram(name: "btstack_avrcp_ch_creat_ok", scope: !3, file: !3, line: 425, type: !874, isLocal: false, isDefinition: true, scopeLine: 426, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !564)
!874 = !DISubroutineType(types: !875)
!875 = !{null}
!876 = !DILocation(line: 427, column: 5, scope: !873)
!877 = distinct !DISubprogram(name: "updata_profile_channels_status", scope: !3, file: !3, line: 433, type: !878, isLocal: false, isDefinition: true, scopeLine: 434, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !880)
!878 = !DISubroutineType(types: !879)
!879 = !{null, !355, !359, !359, !356}
!880 = !{!881, !882, !883, !884, !885}
!881 = !DILocalVariable(name: "addr", arg: 1, scope: !877, file: !3, line: 433, type: !355)
!882 = !DILocalVariable(name: "state", arg: 2, scope: !877, file: !3, line: 433, type: !359)
!883 = !DILocalVariable(name: "channel", arg: 3, scope: !877, file: !3, line: 433, type: !359)
!884 = !DILocalVariable(name: "conn_type", arg: 4, scope: !877, file: !3, line: 433, type: !356)
!885 = !DILocalVariable(name: "conn", scope: !877, file: !3, line: 435, type: !610)
!886 = !DILocation(line: 433, column: 41, scope: !877)
!887 = !DILocation(line: 433, column: 51, scope: !877)
!888 = !DILocation(line: 433, column: 62, scope: !877)
!889 = !DILocation(line: 433, column: 74, scope: !877)
!890 = !DILocation(line: 435, column: 25, scope: !877)
!891 = !DILocation(line: 435, column: 18, scope: !877)
!892 = !DILocation(line: 436, column: 14, scope: !893)
!893 = distinct !DILexicalBlock(scope: !877, file: !3, line: 436, column: 9)
!894 = !DILocation(line: 436, column: 9, scope: !877)
!895 = !DILocation(line: 440, column: 5, scope: !877)
!896 = !DILocation(line: 442, column: 9, scope: !897)
!897 = distinct !DILexicalBlock(scope: !898, file: !3, line: 442, column: 9)
!898 = distinct !DILexicalBlock(scope: !877, file: !3, line: 440, column: 20)
!899 = !DILocation(line: 442, column: 9, scope: !898)
!900 = !DILocation(line: 442, column: 9, scope: !901)
!901 = !DILexicalBlockFile(scope: !897, file: !3, discriminator: 1)
!902 = !DILocation(line: 443, column: 15, scope: !898)
!903 = !DILocation(line: 443, column: 42, scope: !898)
!904 = !DILocation(line: 444, column: 9, scope: !898)
!905 = !DILocation(line: 446, column: 14, scope: !906)
!906 = distinct !DILexicalBlock(scope: !898, file: !3, line: 446, column: 13)
!907 = !DILocation(line: 446, column: 34, scope: !906)
!908 = !{!909, !573, i64 12}
!909 = !{!"_stack_config", !574, i64 0, !573, i64 4, !573, i64 6, !573, i64 8, !573, i64 10, !573, i64 12, !570, i64 14, !570, i64 15, !570, i64 16, !570, i64 17, !570, i64 17, !570, i64 17, !570, i64 17, !570, i64 18, !570, i64 18, !570, i64 18, !570, i64 18, !570, i64 18, !570, i64 18, !570, i64 18, !570, i64 18, !570, i64 19, !570, i64 19, !570, i64 19, !570, i64 19, !570, i64 19, !570, i64 19, !570, i64 19, !570, i64 19, !570, i64 20, !570, i64 20, !570, i64 20, !570, i64 21, !570, i64 22, !570, i64 23, !570, i64 24, !570, i64 25, !570, i64 31, !570, i64 31}
!910 = !DILocation(line: 447, column: 13, scope: !906)
!911 = !DILocation(line: 449, column: 13, scope: !912)
!912 = distinct !DILexicalBlock(scope: !913, file: !3, line: 449, column: 13)
!913 = distinct !DILexicalBlock(scope: !906, file: !3, line: 447, column: 86)
!914 = !DILocation(line: 449, column: 13, scope: !913)
!915 = !DILocation(line: 449, column: 13, scope: !916)
!916 = !DILexicalBlockFile(scope: !912, file: !3, discriminator: 1)
!917 = !DILocation(line: 450, column: 25, scope: !918)
!918 = distinct !DILexicalBlock(scope: !913, file: !3, line: 450, column: 17)
!919 = !DILocation(line: 450, column: 17, scope: !913)
!920 = !DILocation(line: 451, column: 23, scope: !921)
!921 = distinct !DILexicalBlock(scope: !918, file: !3, line: 450, column: 54)
!922 = !DILocation(line: 451, column: 33, scope: !921)
!923 = !DILocation(line: 452, column: 13, scope: !921)
!924 = !DILocation(line: 454, column: 19, scope: !925)
!925 = distinct !DILexicalBlock(scope: !898, file: !3, line: 454, column: 13)
!926 = !DILocation(line: 454, column: 32, scope: !925)
!927 = !DILocation(line: 454, column: 13, scope: !898)
!928 = !DILocation(line: 2776, column: 35, scope: !929, inlinedAt: !930)
!929 = distinct !DISubprogram(name: "tws_host_timeout_set", scope: !3, file: !3, line: 2774, type: !874, isLocal: false, isDefinition: true, scopeLine: 2775, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !564)
!930 = distinct !DILocation(line: 456, column: 13, scope: !931)
!931 = distinct !DILexicalBlock(scope: !925, file: !3, line: 454, column: 38)
!932 = !DILocation(line: 2778, column: 5, scope: !929, inlinedAt: !930)
!933 = !DILocation(line: 458, column: 17, scope: !934)
!934 = distinct !DILexicalBlock(scope: !931, file: !3, line: 458, column: 17)
!935 = !DILocation(line: 458, column: 17, scope: !931)
!936 = !DILocation(line: 459, column: 17, scope: !937)
!937 = distinct !DILexicalBlock(scope: !934, file: !3, line: 458, column: 28)
!938 = !DILocation(line: 460, column: 13, scope: !937)
!939 = !DILocation(line: 462, column: 28, scope: !940)
!940 = distinct !DILexicalBlock(scope: !931, file: !3, line: 462, column: 17)
!941 = !DILocation(line: 462, column: 46, scope: !940)
!942 = !DILocation(line: 462, column: 17, scope: !931)
!943 = !DILocation(line: 463, column: 42, scope: !944)
!944 = distinct !DILexicalBlock(scope: !940, file: !3, line: 462, column: 52)
!945 = !DILocation(line: 463, column: 17, scope: !944)
!946 = !DILocation(line: 464, column: 13, scope: !944)
!947 = !DILocation(line: 465, column: 28, scope: !948)
!948 = distinct !DILexicalBlock(scope: !931, file: !3, line: 465, column: 17)
!949 = !DILocation(line: 465, column: 46, scope: !948)
!950 = !DILocation(line: 465, column: 17, scope: !931)
!951 = !DILocation(line: 466, column: 42, scope: !952)
!952 = distinct !DILexicalBlock(scope: !948, file: !3, line: 465, column: 52)
!953 = !DILocation(line: 466, column: 17, scope: !952)
!954 = !DILocation(line: 467, column: 13, scope: !952)
!955 = !DILocation(line: 469, column: 105, scope: !931)
!956 = !DILocation(line: 469, column: 13, scope: !931)
!957 = !DILocation(line: 470, column: 92, scope: !931)
!958 = !DILocation(line: 470, column: 13, scope: !931)
!959 = !DILocation(line: 471, column: 25, scope: !960)
!960 = distinct !DILexicalBlock(scope: !931, file: !3, line: 471, column: 17)
!961 = !DILocation(line: 471, column: 17, scope: !931)
!962 = !DILocation(line: 474, column: 31, scope: !963)
!963 = distinct !DILexicalBlock(scope: !964, file: !3, line: 474, column: 25)
!964 = distinct !DILexicalBlock(scope: !965, file: !3, line: 473, column: 32)
!965 = distinct !DILexicalBlock(scope: !966, file: !3, line: 473, column: 21)
!966 = distinct !DILexicalBlock(scope: !960, file: !3, line: 471, column: 36)
!967 = !DILocation(line: 474, column: 25, scope: !963)
!968 = !DILocation(line: 474, column: 25, scope: !964)
!969 = !DILocation(line: 475, column: 29, scope: !970)
!970 = distinct !DILexicalBlock(scope: !971, file: !3, line: 475, column: 29)
!971 = distinct !DILexicalBlock(scope: !963, file: !3, line: 474, column: 50)
!972 = !DILocation(line: 475, column: 29, scope: !971)
!973 = !DILocation(line: 476, column: 33, scope: !974)
!974 = distinct !DILexicalBlock(scope: !975, file: !3, line: 476, column: 33)
!975 = distinct !DILexicalBlock(scope: !970, file: !3, line: 475, column: 78)
!976 = !DILocation(line: 476, column: 53, scope: !974)
!977 = !DILocation(line: 476, column: 85, scope: !974)
!978 = !DILocation(line: 476, column: 33, scope: !975)
!979 = !DILocation(line: 477, column: 33, scope: !980)
!980 = distinct !DILexicalBlock(scope: !974, file: !3, line: 476, column: 91)
!981 = !DILocation(line: 478, column: 29, scope: !980)
!982 = !DILocation(line: 479, column: 57, scope: !983)
!983 = distinct !DILexicalBlock(scope: !974, file: !3, line: 478, column: 36)
!984 = !DILocation(line: 481, column: 36, scope: !985)
!985 = !DILexicalBlockFile(scope: !986, file: !3, discriminator: 1)
!986 = distinct !DILexicalBlock(scope: !970, file: !3, line: 481, column: 36)
!987 = !DILocation(line: 481, column: 36, scope: !988)
!988 = !DILexicalBlockFile(scope: !970, file: !3, discriminator: 1)
!989 = !DILocation(line: 482, column: 29, scope: !990)
!990 = distinct !DILexicalBlock(scope: !986, file: !3, line: 481, column: 86)
!991 = !DILocation(line: 483, column: 25, scope: !990)
!992 = !DILocation(line: 485, column: 29, scope: !993)
!993 = distinct !DILexicalBlock(scope: !994, file: !3, line: 485, column: 29)
!994 = distinct !DILexicalBlock(scope: !963, file: !3, line: 484, column: 28)
!995 = !DILocation(line: 485, column: 49, scope: !993)
!996 = !DILocation(line: 485, column: 81, scope: !993)
!997 = !DILocation(line: 485, column: 29, scope: !994)
!998 = !DILocation(line: 486, column: 52, scope: !999)
!999 = distinct !DILexicalBlock(scope: !993, file: !3, line: 485, column: 87)
!1000 = !DILocation(line: 487, column: 25, scope: !999)
!1001 = !DILocation(line: 489, column: 25, scope: !994)
!1002 = !DILocation(line: 495, column: 17, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !931, file: !3, line: 495, column: 17)
!1004 = !DILocation(line: 496, column: 29, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 496, column: 21)
!1006 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 495, column: 39)
!1007 = !DILocation(line: 495, column: 17, scope: !931)
!1008 = !DILocation(line: 496, column: 52, scope: !1009)
!1009 = !DILexicalBlockFile(scope: !1005, file: !3, discriminator: 1)
!1010 = !DILocation(line: 496, column: 45, scope: !1009)
!1011 = !DILocation(line: 496, column: 21, scope: !1012)
!1012 = !DILexicalBlockFile(scope: !1006, file: !3, discriminator: 1)
!1013 = !DILocation(line: 498, column: 33, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 498, column: 25)
!1015 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 496, column: 72)
!1016 = !DILocation(line: 498, column: 46, scope: !1014)
!1017 = !DILocation(line: 498, column: 25, scope: !1015)
!1018 = !DILocation(line: 499, column: 25, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !1014, file: !3, line: 498, column: 62)
!1020 = !DILocation(line: 500, column: 21, scope: !1019)
!1021 = !DILocation(line: 506, column: 23, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !898, file: !3, line: 506, column: 13)
!1023 = !DILocation(line: 506, column: 34, scope: !1022)
!1024 = !DILocation(line: 506, column: 44, scope: !1025)
!1025 = !DILexicalBlockFile(scope: !1022, file: !3, discriminator: 1)
!1026 = !DILocation(line: 506, column: 37, scope: !1025)
!1027 = !DILocation(line: 506, column: 59, scope: !1025)
!1028 = !DILocation(line: 506, column: 69, scope: !1029)
!1029 = !DILexicalBlockFile(scope: !1022, file: !3, discriminator: 2)
!1030 = !DILocation(line: 506, column: 82, scope: !1029)
!1031 = !DILocation(line: 507, column: 23, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 507, column: 17)
!1033 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 506, column: 93)
!1034 = !DILocation(line: 507, column: 20, scope: !1032)
!1035 = !DILocation(line: 506, column: 13, scope: !1036)
!1036 = !DILexicalBlockFile(scope: !898, file: !3, discriminator: 2)
!1037 = !DILocation(line: 507, column: 55, scope: !1032)
!1038 = !DILocation(line: 507, column: 65, scope: !1039)
!1039 = !DILexicalBlockFile(scope: !1032, file: !3, discriminator: 1)
!1040 = !DILocation(line: 507, column: 83, scope: !1039)
!1041 = !DILocation(line: 507, column: 17, scope: !1042)
!1042 = !DILexicalBlockFile(scope: !1033, file: !3, discriminator: 1)
!1043 = !DILocation(line: 509, column: 21, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !3, line: 509, column: 21)
!1045 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 507, column: 90)
!1046 = !DILocation(line: 509, column: 59, scope: !1044)
!1047 = !DILocation(line: 509, column: 21, scope: !1045)
!1048 = !DILocation(line: 510, column: 45, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !1044, file: !3, line: 509, column: 78)
!1050 = !DILocation(line: 511, column: 21, scope: !1049)
!1051 = !DILocation(line: 512, column: 17, scope: !1049)
!1052 = !DILocation(line: 535, column: 26, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 535, column: 21)
!1054 = distinct !DILexicalBlock(scope: !1055, file: !3, line: 534, column: 57)
!1055 = distinct !DILexicalBlock(scope: !1056, file: !3, line: 534, column: 17)
!1056 = distinct !DILexicalBlock(scope: !1057, file: !3, line: 532, column: 33)
!1057 = distinct !DILexicalBlock(scope: !898, file: !3, line: 532, column: 13)
!1058 = !DILocation(line: 516, column: 28, scope: !898)
!1059 = !DILocalVariable(name: "timeout", arg: 1, scope: !1060, file: !3, line: 2782, type: !380)
!1060 = distinct !DISubprogram(name: "tws_host_timeout_reset", scope: !3, file: !3, line: 2782, type: !1061, isLocal: false, isDefinition: true, scopeLine: 2783, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1063)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{null, !380}
!1063 = !{!1059}
!1064 = !DILocation(line: 2782, column: 33, scope: !1060, inlinedAt: !1065)
!1065 = distinct !DILocation(line: 518, column: 9, scope: !898)
!1066 = !DILocation(line: 2784, column: 20, scope: !1067, inlinedAt: !1065)
!1067 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 2784, column: 9)
!1068 = !DILocation(line: 2784, column: 9, scope: !1067, inlinedAt: !1065)
!1069 = !DILocation(line: 2784, column: 9, scope: !1060, inlinedAt: !1065)
!1070 = !DILocation(line: 2786, column: 39, scope: !1071, inlinedAt: !1065)
!1071 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 2784, column: 40)
!1072 = !DILocation(line: 2787, column: 5, scope: !1071, inlinedAt: !1065)
!1073 = !DILocation(line: 520, column: 40, scope: !898)
!1074 = !DILocation(line: 520, column: 9, scope: !898)
!1075 = !DILocation(line: 524, column: 13, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !898, file: !3, line: 523, column: 13)
!1077 = !DILocation(line: 524, column: 18, scope: !1078)
!1078 = !DILexicalBlockFile(scope: !1076, file: !3, discriminator: 1)
!1079 = !DILocation(line: 525, column: 13, scope: !1076)
!1080 = !DILocation(line: 525, column: 16, scope: !1078)
!1081 = !DILocation(line: 523, column: 13, scope: !1082)
!1082 = !DILexicalBlockFile(scope: !898, file: !3, discriminator: 1)
!1083 = !DILocation(line: 527, column: 13, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1076, file: !3, line: 525, column: 64)
!1085 = !DILocation(line: 528, column: 9, scope: !1084)
!1086 = !DILocation(line: 533, column: 19, scope: !1056)
!1087 = !DILocation(line: 533, column: 36, scope: !1056)
!1088 = !DILocation(line: 534, column: 17, scope: !1055)
!1089 = !DILocation(line: 534, column: 30, scope: !1090)
!1090 = !DILexicalBlockFile(scope: !1055, file: !3, discriminator: 1)
!1091 = !DILocation(line: 534, column: 27, scope: !1055)
!1092 = !DILocation(line: 535, column: 23, scope: !1053)
!1093 = !DILocation(line: 535, column: 21, scope: !1054)
!1094 = !DILocation(line: 536, column: 25, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1096, file: !3, line: 536, column: 25)
!1096 = distinct !DILexicalBlock(scope: !1053, file: !3, line: 535, column: 58)
!1097 = !DILocation(line: 536, column: 63, scope: !1095)
!1098 = !DILocation(line: 536, column: 25, scope: !1096)
!1099 = !DILocation(line: 537, column: 25, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1095, file: !3, line: 536, column: 82)
!1101 = !DILocation(line: 538, column: 21, scope: !1100)
!1102 = !DILocation(line: 540, column: 21, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !1053, file: !3, line: 539, column: 24)
!1104 = !DILocation(line: 545, column: 21, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !898, file: !3, line: 545, column: 13)
!1106 = !DILocation(line: 545, column: 13, scope: !898)
!1107 = !DILocation(line: 546, column: 23, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1109, file: !3, line: 546, column: 17)
!1109 = distinct !DILexicalBlock(scope: !1105, file: !3, line: 545, column: 33)
!1110 = !DILocation(line: 546, column: 17, scope: !1108)
!1111 = !DILocation(line: 546, column: 17, scope: !1109)
!1112 = !DILocation(line: 547, column: 17, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !1114, file: !3, line: 547, column: 17)
!1114 = distinct !DILexicalBlock(scope: !1108, file: !3, line: 546, column: 49)
!1115 = !DILocation(line: 547, column: 17, scope: !1114)
!1116 = !DILocation(line: 547, column: 17, scope: !1117)
!1117 = !DILexicalBlockFile(scope: !1113, file: !3, discriminator: 1)
!1118 = !DILocation(line: 548, column: 42, scope: !1114)
!1119 = !DILocation(line: 548, column: 17, scope: !1114)
!1120 = !DILocation(line: 549, column: 13, scope: !1114)
!1121 = !DILocation(line: 551, column: 48, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1108, file: !3, line: 549, column: 20)
!1123 = !DILocation(line: 555, column: 21, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !898, file: !3, line: 555, column: 13)
!1125 = !DILocation(line: 555, column: 13, scope: !898)
!1126 = !DILocation(line: 560, column: 19, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1124, file: !3, line: 555, column: 32)
!1128 = !DILocation(line: 556, column: 13, scope: !1127)
!1129 = !DILocation(line: 557, column: 103, scope: !1127)
!1130 = !DILocation(line: 557, column: 97, scope: !1127)
!1131 = !DILocation(line: 557, column: 13, scope: !1127)
!1132 = !DILocation(line: 558, column: 90, scope: !1127)
!1133 = !DILocation(line: 558, column: 84, scope: !1127)
!1134 = !DILocation(line: 558, column: 13, scope: !1127)
!1135 = !DILocation(line: 560, column: 44, scope: !1127)
!1136 = !DILocation(line: 561, column: 9, scope: !1127)
!1137 = !DILocation(line: 563, column: 20, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !898, file: !3, line: 563, column: 13)
!1139 = !DILocation(line: 563, column: 14, scope: !1138)
!1140 = !DILocation(line: 563, column: 33, scope: !1138)
!1141 = !DILocation(line: 563, column: 67, scope: !1142)
!1142 = !DILexicalBlockFile(scope: !1138, file: !3, discriminator: 1)
!1143 = !DILocation(line: 563, column: 44, scope: !1138)
!1144 = !DILocation(line: 564, column: 19, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1138, file: !3, line: 563, column: 96)
!1146 = !DILocation(line: 564, column: 44, scope: !1145)
!1147 = !DILocation(line: 566, column: 17, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1145, file: !3, line: 566, column: 17)
!1149 = !DILocation(line: 566, column: 17, scope: !1145)
!1150 = !DILocation(line: 567, column: 40, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1148, file: !3, line: 566, column: 39)
!1152 = !DILocation(line: 569, column: 17, scope: !1151)
!1153 = !DILocation(line: 572, column: 13, scope: !1151)
!1154 = !DILocation(line: 575, column: 21, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !898, file: !3, line: 575, column: 13)
!1156 = !DILocation(line: 575, column: 13, scope: !898)
!1157 = !DILocation(line: 576, column: 13, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1155, file: !3, line: 575, column: 33)
!1159 = !DILocation(line: 577, column: 9, scope: !1158)
!1160 = !DILocation(line: 578, column: 13, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !898, file: !3, line: 578, column: 13)
!1162 = !DILocation(line: 578, column: 13, scope: !898)
!1163 = !DILocation(line: 579, column: 37, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1165, file: !3, line: 579, column: 17)
!1165 = distinct !DILexicalBlock(scope: !1161, file: !3, line: 578, column: 24)
!1166 = !DILocation(line: 581, column: 17, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1164, file: !3, line: 579, column: 110)
!1168 = !DILocation(line: 582, column: 13, scope: !1167)
!1169 = !DILocation(line: 587, column: 31, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !898, file: !3, line: 587, column: 13)
!1171 = !DILocation(line: 589, column: 13, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !1170, file: !3, line: 587, column: 56)
!1173 = !DILocation(line: 590, column: 23, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !1172, file: !3, line: 590, column: 17)
!1175 = !DILocation(line: 590, column: 34, scope: !1174)
!1176 = !DILocation(line: 590, column: 17, scope: !1172)
!1177 = !DILocation(line: 591, column: 42, scope: !1178)
!1178 = distinct !DILexicalBlock(scope: !1174, file: !3, line: 590, column: 61)
!1179 = !DILocation(line: 591, column: 17, scope: !1178)
!1180 = !DILocation(line: 592, column: 13, scope: !1178)
!1181 = !DILocation(line: 593, column: 30, scope: !1172)
!1182 = !DILocation(line: 594, column: 9, scope: !1172)
!1183 = !DILocation(line: 595, column: 19, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !898, file: !3, line: 595, column: 13)
!1185 = !DILocation(line: 595, column: 13, scope: !1184)
!1186 = !DILocation(line: 595, column: 13, scope: !898)
!1187 = !DILocation(line: 596, column: 35, scope: !1188)
!1188 = distinct !DILexicalBlock(scope: !1184, file: !3, line: 595, column: 33)
!1189 = !DILocation(line: 596, column: 32, scope: !1188)
!1190 = !DILocation(line: 597, column: 36, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1188, file: !3, line: 597, column: 17)
!1192 = !DILocation(line: 597, column: 17, scope: !1188)
!1193 = !DILocation(line: 599, column: 32, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1195, file: !3, line: 599, column: 21)
!1195 = distinct !DILexicalBlock(scope: !1191, file: !3, line: 597, column: 42)
!1196 = !DILocation(line: 599, column: 50, scope: !1194)
!1197 = !DILocation(line: 599, column: 21, scope: !1195)
!1198 = !DILocation(line: 600, column: 46, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1194, file: !3, line: 599, column: 56)
!1200 = !DILocation(line: 600, column: 21, scope: !1199)
!1201 = !DILocation(line: 601, column: 17, scope: !1199)
!1202 = !DILocation(line: 602, column: 32, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1195, file: !3, line: 602, column: 21)
!1204 = !DILocation(line: 602, column: 50, scope: !1203)
!1205 = !DILocation(line: 602, column: 21, scope: !1195)
!1206 = !DILocation(line: 603, column: 46, scope: !1207)
!1207 = distinct !DILexicalBlock(scope: !1203, file: !3, line: 602, column: 56)
!1208 = !DILocation(line: 603, column: 21, scope: !1207)
!1209 = !DILocation(line: 604, column: 17, scope: !1207)
!1210 = !DILocation(line: 606, column: 23, scope: !1211)
!1211 = distinct !DILexicalBlock(scope: !1188, file: !3, line: 606, column: 17)
!1212 = !DILocation(line: 606, column: 41, scope: !1211)
!1213 = !DILocation(line: 608, column: 17, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !1215, file: !3, line: 608, column: 17)
!1215 = distinct !DILexicalBlock(scope: !1211, file: !3, line: 606, column: 107)
!1216 = !DILocation(line: 608, column: 17, scope: !1215)
!1217 = !DILocation(line: 608, column: 17, scope: !1218)
!1218 = !DILexicalBlockFile(scope: !1214, file: !3, discriminator: 1)
!1219 = !DILocation(line: 610, column: 26, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1215, file: !3, line: 610, column: 21)
!1221 = !DILocation(line: 610, column: 46, scope: !1220)
!1222 = !DILocation(line: 610, column: 23, scope: !1220)
!1223 = !DILocation(line: 610, column: 21, scope: !1215)
!1224 = !DILocation(line: 611, column: 46, scope: !1225)
!1225 = distinct !DILexicalBlock(scope: !1220, file: !3, line: 610, column: 64)
!1226 = !DILocation(line: 611, column: 21, scope: !1225)
!1227 = !DILocation(line: 612, column: 17, scope: !1225)
!1228 = !DILocation(line: 616, column: 21, scope: !1229)
!1229 = distinct !DILexicalBlock(scope: !898, file: !3, line: 616, column: 13)
!1230 = !DILocation(line: 616, column: 13, scope: !898)
!1231 = !DILocation(line: 617, column: 23, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1233, file: !3, line: 617, column: 17)
!1233 = distinct !DILexicalBlock(scope: !1229, file: !3, line: 616, column: 34)
!1234 = !DILocation(line: 617, column: 17, scope: !1232)
!1235 = !DILocation(line: 617, column: 17, scope: !1233)
!1236 = !DILocation(line: 618, column: 28, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !1238, file: !3, line: 618, column: 21)
!1238 = distinct !DILexicalBlock(scope: !1232, file: !3, line: 617, column: 49)
!1239 = !DILocation(line: 618, column: 53, scope: !1237)
!1240 = !DILocation(line: 619, column: 21, scope: !1241)
!1241 = distinct !DILexicalBlock(scope: !1242, file: !3, line: 619, column: 21)
!1242 = distinct !DILexicalBlock(scope: !1237, file: !3, line: 618, column: 95)
!1243 = !DILocation(line: 619, column: 21, scope: !1242)
!1244 = !DILocation(line: 619, column: 21, scope: !1245)
!1245 = !DILexicalBlockFile(scope: !1241, file: !3, discriminator: 1)
!1246 = !DILocation(line: 620, column: 46, scope: !1242)
!1247 = !DILocation(line: 620, column: 21, scope: !1242)
!1248 = !DILocation(line: 621, column: 17, scope: !1242)
!1249 = !DILocation(line: 625, column: 21, scope: !1250)
!1250 = distinct !DILexicalBlock(scope: !898, file: !3, line: 625, column: 13)
!1251 = !DILocation(line: 625, column: 52, scope: !1250)
!1252 = !DILocation(line: 626, column: 19, scope: !1253)
!1253 = distinct !DILexicalBlock(scope: !1250, file: !3, line: 625, column: 94)
!1254 = !DILocation(line: 626, column: 44, scope: !1253)
!1255 = !DILocation(line: 627, column: 9, scope: !1253)
!1256 = !DILocation(line: 629, column: 33, scope: !1257)
!1257 = distinct !DILexicalBlock(scope: !898, file: !3, line: 629, column: 13)
!1258 = !DILocation(line: 629, column: 43, scope: !1257)
!1259 = !DILocation(line: 629, column: 13, scope: !898)
!1260 = !DILocation(line: 630, column: 19, scope: !1261)
!1261 = distinct !DILexicalBlock(scope: !1257, file: !3, line: 629, column: 49)
!1262 = !DILocation(line: 630, column: 37, scope: !1261)
!1263 = !DILocation(line: 631, column: 9, scope: !1261)
!1264 = !DILocation(line: 633, column: 9, scope: !1265)
!1265 = distinct !DILexicalBlock(scope: !898, file: !3, line: 633, column: 9)
!1266 = !DILocation(line: 633, column: 9, scope: !898)
!1267 = !DILocation(line: 633, column: 9, scope: !1268)
!1268 = !DILexicalBlockFile(scope: !1265, file: !3, discriminator: 1)
!1269 = !DILocation(line: 637, column: 15, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !877, file: !3, line: 637, column: 9)
!1271 = !DILocation(line: 637, column: 9, scope: !1270)
!1272 = !DILocation(line: 638, column: 21, scope: !1273)
!1273 = distinct !DILexicalBlock(scope: !1274, file: !3, line: 638, column: 13)
!1274 = distinct !DILexicalBlock(scope: !1270, file: !3, line: 637, column: 34)
!1275 = !DILocation(line: 637, column: 9, scope: !877)
!1276 = !DILocation(line: 639, column: 37, scope: !1277)
!1277 = distinct !DILexicalBlock(scope: !1273, file: !3, line: 638, column: 33)
!1278 = !DILocation(line: 651, column: 17, scope: !1279)
!1279 = distinct !DILexicalBlock(scope: !1277, file: !3, line: 651, column: 17)
!1280 = !DILocation(line: 652, column: 41, scope: !1281)
!1281 = distinct !DILexicalBlock(scope: !1282, file: !3, line: 652, column: 21)
!1282 = distinct !DILexicalBlock(scope: !1279, file: !3, line: 651, column: 38)
!1283 = !DILocation(line: 652, column: 21, scope: !1281)
!1284 = !DILocation(line: 651, column: 17, scope: !1277)
!1285 = !DILocation(line: 653, column: 54, scope: !1286)
!1286 = distinct !DILexicalBlock(scope: !1281, file: !3, line: 652, column: 55)
!1287 = !DILocation(line: 653, column: 21, scope: !1286)
!1288 = !DILocation(line: 654, column: 17, scope: !1286)
!1289 = !DILocation(line: 658, column: 1, scope: !1290)
!1290 = !DILexicalBlockFile(scope: !877, file: !3, discriminator: 2)
!1291 = !DILocation(line: 2776, column: 35, scope: !929)
!1292 = !DILocation(line: 2778, column: 5, scope: !929)
!1293 = !DILocation(line: 2780, column: 1, scope: !929)
!1294 = distinct !DISubprogram(name: "user_send_cmd_prepare", scope: !3, file: !3, line: 1326, type: !1295, isLocal: false, isDefinition: true, scopeLine: 1327, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1299)
!1295 = !DISubroutineType(types: !1296)
!1296 = !{!1297, !1298, !374, !355}
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !430, line: 15, baseType: !381)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "USER_CMD_TYPE", file: !22, line: 295, baseType: !27)
!1299 = !{!1300, !1301, !1302, !1303, !1304, !1305, !1306, !1309}
!1300 = !DILocalVariable(name: "cmd", arg: 1, scope: !1294, file: !3, line: 1326, type: !1298)
!1301 = !DILocalVariable(name: "param_len", arg: 2, scope: !1294, file: !3, line: 1326, type: !374)
!1302 = !DILocalVariable(name: "param", arg: 3, scope: !1294, file: !3, line: 1326, type: !355)
!1303 = !DILocalVariable(name: "ret", scope: !1294, file: !3, line: 1328, type: !380)
!1304 = !DILocalVariable(name: "i", scope: !1294, file: !3, line: 1329, type: !356)
!1305 = !DILocalVariable(name: "disconn_cnt", scope: !1294, file: !3, line: 1333, type: !356)
!1306 = !DILocalVariable(name: "conn", scope: !1307, file: !3, line: 1473, type: !610)
!1307 = distinct !DILexicalBlock(scope: !1308, file: !3, line: 1471, column: 5)
!1308 = distinct !DILexicalBlock(scope: !1294, file: !3, line: 1335, column: 18)
!1309 = !DILocalVariable(name: "send_ptr", scope: !1310, file: !3, line: 1502, type: !1311)
!1310 = distinct !DILexicalBlock(scope: !1308, file: !3, line: 1500, column: 35)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 32)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "hid_s_param_t", file: !22, line: 619, baseType: !1313)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 615, size: 64, elements: !1314)
!1314 = !{!1315, !1316, !1317}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "chl_id", scope: !1313, file: !22, line: 616, baseType: !429, size: 16)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !1313, file: !22, line: 617, baseType: !429, size: 16, offset: 16)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !1313, file: !22, line: 618, baseType: !1318, size: 32, offset: 32)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 32)
!1319 = !DILocation(line: 1326, column: 41, scope: !1294)
!1320 = !DILocation(line: 1326, column: 50, scope: !1294)
!1321 = !DILocation(line: 1326, column: 65, scope: !1294)
!1322 = !DILocation(line: 1328, column: 9, scope: !1294)
!1323 = !DILocation(line: 1330, column: 9, scope: !1324)
!1324 = distinct !DILexicalBlock(scope: !1294, file: !3, line: 1330, column: 9)
!1325 = !DILocation(line: 1330, column: 20, scope: !1324)
!1326 = !DILocation(line: 1330, column: 9, scope: !1294)
!1327 = !DILocation(line: 1333, column: 8, scope: !1294)
!1328 = !DILocation(line: 1335, column: 5, scope: !1294)
!1329 = !DILocation(line: 1337, column: 23, scope: !1330)
!1330 = distinct !DILexicalBlock(scope: !1308, file: !3, line: 1337, column: 13)
!1331 = !DILocation(line: 1337, column: 13, scope: !1308)
!1332 = !DILocation(line: 1337, column: 13, scope: !1330)
!1333 = !DILocation(line: 1340, column: 41, scope: !1334)
!1334 = distinct !DILexicalBlock(scope: !1330, file: !3, line: 1339, column: 16)
!1335 = !DILocation(line: 1340, column: 39, scope: !1334)
!1336 = !{!569, !570, i64 2}
!1337 = !DILocation(line: 1342, column: 13, scope: !1334)
!1338 = !DILocation(line: 1344, column: 9, scope: !1308)
!1339 = !DILocation(line: 1347, column: 39, scope: !1340)
!1340 = distinct !DILexicalBlock(scope: !1308, file: !3, line: 1347, column: 13)
!1341 = !DILocation(line: 1347, column: 61, scope: !1340)
!1342 = !DILocation(line: 1347, column: 13, scope: !1308)
!1343 = !DILocation(line: 1348, column: 61, scope: !1344)
!1344 = distinct !DILexicalBlock(scope: !1340, file: !3, line: 1347, column: 67)
!1345 = !DILocation(line: 1350, column: 13, scope: !1344)
!1346 = !DILocation(line: 1356, column: 9, scope: !1308)
!1347 = !DILocation(line: 1358, column: 23, scope: !1348)
!1348 = distinct !DILexicalBlock(scope: !1308, file: !3, line: 1358, column: 13)
!1349 = !DILocation(line: 1358, column: 13, scope: !1308)
!1350 = !DILocation(line: 1361, column: 41, scope: !1308)
!1351 = !DILocation(line: 1361, column: 39, scope: !1308)
!1352 = !{!569, !570, i64 42}
!1353 = !DILocation(line: 1362, column: 9, scope: !1308)
!1354 = !DILocation(line: 1364, column: 23, scope: !1355)
!1355 = distinct !DILexicalBlock(scope: !1308, file: !3, line: 1364, column: 13)
!1356 = !DILocation(line: 1364, column: 13, scope: !1308)
!1357 = !DILocation(line: 1368, column: 25, scope: !1358)
!1358 = distinct !DILexicalBlock(scope: !1308, file: !3, line: 1368, column: 13)
!1359 = !{!569, !570, i64 43}
!1360 = !DILocation(line: 1368, column: 34, scope: !1358)
!1361 = !DILocation(line: 1368, column: 13, scope: !1308)
!1362 = !DILocation(line: 1369, column: 36, scope: !1363)
!1363 = distinct !DILexicalBlock(scope: !1358, file: !3, line: 1368, column: 40)
!1364 = !DILocation(line: 1369, column: 34, scope: !1363)
!1365 = !DILocation(line: 1373, column: 9, scope: !1308)
!1366 = !DILocation(line: 1376, column: 25, scope: !1367)
!1367 = distinct !DILexicalBlock(scope: !1308, file: !3, line: 1376, column: 13)
!1368 = !{!569, !573, i64 40}
!1369 = !DILocation(line: 1376, column: 42, scope: !1367)
!1370 = !DILocation(line: 1376, column: 13, scope: !1308)
!1371 = !DILocation(line: 1377, column: 42, scope: !1372)
!1372 = distinct !DILexicalBlock(scope: !1367, file: !3, line: 1376, column: 48)
!1373 = !DILocation(line: 1378, column: 42, scope: !1372)
!1374 = !{!569, !572, i64 36}
!1375 = !DILocation(line: 1379, column: 13, scope: !1376)
!1376 = distinct !DILexicalBlock(scope: !1372, file: !3, line: 1379, column: 13)
!1377 = !DILocation(line: 1379, column: 13, scope: !1372)
!1378 = !DILocation(line: 1379, column: 13, scope: !1379)
!1379 = !DILexicalBlockFile(scope: !1376, file: !3, discriminator: 1)
!1380 = !DILocation(line: 1419, column: 9, scope: !1308)
!1381 = !DILocation(line: 1420, column: 9, scope: !1308)
!1382 = !DILocation(line: 794, column: 24, scope: !1383, inlinedAt: !1387)
!1383 = distinct !DISubprogram(name: "is_1t2_connection", scope: !3, file: !3, line: 792, type: !1384, isLocal: false, isDefinition: true, scopeLine: 793, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !564)
!1384 = !DISubroutineType(types: !1385)
!1385 = !{!1386}
!1386 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !430, line: 11, baseType: !358)
!1387 = distinct !DILocation(line: 1423, column: 13, scope: !1388)
!1388 = distinct !DILexicalBlock(scope: !1308, file: !3, line: 1423, column: 13)
!1389 = !DILocation(line: 794, column: 63, scope: !1383, inlinedAt: !1387)
!1390 = !DILocation(line: 794, column: 42, scope: !1383, inlinedAt: !1387)
!1391 = !DILocation(line: 1423, column: 13, scope: !1308)
!1392 = !DILocation(line: 1426, column: 13, scope: !1393)
!1393 = distinct !DILexicalBlock(scope: !1308, file: !3, line: 1426, column: 13)
!1394 = !DILocation(line: 1426, column: 13, scope: !1308)
!1395 = !DILocation(line: 1430, column: 23, scope: !1396)
!1396 = distinct !DILexicalBlock(scope: !1308, file: !3, line: 1430, column: 13)
!1397 = !DILocation(line: 1430, column: 13, scope: !1308)
!1398 = !DILocation(line: 1433, column: 9, scope: !1308)
!1399 = !DILocation(line: 1434, column: 9, scope: !1308)
!1400 = !DILocation(line: 1436, column: 13, scope: !1308)
!1401 = !DILocation(line: 1329, column: 8, scope: !1294)
!1402 = !DILocation(line: 1440, column: 14, scope: !1403)
!1403 = distinct !DILexicalBlock(scope: !1308, file: !3, line: 1440, column: 9)
!1404 = !DILocation(line: 1440, column: 21, scope: !1405)
!1405 = !DILexicalBlockFile(scope: !1406, file: !3, discriminator: 1)
!1406 = distinct !DILexicalBlock(scope: !1403, file: !3, line: 1440, column: 9)
!1407 = !DILocation(line: 1440, column: 9, scope: !1408)
!1408 = !DILexicalBlockFile(scope: !1403, file: !3, discriminator: 1)
!1409 = !DILocation(line: 1441, column: 17, scope: !1410)
!1410 = distinct !DILexicalBlock(scope: !1411, file: !3, line: 1441, column: 17)
!1411 = distinct !DILexicalBlock(scope: !1406, file: !3, line: 1440, column: 48)
!1412 = !DILocation(line: 1441, column: 42, scope: !1410)
!1413 = !DILocation(line: 1441, column: 17, scope: !1411)
!1414 = distinct !{!1414, !1415, !1416}
!1415 = !DILocation(line: 1440, column: 9, scope: !1403)
!1416 = !DILocation(line: 1444, column: 9, scope: !1403)
!1417 = !DILocation(line: 1452, column: 26, scope: !1308)
!1418 = !DILocation(line: 1452, column: 9, scope: !1308)
!1419 = !DILocation(line: 1453, column: 23, scope: !1308)
!1420 = !DILocation(line: 1455, column: 34, scope: !1308)
!1421 = !DILocation(line: 1456, column: 9, scope: !1308)
!1422 = !DILocation(line: 1458, column: 29, scope: !1308)
!1423 = !DILocation(line: 1458, column: 9, scope: !1308)
!1424 = !DILocation(line: 1459, column: 9, scope: !1308)
!1425 = !DILocation(line: 1463, column: 13, scope: !1308)
!1426 = !DILocation(line: 1466, column: 38, scope: !1308)
!1427 = !DILocation(line: 1466, column: 64, scope: !1308)
!1428 = !DILocation(line: 1466, column: 9, scope: !1308)
!1429 = !DILocation(line: 1467, column: 9, scope: !1308)
!1430 = !DILocation(line: 1474, column: 16, scope: !1307)
!1431 = !DILocation(line: 1473, column: 22, scope: !1307)
!1432 = !DILocation(line: 1475, column: 13, scope: !1433)
!1433 = distinct !DILexicalBlock(scope: !1307, file: !3, line: 1475, column: 13)
!1434 = !DILocation(line: 1475, column: 13, scope: !1307)
!1435 = !DILocation(line: 1476, column: 44, scope: !1436)
!1436 = distinct !DILexicalBlock(scope: !1437, file: !3, line: 1476, column: 17)
!1437 = distinct !DILexicalBlock(scope: !1433, file: !3, line: 1475, column: 19)
!1438 = !DILocation(line: 1476, column: 18, scope: !1436)
!1439 = !DILocation(line: 1476, column: 17, scope: !1437)
!1440 = !DILocation(line: 1477, column: 17, scope: !1441)
!1441 = distinct !DILexicalBlock(scope: !1436, file: !3, line: 1476, column: 61)
!1442 = !DILocation(line: 1478, column: 13, scope: !1441)
!1443 = !DILocation(line: 1481, column: 16, scope: !1444)
!1444 = !DILexicalBlockFile(scope: !1307, file: !3, discriminator: 1)
!1445 = !DILocation(line: 1481, column: 47, scope: !1444)
!1446 = !DILocation(line: 1481, column: 9, scope: !1444)
!1447 = !DILocation(line: 1482, column: 13, scope: !1448)
!1448 = distinct !DILexicalBlock(scope: !1307, file: !3, line: 1481, column: 53)
!1449 = !DILocation(line: 1483, column: 13, scope: !1448)
!1450 = !DILocation(line: 1485, column: 24, scope: !1448)
!1451 = !DILocation(line: 1487, column: 29, scope: !1452)
!1452 = distinct !DILexicalBlock(scope: !1448, file: !3, line: 1487, column: 17)
!1453 = !DILocation(line: 1487, column: 17, scope: !1448)
!1454 = distinct !{!1454, !1455, !1456}
!1455 = !DILocation(line: 1481, column: 9, scope: !1307)
!1456 = !DILocation(line: 1490, column: 9, scope: !1307)
!1457 = !DILocation(line: 1494, column: 32, scope: !1308)
!1458 = !DILocation(line: 1494, column: 30, scope: !1308)
!1459 = !{!569, !570, i64 95}
!1460 = !DILocation(line: 1495, column: 9, scope: !1308)
!1461 = !DILocation(line: 1497, column: 28, scope: !1308)
!1462 = !DILocation(line: 1497, column: 26, scope: !1308)
!1463 = !{!569, !570, i64 96}
!1464 = !DILocation(line: 1498, column: 9, scope: !1308)
!1465 = !DILocation(line: 1503, column: 47, scope: !1310)
!1466 = !{!1467, !573, i64 0}
!1467 = !{!"", !573, i64 0, !573, i64 2, !572, i64 4}
!1468 = !DILocation(line: 1503, column: 65, scope: !1310)
!1469 = !{!1467, !572, i64 4}
!1470 = !DILocation(line: 1503, column: 85, scope: !1310)
!1471 = !{!1467, !573, i64 2}
!1472 = !DILocation(line: 1503, column: 15, scope: !1310)
!1473 = !DILocation(line: 1504, column: 13, scope: !1474)
!1474 = distinct !DILexicalBlock(scope: !1310, file: !3, line: 1504, column: 13)
!1475 = !DILocation(line: 1193, column: 39, scope: !1476, inlinedAt: !1478)
!1476 = distinct !DILexicalBlock(scope: !1477, file: !3, line: 1193, column: 9)
!1477 = distinct !DISubprogram(name: "check_user_cmd_timer_status", scope: !3, file: !3, line: 1191, type: !562, isLocal: false, isDefinition: true, scopeLine: 1192, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !564)
!1478 = distinct !DILocation(line: 1512, column: 13, scope: !1479)
!1479 = distinct !DILexicalBlock(scope: !1308, file: !3, line: 1512, column: 13)
!1480 = !{!568, !574, i64 184}
!1481 = !DILocation(line: 1196, column: 9, scope: !1482, inlinedAt: !1478)
!1482 = distinct !DILexicalBlock(scope: !1476, file: !3, line: 1195, column: 12)
!1483 = !DILocation(line: 1512, column: 13, scope: !1308)
!1484 = !DILocation(line: 1193, column: 39, scope: !1476, inlinedAt: !1485)
!1485 = distinct !DILocation(line: 1523, column: 13, scope: !1486)
!1486 = distinct !DILexicalBlock(scope: !1308, file: !3, line: 1523, column: 13)
!1487 = !DILocation(line: 1196, column: 9, scope: !1482, inlinedAt: !1485)
!1488 = !DILocation(line: 1523, column: 13, scope: !1308)
!1489 = !DILocation(line: 1533, column: 9, scope: !1308)
!1490 = !DILocation(line: 1534, column: 9, scope: !1308)
!1491 = !DILocation(line: 1537, column: 17, scope: !1492)
!1492 = distinct !DILexicalBlock(scope: !1308, file: !3, line: 1537, column: 13)
!1493 = !DILocation(line: 1537, column: 13, scope: !1308)
!1494 = !DILocation(line: 1544, column: 57, scope: !1294)
!1495 = !DILocation(line: 1544, column: 5, scope: !1294)
!1496 = !DILocation(line: 1544, column: 51, scope: !1294)
!1497 = !{!569, !570, i64 1}
!1498 = !DILocation(line: 1544, column: 55, scope: !1294)
!1499 = !DILocation(line: 1545, column: 31, scope: !1500)
!1500 = distinct !DILexicalBlock(scope: !1294, file: !3, line: 1545, column: 9)
!1501 = !DILocation(line: 1545, column: 9, scope: !1294)
!1502 = !DILocation(line: 1546, column: 31, scope: !1503)
!1503 = distinct !DILexicalBlock(scope: !1500, file: !3, line: 1545, column: 48)
!1504 = !DILocation(line: 1547, column: 5, scope: !1503)
!1505 = !DILocation(line: 1549, column: 5, scope: !1294)
!1506 = !DILocation(line: 1552, column: 5, scope: !1294)
!1507 = !DILocation(line: 1553, column: 1, scope: !1294)
!1508 = distinct !DISubprogram(name: "update_bt_current_status", scope: !3, file: !3, line: 719, type: !1509, isLocal: false, isDefinition: true, scopeLine: 720, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1511)
!1509 = !DISubroutineType(types: !1510)
!1510 = !{null, !355, !356, !356}
!1511 = !{!1512, !1513, !1514, !1515, !1516}
!1512 = !DILocalVariable(name: "addr", arg: 1, scope: !1508, file: !3, line: 719, type: !355)
!1513 = !DILocalVariable(name: "new_status", arg: 2, scope: !1508, file: !3, line: 719, type: !356)
!1514 = !DILocalVariable(name: "conn_status", arg: 3, scope: !1508, file: !3, line: 719, type: !356)
!1515 = !DILocalVariable(name: "temp_role_type", scope: !1508, file: !3, line: 721, type: !380)
!1516 = !DILocalVariable(name: "conn", scope: !1508, file: !3, line: 728, type: !610)
!1517 = !DILocation(line: 719, column: 35, scope: !1508)
!1518 = !DILocation(line: 719, column: 44, scope: !1508)
!1519 = !DILocation(line: 719, column: 59, scope: !1508)
!1520 = !DILocation(line: 721, column: 9, scope: !1508)
!1521 = !DILocation(line: 723, column: 14, scope: !1522)
!1522 = distinct !DILexicalBlock(scope: !1508, file: !3, line: 723, column: 9)
!1523 = !DILocation(line: 723, column: 9, scope: !1508)
!1524 = !DILocation(line: 728, column: 25, scope: !1508)
!1525 = !DILocation(line: 728, column: 18, scope: !1508)
!1526 = !DILocation(line: 729, column: 14, scope: !1527)
!1527 = distinct !DILexicalBlock(scope: !1508, file: !3, line: 729, column: 9)
!1528 = !DILocation(line: 729, column: 9, scope: !1508)
!1529 = !DILocation(line: 734, column: 48, scope: !1530)
!1530 = distinct !DILexicalBlock(scope: !1508, file: !3, line: 734, column: 9)
!1531 = !DILocation(line: 735, column: 9, scope: !1532)
!1532 = distinct !DILexicalBlock(scope: !1530, file: !3, line: 734, column: 88)
!1533 = !DILocation(line: 736, column: 9, scope: !1534)
!1534 = distinct !DILexicalBlock(scope: !1532, file: !3, line: 736, column: 9)
!1535 = !DILocation(line: 736, column: 9, scope: !1532)
!1536 = !DILocation(line: 736, column: 9, scope: !1537)
!1537 = !DILexicalBlockFile(scope: !1534, file: !3, discriminator: 1)
!1538 = !DILocation(line: 737, column: 9, scope: !1539)
!1539 = distinct !DILexicalBlock(scope: !1532, file: !3, line: 737, column: 9)
!1540 = !DILocation(line: 737, column: 9, scope: !1532)
!1541 = !DILocation(line: 737, column: 9, scope: !1542)
!1542 = !DILexicalBlockFile(scope: !1539, file: !3, discriminator: 1)
!1543 = !DILocation(line: 739, column: 19, scope: !1544)
!1544 = distinct !DILexicalBlock(scope: !1545, file: !3, line: 739, column: 13)
!1545 = distinct !DILexicalBlock(scope: !1546, file: !3, line: 738, column: 62)
!1546 = distinct !DILexicalBlock(scope: !1530, file: !3, line: 738, column: 16)
!1547 = !DILocation(line: 739, column: 13, scope: !1544)
!1548 = !DILocation(line: 739, column: 13, scope: !1545)
!1549 = !DILocation(line: 740, column: 13, scope: !1550)
!1550 = distinct !DILexicalBlock(scope: !1544, file: !3, line: 739, column: 39)
!1551 = !DILocation(line: 741, column: 13, scope: !1552)
!1552 = distinct !DILexicalBlock(scope: !1550, file: !3, line: 741, column: 13)
!1553 = !DILocation(line: 741, column: 13, scope: !1550)
!1554 = !DILocation(line: 741, column: 13, scope: !1555)
!1555 = !DILexicalBlockFile(scope: !1552, file: !3, discriminator: 1)
!1556 = !DILocation(line: 742, column: 13, scope: !1557)
!1557 = distinct !DILexicalBlock(scope: !1550, file: !3, line: 742, column: 13)
!1558 = !DILocation(line: 742, column: 13, scope: !1550)
!1559 = !DILocation(line: 742, column: 13, scope: !1560)
!1560 = !DILexicalBlockFile(scope: !1557, file: !3, discriminator: 1)
!1561 = !DILocation(line: 746, column: 21, scope: !1562)
!1562 = distinct !DILexicalBlock(scope: !1508, file: !3, line: 746, column: 9)
!1563 = !DILocation(line: 746, column: 9, scope: !1508)
!1564 = !DILocation(line: 747, column: 19, scope: !1565)
!1565 = distinct !DILexicalBlock(scope: !1566, file: !3, line: 747, column: 13)
!1566 = distinct !DILexicalBlock(scope: !1562, file: !3, line: 746, column: 27)
!1567 = !DILocation(line: 747, column: 30, scope: !1565)
!1568 = !DILocation(line: 749, column: 9, scope: !1569)
!1569 = distinct !DILexicalBlock(scope: !1565, file: !3, line: 747, column: 57)
!1570 = !{!644, !570, i64 11}
!1571 = !DILocation(line: 752, column: 9, scope: !1566)
!1572 = !DILocation(line: 753, column: 5, scope: !1566)
!1573 = !DILocation(line: 754, column: 28, scope: !1508)
!1574 = !DILocation(line: 754, column: 5, scope: !1508)
!1575 = !DILocation(line: 756, column: 20, scope: !1576)
!1576 = distinct !DILexicalBlock(scope: !1508, file: !3, line: 756, column: 9)
!1577 = !DILocation(line: 756, column: 9, scope: !1508)
!1578 = !DILocation(line: 756, column: 9, scope: !1576)
!1579 = !DILocation(line: 757, column: 37, scope: !1580)
!1580 = distinct !DILexicalBlock(scope: !1576, file: !3, line: 756, column: 26)
!1581 = !{!568, !570, i64 272}
!1582 = !DILocation(line: 758, column: 9, scope: !1580)
!1583 = !DILocation(line: 759, column: 9, scope: !1580)
!1584 = !DILocation(line: 760, column: 5, scope: !1580)
!1585 = !DILocation(line: 761, column: 1, scope: !1508)
!1586 = distinct !DISubprogram(name: "user_emitter_cmd_prepare", scope: !3, file: !3, line: 1556, type: !1295, isLocal: false, isDefinition: true, scopeLine: 1557, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1587)
!1587 = !{!1588, !1589, !1590, !1591, !1592}
!1588 = !DILocalVariable(name: "cmd", arg: 1, scope: !1586, file: !3, line: 1556, type: !1298)
!1589 = !DILocalVariable(name: "param_len", arg: 2, scope: !1586, file: !3, line: 1556, type: !374)
!1590 = !DILocalVariable(name: "param", arg: 3, scope: !1586, file: !3, line: 1556, type: !355)
!1591 = !DILocalVariable(name: "ret", scope: !1586, file: !3, line: 1558, type: !380)
!1592 = !DILocalVariable(name: "i", scope: !1586, file: !3, line: 1559, type: !356)
!1593 = !DILocation(line: 1556, column: 44, scope: !1586)
!1594 = !DILocation(line: 1556, column: 53, scope: !1586)
!1595 = !DILocation(line: 1556, column: 68, scope: !1586)
!1596 = !DILocation(line: 1558, column: 9, scope: !1586)
!1597 = !DILocation(line: 1560, column: 10, scope: !1598)
!1598 = distinct !DILexicalBlock(scope: !1586, file: !3, line: 1560, column: 9)
!1599 = !DILocation(line: 1560, column: 9, scope: !1586)
!1600 = !DILocation(line: 1563, column: 9, scope: !1601)
!1601 = distinct !DILexicalBlock(scope: !1586, file: !3, line: 1563, column: 9)
!1602 = !DILocation(line: 1563, column: 20, scope: !1601)
!1603 = !DILocation(line: 1563, column: 9, scope: !1586)
!1604 = !DILocation(line: 1566, column: 9, scope: !1605)
!1605 = distinct !DILexicalBlock(scope: !1586, file: !3, line: 1566, column: 9)
!1606 = !DILocation(line: 1566, column: 29, scope: !1605)
!1607 = !DILocation(line: 1566, column: 44, scope: !1605)
!1608 = !DILocation(line: 1566, column: 9, scope: !1586)
!1609 = !DILocation(line: 1569, column: 5, scope: !1586)
!1610 = !DILocation(line: 1571, column: 29, scope: !1611)
!1611 = distinct !DILexicalBlock(scope: !1586, file: !3, line: 1569, column: 18)
!1612 = !DILocation(line: 1571, column: 9, scope: !1611)
!1613 = !DILocation(line: 1572, column: 9, scope: !1611)
!1614 = !DILocation(line: 1574, column: 13, scope: !1611)
!1615 = !DILocation(line: 1559, column: 8, scope: !1586)
!1616 = !DILocation(line: 1578, column: 14, scope: !1617)
!1617 = distinct !DILexicalBlock(scope: !1611, file: !3, line: 1578, column: 9)
!1618 = !DILocation(line: 1578, column: 21, scope: !1619)
!1619 = !DILexicalBlockFile(scope: !1620, file: !3, discriminator: 1)
!1620 = distinct !DILexicalBlock(scope: !1617, file: !3, line: 1578, column: 9)
!1621 = !DILocation(line: 1578, column: 9, scope: !1622)
!1622 = !DILexicalBlockFile(scope: !1617, file: !3, discriminator: 1)
!1623 = !DILocation(line: 1579, column: 17, scope: !1624)
!1624 = distinct !DILexicalBlock(scope: !1625, file: !3, line: 1579, column: 17)
!1625 = distinct !DILexicalBlock(scope: !1620, file: !3, line: 1578, column: 48)
!1626 = !DILocation(line: 1579, column: 42, scope: !1624)
!1627 = !DILocation(line: 1579, column: 17, scope: !1625)
!1628 = distinct !{!1628, !1629, !1630}
!1629 = !DILocation(line: 1578, column: 9, scope: !1617)
!1630 = !DILocation(line: 1582, column: 9, scope: !1617)
!1631 = !DILocation(line: 1590, column: 26, scope: !1611)
