temp.o:	file format ELF32-i386

.debug_info contents:
0x00000000: Compile Unit: length = 0x000025ff version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x00002603)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)")
              DW_AT_language	(DW_LANG_C99)
              DW_AT_name	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
              DW_AT_GNU_pubnames	(true)
              DW_AT_low_pc	(0x0000000000000000)
              DW_AT_ranges	(0x00000030
                 [0x00000000 - 0x00006a5b)
                 [0x00006a5b - 0x00006b86)
                 [0x00000000 - 0x00000009))

0x00000026:   DW_TAG_variable
                DW_AT_name	("app_info_debug_enable")
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/profile_stack_debug.h")
                DW_AT_decl_line	(190)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000037:   DW_TAG_base_type
                DW_AT_name	("int")
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_byte_size	(0x04)

0x0000003e:   DW_TAG_variable
                DW_AT_name	("base_table")
                DW_AT_type	(cu + 0x0050 "const u32[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                DW_AT_decl_line	(1288)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000050:   DW_TAG_array_type
                DW_AT_type	(cu + 0x005c "const u32")

0x00000055:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0073 "sizetype")
                  DW_AT_count	(0x06)

0x0000005b:     NULL

0x0000005c:   DW_TAG_const_type
                DW_AT_type	(cu + 0x0061 "u32")

0x00000061:   DW_TAG_typedef
                DW_AT_type	(cu + 0x006c "unsigned int")
                DW_AT_name	("u32")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(48)

0x0000006c:   DW_TAG_base_type
                DW_AT_name	("unsigned int")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x04)

0x00000073:   DW_TAG_base_type
                DW_AT_name	("sizetype")
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_unsigned)

0x0000007a:   DW_TAG_variable
                DW_AT_name	("bt_suspend_user_cmd_loop_resumeuser_cmd_loop_release")
                DW_AT_type	(cu + 0x008c "const bt_sleep")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                DW_AT_decl_line	(3142)
                DW_AT_location	(DW_OP_addr 0x0)

0x0000008c:   DW_TAG_const_type
                DW_AT_type	(cu + 0x0091 "bt_sleep")

0x00000091:   DW_TAG_structure_type
                DW_AT_name	("bt_sleep")
                DW_AT_byte_size	(0x0c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/bt_config.h")
                DW_AT_decl_line	(313)

0x0000009a:     DW_TAG_member
                  DW_AT_name	("suspend")
                  DW_AT_type	(cu + 0x00c2 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/bt_config.h")
                  DW_AT_decl_line	(314)
                  DW_AT_data_member_location	(0x00)

0x000000a7:     DW_TAG_member
                  DW_AT_name	("resume")
                  DW_AT_type	(cu + 0x00c2 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/bt_config.h")
                  DW_AT_decl_line	(315)
                  DW_AT_data_member_location	(0x04)

0x000000b4:     DW_TAG_member
                  DW_AT_name	("release")
                  DW_AT_type	(cu + 0x00c2 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/bt_config.h")
                  DW_AT_decl_line	(316)
                  DW_AT_data_member_location	(0x08)

0x000000c1:     NULL

0x000000c2:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x00c7 "subroutine int")

0x000000c7:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")

0x000000cc:     DW_TAG_unspecified_parameters

0x000000cd:     NULL

0x000000ce:   DW_TAG_variable
                DW_AT_name	("__user_info")
                DW_AT_type	(cu + 0x00df "user_info_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                DW_AT_decl_line	(127)
                DW_AT_location	(DW_OP_addr 0x0)

0x000000df:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00ea "structure ")
                DW_AT_name	("user_info_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                DW_AT_decl_line	(125)

0x000000ea:   DW_TAG_structure_type
                DW_AT_byte_size	(0x0120)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                DW_AT_decl_line	(106)

0x000000ef:     DW_TAG_member
                  DW_AT_name	("cmd_struct")
                  DW_AT_type	(cu + 0x01e2 "user_cmd_ctrl")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(107)
                  DW_AT_data_member_location	(0x00)

0x000000fb:     DW_TAG_member
                  DW_AT_name	("loop")
                  DW_AT_type	(cu + 0x03f5 "run_loop")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(108)
                  DW_AT_data_member_location	(0x7c)

0x00000107:     DW_TAG_member
                  DW_AT_name	("bt_conn")
                  DW_AT_type	(cu + 0x0459 "conn_info[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(109)
                  DW_AT_data_member_location	(0x88)

0x00000113:     DW_TAG_member
                  DW_AT_name	("user_core_data")
                  DW_AT_type	(cu + 0x05f3 "user_core_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(110)
                  DW_AT_data_member_location	(0xa0)

0x0000011f:     DW_TAG_member
                  DW_AT_name	("user_half_sec_loop")
                  DW_AT_type	(cu + 0x0633 "btstack_timer_source_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(111)
                  DW_AT_data_member_location	(0xb4)

0x0000012b:     DW_TAG_member
                  DW_AT_name	("active_mac_addr")
                  DW_AT_type	(cu + 0x05c1 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(112)
                  DW_AT_data_member_location	(0xc8)

0x00000137:     DW_TAG_member
                  DW_AT_name	("more_mac_addr")
                  DW_AT_type	(cu + 0x06de "bd_addr_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(113)
                  DW_AT_data_member_location	(0xce)

0x00000143:     DW_TAG_member
                  DW_AT_name	("emitter_last_bd_addr")
                  DW_AT_type	(cu + 0x05c1 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(114)
                  DW_AT_data_member_location	(0x010a)

0x00000150:     DW_TAG_member
                  DW_AT_name	("bt_newest_status")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(115)
                  DW_AT_data_member_location	(0x0110)

0x0000015d:     DW_TAG_member
                  DW_AT_name	("tws_host_timer_cnt")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(116)
                  DW_AT_data_member_location	(0x0111)

0x0000016a:     DW_TAG_member
                  DW_AT_name	("total_connect_dev")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(117)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x03)
                  DW_AT_bit_offset	(0x05)
                  DW_AT_data_member_location	(0x0112)

0x0000017a:     DW_TAG_member
                  DW_AT_name	("current_search_index")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(118)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x03)
                  DW_AT_bit_offset	(0x02)
                  DW_AT_data_member_location	(0x0112)

0x0000018a:     DW_TAG_member
                  DW_AT_name	("stack_release")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(119)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x01)
                  DW_AT_data_member_location	(0x0112)

0x0000019a:     DW_TAG_member
                  DW_AT_name	("stack_exiting")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(120)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x0112)

0x000001aa:     DW_TAG_member
                  DW_AT_name	("in_background_flag")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(121)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x07)
                  DW_AT_data_member_location	(0x0113)

0x000001ba:     DW_TAG_member
                  DW_AT_name	("conning_mac_addr")
                  DW_AT_type	(cu + 0x05c1 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(122)
                  DW_AT_data_member_location	(0x0114)

0x000001c7:     DW_TAG_member
                  DW_AT_name	("keypress_cnt")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(123)
                  DW_AT_data_member_location	(0x011a)

0x000001d4:     DW_TAG_member
                  DW_AT_name	("keypress")
                  DW_AT_type	(cu + 0x0061 "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(124)
                  DW_AT_data_member_location	(0x011c)

0x000001e1:     NULL

0x000001e2:   DW_TAG_structure_type
                DW_AT_name	("user_cmd_ctrl")
                DW_AT_byte_size	(0x7c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                DW_AT_decl_line	(37)

0x000001ea:     DW_TAG_member
                  DW_AT_name	("pos_read")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(38)
                  DW_AT_data_member_location	(0x00)

0x000001f6:     DW_TAG_member
                  DW_AT_name	("pos_write")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(39)
                  DW_AT_data_member_location	(0x01)

0x00000202:     DW_TAG_member
                  DW_AT_name	("phone_num_len")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(40)
                  DW_AT_data_member_location	(0x02)

0x0000020e:     DW_TAG_member
                  DW_AT_name	("phone_num_buf")
                  DW_AT_type	(cu + 0x031d "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(41)
                  DW_AT_data_member_location	(0x03)

0x0000021a:     DW_TAG_member
                  DW_AT_name	("spp_send_buf_ptr")
                  DW_AT_type	(cu + 0x0329 "u8*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(43)
                  DW_AT_data_member_location	(0x24)

0x00000226:     DW_TAG_member
                  DW_AT_name	("spp_send_buf_len")
                  DW_AT_type	(cu + 0x032e "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(44)
                  DW_AT_data_member_location	(0x28)

0x00000232:     DW_TAG_member
                  DW_AT_name	("phone_hfp_set_vol")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(56)
                  DW_AT_data_member_location	(0x2a)

0x0000023e:     DW_TAG_member
                  DW_AT_name	("dtmf_num")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(57)
                  DW_AT_data_member_location	(0x2b)

0x0000024a:     DW_TAG_member
                  DW_AT_name	("inquiry_num_time")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(58)
                  DW_AT_data_member_location	(0x2c)

0x00000256:     DW_TAG_member
                  DW_AT_name	("sniff_num")
                  DW_AT_type	(cu + 0x0340 "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(59)
                  DW_AT_data_member_location	(0x2d)

0x00000262:     DW_TAG_member
                  DW_AT_name	("sniff_ctrl_config")
                  DW_AT_type	(cu + 0x034c "sniff_ctrl_config_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(60)
                  DW_AT_data_member_location	(0x2e)

0x0000026e:     DW_TAG_member
                  DW_AT_name	("user_cmd_buf")
                  DW_AT_type	(cu + 0x03c5 "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(62)
                  DW_AT_data_member_location	(0x3c)

0x0000027a:     DW_TAG_member
                  DW_AT_name	("emitter_cmd_buf")
                  DW_AT_type	(cu + 0x03d1 "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(63)
                  DW_AT_data_member_location	(0x4c)

0x00000286:     DW_TAG_member
                  DW_AT_name	("emitter_pos_read")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(64)
                  DW_AT_data_member_location	(0x56)

0x00000292:     DW_TAG_member
                  DW_AT_name	("emitter_pos_write")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(65)
                  DW_AT_data_member_location	(0x57)

0x0000029e:     DW_TAG_member
                  DW_AT_name	("unactive_cmd_buf")
                  DW_AT_type	(cu + 0x03dd "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(66)
                  DW_AT_data_member_location	(0x58)

0x000002aa:     DW_TAG_member
                  DW_AT_name	("unactive_pos_read")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(67)
                  DW_AT_data_member_location	(0x5d)

0x000002b6:     DW_TAG_member
                  DW_AT_name	("unactive_pos_write")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(68)
                  DW_AT_data_member_location	(0x5e)

0x000002c2:     DW_TAG_member
                  DW_AT_name	("keypress")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(69)
                  DW_AT_data_member_location	(0x5f)

0x000002ce:     DW_TAG_member
                  DW_AT_name	("pair")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(70)
                  DW_AT_data_member_location	(0x60)

0x000002da:     DW_TAG_member
                  DW_AT_name	("afh_channel")
                  DW_AT_type	(cu + 0x03d1 "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(71)
                  DW_AT_data_member_location	(0x61)

0x000002e6:     DW_TAG_member
                  DW_AT_name	("info")
                  DW_AT_type	(cu + 0x0061 "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(72)
                  DW_AT_data_member_location	(0x6c)

0x000002f2:     DW_TAG_member
                  DW_AT_name	("second_a2dp_source_addr")
                  DW_AT_type	(cu + 0x03e9 "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(73)
                  DW_AT_data_member_location	(0x70)

0x000002fe:     DW_TAG_member
                  DW_AT_name	("hci_disconn_addr")
                  DW_AT_type	(cu + 0x03e9 "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(74)
                  DW_AT_data_member_location	(0x76)

0x0000030a:     NULL

0x0000030b:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0316 "unsigned char")
                DW_AT_name	("u8")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(44)

0x00000316:   DW_TAG_base_type
                DW_AT_name	("unsigned char")
                DW_AT_encoding	(DW_ATE_unsigned_char)
                DW_AT_byte_size	(0x01)

0x0000031d:   DW_TAG_array_type
                DW_AT_type	(cu + 0x030b "u8")

0x00000322:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0073 "sizetype")
                  DW_AT_count	(0x1e)

0x00000328:     NULL

0x00000329:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x030b "u8")

0x0000032e:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0339 "unsigned short")
                DW_AT_name	("u16")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(46)

0x00000339:   DW_TAG_base_type
                DW_AT_name	("unsigned short")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x02)

0x00000340:   DW_TAG_array_type
                DW_AT_type	(cu + 0x030b "u8")

0x00000345:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0073 "sizetype")
                  DW_AT_count	(0x01)

0x0000034b:     NULL

0x0000034c:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0358 "sniff_ctrl_config_t")

0x00000351:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0073 "sizetype")
                  DW_AT_count	(0x01)

0x00000357:     NULL

0x00000358:   DW_TAG_structure_type
                DW_AT_name	("sniff_ctrl_config_t")
                DW_AT_byte_size	(0x0e)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                DW_AT_decl_line	(399)

0x00000361:     DW_TAG_member
                  DW_AT_name	("sniff_max_interval")
                  DW_AT_type	(cu + 0x03a3 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(400)
                  DW_AT_data_member_location	(0x00)

0x0000036e:     DW_TAG_member
                  DW_AT_name	("sniff_mix_interval")
                  DW_AT_type	(cu + 0x03a3 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(401)
                  DW_AT_data_member_location	(0x02)

0x0000037b:     DW_TAG_member
                  DW_AT_name	("sniff_attemp")
                  DW_AT_type	(cu + 0x03a3 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(402)
                  DW_AT_data_member_location	(0x04)

0x00000388:     DW_TAG_member
                  DW_AT_name	("sniff_timeout")
                  DW_AT_type	(cu + 0x03a3 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(403)
                  DW_AT_data_member_location	(0x06)

0x00000395:     DW_TAG_member
                  DW_AT_name	("sniff_addr")
                  DW_AT_type	(cu + 0x03ae "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(404)
                  DW_AT_data_member_location	(0x08)

0x000003a2:     NULL

0x000003a3:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0339 "unsigned short")
                DW_AT_name	("u16")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(13)

0x000003ae:   DW_TAG_array_type
                DW_AT_type	(cu + 0x03ba "u8")

0x000003b3:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0073 "sizetype")
                  DW_AT_count	(0x06)

0x000003b9:     NULL

0x000003ba:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0316 "unsigned char")
                DW_AT_name	("u8")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(11)

0x000003c5:   DW_TAG_array_type
                DW_AT_type	(cu + 0x030b "u8")

0x000003ca:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0073 "sizetype")
                  DW_AT_count	(0x10)

0x000003d0:     NULL

0x000003d1:   DW_TAG_array_type
                DW_AT_type	(cu + 0x030b "u8")

0x000003d6:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0073 "sizetype")
                  DW_AT_count	(0x0a)

0x000003dc:     NULL

0x000003dd:   DW_TAG_array_type
                DW_AT_type	(cu + 0x030b "u8")

0x000003e2:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0073 "sizetype")
                  DW_AT_count	(0x05)

0x000003e8:     NULL

0x000003e9:   DW_TAG_array_type
                DW_AT_type	(cu + 0x030b "u8")

0x000003ee:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0073 "sizetype")
                  DW_AT_count	(0x06)

0x000003f4:     NULL

0x000003f5:   DW_TAG_structure_type
                DW_AT_name	("run_loop")
                DW_AT_byte_size	(0x0c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/run_loop.h")
                DW_AT_decl_line	(9)

0x000003fd:     DW_TAG_member
                  DW_AT_name	("entry")
                  DW_AT_type	(cu + 0x0422 "btstack_linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/run_loop.h")
                  DW_AT_decl_line	(10)
                  DW_AT_data_member_location	(0x00)

0x00000409:     DW_TAG_member
                  DW_AT_name	("run")
                  DW_AT_type	(cu + 0x0447 "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/run_loop.h")
                  DW_AT_decl_line	(11)
                  DW_AT_data_member_location	(0x04)

0x00000415:     DW_TAG_member
                  DW_AT_name	("var")
                  DW_AT_type	(cu + 0x0458 "*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/run_loop.h")
                  DW_AT_decl_line	(12)
                  DW_AT_data_member_location	(0x08)

0x00000421:     NULL

0x00000422:   DW_TAG_typedef
                DW_AT_type	(cu + 0x042d "btstack_linked_item")
                DW_AT_name	("btstack_linked_item_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(55)

0x0000042d:   DW_TAG_structure_type
                DW_AT_name	("btstack_linked_item")
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(53)

0x00000435:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(cu + 0x0442 "btstack_linked_item*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                  DW_AT_decl_line	(54)
                  DW_AT_data_member_location	(0x00)

0x00000441:     NULL

0x00000442:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x042d "btstack_linked_item")

0x00000447:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x044c "subroutine ")

0x0000044c:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x0000044d:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0453 "run_loop*")

0x00000452:     NULL

0x00000453:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x03f5 "run_loop")

0x00000458:   DW_TAG_pointer_type

0x00000459:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0465 "conn_info")

0x0000045e:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0073 "sizetype")
                  DW_AT_count	(0x01)

0x00000464:     NULL

0x00000465:   DW_TAG_structure_type
                DW_AT_name	("conn_info")
                DW_AT_byte_size	(0x18)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                DW_AT_decl_line	(79)

0x0000046d:     DW_TAG_member
                  DW_AT_name	("mac_addr")
                  DW_AT_type	(cu + 0x05c1 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(80)
                  DW_AT_data_member_location	(0x00)

0x00000479:     DW_TAG_member
                  DW_AT_name	("hci_connect_handle")
                  DW_AT_type	(cu + 0x032e "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(81)
                  DW_AT_data_member_location	(0x06)

0x00000485:     DW_TAG_member
                  DW_AT_name	("curr_channel")
                  DW_AT_type	(cu + 0x032e "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(82)
                  DW_AT_data_member_location	(0x08)

0x00000491:     DW_TAG_member
                  DW_AT_name	("remote_not_support_channel")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(83)
                  DW_AT_data_member_location	(0x0a)

0x0000049d:     DW_TAG_member
                  DW_AT_name	("connect_status")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(84)
                  DW_AT_data_member_location	(0x0b)

0x000004a9:     DW_TAG_member
                  DW_AT_name	("hfp_status")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(85)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x0c)

0x000004b8:     DW_TAG_member
                  DW_AT_name	("bt_hfp_flag")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(86)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x0c)

0x000004c7:     DW_TAG_member
                  DW_AT_name	("second_call_status")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(87)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x0d)

0x000004d6:     DW_TAG_member
                  DW_AT_name	("a2dp_status")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(88)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x0d)

0x000004e5:     DW_TAG_member
                  DW_AT_name	("avctp_ctrl_status")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(89)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x0e)

0x000004f4:     DW_TAG_member
                  DW_AT_name	("connect_a2dp_cnt")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(90)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x0e)

0x00000503:     DW_TAG_member
                  DW_AT_name	("one_call_onheld")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(91)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x06)
                  DW_AT_data_member_location	(0x0f)

0x00000512:     DW_TAG_member
                  DW_AT_name	("reserve2")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(92)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x03)
                  DW_AT_bit_offset	(0x03)
                  DW_AT_data_member_location	(0x0f)

0x00000521:     DW_TAG_member
                  DW_AT_name	("inused")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(93)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x02)
                  DW_AT_data_member_location	(0x0f)

0x00000530:     DW_TAG_member
                  DW_AT_name	("a2dp_decoder_status")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(94)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x01)
                  DW_AT_data_member_location	(0x0f)

0x0000053f:     DW_TAG_member
                  DW_AT_name	("inband_ringtone")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(95)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x0f)

0x0000054e:     DW_TAG_member
                  DW_AT_name	("auto_connect_a2dp")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(96)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x07)
                  DW_AT_data_member_location	(0x10)

0x0000055d:     DW_TAG_member
                  DW_AT_name	("current_mode")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(97)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x05)
                  DW_AT_data_member_location	(0x10)

0x0000056c:     DW_TAG_member
                  DW_AT_name	("avdtp_a2dp_connect_state")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(98)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x03)
                  DW_AT_data_member_location	(0x10)

0x0000057b:     DW_TAG_member
                  DW_AT_name	("hid_disconn_state")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(99)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x02)
                  DW_AT_data_member_location	(0x10)

0x0000058a:     DW_TAG_member
                  DW_AT_name	("role_type")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(100)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x01)
                  DW_AT_data_member_location	(0x10)

0x00000599:     DW_TAG_member
                  DW_AT_name	("reserve")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(101)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x10)

0x000005a8:     DW_TAG_member
                  DW_AT_name	("sniff_cnt")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(102)
                  DW_AT_data_member_location	(0x11)

0x000005b4:     DW_TAG_member
                  DW_AT_name	("user_at_cmd_item")
                  DW_AT_type	(cu + 0x05e3 "linked_list_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(103)
                  DW_AT_data_member_location	(0x14)

0x000005c0:     NULL

0x000005c1:   DW_TAG_typedef
                DW_AT_type	(cu + 0x05cc "uint8_t[]")
                DW_AT_name	("bd_addr_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/utils.h")
                DW_AT_decl_line	(66)

0x000005cc:   DW_TAG_array_type
                DW_AT_type	(cu + 0x05d8 "uint8_t")

0x000005d1:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0073 "sizetype")
                  DW_AT_count	(0x06)

0x000005d7:     NULL

0x000005d8:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0316 "unsigned char")
                DW_AT_name	("uint8_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(44)

0x000005e3:   DW_TAG_typedef
                DW_AT_type	(cu + 0x05ee "btstack_linked_item_t*")
                DW_AT_name	("linked_list_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(101)

0x000005ee:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0422 "btstack_linked_item_t")

0x000005f3:   DW_TAG_typedef
                DW_AT_type	(cu + 0x05fe "structure ")
                DW_AT_name	("user_core_data_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                DW_AT_decl_line	(32)

0x000005fe:   DW_TAG_structure_type
                DW_AT_byte_size	(0x13)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                DW_AT_decl_line	(27)

0x00000602:     DW_TAG_member
                  DW_AT_name	("phone_sound_ctrl_flag")
                  DW_AT_type	(cu + 0x030b "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(28)
                  DW_AT_data_member_location	(0x00)

0x0000060e:     DW_TAG_member
                  DW_AT_name	("last_bd_addr")
                  DW_AT_type	(cu + 0x05c1 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(29)
                  DW_AT_data_member_location	(0x01)

0x0000061a:     DW_TAG_member
                  DW_AT_name	("name_bd_addr")
                  DW_AT_type	(cu + 0x05c1 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(30)
                  DW_AT_data_member_location	(0x07)

0x00000626:     DW_TAG_member
                  DW_AT_name	("special_conn_addr")
                  DW_AT_type	(cu + 0x05c1 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                  DW_AT_decl_line	(31)
                  DW_AT_data_member_location	(0x0d)

0x00000632:     NULL

0x00000633:   DW_TAG_typedef
                DW_AT_type	(cu + 0x063e "btstack_timer_source")
                DW_AT_name	("btstack_timer_source_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                DW_AT_decl_line	(19)

0x0000063e:   DW_TAG_structure_type
                DW_AT_name	("btstack_timer_source")
                DW_AT_byte_size	(0x14)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                DW_AT_decl_line	(7)

0x00000646:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x0422 "btstack_linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(8)
                  DW_AT_data_member_location	(0x00)

0x00000652:     DW_TAG_member
                  DW_AT_name	("timeout")
                  DW_AT_type	(cu + 0x06c2 "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(10)
                  DW_AT_data_member_location	(0x04)

0x0000065e:     DW_TAG_member
                  DW_AT_name	("timeout_interval")
                  DW_AT_type	(cu + 0x06c2 "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(11)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x10)
                  DW_AT_bit_offset	(0x10)
                  DW_AT_data_member_location	(0x08)

0x0000066d:     DW_TAG_member
                  DW_AT_name	("timer_type")
                  DW_AT_type	(cu + 0x06c2 "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(12)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x0c)
                  DW_AT_data_member_location	(0x08)

0x0000067c:     DW_TAG_member
                  DW_AT_name	("timer_tick_overflow")
                  DW_AT_type	(cu + 0x06c2 "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(13)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x0b)
                  DW_AT_data_member_location	(0x08)

0x0000068b:     DW_TAG_member
                  DW_AT_name	("loop_flag")
                  DW_AT_type	(cu + 0x06c2 "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(14)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x0a)
                  DW_AT_data_member_location	(0x08)

0x0000069a:     DW_TAG_member
                  DW_AT_name	("loop_times")
                  DW_AT_type	(cu + 0x06c2 "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(15)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x0a)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x08)

0x000006a9:     DW_TAG_member
                  DW_AT_name	("process")
                  DW_AT_type	(cu + 0x06cd "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(17)
                  DW_AT_data_member_location	(0x0c)

0x000006b5:     DW_TAG_member
                  DW_AT_name	("context")
                  DW_AT_type	(cu + 0x0458 "*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(18)
                  DW_AT_data_member_location	(0x10)

0x000006c1:     NULL

0x000006c2:   DW_TAG_typedef
                DW_AT_type	(cu + 0x006c "unsigned int")
                DW_AT_name	("uint32_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(48)

0x000006cd:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x06d2 "subroutine ")

0x000006d2:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x000006d3:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x06d9 "btstack_timer_source*")

0x000006d8:     NULL

0x000006d9:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x063e "btstack_timer_source")

0x000006de:   DW_TAG_array_type
                DW_AT_type	(cu + 0x05c1 "bd_addr_t")

0x000006e3:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0073 "sizetype")
                  DW_AT_count	(0x0a)

0x000006e9:     NULL

0x000006ea:   DW_TAG_variable
                DW_AT_name	("g_user_cmd")
                DW_AT_type	(cu + 0x06fb "user_cmd_ctrl*")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/avctp_user.c")
                DW_AT_decl_line	(76)
                DW_AT_location	(DW_OP_addr 0x0)

0x000006fb:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x01e2 "user_cmd_ctrl")

0x00000700:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/profile_common.h")
                DW_AT_decl_line	(42)

0x00000704:     DW_TAG_enumerator
                  DW_AT_name	("HFP_INDSTA_BATTERY_CHG")
                  DW_AT_const_value	(0)

0x0000070a:     DW_TAG_enumerator
                  DW_AT_name	("HFP_INDSTA_SIGNAL_CHG")
                  DW_AT_const_value	(1)

0x00000710:     DW_TAG_enumerator
                  DW_AT_name	("HFP_INDSTA_INCOMING_CALL")
                  DW_AT_const_value	(2)

0x00000716:     DW_TAG_enumerator
                  DW_AT_name	("HFP_INDSTA_OUTGOING_CALL")
                  DW_AT_const_value	(3)

0x0000071c:     DW_TAG_enumerator
                  DW_AT_name	("HFP_INDSTA_CALL_ACTIVE")
                  DW_AT_const_value	(4)

0x00000722:     DW_TAG_enumerator
                  DW_AT_name	("HFP_INDSTA_CALL_HANGUP")
                  DW_AT_const_value	(5)

0x00000728:     DW_TAG_enumerator
                  DW_AT_name	("HFP_INDSTA_CALL_ALERT")
                  DW_AT_const_value	(6)

0x0000072e:     DW_TAG_enumerator
                  DW_AT_name	("HFP_INDSTA_VOL_CHANGED")
                  DW_AT_const_value	(7)

0x00000734:     DW_TAG_enumerator
                  DW_AT_name	("HFP_INDSTA_SECOND_CALL_STATUS")
                  DW_AT_const_value	(8)

0x0000073a:     DW_TAG_enumerator
                  DW_AT_name	("HFP_INDSTA_INBAND_RINGTONE")
                  DW_AT_const_value	(9)

0x00000740:     DW_TAG_enumerator
                  DW_AT_name	("HFP_INDSTA_AG_GET_ATCMD")
                  DW_AT_const_value	(10)

0x00000746:     DW_TAG_enumerator
                  DW_AT_name	("HFP_INDSTA_CALL_HELD")
                  DW_AT_const_value	(11)

0x0000074c:     DW_TAG_enumerator
                  DW_AT_name	("HFP_INDSTA_MAX")
                  DW_AT_const_value	(12)

0x00000752:     NULL

0x00000753:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                DW_AT_decl_line	(374)

0x00000758:     DW_TAG_enumerator
                  DW_AT_name	("BT_MUSIC_STATUS_IDLE")
                  DW_AT_const_value	(0)

0x0000075e:     DW_TAG_enumerator
                  DW_AT_name	("BT_MUSIC_STATUS_STARTING")
                  DW_AT_const_value	(1)

0x00000764:     DW_TAG_enumerator
                  DW_AT_name	("BT_MUSIC_STATUS_SUSPENDING")
                  DW_AT_const_value	(2)

0x0000076a:     NULL

0x0000076b:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                DW_AT_decl_line	(12)

0x0000076f:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_START_CONNECTION")
                  DW_AT_const_value	(0)

0x00000775:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_START_CONNEC_VIA_ADDR")
                  DW_AT_const_value	(1)

0x0000077b:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_START_CONNEC_VIA_ADDR_MANUALLY")
                  DW_AT_const_value	(2)

0x00000781:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_START_CONNEC_SPP_VIA_ADDR")
                  DW_AT_const_value	(3)

0x00000787:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_DISCONNECTION_HCI")
                  DW_AT_const_value	(4)

0x0000078d:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_CONNECTION_CANCEL")
                  DW_AT_const_value	(5)

0x00000793:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_READ_REMOTE_NAME")
                  DW_AT_const_value	(6)

0x00000799:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_PAUSE_MUSIC")
                  DW_AT_const_value	(7)

0x0000079f:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SCO_LINK")
                  DW_AT_const_value	(8)

0x000007a5:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_CONN_SCO")
                  DW_AT_const_value	(9)

0x000007ab:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_DISCONN_SCO")
                  DW_AT_const_value	(10)

0x000007b1:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_DISCONN_SDP_MASTER")
                  DW_AT_const_value	(11)

0x000007b7:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_WRITE_SCAN_DISABLE")
                  DW_AT_const_value	(12)

0x000007bd:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_WRITE_SCAN_ENABLE")
                  DW_AT_const_value	(13)

0x000007c3:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_WRITE_CONN_DISABLE")
                  DW_AT_const_value	(14)

0x000007c9:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_WRITE_CONN_ENABLE")
                  DW_AT_const_value	(15)

0x000007cf:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SEARCH_DEVICE")
                  DW_AT_const_value	(16)

0x000007d5:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_INQUIRY_CANCEL")
                  DW_AT_const_value	(17)

0x000007db:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_PAGE_CANCEL")
                  DW_AT_const_value	(18)

0x000007e1:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SNIFF_IN")
                  DW_AT_const_value	(19)

0x000007e7:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SNIFF_EXIT")
                  DW_AT_const_value	(20)

0x000007ed:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_ALL_SNIFF_EXIT")
                  DW_AT_const_value	(21)

0x000007f3:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CMD_BEGIN")
                  DW_AT_const_value	(22)

0x000007f9:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CALL_VOLUME_UP")
                  DW_AT_const_value	(23)

0x000007ff:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CALL_VOLUME_DOWN")
                  DW_AT_const_value	(24)

0x00000805:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CALL_SET_VOLUME")
                  DW_AT_const_value	(25)

0x0000080b:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CALL_GET_VOLUME")
                  DW_AT_const_value	(26)

0x00000811:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CALL_ANSWER")
                  DW_AT_const_value	(27)

0x00000817:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CALL_HANGUP")
                  DW_AT_const_value	(28)

0x0000081d:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CALL_LAST_NO")
                  DW_AT_const_value	(29)

0x00000823:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CALL_CURRENT")
                  DW_AT_const_value	(30)

0x00000829:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_DTMF_TONES")
                  DW_AT_const_value	(31)

0x0000082f:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_DIAL_NUMBER")
                  DW_AT_const_value	(32)

0x00000835:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SEND_BATTERY")
                  DW_AT_const_value	(33)

0x0000083b:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_GET_SIRI_STATUS")
                  DW_AT_const_value	(34)

0x00000841:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_GET_SIRI_OPEN")
                  DW_AT_const_value	(35)

0x00000847:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_GET_SIRI_CLOSE")
                  DW_AT_const_value	(36)

0x0000084d:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_GET_PHONE_DATE_TIME")
                  DW_AT_const_value	(37)

0x00000853:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CMD_SEND_BIA")
                  DW_AT_const_value	(38)

0x00000859:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CMD_GET_MANUFACTURER")
                  DW_AT_const_value	(39)

0x0000085f:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CMD_UPDATE_BATTARY")
                  DW_AT_const_value	(40)

0x00000865:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_THREE_WAY_ANSWER1")
                  DW_AT_const_value	(41)

0x0000086b:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_THREE_WAY_ANSWER2")
                  DW_AT_const_value	(42)

0x00000871:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_THREE_WAY_ANSWER1X")
                  DW_AT_const_value	(43)

0x00000877:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_THREE_WAY_ANSWER2X")
                  DW_AT_const_value	(44)

0x0000087d:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_THREE_WAY_ANSWER3")
                  DW_AT_const_value	(45)

0x00000883:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_THREE_WAY_REJECT")
                  DW_AT_const_value	(46)

0x00000889:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_DISCONNECT")
                  DW_AT_const_value	(47)

0x0000088f:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CMD_END")
                  DW_AT_const_value	(48)

0x00000895:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_CMD_BEGIN")
                  DW_AT_const_value	(49)

0x0000089b:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_PLAY")
                  DW_AT_const_value	(50)

0x000008a1:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_PAUSE")
                  DW_AT_const_value	(51)

0x000008a7:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_STOP")
                  DW_AT_const_value	(52)

0x000008ad:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_NEXT")
                  DW_AT_const_value	(53)

0x000008b3:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_PREV")
                  DW_AT_const_value	(54)

0x000008b9:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_FORWARD")
                  DW_AT_const_value	(55)

0x000008bf:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_REWIND")
                  DW_AT_const_value	(56)

0x000008c5:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_REPEAT_MODE")
                  DW_AT_const_value	(57)

0x000008cb:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_SHUFFLE_MODE")
                  DW_AT_const_value	(58)

0x000008d1:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_GET_PLAY_TIME")
                  DW_AT_const_value	(59)

0x000008d7:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_SEND_VOL")
                  DW_AT_const_value	(60)

0x000008dd:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_DISCONNECT")
                  DW_AT_const_value	(61)

0x000008e3:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_CONN")
                  DW_AT_const_value	(62)

0x000008e9:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_CMD_END")
                  DW_AT_const_value	(63)

0x000008ef:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_A2DP_CMD_BEGIN")
                  DW_AT_const_value	(64)

0x000008f6:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AUTO_CONN_A2DP")
                  DW_AT_const_value	(65)

0x000008fd:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_CONN_A2DP")
                  DW_AT_const_value	(66)

0x00000904:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_DISCONN_A2DP")
                  DW_AT_const_value	(67)

0x0000090b:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_A2DP_CMD_START")
                  DW_AT_const_value	(68)

0x00000912:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_A2DP_CMD_CLOSE")
                  DW_AT_const_value	(69)

0x00000919:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_A2DP_CMD_SUSPEND")
                  DW_AT_const_value	(70)

0x00000920:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_A2DP_CMD_GET_CONFIGURATION")
                  DW_AT_const_value	(71)

0x00000927:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_A2DP_CMD_ABORT")
                  DW_AT_const_value	(72)

0x0000092e:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_A2DP_CMD_END")
                  DW_AT_const_value	(73)

0x00000935:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_POWER_OFF")
                  DW_AT_const_value	(74)

0x0000093c:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_POWER_ON")
                  DW_AT_const_value	(75)

0x00000943:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_CMD_BEGIN")
                  DW_AT_const_value	(76)

0x0000094a:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_CONN")
                  DW_AT_const_value	(77)

0x00000951:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_ANDROID")
                  DW_AT_const_value	(78)

0x00000958:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_IOS")
                  DW_AT_const_value	(79)

0x0000095f:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_BOTH")
                  DW_AT_const_value	(80)

0x00000966:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_DISCONNECT")
                  DW_AT_const_value	(81)

0x0000096d:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_HOME")
                  DW_AT_const_value	(82)

0x00000974:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_RETURN")
                  DW_AT_const_value	(83)

0x0000097b:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_LEFTARROW")
                  DW_AT_const_value	(84)

0x00000982:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_RIGHTARROW")
                  DW_AT_const_value	(85)

0x00000989:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_VOL_UP")
                  DW_AT_const_value	(86)

0x00000990:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_VOL_DOWN")
                  DW_AT_const_value	(87)

0x00000997:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_SEND_DATA")
                  DW_AT_const_value	(88)

0x0000099e:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_CMD_END")
                  DW_AT_const_value	(89)

0x000009a5:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_CMD_BEGIN")
                  DW_AT_const_value	(90)

0x000009ac:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SYNC_TRAIN")
                  DW_AT_const_value	(91)

0x000009b3:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SYNC_TRAIN_SCAN")
                  DW_AT_const_value	(92)

0x000009ba:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_MONITOR")
                  DW_AT_const_value	(93)

0x000009c1:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_CONNEC_VIA_ADDR")
                  DW_AT_const_value	(94)

0x000009c8:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_COTROL_CDM")
                  DW_AT_const_value	(95)

0x000009cf:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_CLEAR_INFO")
                  DW_AT_const_value	(96)

0x000009d6:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_DISCONNECTION_HCI")
                  DW_AT_const_value	(97)

0x000009dd:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_START_CONNECTION")
                  DW_AT_const_value	(98)

0x000009e4:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_SYNC_CDM")
                  DW_AT_const_value	(99)

0x000009eb:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_SYNC_SBC_CDM")
                  DW_AT_const_value	(100)

0x000009f2:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_RESTART_SBC_CDM")
                  DW_AT_const_value	(101)

0x000009f9:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SYNC_TRAIN_CANCEL")
                  DW_AT_const_value	(102)

0x00000a00:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SYNC_TRAIN_SCAN_CANCEL")
                  DW_AT_const_value	(103)

0x00000a07:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_SYNC_CDM_FUN")
                  DW_AT_const_value	(104)

0x00000a0e:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_LINEIN_START")
                  DW_AT_const_value	(105)

0x00000a15:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_LINEIN_CLOSE")
                  DW_AT_const_value	(106)

0x00000a1c:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_CMD_END")
                  DW_AT_const_value	(107)

0x00000a23:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SPP_CMD_BEGIN")
                  DW_AT_const_value	(108)

0x00000a2a:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SPP_SEND_DATA")
                  DW_AT_const_value	(109)

0x00000a31:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SPP_TRY_SEND_DATA")
                  DW_AT_const_value	(110)

0x00000a38:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SPP_UPDATA_DATA")
                  DW_AT_const_value	(111)

0x00000a3f:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SPP_DISCONNECT")
                  DW_AT_const_value	(112)

0x00000a46:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SPP_CMD_END")
                  DW_AT_const_value	(113)

0x00000a4d:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_PBG_CMD_BEGIN")
                  DW_AT_const_value	(114)

0x00000a54:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_PBG_SEND_DATA")
                  DW_AT_const_value	(115)

0x00000a5b:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_PBG_TRY_SEND_DATA")
                  DW_AT_const_value	(116)

0x00000a62:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_PBG_CMD_END")
                  DW_AT_const_value	(117)

0x00000a69:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_ADT_CMD_BEGIN")
                  DW_AT_const_value	(118)

0x00000a70:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_ADT_CONNECT")
                  DW_AT_const_value	(119)

0x00000a77:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_ADT_KEY_MIC_OPEN")
                  DW_AT_const_value	(120)

0x00000a7e:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_ADT_SEND_DATA")
                  DW_AT_const_value	(121)

0x00000a85:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_ADT_TRY_SEND_DATA")
                  DW_AT_const_value	(122)

0x00000a8c:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_ADT_CMD_END")
                  DW_AT_const_value	(123)

0x00000a93:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_PBAP_CMD_BEGIN")
                  DW_AT_const_value	(124)

0x00000a9a:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_PBAP_READ_PART")
                  DW_AT_const_value	(125)

0x00000aa1:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_PBAP_READ_ALL")
                  DW_AT_const_value	(126)

0x00000aa8:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_PBAP_STOP_READING")
                  DW_AT_const_value	(127)

0x00000aaf:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_PBAP_CMD_END")
                  DW_AT_const_value	(128)

0x00000ab6:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_DEL_ALL_REMOTE_INFO")
                  DW_AT_const_value	(129)

0x00000abd:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TEST_KEY")
                  DW_AT_const_value	(130)

0x00000ac4:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SEND_USER_INFO")
                  DW_AT_const_value	(131)

0x00000acb:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_KEYPRESS")
                  DW_AT_const_value	(132)

0x00000ad2:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_PAIR")
                  DW_AT_const_value	(133)

0x00000ad9:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AFH_CHANNEL")
                  DW_AT_const_value	(134)

0x00000ae0:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HALF_SEC_LOOP_CREATE")
                  DW_AT_const_value	(135)

0x00000ae7:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HALF_SEC_LOOP_DEL")
                  DW_AT_const_value	(136)

0x00000aee:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_CMD_SYNC_VOL_INC")
                  DW_AT_const_value	(137)

0x00000af5:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_CMD_SYNC_VOL_DEC")
                  DW_AT_const_value	(138)

0x00000afc:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_CMD_CHANGE_PROFILE_MODE")
                  DW_AT_const_value	(139)

0x00000b03:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_CMD_RESERVE_INDEX4")
                  DW_AT_const_value	(140)

0x00000b0a:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_CMD_RESUME_STACK")
                  DW_AT_const_value	(141)

0x00000b11:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_GET_MUSIC_INFO")
                  DW_AT_const_value	(142)

0x00000b18:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_LAST")
                  DW_AT_const_value	(143)

0x00000b1f:     NULL

0x00000b20:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                DW_AT_decl_line	(299)

0x00000b25:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_POWER_ON")
                  DW_AT_const_value	(1)

0x00000b2b:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_POWER_OFF")
                  DW_AT_const_value	(2)

0x00000b31:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_INIT_OK")
                  DW_AT_const_value	(3)

0x00000b37:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_EXIT_OK")
                  DW_AT_const_value	(4)

0x00000b3d:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_START_CONNECTED")
                  DW_AT_const_value	(5)

0x00000b43:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_FIRST_CONNECTED")
                  DW_AT_const_value	(6)

0x00000b49:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_SECOND_CONNECTED")
                  DW_AT_const_value	(7)

0x00000b4f:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_ENCRY_COMPLETE")
                  DW_AT_const_value	(8)

0x00000b55:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_FIRST_DISCONNECT")
                  DW_AT_const_value	(9)

0x00000b5b:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_SECOND_DISCONNECT")
                  DW_AT_const_value	(10)

0x00000b61:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_PHONE_INCOME")
                  DW_AT_const_value	(11)

0x00000b67:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_PHONE_NUMBER")
                  DW_AT_const_value	(12)

0x00000b6d:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_PHONE_MANUFACTURER")
                  DW_AT_const_value	(13)

0x00000b73:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_PHONE_OUT")
                  DW_AT_const_value	(14)

0x00000b79:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_PHONE_ACTIVE")
                  DW_AT_const_value	(15)

0x00000b7f:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_PHONE_HANGUP")
                  DW_AT_const_value	(16)

0x00000b85:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_BEGIN_AUTO_CON")
                  DW_AT_const_value	(17)

0x00000b8b:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_MUSIC_SOUND_COME")
                  DW_AT_const_value	(18)

0x00000b91:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_MUSIC_SOUND_GO")
                  DW_AT_const_value	(19)

0x00000b97:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_RESUME")
                  DW_AT_const_value	(20)

0x00000b9d:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_RESUME_BTSTACK")
                  DW_AT_const_value	(21)

0x00000ba3:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_SUSPEND")
                  DW_AT_const_value	(22)

0x00000ba9:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_LAST_CALL_TYPE_CHANGE")
                  DW_AT_const_value	(23)

0x00000baf:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_CALL_VOL_CHANGE")
                  DW_AT_const_value	(24)

0x00000bb5:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_SCO_STATUS_CHANGE")
                  DW_AT_const_value	(25)

0x00000bbb:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_CONNECT_WITHOUT_LINKKEY")
                  DW_AT_const_value	(26)

0x00000bc1:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_PHONE_BATTERY_CHANGE")
                  DW_AT_const_value	(27)

0x00000bc7:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_RECONNECT_LINKKEY_LOST")
                  DW_AT_const_value	(28)

0x00000bcd:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_RECONN_OR_CONN")
                  DW_AT_const_value	(29)

0x00000bd3:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_BT_TEST_BOX_CMD")
                  DW_AT_const_value	(30)

0x00000bd9:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_BT_TWS_CONNECT_CMD")
                  DW_AT_const_value	(31)

0x00000bdf:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_SNIFF_STATE_UPDATE")
                  DW_AT_const_value	(32)

0x00000be5:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_TONE_BY_FILE_NAME")
                  DW_AT_const_value	(33)

0x00000beb:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_PHONE_DATE_AND_TIME")
                  DW_AT_const_value	(34)

0x00000bf1:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_INBAND_RINGTONE")
                  DW_AT_const_value	(35)

0x00000bf7:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_VOICE_RECOGNITION")
                  DW_AT_const_value	(36)

0x00000bfd:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_AVRCP_INCOME_OPID")
                  DW_AT_const_value	(37)

0x00000c03:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_HFP_SERVICE_LEVEL_CONNECTION_OK")
                  DW_AT_const_value	(38)

0x00000c09:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_CONN_A2DP_CH")
                  DW_AT_const_value	(39)

0x00000c0f:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_CONN_HFP_CH")
                  DW_AT_const_value	(40)

0x00000c15:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_INQUIRY_TIMEOUT")
                  DW_AT_const_value	(41)

0x00000c1b:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_INITING")
                  DW_AT_const_value	(42)

0x00000c21:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_WAITINT_CONN")
                  DW_AT_const_value	(43)

0x00000c27:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_AUTO_CONNECTINT")
                  DW_AT_const_value	(44)

0x00000c2d:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_CONNECTING")
                  DW_AT_const_value	(45)

0x00000c33:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_TAKEING_PHONE")
                  DW_AT_const_value	(46)

0x00000c39:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_PLAYING_MUSIC")
                  DW_AT_const_value	(47)

0x00000c3f:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_A2DP_MEDIA_START")
                  DW_AT_const_value	(48)

0x00000c45:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_A2DP_MEDIA_STOP")
                  DW_AT_const_value	(49)

0x00000c4b:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_BROADCAST_STATE")
                  DW_AT_const_value	(50)

0x00000c51:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_TRIM_OVER")
                  DW_AT_const_value	(51)

0x00000c57:     NULL

0x00000c58:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                DW_AT_decl_line	(631)

0x00000c5d:     DW_TAG_enumerator
                  DW_AT_name	("REMOTE_DEV_UNKNOWN")
                  DW_AT_const_value	(0)

0x00000c63:     DW_TAG_enumerator
                  DW_AT_name	("REMOTE_DEV_ANDROID")
                  DW_AT_const_value	(1)

0x00000c69:     DW_TAG_enumerator
                  DW_AT_name	("REMOTE_DEV_IOS")
                  DW_AT_const_value	(2)

0x00000c6f:     DW_TAG_enumerator
                  DW_AT_name	("REMOTE_DEV_XIAOMI")
                  DW_AT_const_value	(3)

0x00000c75:     NULL

0x00000c76:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/bredr/multi_bd.h")
                DW_AT_decl_line	(6)

0x00000c7a:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_SCO_REQ")
                  DW_AT_const_value	(1)

0x00000c80:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_SCO_CONNECTED")
                  DW_AT_const_value	(2)

0x00000c86:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_SCO_DISCONN")
                  DW_AT_const_value	(3)

0x00000c8c:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_A2DP_ACTIVE")
                  DW_AT_const_value	(4)

0x00000c92:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_A2DP_STOP")
                  DW_AT_const_value	(5)

0x00000c98:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_CALL_INCOMING")
                  DW_AT_const_value	(6)

0x00000c9e:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_CALL_OUTGOING")
                  DW_AT_const_value	(7)

0x00000ca4:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_CALL_HANGUP")
                  DW_AT_const_value	(8)

0x00000caa:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_SET_WORK_TIME")
                  DW_AT_const_value	(9)

0x00000cb0:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_CLR_WORK_TIME")
                  DW_AT_const_value	(10)

0x00000cb6:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_SCAN_STATUS")
                  DW_AT_const_value	(11)

0x00000cbc:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_SIRI_ACTIVE")
                  DW_AT_const_value	(12)

0x00000cc2:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_SIRI_STOP")
                  DW_AT_const_value	(13)

0x00000cc8:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_A2DP_CONN_CH")
                  DW_AT_const_value	(14)

0x00000cce:     NULL

0x00000ccf:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/sdp.h")
                DW_AT_decl_line	(143)

0x00000cd3:     DW_TAG_enumerator
                  DW_AT_name	("SDP_CMD_CONNECT")
                  DW_AT_const_value	(0)

0x00000cd9:     DW_TAG_enumerator
                  DW_AT_name	("SDP_CMD_DISCONNECT")
                  DW_AT_const_value	(1)

0x00000cdf:     DW_TAG_enumerator
                  DW_AT_name	("SDP_CMD_GET_REMOTE_PNP_INFO")
                  DW_AT_const_value	(2)

0x00000ce5:     NULL

0x00000ce6:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/profile_common.h")
                DW_AT_decl_line	(31)

0x00000cea:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_OK")
                  DW_AT_const_value	(0)

0x00000cf0:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_DEVICE_NO_FOUND")
                  DW_AT_const_value	(-1000)

0x00000cf7:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_NO_FOUND")
                  DW_AT_const_value	(-1001)

0x00000cfe:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_SEND_ERROR")
                  DW_AT_const_value	(-1002)

0x00000d05:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_REMOTE_NOT_SUPPORT")
                  DW_AT_const_value	(-1003)

0x00000d0c:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_TRY_AGAIN_LATER")
                  DW_AT_const_value	(-1004)

0x00000d13:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_DATA_PARSE_ERROE")
                  DW_AT_const_value	(-1005)

0x00000d1a:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_PROFILE_NOT_SUPPORT")
                  DW_AT_const_value	(-1006)

0x00000d21:     NULL

0x00000d22:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hfp_profile.h")
                DW_AT_decl_line	(142)

0x00000d26:     DW_TAG_enumerator
                  DW_AT_name	("HFP_CALL_ANSWER")
                  DW_AT_const_value	(0)

0x00000d2c:     DW_TAG_enumerator
                  DW_AT_name	("HFP_CALL_HANGUP")
                  DW_AT_const_value	(1)

0x00000d32:     DW_TAG_enumerator
                  DW_AT_name	("HFP_CALL_LAST_NO")
                  DW_AT_const_value	(2)

0x00000d38:     DW_TAG_enumerator
                  DW_AT_name	("HFP_CALL_VOLUME_UP")
                  DW_AT_const_value	(3)

0x00000d3e:     DW_TAG_enumerator
                  DW_AT_name	("HFP_CALL_VOLUME_DOWN")
                  DW_AT_const_value	(4)

0x00000d44:     DW_TAG_enumerator
                  DW_AT_name	("HFP_CALL_VOLUME_SET")
                  DW_AT_const_value	(5)

0x00000d4a:     DW_TAG_enumerator
                  DW_AT_name	("HFP_CALL_CURRENT")
                  DW_AT_const_value	(6)

0x00000d50:     DW_TAG_enumerator
                  DW_AT_name	("HFP_GET_SIRI_STATUS")
                  DW_AT_const_value	(7)

0x00000d56:     DW_TAG_enumerator
                  DW_AT_name	("HFP_GET_SIRI_OPEN")
                  DW_AT_const_value	(8)

0x00000d5c:     DW_TAG_enumerator
                  DW_AT_name	("HFP_GET_SIRI_CLOSE")
                  DW_AT_const_value	(9)

0x00000d62:     DW_TAG_enumerator
                  DW_AT_name	("HFP_GET_PHONE_DATE_TIME")
                  DW_AT_const_value	(10)

0x00000d68:     DW_TAG_enumerator
                  DW_AT_name	("HFP_CMD_GET_MANUFACTURER")
                  DW_AT_const_value	(11)

0x00000d6e:     DW_TAG_enumerator
                  DW_AT_name	("HFP_CMD_GET_NUM_INFO")
                  DW_AT_const_value	(12)

0x00000d74:     DW_TAG_enumerator
                  DW_AT_name	("HFP_CMD_SEND_BIA")
                  DW_AT_const_value	(13)

0x00000d7a:     DW_TAG_enumerator
                  DW_AT_name	("HFP_CMD_SEND_BCC")
                  DW_AT_const_value	(14)

0x00000d80:     DW_TAG_enumerator
                  DW_AT_name	("HFP_CMD_SIMPLE_CMD_TABLE_END")
                  DW_AT_const_value	(15)

0x00000d86:     DW_TAG_enumerator
                  DW_AT_name	("HFP_THREE_WAY_CALL")
                  DW_AT_const_value	(16)

0x00000d8c:     DW_TAG_enumerator
                  DW_AT_name	("HFP_CMD_DTMF")
                  DW_AT_const_value	(17)

0x00000d92:     DW_TAG_enumerator
                  DW_AT_name	("HFP_CMD_DIAL")
                  DW_AT_const_value	(18)

0x00000d98:     DW_TAG_enumerator
                  DW_AT_name	("HFP_CMD_SPEAK_GAIN")
                  DW_AT_const_value	(19)

0x00000d9e:     DW_TAG_enumerator
                  DW_AT_name	("HFP_CMD_CLEAR_SIRI_STATUS")
                  DW_AT_const_value	(20)

0x00000da4:     DW_TAG_enumerator
                  DW_AT_name	("HFP_CMD_UPDATE_BAT_NOW")
                  DW_AT_const_value	(21)

0x00000daa:     DW_TAG_enumerator
                  DW_AT_name	("HFP_CONNECT")
                  DW_AT_const_value	(22)

0x00000db0:     DW_TAG_enumerator
                  DW_AT_name	("HFP_DISCONNECT")
                  DW_AT_const_value	(23)

0x00000db6:     DW_TAG_enumerator
                  DW_AT_name	("HFP_AG_OUTGOING_CALL")
                  DW_AT_const_value	(24)

0x00000dbc:     DW_TAG_enumerator
                  DW_AT_name	("HFP_SEND_USER_AT_CMD")
                  DW_AT_const_value	(25)

0x00000dc2:     DW_TAG_enumerator
                  DW_AT_name	("HFP_NO_OPERATE")
                  DW_AT_const_value	(255)

0x00000dc9:     NULL

0x00000dca:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hfp_profile.h")
                DW_AT_decl_line	(124)

0x00000dce:     DW_TAG_enumerator
                  DW_AT_name	("HFP_GAIN_INC")
                  DW_AT_const_value	(0)

0x00000dd4:     DW_TAG_enumerator
                  DW_AT_name	("HFP_GAIN_DEC")
                  DW_AT_const_value	(1)

0x00000dda:     DW_TAG_enumerator
                  DW_AT_name	("HFP_GAIN_SET_GAIN")
                  DW_AT_const_value	(2)

0x00000de0:     DW_TAG_enumerator
                  DW_AT_name	("HFP_GAIN_GET_GAIN")
                  DW_AT_const_value	(3)

0x00000de6:     NULL

0x00000de7:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hfp_profile.h")
                DW_AT_decl_line	(132)

0x00000deb:     DW_TAG_enumerator
                  DW_AT_name	("THREE_WAY_OP_0")
                  DW_AT_const_value	(0)

0x00000df1:     DW_TAG_enumerator
                  DW_AT_name	("THREE_WAY_OP_1")
                  DW_AT_const_value	(1)

0x00000df7:     DW_TAG_enumerator
                  DW_AT_name	("THREE_WAY_OP_1X")
                  DW_AT_const_value	(2)

0x00000dfd:     DW_TAG_enumerator
                  DW_AT_name	("THREE_WAY_OP_2")
                  DW_AT_const_value	(3)

0x00000e03:     DW_TAG_enumerator
                  DW_AT_name	("THREE_WAY_OP_2X")
                  DW_AT_const_value	(4)

0x00000e09:     DW_TAG_enumerator
                  DW_AT_name	("THREE_WAY_OP_3")
                  DW_AT_const_value	(5)

0x00000e0f:     DW_TAG_enumerator
                  DW_AT_name	("THREE_WAY_OP_4")
                  DW_AT_const_value	(6)

0x00000e15:     NULL

0x00000e16:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/bt_config.h")
                DW_AT_decl_line	(11)

0x00000e1a:     DW_TAG_enumerator
                  DW_AT_name	("ACTIVE_MODE")
                  DW_AT_const_value	(0)

0x00000e20:     DW_TAG_enumerator
                  DW_AT_name	("HOLD_MODE")
                  DW_AT_const_value	(1)

0x00000e26:     DW_TAG_enumerator
                  DW_AT_name	("SNIFF_MODE")
                  DW_AT_const_value	(2)

0x00000e2c:     NULL

0x00000e2d:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                DW_AT_decl_line	(363)

0x00000e32:     DW_TAG_enumerator
                  DW_AT_name	("BT_CALL_BATTERY_CHG")
                  DW_AT_const_value	(0)

0x00000e38:     DW_TAG_enumerator
                  DW_AT_name	("BT_CALL_SIGNAL_CHG")
                  DW_AT_const_value	(1)

0x00000e3e:     DW_TAG_enumerator
                  DW_AT_name	("BT_CALL_INCOMING")
                  DW_AT_const_value	(2)

0x00000e44:     DW_TAG_enumerator
                  DW_AT_name	("BT_CALL_OUTGOING")
                  DW_AT_const_value	(3)

0x00000e4a:     DW_TAG_enumerator
                  DW_AT_name	("BT_CALL_ACTIVE")
                  DW_AT_const_value	(4)

0x00000e50:     DW_TAG_enumerator
                  DW_AT_name	("BT_CALL_HANGUP")
                  DW_AT_const_value	(5)

0x00000e56:     DW_TAG_enumerator
                  DW_AT_name	("BT_CALL_ALERT")
                  DW_AT_const_value	(6)

0x00000e5c:     DW_TAG_enumerator
                  DW_AT_name	("BT_CALL_VOL_CHANGED")
                  DW_AT_const_value	(7)

0x00000e62:     NULL

0x00000e63:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                DW_AT_decl_line	(70)

0x00000e67:     DW_TAG_enumerator
                  DW_AT_name	("HID_CMD_ANDROID_SHUTTER")
                  DW_AT_const_value	(1)

0x00000e6d:     DW_TAG_enumerator
                  DW_AT_name	("HID_CMD_IOS_SHUTTER")
                  DW_AT_const_value	(2)

0x00000e73:     DW_TAG_enumerator
                  DW_AT_name	("HID_CMD_BOTH_SHUTTER")
                  DW_AT_const_value	(3)

0x00000e79:     DW_TAG_enumerator
                  DW_AT_name	("HID_CMD_HOME_KEY")
                  DW_AT_const_value	(4)

0x00000e7f:     DW_TAG_enumerator
                  DW_AT_name	("HID_CMD_RETURN_KEY")
                  DW_AT_const_value	(5)

0x00000e85:     DW_TAG_enumerator
                  DW_AT_name	("HID_CMD_LEFTARROW_KEY")
                  DW_AT_const_value	(6)

0x00000e8b:     DW_TAG_enumerator
                  DW_AT_name	("HID_CMD_RIGHTARROW_KEY")
                  DW_AT_const_value	(7)

0x00000e91:     DW_TAG_enumerator
                  DW_AT_name	("HID_CMD_CONNECT")
                  DW_AT_const_value	(8)

0x00000e97:     DW_TAG_enumerator
                  DW_AT_name	("HID_CMD_DISCONNECT")
                  DW_AT_const_value	(9)

0x00000e9d:     DW_TAG_enumerator
                  DW_AT_name	("HID_CMD_INCREASE_VOL")
                  DW_AT_const_value	(10)

0x00000ea3:     DW_TAG_enumerator
                  DW_AT_name	("HID_CMD_DECREASE_VOL")
                  DW_AT_const_value	(11)

0x00000ea9:     DW_TAG_enumerator
                  DW_AT_name	("HID_CMD_DIY_RESUME_SEND")
                  DW_AT_const_value	(12)

0x00000eaf:     NULL

0x00000eb0:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/iap_profile.h")
                DW_AT_decl_line	(26)

0x00000eb4:     DW_TAG_enumerator
                  DW_AT_name	("IAP_CMD_CONNECT")
                  DW_AT_const_value	(1)

0x00000eba:     DW_TAG_enumerator
                  DW_AT_name	("IAP_CMD_DISCONNECT")
                  DW_AT_const_value	(2)

0x00000ec0:     DW_TAG_enumerator
                  DW_AT_name	("IAP_CMD_SEND_DATA")
                  DW_AT_const_value	(3)

0x00000ec6:     NULL

0x00000ec7:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/spp_profile.h")
                DW_AT_decl_line	(26)

0x00000ecb:     DW_TAG_enumerator
                  DW_AT_name	("SPP_CMD_CONNECT")
                  DW_AT_const_value	(1)

0x00000ed1:     DW_TAG_enumerator
                  DW_AT_name	("SPP_CMD_DISCONNECT")
                  DW_AT_const_value	(2)

0x00000ed7:     DW_TAG_enumerator
                  DW_AT_name	("SPP_CMD_SEND_DATA")
                  DW_AT_const_value	(3)

0x00000edd:     NULL

0x00000ede:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0ee3 "linked_item_t")

0x00000ee3:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0422 "btstack_linked_item_t")
                DW_AT_name	("linked_item_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(100)

0x00000eee:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0ef3 "resend_t")

0x00000ef3:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0efe "structure ")
                DW_AT_name	("resend_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/profile_common.h")
                DW_AT_decl_line	(74)

0x00000efe:   DW_TAG_structure_type
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/profile_common.h")
                DW_AT_decl_line	(70)

0x00000f02:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x0ee3 "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/profile_common.h")
                  DW_AT_decl_line	(71)
                  DW_AT_data_member_location	(0x00)

0x00000f0e:     DW_TAG_member
                  DW_AT_name	("len")
                  DW_AT_type	(cu + 0x032e "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/profile_common.h")
                  DW_AT_decl_line	(72)
                  DW_AT_data_member_location	(0x04)

0x00000f1a:     DW_TAG_member
                  DW_AT_name	("data")
                  DW_AT_type	(cu + 0x0f27 "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/profile_common.h")
                  DW_AT_decl_line	(73)
                  DW_AT_data_member_location	(0x06)

0x00000f26:     NULL

0x00000f27:   DW_TAG_array_type
                DW_AT_type	(cu + 0x030b "u8")

0x00000f2c:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0073 "sizetype")
                  DW_AT_count	(0x00)

0x00000f32:     NULL

0x00000f33:   DW_TAG_subprogram
