; ModuleID = 'avctp.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avctp.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.avctp_stack_t = type { i8, i8, i16, [1 x %struct.avctp], %struct.run_loop }
%struct.avctp = type { [6 x i8], i16, i8, %struct.control_pdu_handler*, %struct.respone_pdu_handler*, %struct.avrcp_core_data_t }
%struct.control_pdu_handler = type { i8, i8, i8 (%struct.avctp*, %struct.avrcp_header*, i8)* }
%struct.avrcp_header = type opaque
%struct.respone_pdu_handler = type { i8, i8, i8 (%struct.avctp*, i8, i8, i8*, i32)* }
%struct.avrcp_core_data_t = type { i32, i8, i8, [5 x i8], i8, i8, [3 x i8], i8, i8, [9 x i8], [14 x %struct.avrcp_event_info] }
%struct.avrcp_event_info = type { i8 }
%struct.run_loop = type { %struct.btstack_linked_item, void (%struct.run_loop*)*, i8* }
%struct.btstack_linked_item = type { %struct.btstack_linked_item* }
%struct.btstack_timer_source = type { %struct.btstack_linked_item, i32, i32, void (%struct.btstack_timer_source*)*, i8* }
%struct.bt_sleep = type { i32 (...)*, i32 (...)*, i32 (...)* }

!81 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !82, line: 299, size: 32, elements: !83)
!82 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!83 = !{!84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134}
!84 = !DIEnumerator(name: "BT_STATUS_POWER_ON", value: 1)
!85 = !DIEnumerator(name: "BT_STATUS_POWER_OFF", value: 2)
!86 = !DIEnumerator(name: "BT_STATUS_INIT_OK", value: 3)
!87 = !DIEnumerator(name: "BT_STATUS_EXIT_OK", value: 4)
!88 = !DIEnumerator(name: "BT_STATUS_START_CONNECTED", value: 5)
!89 = !DIEnumerator(name: "BT_STATUS_FIRST_CONNECTED", value: 6)
!90 = !DIEnumerator(name: "BT_STATUS_SECOND_CONNECTED", value: 7)
!91 = !DIEnumerator(name: "BT_STATUS_ENCRY_COMPLETE", value: 8)
!92 = !DIEnumerator(name: "BT_STATUS_FIRST_DISCONNECT", value: 9)
!93 = !DIEnumerator(name: "BT_STATUS_SECOND_DISCONNECT", value: 10)
!94 = !DIEnumerator(name: "BT_STATUS_PHONE_INCOME", value: 11)
!95 = !DIEnumerator(name: "BT_STATUS_PHONE_NUMBER", value: 12)
!96 = !DIEnumerator(name: "BT_STATUS_PHONE_MANUFACTURER", value: 13)
!97 = !DIEnumerator(name: "BT_STATUS_PHONE_OUT", value: 14)
!98 = !DIEnumerator(name: "BT_STATUS_PHONE_ACTIVE", value: 15)
!99 = !DIEnumerator(name: "BT_STATUS_PHONE_HANGUP", value: 16)
!100 = !DIEnumerator(name: "BT_STATUS_BEGIN_AUTO_CON", value: 17)
!101 = !DIEnumerator(name: "BT_STATUS_MUSIC_SOUND_COME", value: 18)
!102 = !DIEnumerator(name: "BT_STATUS_MUSIC_SOUND_GO", value: 19)
!103 = !DIEnumerator(name: "BT_STATUS_RESUME", value: 20)
!104 = !DIEnumerator(name: "BT_STATUS_RESUME_BTSTACK", value: 21)
!105 = !DIEnumerator(name: "BT_STATUS_SUSPEND", value: 22)
!106 = !DIEnumerator(name: "BT_STATUS_LAST_CALL_TYPE_CHANGE", value: 23)
!107 = !DIEnumerator(name: "BT_STATUS_CALL_VOL_CHANGE", value: 24)
!108 = !DIEnumerator(name: "BT_STATUS_SCO_STATUS_CHANGE", value: 25)
!109 = !DIEnumerator(name: "BT_STATUS_CONNECT_WITHOUT_LINKKEY", value: 26)
!110 = !DIEnumerator(name: "BT_STATUS_PHONE_BATTERY_CHANGE", value: 27)
!111 = !DIEnumerator(name: "BT_STATUS_RECONNECT_LINKKEY_LOST", value: 28)
!112 = !DIEnumerator(name: "BT_STATUS_RECONN_OR_CONN", value: 29)
!113 = !DIEnumerator(name: "BT_STATUS_BT_TEST_BOX_CMD", value: 30)
!114 = !DIEnumerator(name: "BT_STATUS_BT_TWS_CONNECT_CMD", value: 31)
!115 = !DIEnumerator(name: "BT_STATUS_SNIFF_STATE_UPDATE", value: 32)
!116 = !DIEnumerator(name: "BT_STATUS_TONE_BY_FILE_NAME", value: 33)
!117 = !DIEnumerator(name: "BT_STATUS_PHONE_DATE_AND_TIME", value: 34)
!118 = !DIEnumerator(name: "BT_STATUS_INBAND_RINGTONE", value: 35)
!119 = !DIEnumerator(name: "BT_STATUS_VOICE_RECOGNITION", value: 36)
!120 = !DIEnumerator(name: "BT_STATUS_AVRCP_INCOME_OPID", value: 37)
!121 = !DIEnumerator(name: "BT_STATUS_HFP_SERVICE_LEVEL_CONNECTION_OK", value: 38)
!122 = !DIEnumerator(name: "BT_STATUS_CONN_A2DP_CH", value: 39)
!123 = !DIEnumerator(name: "BT_STATUS_CONN_HFP_CH", value: 40)
!124 = !DIEnumerator(name: "BT_STATUS_INQUIRY_TIMEOUT", value: 41)
!125 = !DIEnumerator(name: "BT_STATUS_INITING", value: 42)
!126 = !DIEnumerator(name: "BT_STATUS_WAITINT_CONN", value: 43)
!127 = !DIEnumerator(name: "BT_STATUS_AUTO_CONNECTINT", value: 44)
!128 = !DIEnumerator(name: "BT_STATUS_CONNECTING", value: 45)
!129 = !DIEnumerator(name: "BT_STATUS_TAKEING_PHONE", value: 46)
!130 = !DIEnumerator(name: "BT_STATUS_PLAYING_MUSIC", value: 47)
!131 = !DIEnumerator(name: "BT_STATUS_A2DP_MEDIA_START", value: 48)
!132 = !DIEnumerator(name: "BT_STATUS_A2DP_MEDIA_STOP", value: 49)
!133 = !DIEnumerator(name: "BT_STATUS_BROADCAST_STATE", value: 50)
!134 = !DIEnumerator(name: "BT_STATUS_TRIM_OVER", value: 51)
!135 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !70, line: 164, size: 32, elements: !136)
!136 = !{!137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147}
!137 = !DIEnumerator(name: "A2DP_CMD_CONNECT", value: 50)
!138 = !DIEnumerator(name: "A2DP_CMD_DISCONNECT", value: 51)
!139 = !DIEnumerator(name: "A2DP_CMD_START", value: 52)
!140 = !DIEnumerator(name: "A2DP_CMD_CLOSE", value: 53)
!141 = !DIEnumerator(name: "A2DP_CMD_SUSPEND", value: 54)
!142 = !DIEnumerator(name: "A2DP_CMD_GET_CONFIGURATION", value: 55)
!143 = !DIEnumerator(name: "A2DP_CMD_ABORT", value: 56)
!144 = !DIEnumerator(name: "A2DP_CMD_EMITTER_START_CMD", value: 57)
!145 = !DIEnumerator(name: "A2DP_CMD_EMITTER_SUSPEND_CMD", value: 58)
!146 = !DIEnumerator(name: "A2DP_CMD_EMITTER_CLOSE_CMD", value: 59)
!147 = !DIEnumerator(name: "A2DP_CMD_CONNECT_MEDIA_CHANNEL", value: 60)
!148 = !{!149, !150, !151, !167, !164, !175}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!150 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "avctp_header", file: !6, line: 168, size: 24, elements: !153)
!153 = !{!154, !160, !161, !162, !163}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ipid", scope: !152, file: !6, line: 169, baseType: !155, size: 1, flags: DIFlagBitField, extraData: i64 0)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !156, line: 20, baseType: !157)
!156 = !DIFile(filename: "/opt/q32s/include/sys/_stdint.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !158, line: 29, baseType: !159)
!158 = !DIFile(filename: "/opt/q32s/include/machine/_default_types.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!159 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "cr", scope: !152, file: !6, line: 170, baseType: !155, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "packet_type", scope: !152, file: !6, line: 171, baseType: !155, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "transaction", scope: !152, file: !6, line: 172, baseType: !155, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !152, file: !6, line: 173, baseType: !164, size: 16, offset: 8)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !156, line: 26, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !158, line: 43, baseType: !166)
!166 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "avc_header", file: !6, line: 177, size: 24, elements: !169)
!169 = !{!170, !171, !172, !173, !174}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !168, file: !6, line: 178, baseType: !155, size: 4, flags: DIFlagBitField, extraData: i64 0)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_hdr0", scope: !168, file: !6, line: 179, baseType: !155, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "subunit_id", scope: !168, file: !6, line: 180, baseType: !155, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "subunit_type", scope: !168, file: !6, line: 181, baseType: !155, size: 5, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !168, file: !6, line: 182, baseType: !155, size: 8, offset: 16)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !177, line: 11, baseType: !159)
!177 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!178 = !{!0, !179, !191, !219, !322}
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "bt_suspend_avctp_resumeavctp_release", scope: !2, file: !3, line: 1315, type: !181, isLocal: false, isDefinition: true)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bt_sleep", file: !183, line: 313, size: 96, elements: !184)
!183 = !DIFile(filename: "../btstack/Host/include/common/bt_config.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!184 = !{!185, !189, !190}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "suspend", scope: !182, file: !183, line: 314, baseType: !186, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 32)
!187 = !DISubroutineType(types: !188)
!188 = !{!150, null}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "resume", scope: !182, file: !183, line: 315, baseType: !186, size: 32, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !182, file: !183, line: 316, baseType: !186, size: 32, offset: 64)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "avctp_conn_timer", scope: !2, file: !3, line: 1190, type: !193, isLocal: false, isDefinition: true)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_timer_source_t", file: !194, line: 19, baseType: !195)
!194 = !DIFile(filename: "../btcommon/btstack_sys_timer.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btstack_timer_source", file: !194, line: 7, size: 160, elements: !196)
!196 = !{!197, !204, !208, !209, !210, !211, !212, !213, !218}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !195, file: !194, line: 8, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_linked_item_t", file: !199, line: 55, baseType: !200)
!199 = !DIFile(filename: "../btcommon/btstack_linked_list.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btstack_linked_item", file: !199, line: 53, size: 32, elements: !201)
!201 = !{!202}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !200, file: !199, line: 54, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !195, file: !194, line: 10, baseType: !205, size: 32, offset: 32)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !156, line: 32, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !158, line: 65, baseType: !207)
!207 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_interval", scope: !195, file: !194, line: 11, baseType: !205, size: 16, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "timer_type", scope: !195, file: !194, line: 12, baseType: !205, size: 4, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "timer_tick_overflow", scope: !195, file: !194, line: 13, baseType: !205, size: 1, offset: 84, flags: DIFlagBitField, extraData: i64 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "loop_flag", scope: !195, file: !194, line: 14, baseType: !205, size: 1, offset: 85, flags: DIFlagBitField, extraData: i64 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "loop_times", scope: !195, file: !194, line: 15, baseType: !205, size: 10, offset: 86, flags: DIFlagBitField, extraData: i64 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !195, file: !194, line: 17, baseType: !214, size: 32, offset: 96)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = !DISubroutineType(types: !216)
!216 = !{null, !217}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !195, file: !194, line: 18, baseType: !149, size: 32, offset: 128)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "acp_stack", scope: !2, file: !3, line: 24, type: !221, isLocal: true, isDefinition: true)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "avctp_stack_t", file: !6, line: 318, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 312, size: 640, elements: !224)
!224 = !{!225, !226, !227, !229, !311}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "acp_send_cmd_cnt", scope: !223, file: !6, line: 313, baseType: !176, size: 8)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_1", scope: !223, file: !6, line: 314, baseType: !176, size: 8, offset: 8)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_2", scope: !223, file: !6, line: 315, baseType: !228, size: 16, offset: 16)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !177, line: 13, baseType: !166)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !223, file: !6, line: 316, baseType: !230, size: 512, offset: 32)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 512, elements: !309)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "avctp", file: !6, line: 296, size: 512, elements: !232)
!232 = !{!233, !239, !240, !241, !255, !267}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "dev_addr", scope: !231, file: !6, line: 297, baseType: !234, size: 48)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_addr_t", file: !235, line: 7, baseType: !236)
!235 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 48, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 6)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "control_cid", scope: !231, file: !6, line: 298, baseType: !228, size: 16, offset: 48)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "avctp_conn_cnt", scope: !231, file: !6, line: 299, baseType: !176, size: 8, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "arp_control_handlers", scope: !231, file: !6, line: 300, baseType: !242, size: 32, offset: 96)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_pdu_handler", file: !6, line: 246, size: 64, elements: !245)
!245 = !{!246, !247, !248}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "pdu_id", scope: !244, file: !6, line: 247, baseType: !155, size: 8)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !244, file: !6, line: 248, baseType: !155, size: 8, offset: 8)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !244, file: !6, line: 249, baseType: !249, size: 32, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 32)
!250 = !DISubroutineType(types: !251)
!251 = !{!155, !252, !253, !155}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "avrcp_header", file: !6, line: 238, flags: DIFlagFwdDecl)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "arp_respone_handlers", scope: !231, file: !6, line: 301, baseType: !256, size: 32, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "respone_pdu_handler", file: !6, line: 252, size: 64, elements: !259)
!259 = !{!260, !261, !262}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "pdu_id", scope: !258, file: !6, line: 253, baseType: !155, size: 8)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !258, file: !6, line: 254, baseType: !155, size: 8, offset: 8)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !258, file: !6, line: 255, baseType: !263, size: 32, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 32)
!264 = !DISubroutineType(types: !265)
!265 = !{!155, !252, !155, !155, !266, !150}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "acp_core_data", scope: !231, file: !6, line: 306, baseType: !268, size: 352, offset: 160)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "avrcp_core_data_t", file: !6, line: 294, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 274, size: 352, elements: !270)
!270 = !{!271, !273, !274, !275, !279, !280, !281, !282, !284, !286, !287, !288, !289, !290, !291, !292, !293, !294, !298}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "pending_cmd", scope: !269, file: !6, line: 275, baseType: !272, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !177, line: 15, baseType: !207)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "pending_release_cnt", scope: !269, file: !6, line: 276, baseType: !155, size: 8, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "pending_release_cmd", scope: !269, file: !6, line: 277, baseType: !155, size: 8, offset: 40)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "remote_player_setting_attr_value", scope: !269, file: !6, line: 278, baseType: !276, size: 40, offset: 48)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 40, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 5)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "remote_player_setting_cnt", scope: !269, file: !6, line: 279, baseType: !155, size: 8, offset: 88)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "remote_player_setting_attr", scope: !269, file: !6, line: 280, baseType: !155, size: 8, offset: 96)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "remote_transaction", scope: !269, file: !6, line: 281, baseType: !155, size: 4, offset: 104, flags: DIFlagBitField, extraData: i64 104)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !269, file: !6, line: 282, baseType: !283, size: 3, offset: 108, flags: DIFlagBitField, extraData: i64 104)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "avctp_state_t", file: !6, line: 215, baseType: !5)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "initiator", scope: !269, file: !6, line: 283, baseType: !285, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 104)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !177, line: 11, baseType: !159)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "pre_sta", scope: !269, file: !6, line: 284, baseType: !176, size: 3, offset: 112, flags: DIFlagBitField, extraData: i64 104)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "a2dp_play_sta", scope: !269, file: !6, line: 285, baseType: !176, size: 3, offset: 115, flags: DIFlagBitField, extraData: i64 104)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "is_play_have_sent", scope: !269, file: !6, line: 286, baseType: !285, size: 1, offset: 118, flags: DIFlagBitField, extraData: i64 104)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "is_inuse", scope: !269, file: !6, line: 287, baseType: !285, size: 1, offset: 119, flags: DIFlagBitField, extraData: i64 104)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "pos_read", scope: !269, file: !6, line: 288, baseType: !176, size: 4, offset: 120, flags: DIFlagBitField, extraData: i64 104)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "pos_write", scope: !269, file: !6, line: 289, baseType: !176, size: 4, offset: 124, flags: DIFlagBitField, extraData: i64 104)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "avrcp_volume", scope: !269, file: !6, line: 290, baseType: !176, size: 8, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "avctp_send_buf_len", scope: !269, file: !6, line: 291, baseType: !176, size: 8, offset: 136)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "avctp_opid_buf", scope: !269, file: !6, line: 292, baseType: !295, size: 72, offset: 144)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 72, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 9)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "avrcp_event", scope: !269, file: !6, line: 293, baseType: !299, size: 112, offset: 216)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 112, elements: !307)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "avrcp_event_info", file: !6, line: 263, size: 8, elements: !301)
!301 = !{!302, !303, !304, !305, !306}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "supported_events", scope: !300, file: !6, line: 264, baseType: !155, size: 1, flags: DIFlagBitField, extraData: i64 0)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "registered_events", scope: !300, file: !6, line: 265, baseType: !155, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "remote_supported_events", scope: !300, file: !6, line: 266, baseType: !155, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "remote_registered_events", scope: !300, file: !6, line: 267, baseType: !155, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "transaction_events", scope: !300, file: !6, line: 268, baseType: !155, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!307 = !{!308}
!308 = !DISubrange(count: 14)
!309 = !{!310}
!310 = !DISubrange(count: 1)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !223, file: !6, line: 317, baseType: !312, size: 96, offset: 544)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "run_loop", file: !313, line: 9, size: 96, elements: !314)
!313 = !DIFile(filename: "../btcommon/run_loop.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!314 = !{!315, !316, !321}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !312, file: !313, line: 10, baseType: !198, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "run", scope: !312, file: !313, line: 11, baseType: !317, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 32)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !320}
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !312, file: !313, line: 12, baseType: !149, size: 32, offset: 64)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "avctp_run_loop_busy", scope: !2, file: !3, line: 25, type: !176, isLocal: true, isDefinition: true)
!324 = !DIFile(filename: "../btcommon/profile_stack_debug.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!325 = !{i32 2, !"Dwarf Version", i32 4}
!326 = !{i32 2, !"Debug Info Version", i32 3}
!327 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!328 = distinct !DISubprogram(name: "avctp_send_vendordep", scope: !3, file: !3, line: 206, type: !329, isLocal: false, isDefinition: true, scopeLine: 209, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !331)
!329 = !DISubroutineType(types: !330)
!330 = !{!150, !252, !155, !155, !155, !266, !150}
!331 = !{!332, !333, !334, !335, !336, !337}
!332 = !DILocalVariable(name: "conn", arg: 1, scope: !328, file: !3, line: 206, type: !252)
!333 = !DILocalVariable(name: "transaction", arg: 2, scope: !328, file: !3, line: 206, type: !155)
!334 = !DILocalVariable(name: "code", arg: 3, scope: !328, file: !3, line: 207, type: !155)
!335 = !DILocalVariable(name: "subunit", arg: 4, scope: !328, file: !3, line: 207, type: !155)
!336 = !DILocalVariable(name: "operands", arg: 5, scope: !328, file: !3, line: 208, type: !266)
!337 = !DILocalVariable(name: "operand_count", arg: 6, scope: !328, file: !3, line: 208, type: !150)
!338 = !DILocation(line: 206, column: 40, scope: !328)
!339 = !DILocation(line: 206, column: 54, scope: !328)
!340 = !DILocation(line: 207, column: 34, scope: !328)
!341 = !DILocation(line: 207, column: 48, scope: !328)
!342 = !DILocation(line: 208, column: 35, scope: !328)
!343 = !DILocation(line: 208, column: 49, scope: !328)
!344 = !DILocation(line: 210, column: 12, scope: !328)
!345 = !DILocation(line: 210, column: 5, scope: !328)
!346 = distinct !DISubprogram(name: "avctp_send", scope: !3, file: !3, line: 157, type: !347, isLocal: true, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !349)
!347 = !DISubroutineType(types: !348)
!348 = !{!150, !252, !155, !155, !155, !155, !155, !266, !150}
!349 = !{!350, !351, !352, !353, !354, !355, !356, !357, !358, !369, !370, !371, !372}
!350 = !DILocalVariable(name: "conn", arg: 1, scope: !346, file: !3, line: 157, type: !252)
!351 = !DILocalVariable(name: "transaction", arg: 2, scope: !346, file: !3, line: 157, type: !155)
!352 = !DILocalVariable(name: "cr", arg: 3, scope: !346, file: !3, line: 158, type: !155)
!353 = !DILocalVariable(name: "code", arg: 4, scope: !346, file: !3, line: 158, type: !155)
!354 = !DILocalVariable(name: "subunit", arg: 5, scope: !346, file: !3, line: 159, type: !155)
!355 = !DILocalVariable(name: "opcode", arg: 6, scope: !346, file: !3, line: 159, type: !155)
!356 = !DILocalVariable(name: "operands", arg: 7, scope: !346, file: !3, line: 160, type: !266)
!357 = !DILocalVariable(name: "operand_count", arg: 8, scope: !346, file: !3, line: 160, type: !150)
!358 = !DILocalVariable(name: "ctrl_io", scope: !346, file: !3, line: 162, type: !359)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 896, elements: !367)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !6, line: 241, size: 448, elements: !361)
!361 = !{!362, !366}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !360, file: !6, line: 242, baseType: !363, size: 400)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 400, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 50)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !360, file: !6, line: 243, baseType: !150, size: 32, offset: 416)
!367 = !{!368}
!368 = !DISubrange(count: 2)
!369 = !DILocalVariable(name: "avctp_h", scope: !346, file: !3, line: 163, type: !151)
!370 = !DILocalVariable(name: "avc", scope: !346, file: !3, line: 164, type: !167)
!371 = !DILocalVariable(name: "err", scope: !346, file: !3, line: 165, type: !150)
!372 = !DILocalVariable(name: "avctp_send_buf", scope: !373, file: !3, line: 193, type: !375)
!373 = distinct !DILexicalBlock(scope: !374, file: !3, line: 186, column: 54)
!374 = distinct !DILexicalBlock(scope: !346, file: !3, line: 186, column: 9)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 640, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 80)
!378 = !DILocation(line: 157, column: 37, scope: !346)
!379 = !DILocation(line: 157, column: 51, scope: !346)
!380 = !DILocation(line: 158, column: 31, scope: !346)
!381 = !DILocation(line: 158, column: 43, scope: !346)
!382 = !DILocation(line: 159, column: 31, scope: !346)
!383 = !DILocation(line: 159, column: 48, scope: !346)
!384 = !DILocation(line: 160, column: 32, scope: !346)
!385 = !DILocation(line: 160, column: 46, scope: !346)
!386 = !DILocation(line: 162, column: 5, scope: !346)
!387 = !DILocation(line: 162, column: 18, scope: !346)
!388 = !DILocation(line: 165, column: 9, scope: !346)
!389 = !DILocation(line: 166, column: 14, scope: !390)
!390 = distinct !DILexicalBlock(scope: !346, file: !3, line: 166, column: 9)
!391 = !DILocation(line: 166, column: 9, scope: !346)
!392 = !DILocation(line: 169, column: 24, scope: !346)
!393 = !DILocation(line: 170, column: 24, scope: !346)
!394 = !DILocation(line: 171, column: 34, scope: !395)
!395 = distinct !DILexicalBlock(scope: !346, file: !3, line: 171, column: 9)
!396 = !DILocation(line: 171, column: 12, scope: !395)
!397 = !DILocation(line: 171, column: 9, scope: !346)
!398 = !DILocation(line: 175, column: 5, scope: !346)
!399 = !DILocation(line: 163, column: 26, scope: !346)
!400 = !DILocation(line: 164, column: 24, scope: !346)
!401 = !DILocation(line: 179, column: 26, scope: !346)
!402 = !DILocation(line: 181, column: 17, scope: !346)
!403 = !DILocation(line: 182, column: 18, scope: !346)
!404 = !DILocation(line: 183, column: 15, scope: !346)
!405 = !DILocation(line: 184, column: 23, scope: !346)
!406 = !DILocation(line: 185, column: 17, scope: !346)
!407 = !DILocation(line: 186, column: 29, scope: !374)
!408 = !{!409, !410, i64 37}
!409 = !{!"avctp", !410, i64 0, !412, i64 6, !410, i64 8, !413, i64 12, !413, i64 16, !414, i64 20}
!410 = !{!"omnipotent char", !411, i64 0}
!411 = !{!"Simple C/C++ TBAA"}
!412 = !{!"short", !410, i64 0}
!413 = !{!"any pointer", !410, i64 0}
!414 = !{!"", !415, i64 0, !410, i64 4, !410, i64 5, !410, i64 6, !410, i64 11, !410, i64 12, !410, i64 13, !410, i64 13, !410, i64 13, !410, i64 14, !410, i64 14, !410, i64 14, !410, i64 14, !410, i64 15, !410, i64 15, !410, i64 16, !410, i64 17, !410, i64 18, !410, i64 27}
!415 = !{!"int", !410, i64 0}
!416 = !DILocation(line: 186, column: 48, scope: !374)
!417 = !DILocation(line: 186, column: 9, scope: !346)
!418 = !DILocation(line: 187, column: 82, scope: !373)
!419 = !DILocation(line: 187, column: 69, scope: !373)
!420 = !DILocation(line: 187, column: 50, scope: !373)
!421 = !DILocation(line: 187, column: 48, scope: !373)
!422 = !DILocation(line: 193, column: 9, scope: !373)
!423 = !DILocation(line: 193, column: 12, scope: !373)
!424 = !DILocation(line: 195, column: 9, scope: !373)
!425 = !DILocation(line: 196, column: 17, scope: !373)
!426 = !DILocation(line: 196, column: 9, scope: !373)
!427 = !DILocation(line: 197, column: 15, scope: !373)
!428 = !DILocation(line: 199, column: 5, scope: !374)
!429 = !DILocation(line: 199, column: 5, scope: !373)
!430 = !DILocation(line: 203, column: 1, scope: !346)
