; ModuleID = 'avdtp.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.avdtp = type { [2 x %struct._avdtp_local_sep], %struct.avdtp_core_data_t }
%struct._avdtp_local_sep = type { %struct._avdtp_sep_ind*, %struct.avdtp*, %struct._seid_info, i8, [16 x i8] }
%struct._avdtp_sep_ind = type { i8 (i8, i8*, i8*)*, i8 (%struct._avdtp_local_sep*, i8*, i8, i8*)*, i8 (%struct._avdtp_local_sep*, %struct._avdtp_stream*, i8)*, i8 (%struct._avdtp_local_sep*, %struct._avdtp_stream*)*, i8 (%struct._avdtp_local_sep*, %struct._avdtp_stream*)*, i8 (%struct._avdtp_local_sep*, %struct._avdtp_stream*, i8*)*, void (%struct._avdtp_local_sep*)*, i8 (...)*, i8 (i8, i16)* }
%struct._avdtp_stream = type { i8 }
%struct._seid_info = type { i16 }
%struct.avdtp_core_data_t = type { %struct._avdtp_stream, %struct._avdtp_local_sep*, i8, i16, [8 x %struct._seid_req], [16 x i8], i8, i8, i16 }
%struct._seid_req = type { i8 }
%struct._avdtp_send_info = type { %struct._avdtp_single_header, [126 x i8] }
%struct._avdtp_single_header = type { i16 }
%struct._in_buf = type { i32, [128 x i8], i8, i8, i8, i8, i8 }
%struct._start_req = type { %struct._seid, [1 x %struct._seid] }
%struct._seid = type { i8 }
%struct._suspend_req = type { %struct._seid, [1 x %struct._seid] }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "app_info_debug_enable", scope: !2, file: !297, line: 190, type: !168, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !296)
!3 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!4 = !{!5, !14}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, size: 32, elements: !7)
!6 = !DIFile(filename: "../btstack/Profile/include/bredr/avdtp.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!7 = !{!8, !9, !10, !11, !12, !13}
!8 = !DIEnumerator(name: "AVDTP_STATE_IDLE", value: 0)
!9 = !DIEnumerator(name: "AVDTP_STATE_CONFIGURED", value: 1)
!10 = !DIEnumerator(name: "AVDTP_STATE_OPEN", value: 2)
!11 = !DIEnumerator(name: "AVDTP_STATE_STREAMING", value: 3)
!12 = !DIEnumerator(name: "AVDTP_STATE_CLOSING", value: 4)
!13 = !DIEnumerator(name: "AVDTP_STATE_ABORTING", value: 5)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_avdtp_parse_result", file: !6, line: 51, size: 32, elements: !15)
!15 = !{!16, !17, !18}
!16 = !DIEnumerator(name: "PARSE_ERROR", value: 0)
!17 = !DIEnumerator(name: "PARSE_FRAGMENT", value: 1)
!18 = !DIEnumerator(name: "PARSE_SUCCESS", value: 2)
!19 = !{!20, !210, !212, !62, !63, !213, !220, !229, !239, !240, !248, !262, !268, !274, !282, !68, !289, !290}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 32)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "a2dp_conn", file: !22, line: 237, size: 1024, elements: !23)
!22 = !DIFile(filename: "../btstack/Profile/include/bredr/a2dp.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!23 = !{!24, !35, !44, !151}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !21, file: !22, line: 238, baseType: !25, size: 48)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_addr_t", file: !26, line: 7, baseType: !27)
!26 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 48, elements: !33)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !29, line: 20, baseType: !30)
!29 = !DIFile(filename: "/opt/q32s/include/sys/_stdint.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !31, line: 29, baseType: !32)
!31 = !DIFile(filename: "/opt/q32s/include/machine/_default_types.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!32 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!33 = !{!34}
!34 = !DISubrange(count: 6)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "a2dp_core_data", scope: !21, file: !22, line: 239, baseType: !36, size: 8, offset: 48)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "a2dp_core_data_t", file: !22, line: 229, baseType: !37)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 225, size: 8, elements: !38)
!38 = !{!39, !42, !43}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "inused", scope: !37, file: !22, line: 226, baseType: !40, size: 1, flags: DIFlagBitField, extraData: i64 0)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !41, line: 11, baseType: !32)
!41 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!42 = !DIDerivedType(tag: DW_TAG_member, name: "discover_req", scope: !37, file: !22, line: 227, baseType: !40, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "bqb_test_cnt", scope: !37, file: !22, line: 228, baseType: !40, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !21, file: !22, line: 240, baseType: !45, size: 768, offset: 64)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "avdtp", file: !6, line: 335, size: 768, elements: !46)
!46 = !{!47, !125}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "local_seps", scope: !45, file: !6, line: 337, baseType: !48, size: 448)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 448, elements: !123)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "avdtp_local_sep", file: !6, line: 293, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_avdtp_local_sep", file: !6, line: 282, size: 224, elements: !51)
!51 = !{!52, !105, !107, !117, !118, !119}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "ind", scope: !50, file: !6, line: 283, baseType: !53, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 32)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_avdtp_sep_ind", file: !6, line: 350, size: 288, elements: !56)
!56 = !{!57, !64, !69, !82, !86, !87, !91, !95, !99}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "get_capability", scope: !55, file: !6, line: 351, baseType: !58, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 32)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !40, !62, !63}
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !41, line: 11, baseType: !32)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "set_configuration", scope: !55, file: !6, line: 353, baseType: !65, size: 32, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32)
!66 = !DISubroutineType(types: !67)
!67 = !{!61, !68, !63, !40, !62}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !55, file: !6, line: 355, baseType: !70, size: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 32)
!71 = !DISubroutineType(types: !72)
!72 = !{!61, !68, !73, !40}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "avdtp_stream", file: !6, line: 280, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_avdtp_stream", file: !6, line: 268, size: 8, elements: !76)
!76 = !{!77, !78, !79, !80, !81}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "rseid", scope: !75, file: !6, line: 270, baseType: !40, size: 4, flags: DIFlagBitField, extraData: i64 0)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "int_role", scope: !75, file: !6, line: 271, baseType: !40, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "open_acp", scope: !75, file: !6, line: 272, baseType: !40, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "starting", scope: !75, file: !6, line: 278, baseType: !40, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "reserve", scope: !75, file: !6, line: 279, baseType: !40, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !55, file: !6, line: 356, baseType: !83, size: 32, offset: 96)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 32)
!84 = !DISubroutineType(types: !85)
!85 = !{!61, !68, !73}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "suspend", scope: !55, file: !6, line: 357, baseType: !83, size: 32, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !55, file: !6, line: 359, baseType: !88, size: 32, offset: 160)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 32)
!89 = !DISubroutineType(types: !90)
!90 = !{!61, !68, !73, !63}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "abort", scope: !55, file: !6, line: 361, baseType: !92, size: 32, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 32)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !68}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "reconfigure", scope: !55, file: !6, line: 362, baseType: !96, size: 32, offset: 224)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 32)
!97 = !DISubroutineType(types: !98)
!98 = !{!61, null}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "delayreport", scope: !55, file: !6, line: 363, baseType: !100, size: 32, offset: 256)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 32)
!101 = !DISubroutineType(types: !102)
!102 = !{!61, !40, !103}
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !41, line: 13, baseType: !104)
!104 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !50, file: !6, line: 284, baseType: !106, size: 32, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !50, file: !6, line: 286, baseType: !108, size: 16, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "seid_info", file: !6, line: 124, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_seid_info", file: !6, line: 117, size: 16, elements: !110)
!110 = !{!111, !112, !113, !114, !115, !116}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "rfa0", scope: !109, file: !6, line: 118, baseType: !40, size: 1, flags: DIFlagBitField, extraData: i64 0)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !109, file: !6, line: 119, baseType: !40, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "seid", scope: !109, file: !6, line: 120, baseType: !40, size: 6, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "rfa2", scope: !109, file: !6, line: 121, baseType: !40, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !109, file: !6, line: 122, baseType: !40, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "media_type", scope: !109, file: !6, line: 123, baseType: !40, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !50, file: !6, line: 288, baseType: !40, size: 4, offset: 80, flags: DIFlagBitField, extraData: i64 80)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !50, file: !6, line: 289, baseType: !40, size: 4, offset: 84, flags: DIFlagBitField, extraData: i64 80)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !50, file: !6, line: 290, baseType: !120, size: 128, offset: 88)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 128, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 16)
!123 = !{!124}
!124 = !DISubrange(count: 2)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "adp_core_data", scope: !45, file: !6, line: 338, baseType: !126, size: 320, offset: 448)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "avdtp_core_data_t", file: !6, line: 333, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 318, size: 320, elements: !128)
!128 = !{!129, !130, !131, !132, !133, !142, !143, !144, !145, !146, !147, !148, !149, !150}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !127, file: !6, line: 319, baseType: !74, size: 8)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "local_sep", scope: !127, file: !6, line: 320, baseType: !68, size: 32, offset: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "local_sep_ind", scope: !127, file: !6, line: 321, baseType: !40, size: 8, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !127, file: !6, line: 322, baseType: !103, size: 16, offset: 80)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "acp_seid", scope: !127, file: !6, line: 323, baseType: !134, size: 64, offset: 96)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 64, elements: !140)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "seid_req", file: !6, line: 129, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_seid_req", file: !6, line: 126, size: 8, elements: !137)
!137 = !{!138, !139}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "rfa0", scope: !136, file: !6, line: 127, baseType: !40, size: 2, flags: DIFlagBitField, extraData: i64 0)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "acp_seid", scope: !136, file: !6, line: 128, baseType: !40, size: 6, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!140 = !{!141}
!141 = !DISubrange(count: 8)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !127, file: !6, line: 324, baseType: !120, size: 128, offset: 160)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "seid_ind", scope: !127, file: !6, line: 325, baseType: !40, size: 8, offset: 288)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "pending_req", scope: !127, file: !6, line: 326, baseType: !40, size: 8, offset: 296)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "max_acp_seid", scope: !127, file: !6, line: 327, baseType: !40, size: 4, offset: 304, flags: DIFlagBitField, extraData: i64 304)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "cur_acp_seid", scope: !127, file: !6, line: 328, baseType: !40, size: 4, offset: 308, flags: DIFlagBitField, extraData: i64 304)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "aac_codec_prior", scope: !127, file: !6, line: 329, baseType: !40, size: 4, offset: 312, flags: DIFlagBitField, extraData: i64 304)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "role", scope: !127, file: !6, line: 330, baseType: !40, size: 2, offset: 316, flags: DIFlagBitField, extraData: i64 304)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "get_discover", scope: !127, file: !6, line: 331, baseType: !40, size: 1, offset: 318, flags: DIFlagBitField, extraData: i64 304)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "reserve", scope: !127, file: !6, line: 332, baseType: !40, size: 1, offset: 319, flags: DIFlagBitField, extraData: i64 304)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "media", scope: !21, file: !22, line: 241, baseType: !152, size: 192, offset: 832)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "a2dp_media", file: !22, line: 215, size: 192, elements: !153)
!153 = !{!154, !163, !187, !206, !207, !208, !209}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "media_core_data", scope: !152, file: !22, line: 216, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "media_core_data_t", file: !22, line: 213, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 209, size: 64, elements: !157)
!157 = !{!158, !159, !160}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !156, file: !22, line: 210, baseType: !103, size: 16)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "cp_type", scope: !156, file: !22, line: 211, baseType: !103, size: 16, offset: 16)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "samplerate", scope: !156, file: !22, line: 212, baseType: !161, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !41, line: 15, baseType: !162)
!162 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "probe", scope: !152, file: !22, line: 217, baseType: !164, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 32)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "a2dp_media_probe", file: !22, line: 190, size: 192, elements: !166)
!166 = !{!167, !169, !176, !181, !185, !186}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !165, file: !22, line: 192, baseType: !168, size: 32)
!168 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !165, file: !22, line: 193, baseType: !170, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DISubroutineType(types: !172)
!172 = !{!168, !62, !173}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DISubroutineType(types: !175)
!175 = !{!168, !62, !63, !103}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "probe", scope: !165, file: !22, line: 194, baseType: !177, size: 32, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!178 = !DISubroutineType(types: !179)
!179 = !{!168, !180, !63, !103}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !165, file: !22, line: 195, baseType: !182, size: 32, offset: 96)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DISubroutineType(types: !184)
!184 = !{!168, null}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "suspend", scope: !165, file: !22, line: 196, baseType: !182, size: 32, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !165, file: !22, line: 197, baseType: !182, size: 32, offset: 160)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !152, file: !22, line: 218, baseType: !188, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "a2dp_media_codec", file: !22, line: 200, size: 192, elements: !190)
!190 = !{!191, !192, !196, !200, !204, !205}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !189, file: !22, line: 201, baseType: !168, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "inused", scope: !189, file: !22, line: 202, baseType: !193, size: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DISubroutineType(types: !195)
!195 = !{!168, !168}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !189, file: !22, line: 203, baseType: !197, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = !DISubroutineType(types: !199)
!199 = !{!168, !62}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !189, file: !22, line: 204, baseType: !201, size: 32, offset: 96)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DISubroutineType(types: !203)
!203 = !{!168, !63, !103}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "suspend", scope: !189, file: !22, line: 205, baseType: !182, size: 32, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !189, file: !22, line: 206, baseType: !197, size: 32, offset: 160)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "bitrate", scope: !152, file: !22, line: 219, baseType: !161, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "nchannels", scope: !152, file: !22, line: 220, baseType: !40, size: 4, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "reserve", scope: !152, file: !22, line: 221, baseType: !40, size: 4, offset: 164, flags: DIFlagBitField, extraData: i64 160)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !152, file: !22, line: 222, baseType: !40, size: 8, offset: 168)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!212 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "avdtp_common_header", file: !6, line: 87, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_avdtp_common_header", file: !6, line: 83, size: 8, elements: !216)
!216 = !{!217, !218, !219}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "message_type", scope: !215, file: !6, line: 84, baseType: !40, size: 2, flags: DIFlagBitField, extraData: i64 0)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "packet_type", scope: !215, file: !6, line: 85, baseType: !40, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "transaction", scope: !215, file: !6, line: 86, baseType: !40, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "avdtp_single_header", file: !6, line: 95, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_avdtp_single_header", file: !6, line: 89, size: 16, elements: !223)
!223 = !{!224, !225, !226, !227, !228}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "message_type", scope: !222, file: !6, line: 90, baseType: !40, size: 2, flags: DIFlagBitField, extraData: i64 0)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "packet_type", scope: !222, file: !6, line: 91, baseType: !40, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "transaction", scope: !222, file: !6, line: 92, baseType: !40, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "signal_id", scope: !222, file: !6, line: 93, baseType: !40, size: 6, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "rfa0", scope: !222, file: !6, line: 94, baseType: !40, size: 2, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "avdtp_start_header", file: !6, line: 104, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_avdtp_start_header", file: !6, line: 97, size: 24, elements: !232)
!232 = !{!233, !234, !235, !236, !237, !238}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "message_type", scope: !231, file: !6, line: 98, baseType: !40, size: 2, flags: DIFlagBitField, extraData: i64 0)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "packet_type", scope: !231, file: !6, line: 99, baseType: !40, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "transaction", scope: !231, file: !6, line: 100, baseType: !40, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "no_of_packets", scope: !231, file: !6, line: 101, baseType: !40, size: 8, offset: 8)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "signal_id", scope: !231, file: !6, line: 102, baseType: !40, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 16)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "rfa0", scope: !231, file: !6, line: 103, baseType: !40, size: 2, offset: 22, flags: DIFlagBitField, extraData: i64 16)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "setconf_req", file: !6, line: 136, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_setconf_req", file: !6, line: 131, size: 16, elements: !243)
!243 = !{!244, !245, !246, !247}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "rfa0", scope: !242, file: !6, line: 132, baseType: !40, size: 2, flags: DIFlagBitField, extraData: i64 0)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "acp_seid", scope: !242, file: !6, line: 133, baseType: !40, size: 6, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "rfa1", scope: !242, file: !6, line: 134, baseType: !40, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "int_seid", scope: !242, file: !6, line: 135, baseType: !40, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "start_req", file: !6, line: 261, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_start_req", file: !6, line: 258, size: 16, elements: !251)
!251 = !{!252, !258}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "first_seid", scope: !250, file: !6, line: 259, baseType: !253, size: 8)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "seid", file: !6, line: 115, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_seid", file: !6, line: 112, size: 8, elements: !255)
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "rfa0", scope: !254, file: !6, line: 113, baseType: !40, size: 2, flags: DIFlagBitField, extraData: i64 0)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "seid", scope: !254, file: !6, line: 114, baseType: !40, size: 6, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "other_seids", scope: !250, file: !6, line: 260, baseType: !259, size: 8, offset: 8)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 8, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 1)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "suspend_req", file: !6, line: 266, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_suspend_req", file: !6, line: 263, size: 16, elements: !265)
!265 = !{!266, !267}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "first_seid", scope: !264, file: !6, line: 264, baseType: !253, size: 8)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "other_seids", scope: !264, file: !6, line: 265, baseType: !259, size: 8, offset: 8)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "conf_rej", file: !6, line: 76, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_conf_rej", file: !6, line: 73, size: 16, elements: !271)
!271 = !{!272, !273}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !270, file: !6, line: 74, baseType: !40, size: 8)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !270, file: !6, line: 75, baseType: !40, size: 8, offset: 8)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "reconf_req", file: !6, line: 150, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reconf_req", file: !6, line: 144, size: 24, elements: !277)
!277 = !{!278, !279, !280, !281}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "rfa0", scope: !276, file: !6, line: 145, baseType: !40, size: 2, flags: DIFlagBitField, extraData: i64 0)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "acp_seid", scope: !276, file: !6, line: 146, baseType: !40, size: 6, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "serv_cap", scope: !276, file: !6, line: 148, baseType: !40, size: 8, offset: 8)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "serv_cap_len", scope: !276, file: !6, line: 149, baseType: !40, size: 8, offset: 16)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "stream_rej", file: !6, line: 142, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stream_rej", file: !6, line: 138, size: 16, elements: !285)
!285 = !{!286, !287, !288}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "rfa0", scope: !284, file: !6, line: 139, baseType: !40, size: 2, flags: DIFlagBitField, extraData: i64 0)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "acp_seid", scope: !284, file: !6, line: 140, baseType: !40, size: 6, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !284, file: !6, line: 141, baseType: !40, size: 8, offset: 8)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "avdtp_service_capability", file: !6, line: 71, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_avdtp_service_capability", file: !6, line: 68, size: 16, elements: !293)
!293 = !{!294, !295}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !292, file: !6, line: 69, baseType: !40, size: 8)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !292, file: !6, line: 70, baseType: !40, size: 8, offset: 8)
!296 = !{!0}
!297 = !DIFile(filename: "../btcommon/profile_stack_debug.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!298 = !{i32 2, !"Dwarf Version", i32 4}
!299 = !{i32 2, !"Debug Info Version", i32 3}
!300 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!301 = distinct !DISubprogram(name: "avdtp_retry_send", scope: !3, file: !3, line: 82, type: !302, isLocal: false, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !306)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !304}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "avdtp_t", file: !6, line: 345, baseType: !45)
!306 = !{!307}
!307 = !DILocalVariable(name: "session", arg: 1, scope: !301, file: !3, line: 82, type: !304)
!308 = !DILocation(line: 82, column: 32, scope: !301)
!309 = !DILocation(line: 93, column: 1, scope: !301)
!310 = distinct !DISubprogram(name: "find_local_sep_by_seid", scope: !3, file: !3, line: 193, type: !311, isLocal: false, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !313)
!311 = !DISubroutineType(types: !312)
!312 = !{!68, !304, !168}
!313 = !{!314, !315, !316}
!314 = !DILocalVariable(name: "session", arg: 1, scope: !310, file: !3, line: 193, type: !304)
!315 = !DILocalVariable(name: "seid", arg: 2, scope: !310, file: !3, line: 193, type: !168)
!316 = !DILocalVariable(name: "sep", scope: !310, file: !3, line: 195, type: !68)
!317 = !DILocation(line: 193, column: 50, scope: !310)
!318 = !DILocation(line: 193, column: 63, scope: !310)
!319 = !DILocation(line: 197, column: 5, scope: !320)
!320 = distinct !DILexicalBlock(scope: !310, file: !3, line: 197, column: 5)
!321 = !DILocation(line: 195, column: 22, scope: !310)
!322 = !DILocation(line: 197, column: 5, scope: !323)
!323 = !DILexicalBlockFile(scope: !324, file: !3, discriminator: 1)
!324 = distinct !DILexicalBlock(scope: !320, file: !3, line: 197, column: 5)
!325 = !DILocation(line: 197, column: 5, scope: !326)
!326 = !DILexicalBlockFile(scope: !320, file: !3, discriminator: 1)
!327 = !DILocation(line: 198, column: 23, scope: !328)
!328 = distinct !DILexicalBlock(scope: !329, file: !3, line: 198, column: 13)
!329 = distinct !DILexicalBlock(scope: !324, file: !3, line: 197, column: 28)
!330 = !DILocation(line: 198, column: 28, scope: !328)
!331 = !DILocation(line: 198, column: 13, scope: !329)
!332 = !DILocation(line: 197, column: 5, scope: !333)
!333 = !DILexicalBlockFile(scope: !324, file: !3, discriminator: 2)
!334 = distinct !{!334, !319, !335}
!335 = !DILocation(line: 201, column: 5, scope: !320)
!336 = !DILocation(line: 205, column: 1, scope: !310)
!337 = distinct !DISubprogram(name: "avdtp_discover_req", scope: !3, file: !3, line: 1036, type: !302, isLocal: false, isDefinition: true, scopeLine: 1037, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !338)
!338 = !{!339, !340, !341}
!339 = !DILocalVariable(name: "session", arg: 1, scope: !337, file: !3, line: 1036, type: !304)
!340 = !DILocalVariable(name: "sep", scope: !337, file: !3, line: 1038, type: !68)
!341 = !DILocalVariable(name: "conn", scope: !337, file: !3, line: 1039, type: !20)
!342 = !DILocation(line: 1036, column: 34, scope: !337)
!343 = !DILocation(line: 1039, column: 30, scope: !337)
!344 = !DILocation(line: 1040, column: 32, scope: !345)
!345 = distinct !DILexicalBlock(scope: !337, file: !3, line: 1040, column: 9)
!346 = !DILocation(line: 1040, column: 45, scope: !345)
!347 = !DILocation(line: 1040, column: 9, scope: !337)
!348 = !DILocation(line: 1041, column: 9, scope: !349)
!349 = distinct !DILexicalBlock(scope: !350, file: !3, line: 1041, column: 9)
!350 = distinct !DILexicalBlock(scope: !345, file: !3, line: 1040, column: 54)
!351 = !{!352, !352, i64 0}
!352 = !{!"omnipotent char", !353, i64 0}
!353 = !{!"Simple C/C++ TBAA"}
!354 = !DILocation(line: 1041, column: 9, scope: !350)
!355 = !DILocation(line: 1041, column: 9, scope: !356)
!356 = !DILexicalBlockFile(scope: !349, file: !3, discriminator: 1)
!357 = !DILocation(line: 1043, column: 42, scope: !350)
!358 = !DILocation(line: 1043, column: 9, scope: !350)
!359 = !DILocation(line: 1044, column: 9, scope: !350)
!360 = !DILocation(line: 990, column: 5, scope: !361, inlinedAt: !380)
!361 = distinct !DISubprogram(name: "send_request", scope: !3, file: !3, line: 984, type: !362, isLocal: true, isDefinition: true, scopeLine: 985, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !364)
!362 = !DISubroutineType(types: !363)
!363 = !{!168, !304, !40, !62, !168}
!364 = !{!365, !366, !367, !368, !369, !379}
!365 = !DILocalVariable(name: "session", arg: 1, scope: !361, file: !3, line: 984, type: !304)
!366 = !DILocalVariable(name: "signal_id", arg: 2, scope: !361, file: !3, line: 984, type: !40)
!367 = !DILocalVariable(name: "buffer", arg: 3, scope: !361, file: !3, line: 984, type: !62)
!368 = !DILocalVariable(name: "size", arg: 4, scope: !361, file: !3, line: 984, type: !168)
!369 = !DILocalVariable(name: "send_buf_ptr", scope: !361, file: !3, line: 986, type: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "avdtp_send_info", file: !6, line: 312, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_avdtp_send_info", file: !6, line: 309, size: 1024, elements: !373)
!373 = !{!374, !375}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !372, file: !6, line: 310, baseType: !221, size: 16)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !372, file: !6, line: 311, baseType: !376, size: 1008, offset: 16)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 1008, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 126)
!379 = !DILocalVariable(name: "t_send", scope: !361, file: !3, line: 990, type: !371)
!380 = distinct !DILocation(line: 1048, column: 5, scope: !337)
!381 = !DILocation(line: 986, column: 22, scope: !361, inlinedAt: !380)
!382 = !DILocation(line: 993, column: 5, scope: !361, inlinedAt: !380)
!383 = !DILocation(line: 995, column: 28, scope: !361, inlinedAt: !380)
!384 = !DILocation(line: 995, column: 40, scope: !361, inlinedAt: !380)
!385 = !{!386, !352, i64 93}
!386 = !{!"avdtp", !352, i64 0, !387, i64 56}
!387 = !{!"", !388, i64 0, !389, i64 4, !352, i64 8, !390, i64 10, !352, i64 12, !352, i64 20, !352, i64 36, !352, i64 37, !352, i64 38, !352, i64 38, !352, i64 39, !352, i64 39, !352, i64 39, !352, i64 39}
!388 = !{!"_avdtp_stream", !352, i64 0, !352, i64 0, !352, i64 0, !352, i64 0, !352, i64 0}
!389 = !{!"any pointer", !352, i64 0}
!390 = !{!"short", !352, i64 0}
!391 = !DILocation(line: 984, column: 75, scope: !361, inlinedAt: !380)
!392 = !DILocation(line: 990, column: 21, scope: !361, inlinedAt: !380)
!393 = !DILocation(line: 1003, column: 5, scope: !361, inlinedAt: !380)
!394 = !DILocation(line: 1011, column: 1, scope: !361, inlinedAt: !380)
!395 = !DILocation(line: 1052, column: 5, scope: !396)
!396 = distinct !DILexicalBlock(scope: !337, file: !3, line: 1052, column: 5)
!397 = !DILocation(line: 1038, column: 22, scope: !337)
!398 = !DILocation(line: 1052, column: 5, scope: !399)
!399 = !DILexicalBlockFile(scope: !400, file: !3, discriminator: 1)
!400 = distinct !DILexicalBlock(scope: !396, file: !3, line: 1052, column: 5)
!401 = !DILocation(line: 1052, column: 5, scope: !402)
!402 = !DILexicalBlockFile(scope: !396, file: !3, discriminator: 1)
!403 = !DILocation(line: 1053, column: 14, scope: !404)
!404 = distinct !DILexicalBlock(scope: !400, file: !3, line: 1052, column: 28)
!405 = !DILocation(line: 1053, column: 20, scope: !404)
!406 = !DILocation(line: 1052, column: 5, scope: !407)
!407 = !DILexicalBlockFile(scope: !400, file: !3, discriminator: 2)
!408 = distinct !{!408, !395, !409}
!409 = !DILocation(line: 1054, column: 5, scope: !396)
!410 = !DILocation(line: 1055, column: 1, scope: !411)
!411 = !DILexicalBlockFile(scope: !337, file: !3, discriminator: 2)
!412 = distinct !DISubprogram(name: "avdtp_start_req", scope: !3, file: !3, line: 1058, type: !302, isLocal: false, isDefinition: true, scopeLine: 1059, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !413)
!413 = !{!414}
!414 = !DILocalVariable(name: "session", arg: 1, scope: !412, file: !3, line: 1058, type: !304)
!415 = !DILocation(line: 1058, column: 31, scope: !412)
!416 = !DILocation(line: 1061, column: 100, scope: !417)
!417 = distinct !DILexicalBlock(scope: !412, file: !3, line: 1061, column: 9)
!418 = !{!386, !352, i64 92}
!419 = !DILocation(line: 1061, column: 45, scope: !417)
!420 = !DILocation(line: 1061, column: 44, scope: !417)
!421 = !DILocation(line: 990, column: 5, scope: !361, inlinedAt: !422)
!422 = distinct !DILocation(line: 1061, column: 9, scope: !417)
!423 = !DILocation(line: 986, column: 22, scope: !361, inlinedAt: !422)
!424 = !DILocation(line: 993, column: 5, scope: !361, inlinedAt: !422)
!425 = !DILocation(line: 995, column: 28, scope: !361, inlinedAt: !422)
!426 = !DILocation(line: 995, column: 40, scope: !361, inlinedAt: !422)
!427 = !DILocation(line: 996, column: 5, scope: !361, inlinedAt: !422)
!428 = !DILocation(line: 984, column: 75, scope: !361, inlinedAt: !422)
!429 = !DILocation(line: 990, column: 21, scope: !361, inlinedAt: !422)
!430 = !DILocation(line: 1003, column: 5, scope: !361, inlinedAt: !422)
!431 = !DILocation(line: 1011, column: 1, scope: !361, inlinedAt: !422)
!432 = !DILocation(line: 1064, column: 1, scope: !412)
!433 = distinct !DISubprogram(name: "avdtp_suspend_req", scope: !3, file: !3, line: 1068, type: !302, isLocal: false, isDefinition: true, scopeLine: 1069, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !434)
!434 = !{!435}
!435 = !DILocalVariable(name: "session", arg: 1, scope: !433, file: !3, line: 1068, type: !304)
!436 = !DILocation(line: 1068, column: 33, scope: !433)
!437 = !DILocation(line: 1071, column: 102, scope: !438)
!438 = distinct !DILexicalBlock(scope: !433, file: !3, line: 1071, column: 9)
!439 = !DILocation(line: 1071, column: 47, scope: !438)
!440 = !DILocation(line: 1071, column: 46, scope: !438)
!441 = !DILocation(line: 990, column: 5, scope: !361, inlinedAt: !442)
!442 = distinct !DILocation(line: 1071, column: 9, scope: !438)
!443 = !DILocation(line: 986, column: 22, scope: !361, inlinedAt: !442)
!444 = !DILocation(line: 993, column: 5, scope: !361, inlinedAt: !442)
!445 = !DILocation(line: 995, column: 28, scope: !361, inlinedAt: !442)
!446 = !DILocation(line: 995, column: 40, scope: !361, inlinedAt: !442)
!447 = !DILocation(line: 996, column: 5, scope: !361, inlinedAt: !442)
!448 = !DILocation(line: 984, column: 75, scope: !361, inlinedAt: !442)
!449 = !DILocation(line: 990, column: 21, scope: !361, inlinedAt: !442)
!450 = !DILocation(line: 1003, column: 5, scope: !361, inlinedAt: !442)
!451 = !DILocation(line: 1011, column: 1, scope: !361, inlinedAt: !442)
!452 = !DILocalVariable(name: "packet", arg: 2, scope: !453, file: !3, line: 1340, type: !63)
!453 = distinct !DISubprogram(name: "avdtp_suspend_response", scope: !3, file: !3, line: 1340, type: !454, isLocal: true, isDefinition: true, scopeLine: 1341, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !456)
!454 = !DISubroutineType(types: !455)
!455 = !{!61, !304, !63, !161}
!456 = !{!457, !452, !458, !459}
!457 = !DILocalVariable(name: "session", arg: 1, scope: !453, file: !3, line: 1340, type: !304)
!458 = !DILocalVariable(name: "size", arg: 3, scope: !453, file: !3, line: 1340, type: !161)
!459 = !DILocalVariable(name: "local_sep", scope: !453, file: !3, line: 1342, type: !68)
!460 = !DILocation(line: 1340, column: 59, scope: !453, inlinedAt: !461)
!461 = distinct !DILocation(line: 1075, column: 5, scope: !433)
!462 = !DILocation(line: 1340, column: 71, scope: !453, inlinedAt: !461)
!463 = !DILocation(line: 1342, column: 57, scope: !453, inlinedAt: !461)
!464 = !{!386, !389, i64 60}
!465 = !DILocation(line: 1342, column: 22, scope: !453, inlinedAt: !461)
!466 = !DILocation(line: 1343, column: 16, scope: !453, inlinedAt: !461)
!467 = !DILocation(line: 1343, column: 22, scope: !453, inlinedAt: !461)
!468 = !DILocation(line: 1344, column: 16, scope: !453, inlinedAt: !461)
!469 = !{!470, !389, i64 0}
!470 = !{!"_avdtp_local_sep", !389, i64 0, !389, i64 4, !471, i64 8, !352, i64 10, !352, i64 10, !352, i64 11}
!471 = !{!"_seid_info", !352, i64 0, !352, i64 0, !352, i64 0, !352, i64 1, !352, i64 1, !352, i64 1}
!472 = !DILocation(line: 1344, column: 21, scope: !453, inlinedAt: !461)
!473 = !{!474, !389, i64 16}
!474 = !{!"_avdtp_sep_ind", !389, i64 0, !389, i64 4, !389, i64 8, !389, i64 12, !389, i64 16, !389, i64 20, !389, i64 24, !389, i64 28, !389, i64 32}
!475 = !DILocation(line: 1344, column: 64, scope: !453, inlinedAt: !461)
!476 = !DILocation(line: 1344, column: 5, scope: !453, inlinedAt: !461)
!477 = !DILocation(line: 1076, column: 1, scope: !433)
!478 = distinct !DISubprogram(name: "avdtp_close_req", scope: !3, file: !3, line: 1079, type: !302, isLocal: false, isDefinition: true, scopeLine: 1080, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !479)
!479 = !{!480}
!480 = !DILocalVariable(name: "session", arg: 1, scope: !478, file: !3, line: 1079, type: !304)
!481 = !DILocation(line: 1079, column: 31, scope: !478)
!482 = !DILocation(line: 1082, column: 100, scope: !483)
!483 = distinct !DILexicalBlock(scope: !478, file: !3, line: 1082, column: 9)
!484 = !DILocation(line: 1082, column: 45, scope: !483)
!485 = !DILocation(line: 1082, column: 44, scope: !483)
!486 = !DILocation(line: 990, column: 5, scope: !361, inlinedAt: !487)
!487 = distinct !DILocation(line: 1082, column: 9, scope: !483)
!488 = !DILocation(line: 986, column: 22, scope: !361, inlinedAt: !487)
!489 = !DILocation(line: 993, column: 5, scope: !361, inlinedAt: !487)
!490 = !DILocation(line: 995, column: 28, scope: !361, inlinedAt: !487)
!491 = !DILocation(line: 995, column: 40, scope: !361, inlinedAt: !487)
!492 = !DILocation(line: 996, column: 5, scope: !361, inlinedAt: !487)
!493 = !DILocation(line: 984, column: 75, scope: !361, inlinedAt: !487)
!494 = !DILocation(line: 990, column: 21, scope: !361, inlinedAt: !487)
!495 = !DILocation(line: 1003, column: 5, scope: !361, inlinedAt: !487)
!496 = !DILocation(line: 1011, column: 1, scope: !361, inlinedAt: !487)
!497 = !DILocation(line: 1085, column: 1, scope: !478)
!498 = distinct !DISubprogram(name: "avdtp_abort_req", scope: !3, file: !3, line: 1088, type: !302, isLocal: false, isDefinition: true, scopeLine: 1089, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !499)
!499 = !{!500}
!500 = !DILocalVariable(name: "session", arg: 1, scope: !498, file: !3, line: 1088, type: !304)
!501 = !DILocation(line: 1088, column: 31, scope: !498)
!502 = !DILocation(line: 1090, column: 5, scope: !503)
!503 = distinct !DILexicalBlock(scope: !498, file: !3, line: 1090, column: 5)
!504 = !DILocation(line: 1090, column: 5, scope: !498)
!505 = !DILocation(line: 1090, column: 5, scope: !506)
!506 = !DILexicalBlockFile(scope: !503, file: !3, discriminator: 1)
!507 = !DILocation(line: 1091, column: 100, scope: !508)
!508 = distinct !DILexicalBlock(scope: !498, file: !3, line: 1091, column: 9)
!509 = !DILocation(line: 1091, column: 45, scope: !508)
!510 = !DILocation(line: 1091, column: 44, scope: !508)
!511 = !DILocation(line: 990, column: 5, scope: !361, inlinedAt: !512)
!512 = distinct !DILocation(line: 1091, column: 9, scope: !508)
!513 = !DILocation(line: 986, column: 22, scope: !361, inlinedAt: !512)
!514 = !DILocation(line: 993, column: 5, scope: !361, inlinedAt: !512)
!515 = !DILocation(line: 995, column: 28, scope: !361, inlinedAt: !512)
!516 = !DILocation(line: 995, column: 40, scope: !361, inlinedAt: !512)
!517 = !DILocation(line: 996, column: 5, scope: !361, inlinedAt: !512)
!518 = !DILocation(line: 984, column: 75, scope: !361, inlinedAt: !512)
!519 = !DILocation(line: 990, column: 21, scope: !361, inlinedAt: !512)
!520 = !DILocation(line: 1003, column: 5, scope: !361, inlinedAt: !512)
!521 = !DILocation(line: 1011, column: 1, scope: !361, inlinedAt: !512)
!522 = !DILocation(line: 1094, column: 1, scope: !498)
!523 = distinct !DISubprogram(name: "avdtp_get_configuation_req", scope: !3, file: !3, line: 1097, type: !302, isLocal: false, isDefinition: true, scopeLine: 1098, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !524)
!524 = !{!525}
!525 = !DILocalVariable(name: "session", arg: 1, scope: !523, file: !3, line: 1097, type: !304)
!526 = !DILocation(line: 1097, column: 42, scope: !523)
!527 = !DILocation(line: 1099, column: 112, scope: !528)
!528 = distinct !DILexicalBlock(scope: !523, file: !3, line: 1099, column: 9)
!529 = !DILocation(line: 1099, column: 57, scope: !528)
!530 = !DILocation(line: 1099, column: 56, scope: !528)
!531 = !DILocation(line: 990, column: 5, scope: !361, inlinedAt: !532)
!532 = distinct !DILocation(line: 1099, column: 9, scope: !528)
!533 = !DILocation(line: 986, column: 22, scope: !361, inlinedAt: !532)
!534 = !DILocation(line: 993, column: 5, scope: !361, inlinedAt: !532)
!535 = !DILocation(line: 995, column: 28, scope: !361, inlinedAt: !532)
!536 = !DILocation(line: 995, column: 40, scope: !361, inlinedAt: !532)
!537 = !DILocation(line: 996, column: 5, scope: !361, inlinedAt: !532)
!538 = !DILocation(line: 984, column: 75, scope: !361, inlinedAt: !532)
!539 = !DILocation(line: 990, column: 21, scope: !361, inlinedAt: !532)
!540 = !DILocation(line: 1003, column: 5, scope: !361, inlinedAt: !532)
!541 = !DILocation(line: 1011, column: 1, scope: !361, inlinedAt: !532)
!542 = !DILocation(line: 1102, column: 1, scope: !523)
!543 = distinct !DISubprogram(name: "avdtp_delay_report_req", scope: !3, file: !3, line: 1104, type: !302, isLocal: false, isDefinition: true, scopeLine: 1105, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !544)
!544 = !{!545}
!545 = !DILocalVariable(name: "session", arg: 1, scope: !543, file: !3, line: 1104, type: !304)
!546 = !DILocation(line: 1104, column: 38, scope: !543)
!547 = !DILocation(line: 1107, column: 107, scope: !548)
!548 = distinct !DILexicalBlock(scope: !543, file: !3, line: 1107, column: 9)
!549 = !DILocation(line: 1107, column: 52, scope: !548)
!550 = !DILocation(line: 1107, column: 51, scope: !548)
!551 = !DILocation(line: 990, column: 5, scope: !361, inlinedAt: !552)
!552 = distinct !DILocation(line: 1107, column: 9, scope: !548)
!553 = !DILocation(line: 986, column: 22, scope: !361, inlinedAt: !552)
!554 = !DILocation(line: 993, column: 5, scope: !361, inlinedAt: !552)
!555 = !DILocation(line: 995, column: 28, scope: !361, inlinedAt: !552)
!556 = !DILocation(line: 995, column: 40, scope: !361, inlinedAt: !552)
!557 = !DILocation(line: 996, column: 5, scope: !361, inlinedAt: !552)
!558 = !DILocation(line: 998, column: 9, scope: !559, inlinedAt: !552)
!559 = distinct !DILexicalBlock(scope: !560, file: !3, line: 997, column: 42)
!560 = distinct !DILexicalBlock(scope: !361, file: !3, line: 997, column: 9)
!561 = !DILocation(line: 998, column: 37, scope: !559, inlinedAt: !552)
!562 = !DILocation(line: 999, column: 9, scope: !559, inlinedAt: !552)
!563 = !DILocation(line: 999, column: 37, scope: !559, inlinedAt: !552)
!564 = !DILocation(line: 984, column: 75, scope: !361, inlinedAt: !552)
!565 = !DILocation(line: 990, column: 21, scope: !361, inlinedAt: !552)
!566 = !DILocation(line: 1003, column: 5, scope: !361, inlinedAt: !552)
!567 = !DILocation(line: 1011, column: 1, scope: !361, inlinedAt: !552)
!568 = !DILocation(line: 1110, column: 1, scope: !543)
!569 = distinct !DISubprogram(name: "avdtp_packet_handler", scope: !3, file: !3, line: 1410, type: !570, isLocal: false, isDefinition: true, scopeLine: 1411, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !572)
!570 = !DISubroutineType(types: !571)
!571 = !{!61, !304, !63, !103}
!572 = !{!573, !574, !575, !576}
!573 = !DILocalVariable(name: "session", arg: 1, scope: !569, file: !3, line: 1410, type: !304)
!574 = !DILocalVariable(name: "packet", arg: 2, scope: !569, file: !3, line: 1410, type: !63)
!575 = !DILocalVariable(name: "size", arg: 3, scope: !569, file: !3, line: 1410, type: !103)
!576 = !DILocalVariable(name: "in", scope: !569, file: !3, line: 1412, type: !577)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_buf", file: !6, line: 305, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_in_buf", file: !6, line: 297, size: 1120, elements: !579)
!579 = !{!580, !581, !585, !586, !587, !588, !589}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "no_of_packets", scope: !578, file: !6, line: 298, baseType: !168, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !578, file: !6, line: 299, baseType: !582, size: 1024, offset: 32)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 1024, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !578, file: !6, line: 300, baseType: !40, size: 8, offset: 1056)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "transaction", scope: !578, file: !6, line: 301, baseType: !40, size: 8, offset: 1064)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "message_type", scope: !578, file: !6, line: 302, baseType: !40, size: 8, offset: 1072)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "signal_id", scope: !578, file: !6, line: 303, baseType: !40, size: 8, offset: 1080)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !578, file: !6, line: 304, baseType: !40, size: 8, offset: 1088)
!590 = !DILocation(line: 1410, column: 36, scope: !569)
!591 = !DILocation(line: 1410, column: 49, scope: !569)
!592 = !DILocation(line: 1410, column: 61, scope: !569)
!593 = !DILocation(line: 1412, column: 5, scope: !569)
!594 = !DILocation(line: 1413, column: 5, scope: !569)
!595 = !DILocation(line: 1416, column: 43, scope: !569)
!596 = !DILocation(line: 1412, column: 12, scope: !569)
!597 = !DILocalVariable(name: "in", arg: 1, scope: !598, file: !3, line: 851, type: !602)
!598 = distinct !DISubprogram(name: "avdtp_parse_data", scope: !3, file: !3, line: 851, type: !599, isLocal: true, isDefinition: true, scopeLine: 852, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !603)
!599 = !DISubroutineType(types: !600)
!600 = !{!601, !602, !62, !161}
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "avdtp_parse_result", file: !6, line: 55, baseType: !14)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!603 = !{!597, !604, !605, !606, !607, !608, !609, !610}
!604 = !DILocalVariable(name: "buf", arg: 2, scope: !598, file: !3, line: 851, type: !62)
!605 = !DILocalVariable(name: "size", arg: 3, scope: !598, file: !3, line: 851, type: !161)
!606 = !DILocalVariable(name: "skip_size", scope: !598, file: !3, line: 853, type: !161)
!607 = !DILocalVariable(name: "payload_size", scope: !598, file: !3, line: 854, type: !161)
!608 = !DILocalVariable(name: "header", scope: !598, file: !3, line: 855, type: !213)
!609 = !DILocalVariable(name: "single", scope: !598, file: !3, line: 856, type: !220)
!610 = !DILocalVariable(name: "start", scope: !598, file: !3, line: 857, type: !229)
!611 = !DILocation(line: 851, column: 52, scope: !598, inlinedAt: !612)
!612 = distinct !DILocation(line: 1416, column: 13, scope: !569)
!613 = !DILocation(line: 851, column: 62, scope: !598, inlinedAt: !612)
!614 = !DILocation(line: 851, column: 71, scope: !598, inlinedAt: !612)
!615 = !DILocation(line: 859, column: 14, scope: !616, inlinedAt: !612)
!616 = distinct !DILexicalBlock(scope: !598, file: !3, line: 859, column: 9)
!617 = !DILocation(line: 859, column: 9, scope: !598, inlinedAt: !612)
!618 = !DILocation(line: 863, column: 21, scope: !598, inlinedAt: !612)
!619 = !DILocation(line: 863, column: 5, scope: !598, inlinedAt: !612)
!620 = !DILocation(line: 865, column: 18, scope: !621, inlinedAt: !612)
!621 = distinct !DILexicalBlock(scope: !622, file: !3, line: 865, column: 13)
!622 = distinct !DILexicalBlock(scope: !598, file: !3, line: 863, column: 34)
!623 = !DILocation(line: 865, column: 13, scope: !622, inlinedAt: !612)
!624 = !DILocation(line: 873, column: 13, scope: !622, inlinedAt: !612)
!625 = !DILocation(line: 873, column: 23, scope: !622, inlinedAt: !612)
!626 = !{!627, !352, i64 136}
!627 = !{!"_in_buf", !628, i64 0, !352, i64 4, !352, i64 132, !352, i64 133, !352, i64 134, !352, i64 135, !352, i64 136}
!628 = !{!"int", !352, i64 0}
!629 = !DILocation(line: 874, column: 13, scope: !622, inlinedAt: !612)
!630 = !DILocation(line: 874, column: 27, scope: !622, inlinedAt: !612)
!631 = !{!627, !628, i64 0}
!632 = !DILocation(line: 875, column: 36, scope: !622, inlinedAt: !612)
!633 = !DILocation(line: 875, column: 13, scope: !622, inlinedAt: !612)
!634 = !DILocation(line: 875, column: 26, scope: !622, inlinedAt: !612)
!635 = !{!627, !352, i64 134}
!636 = !DILocation(line: 876, column: 33, scope: !622, inlinedAt: !612)
!637 = !DILocation(line: 876, column: 13, scope: !622, inlinedAt: !612)
!638 = !DILocation(line: 876, column: 23, scope: !622, inlinedAt: !612)
!639 = !{!627, !352, i64 135}
!640 = !DILocation(line: 877, column: 35, scope: !622, inlinedAt: !612)
!641 = !DILocation(line: 877, column: 13, scope: !622, inlinedAt: !612)
!642 = !DILocation(line: 877, column: 25, scope: !622, inlinedAt: !612)
!643 = !{!627, !352, i64 133}
!644 = !DILocation(line: 853, column: 9, scope: !598, inlinedAt: !612)
