temp.o:	file format ELF32-i386

.debug_info contents:
0x00000000: Compile Unit: length = 0x00001f2e version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x00001f32)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)")
              DW_AT_language	(DW_LANG_C99)
              DW_AT_name	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
              DW_AT_GNU_pubnames	(true)
              DW_AT_low_pc	(0x0000000000000000)
              DW_AT_ranges	(0x00000070
                 [0x00000000 - 0x0000174f)
                 [0x0000174f - 0x00003d52)
                 [0x00000000 - 0x00000009))

0x00000026:   DW_TAG_variable
                DW_AT_name	("app_info_debug_enable")
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/profile_stack_debug.h")
                DW_AT_decl_line	(190)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000037:   DW_TAG_base_type
                DW_AT_name	("int")
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_byte_size	(0x04)

0x0000003e:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(58)

0x00000042:     DW_TAG_enumerator
                  DW_AT_name	("AVDTP_STATE_IDLE")
                  DW_AT_const_value	(0)

0x00000048:     DW_TAG_enumerator
                  DW_AT_name	("AVDTP_STATE_CONFIGURED")
                  DW_AT_const_value	(1)

0x0000004e:     DW_TAG_enumerator
                  DW_AT_name	("AVDTP_STATE_OPEN")
                  DW_AT_const_value	(2)

0x00000054:     DW_TAG_enumerator
                  DW_AT_name	("AVDTP_STATE_STREAMING")
                  DW_AT_const_value	(3)

0x0000005a:     DW_TAG_enumerator
                  DW_AT_name	("AVDTP_STATE_CLOSING")
                  DW_AT_const_value	(4)

0x00000060:     DW_TAG_enumerator
                  DW_AT_name	("AVDTP_STATE_ABORTING")
                  DW_AT_const_value	(5)

0x00000066:     NULL

0x00000067:   DW_TAG_enumeration_type
                DW_AT_name	("_avdtp_parse_result")
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(51)

0x0000006f:     DW_TAG_enumerator
                  DW_AT_name	("PARSE_ERROR")
                  DW_AT_const_value	(0)

0x00000075:     DW_TAG_enumerator
                  DW_AT_name	("PARSE_FRAGMENT")
                  DW_AT_const_value	(1)

0x0000007b:     DW_TAG_enumerator
                  DW_AT_name	("PARSE_SUCCESS")
                  DW_AT_const_value	(2)

0x00000081:     NULL

0x00000082:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0087 "a2dp_conn")

0x00000087:   DW_TAG_structure_type
                DW_AT_name	("a2dp_conn")
                DW_AT_byte_size	(0x80)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(237)

0x0000008f:     DW_TAG_member
                  DW_AT_name	("addr")
                  DW_AT_type	(cu + 0x00c0 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(238)
                  DW_AT_data_member_location	(0x00)

0x0000009b:     DW_TAG_member
                  DW_AT_name	("a2dp_core_data")
                  DW_AT_type	(cu + 0x00fb "a2dp_core_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(239)
                  DW_AT_data_member_location	(0x06)

0x000000a7:     DW_TAG_member
                  DW_AT_name	("session")
                  DW_AT_type	(cu + 0x0143 "avdtp")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(240)
                  DW_AT_data_member_location	(0x08)

0x000000b3:     DW_TAG_member
                  DW_AT_name	("media")
                  DW_AT_type	(cu + 0x053f "a2dp_media")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(241)
                  DW_AT_data_member_location	(0x68)

0x000000bf:     NULL

0x000000c0:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00cb "uint8_t[]")
                DW_AT_name	("bd_addr_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h")
                DW_AT_decl_line	(7)

0x000000cb:   DW_TAG_array_type
                DW_AT_type	(cu + 0x00d7 "uint8_t")

0x000000d0:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x00f4 "sizetype")
                  DW_AT_count	(0x06)

0x000000d6:     NULL

0x000000d7:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00e2 "__uint8_t")
                DW_AT_name	("uint8_t")
                DW_AT_decl_file	("/opt/q32s/include/sys/_stdint.h")
                DW_AT_decl_line	(20)

0x000000e2:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00ed "unsigned char")
                DW_AT_name	("__uint8_t")
                DW_AT_decl_file	("/opt/q32s/include/machine/_default_types.h")
                DW_AT_decl_line	(29)

0x000000ed:   DW_TAG_base_type
                DW_AT_name	("unsigned char")
                DW_AT_encoding	(DW_ATE_unsigned_char)
                DW_AT_byte_size	(0x01)

0x000000f4:   DW_TAG_base_type
                DW_AT_name	("sizetype")
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_unsigned)

0x000000fb:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0106 "structure ")
                DW_AT_name	("a2dp_core_data_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(229)

0x00000106:   DW_TAG_structure_type
                DW_AT_byte_size	(0x01)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(225)

0x0000010a:     DW_TAG_member
                  DW_AT_name	("inused")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(226)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x07)
                  DW_AT_data_member_location	(0x00)

0x00000119:     DW_TAG_member
                  DW_AT_name	("discover_req")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(227)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x03)
                  DW_AT_data_member_location	(0x00)

0x00000128:     DW_TAG_member
                  DW_AT_name	("bqb_test_cnt")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(228)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x03)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x00)

0x00000137:     NULL

0x00000138:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00ed "unsigned char")
                DW_AT_name	("u8")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(11)

0x00000143:   DW_TAG_structure_type
                DW_AT_name	("avdtp")
                DW_AT_byte_size	(0x60)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(335)

0x0000014c:     DW_TAG_member
                  DW_AT_name	("local_seps")
                  DW_AT_type	(cu + 0x0167 "avdtp_local_sep[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(337)
                  DW_AT_data_member_location	(0x00)

0x00000159:     DW_TAG_member
                  DW_AT_name	("adp_core_data")
                  DW_AT_type	(cu + 0x0427 "avdtp_core_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(338)
                  DW_AT_data_member_location	(0x38)

0x00000166:     NULL

0x00000167:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0173 "avdtp_local_sep")

0x0000016c:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x00f4 "sizetype")
                  DW_AT_count	(0x02)

0x00000172:     NULL

0x00000173:   DW_TAG_typedef
                DW_AT_type	(cu + 0x017f "_avdtp_local_sep")
                DW_AT_name	("avdtp_local_sep")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(293)

0x0000017f:   DW_TAG_structure_type
                DW_AT_name	("_avdtp_local_sep")
                DW_AT_byte_size	(0x1c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(282)

0x00000188:     DW_TAG_member
                  DW_AT_name	("ind")
                  DW_AT_type	(cu + 0x01dd "const _avdtp_sep_ind*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(283)
                  DW_AT_data_member_location	(0x00)

0x00000195:     DW_TAG_member
                  DW_AT_name	("session")
                  DW_AT_type	(cu + 0x03a8 "avdtp*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(284)
                  DW_AT_data_member_location	(0x04)

0x000001a2:     DW_TAG_member
                  DW_AT_name	("info")
                  DW_AT_type	(cu + 0x03ad "seid_info")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(286)
                  DW_AT_data_member_location	(0x08)

0x000001af:     DW_TAG_member
                  DW_AT_name	("state")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(288)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x0a)

0x000001bf:     DW_TAG_member
                  DW_AT_name	("codec_type")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(289)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x0a)

0x000001cf:     DW_TAG_member
                  DW_AT_name	("config")
                  DW_AT_type	(cu + 0x041b "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(290)
                  DW_AT_data_member_location	(0x0b)

0x000001dc:     NULL

0x000001dd:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x01e2 "const _avdtp_sep_ind")

0x000001e2:   DW_TAG_const_type
                DW_AT_type	(cu + 0x01e7 "_avdtp_sep_ind")

0x000001e7:   DW_TAG_structure_type
                DW_AT_name	("_avdtp_sep_ind")
                DW_AT_byte_size	(0x24)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(350)

0x000001f0:     DW_TAG_member
                  DW_AT_name	("get_capability")
                  DW_AT_type	(cu + 0x0266 "subroutine bool*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(351)
                  DW_AT_data_member_location	(0x00)

0x000001fd:     DW_TAG_member
                  DW_AT_name	("set_configuration")
                  DW_AT_type	(cu + 0x0291 "subroutine bool*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(353)
                  DW_AT_data_member_location	(0x04)

0x0000020a:     DW_TAG_member
                  DW_AT_name	("open")
                  DW_AT_type	(cu + 0x02b5 "subroutine bool*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(355)
                  DW_AT_data_member_location	(0x08)

0x00000217:     DW_TAG_member
                  DW_AT_name	("start")
                  DW_AT_type	(cu + 0x033a "subroutine bool*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(356)
                  DW_AT_data_member_location	(0x0c)

0x00000224:     DW_TAG_member
                  DW_AT_name	("suspend")
                  DW_AT_type	(cu + 0x033a "subroutine bool*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(357)
                  DW_AT_data_member_location	(0x10)

0x00000231:     DW_TAG_member
                  DW_AT_name	("close")
                  DW_AT_type	(cu + 0x034f "subroutine bool*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(359)
                  DW_AT_data_member_location	(0x14)

0x0000023e:     DW_TAG_member
                  DW_AT_name	("abort")
                  DW_AT_type	(cu + 0x0369 "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(361)
                  DW_AT_data_member_location	(0x18)

0x0000024b:     DW_TAG_member
                  DW_AT_name	("reconfigure")
                  DW_AT_type	(cu + 0x0375 "subroutine bool*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(362)
                  DW_AT_data_member_location	(0x1c)

0x00000258:     DW_TAG_member
                  DW_AT_name	("delayreport")
                  DW_AT_type	(cu + 0x0381 "subroutine bool*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(363)
                  DW_AT_data_member_location	(0x20)

0x00000265:     NULL

0x00000266:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x026b "subroutine bool")

0x0000026b:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0280 "bool")
                DW_AT_prototyped	(true)

0x00000270:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0138 "u8")

0x00000275:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x028b "*")

0x0000027a:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x028c "u8*")

0x0000027f:     NULL

0x00000280:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00ed "unsigned char")
                DW_AT_name	("bool")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(11)

0x0000028b:   DW_TAG_pointer_type

0x0000028c:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0138 "u8")

0x00000291:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0296 "subroutine bool")

0x00000296:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0280 "bool")
                DW_AT_prototyped	(true)

0x0000029b:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x02b0 "avdtp_local_sep*")

0x000002a0:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x028c "u8*")

0x000002a5:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0138 "u8")

0x000002aa:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x028b "*")

0x000002af:     NULL

0x000002b0:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0173 "avdtp_local_sep")

0x000002b5:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x02ba "subroutine bool")

0x000002ba:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0280 "bool")
                DW_AT_prototyped	(true)

0x000002bf:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x02b0 "avdtp_local_sep*")

0x000002c4:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x02cf "avdtp_stream*")

0x000002c9:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0138 "u8")

0x000002ce:     NULL

0x000002cf:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x02d4 "avdtp_stream")

0x000002d4:   DW_TAG_typedef
                DW_AT_type	(cu + 0x02e0 "_avdtp_stream")
                DW_AT_name	("avdtp_stream")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(280)

0x000002e0:   DW_TAG_structure_type
                DW_AT_name	("_avdtp_stream")
                DW_AT_byte_size	(0x01)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(268)

0x000002e9:     DW_TAG_member
                  DW_AT_name	("rseid")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(270)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x00)

0x000002f9:     DW_TAG_member
                  DW_AT_name	("int_role")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(271)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x03)
                  DW_AT_data_member_location	(0x00)

0x00000309:     DW_TAG_member
                  DW_AT_name	("open_acp")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(272)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x02)
                  DW_AT_data_member_location	(0x00)

0x00000319:     DW_TAG_member
                  DW_AT_name	("starting")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(278)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x01)
                  DW_AT_data_member_location	(0x00)

0x00000329:     DW_TAG_member
                  DW_AT_name	("reserve")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(279)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x00)

0x00000339:     NULL

0x0000033a:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x033f "subroutine bool")

0x0000033f:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0280 "bool")
                DW_AT_prototyped	(true)

0x00000344:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x02b0 "avdtp_local_sep*")

0x00000349:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x02cf "avdtp_stream*")

0x0000034e:     NULL

0x0000034f:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0354 "subroutine bool")

0x00000354:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0280 "bool")
                DW_AT_prototyped	(true)

0x00000359:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x02b0 "avdtp_local_sep*")

0x0000035e:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x02cf "avdtp_stream*")

0x00000363:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x028c "u8*")

0x00000368:     NULL

0x00000369:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x036e "subroutine ")

0x0000036e:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x0000036f:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x02b0 "avdtp_local_sep*")

0x00000374:     NULL

0x00000375:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x037a "subroutine bool")

0x0000037a:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0280 "bool")

0x0000037f:     DW_TAG_unspecified_parameters

0x00000380:     NULL

0x00000381:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0386 "subroutine bool")

0x00000386:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0280 "bool")
                DW_AT_prototyped	(true)

0x0000038b:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0138 "u8")

0x00000390:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0396 "u16")

0x00000395:     NULL

0x00000396:   DW_TAG_typedef
                DW_AT_type	(cu + 0x03a1 "unsigned short")
                DW_AT_name	("u16")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(13)

0x000003a1:   DW_TAG_base_type
                DW_AT_name	("unsigned short")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x02)

0x000003a8:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0143 "avdtp")

0x000003ad:   DW_TAG_typedef
                DW_AT_type	(cu + 0x03b8 "_seid_info")
                DW_AT_name	("seid_info")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(124)

0x000003b8:   DW_TAG_structure_type
                DW_AT_name	("_seid_info")
                DW_AT_byte_size	(0x02)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(117)

0x000003c0:     DW_TAG_member
                  DW_AT_name	("rfa0")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(118)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x07)
                  DW_AT_data_member_location	(0x00)

0x000003cf:     DW_TAG_member
                  DW_AT_name	("inuse")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(119)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x06)
                  DW_AT_data_member_location	(0x00)

0x000003de:     DW_TAG_member
                  DW_AT_name	("seid")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(120)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x06)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x00)

0x000003ed:     DW_TAG_member
                  DW_AT_name	("rfa2")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(121)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x03)
                  DW_AT_bit_offset	(0x05)
                  DW_AT_data_member_location	(0x01)

0x000003fc:     DW_TAG_member
                  DW_AT_name	("type")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(122)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x01)

0x0000040b:     DW_TAG_member
                  DW_AT_name	("media_type")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(123)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x01)

0x0000041a:     NULL

0x0000041b:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0138 "u8")

0x00000420:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x00f4 "sizetype")
                  DW_AT_count	(0x10)

0x00000426:     NULL

0x00000427:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0433 "structure ")
                DW_AT_name	("avdtp_core_data_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(333)

0x00000433:   DW_TAG_structure_type
                DW_AT_byte_size	(0x28)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(318)

0x00000438:     DW_TAG_member
                  DW_AT_name	("stream")
                  DW_AT_type	(cu + 0x02d4 "avdtp_stream")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(319)
                  DW_AT_data_member_location	(0x00)

0x00000445:     DW_TAG_member
                  DW_AT_name	("local_sep")
                  DW_AT_type	(cu + 0x02b0 "avdtp_local_sep*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(320)
                  DW_AT_data_member_location	(0x04)

0x00000452:     DW_TAG_member
                  DW_AT_name	("local_sep_ind")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(321)
                  DW_AT_data_member_location	(0x08)

0x0000045f:     DW_TAG_member
                  DW_AT_name	("channel")
                  DW_AT_type	(cu + 0x0396 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(322)
                  DW_AT_data_member_location	(0x0a)

0x0000046c:     DW_TAG_member
                  DW_AT_name	("acp_seid")
                  DW_AT_type	(cu + 0x0501 "seid_req[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(323)
                  DW_AT_data_member_location	(0x0c)

0x00000479:     DW_TAG_member
                  DW_AT_name	("config")
                  DW_AT_type	(cu + 0x041b "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(324)
                  DW_AT_data_member_location	(0x14)

0x00000486:     DW_TAG_member
                  DW_AT_name	("seid_ind")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(325)
                  DW_AT_data_member_location	(0x24)

0x00000493:     DW_TAG_member
                  DW_AT_name	("pending_req")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(326)
                  DW_AT_data_member_location	(0x25)

0x000004a0:     DW_TAG_member
                  DW_AT_name	("max_acp_seid")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(327)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x26)

0x000004b0:     DW_TAG_member
                  DW_AT_name	("cur_acp_seid")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(328)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x26)

0x000004c0:     DW_TAG_member
                  DW_AT_name	("aac_codec_prior")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(329)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x27)

0x000004d0:     DW_TAG_member
                  DW_AT_name	("role")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(330)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x02)
                  DW_AT_data_member_location	(0x27)

0x000004e0:     DW_TAG_member
                  DW_AT_name	("get_discover")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(331)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x01)
                  DW_AT_data_member_location	(0x27)

0x000004f0:     DW_TAG_member
                  DW_AT_name	("reserve")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(332)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x27)

0x00000500:     NULL

0x00000501:   DW_TAG_array_type
                DW_AT_type	(cu + 0x050d "seid_req")

0x00000506:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x00f4 "sizetype")
                  DW_AT_count	(0x08)

0x0000050c:     NULL

0x0000050d:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0518 "_seid_req")
                DW_AT_name	("seid_req")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(129)

0x00000518:   DW_TAG_structure_type
                DW_AT_name	("_seid_req")
                DW_AT_byte_size	(0x01)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(126)

0x00000520:     DW_TAG_member
                  DW_AT_name	("rfa0")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(127)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x06)
                  DW_AT_data_member_location	(0x00)

0x0000052f:     DW_TAG_member
                  DW_AT_name	("acp_seid")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(128)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x06)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x00)

0x0000053e:     NULL

0x0000053f:   DW_TAG_structure_type
                DW_AT_name	("a2dp_media")
                DW_AT_byte_size	(0x18)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(215)

0x00000547:     DW_TAG_member
                  DW_AT_name	("media_core_data")
                  DW_AT_type	(cu + 0x05a2 "media_core_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(216)
                  DW_AT_data_member_location	(0x00)

0x00000553:     DW_TAG_member
                  DW_AT_name	("probe")
                  DW_AT_type	(cu + 0x05e8 "a2dp_media_probe*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(217)
                  DW_AT_data_member_location	(0x08)

0x0000055f:     DW_TAG_member
                  DW_AT_name	("codec")
                  DW_AT_type	(cu + 0x0698 "a2dp_media_codec*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(218)
                  DW_AT_data_member_location	(0x0c)

0x0000056b:     DW_TAG_member
                  DW_AT_name	("bitrate")
                  DW_AT_type	(cu + 0x05d6 "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(219)
                  DW_AT_data_member_location	(0x10)

0x00000577:     DW_TAG_member
                  DW_AT_name	("nchannels")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(220)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x14)

0x00000586:     DW_TAG_member
                  DW_AT_name	("reserve")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(221)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x14)

0x00000595:     DW_TAG_member
                  DW_AT_name	("type")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(222)
                  DW_AT_data_member_location	(0x15)

0x000005a1:     NULL

0x000005a2:   DW_TAG_typedef
                DW_AT_type	(cu + 0x05ad "structure ")
                DW_AT_name	("media_core_data_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(213)

0x000005ad:   DW_TAG_structure_type
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(209)

0x000005b1:     DW_TAG_member
                  DW_AT_name	("channel")
                  DW_AT_type	(cu + 0x0396 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(210)
                  DW_AT_data_member_location	(0x00)

0x000005bd:     DW_TAG_member
                  DW_AT_name	("cp_type")
                  DW_AT_type	(cu + 0x0396 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(211)
                  DW_AT_data_member_location	(0x02)

0x000005c9:     DW_TAG_member
                  DW_AT_name	("samplerate")
                  DW_AT_type	(cu + 0x05d6 "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(212)
                  DW_AT_data_member_location	(0x04)

0x000005d5:     NULL

0x000005d6:   DW_TAG_typedef
                DW_AT_type	(cu + 0x05e1 "unsigned int")
                DW_AT_name	("u32")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(15)

0x000005e1:   DW_TAG_base_type
                DW_AT_name	("unsigned int")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x04)

0x000005e8:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x05ed "a2dp_media_probe")

0x000005ed:   DW_TAG_structure_type
                DW_AT_name	("a2dp_media_probe")
                DW_AT_byte_size	(0x18)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(190)

0x000005f5:     DW_TAG_member
                  DW_AT_name	("type")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(192)
                  DW_AT_data_member_location	(0x00)

0x00000601:     DW_TAG_member
                  DW_AT_name	("init")
                  DW_AT_type	(cu + 0x063e "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(193)
                  DW_AT_data_member_location	(0x04)

0x0000060d:     DW_TAG_member
                  DW_AT_name	("probe")
                  DW_AT_type	(cu + 0x066d "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(194)
                  DW_AT_data_member_location	(0x08)

0x00000619:     DW_TAG_member
                  DW_AT_name	("start")
                  DW_AT_type	(cu + 0x068c "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(195)
                  DW_AT_data_member_location	(0x0c)

0x00000625:     DW_TAG_member
                  DW_AT_name	("suspend")
                  DW_AT_type	(cu + 0x068c "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(196)
                  DW_AT_data_member_location	(0x10)

0x00000631:     DW_TAG_member
                  DW_AT_name	("close")
                  DW_AT_type	(cu + 0x068c "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(197)
                  DW_AT_data_member_location	(0x14)

0x0000063d:     NULL

0x0000063e:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0643 "subroutine int")

0x00000643:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_prototyped	(true)

0x00000648:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x028b "*")

0x0000064d:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0653 "subroutine int*")

0x00000652:     NULL

0x00000653:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0658 "subroutine int")

0x00000658:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_prototyped	(true)

0x0000065d:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x028b "*")

0x00000662:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x028c "u8*")

0x00000667:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0396 "u16")

0x0000066c:     NULL

0x0000066d:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0672 "subroutine int")

0x00000672:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_prototyped	(true)

0x00000677:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0687 "uint8_t*")

0x0000067c:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x028c "u8*")

0x00000681:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0396 "u16")

0x00000686:     NULL

0x00000687:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x00d7 "uint8_t")

0x0000068c:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0691 "subroutine int")

0x00000691:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")

0x00000696:     DW_TAG_unspecified_parameters

0x00000697:     NULL

0x00000698:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x069d "a2dp_media_codec")

0x0000069d:   DW_TAG_structure_type
                DW_AT_name	("a2dp_media_codec")
                DW_AT_byte_size	(0x18)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                DW_AT_decl_line	(200)

0x000006a5:     DW_TAG_member
                  DW_AT_name	("type")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(201)
                  DW_AT_data_member_location	(0x00)

0x000006b1:     DW_TAG_member
                  DW_AT_name	("inused")
                  DW_AT_type	(cu + 0x06ee "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(202)
                  DW_AT_data_member_location	(0x04)

0x000006bd:     DW_TAG_member
                  DW_AT_name	("init")
                  DW_AT_type	(cu + 0x06fe "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(203)
                  DW_AT_data_member_location	(0x08)

0x000006c9:     DW_TAG_member
                  DW_AT_name	("start")
                  DW_AT_type	(cu + 0x070e "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(204)
                  DW_AT_data_member_location	(0x0c)

0x000006d5:     DW_TAG_member
                  DW_AT_name	("suspend")
                  DW_AT_type	(cu + 0x068c "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(205)
                  DW_AT_data_member_location	(0x10)

0x000006e1:     DW_TAG_member
                  DW_AT_name	("stop")
                  DW_AT_type	(cu + 0x06fe "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/a2dp.h")
                  DW_AT_decl_line	(206)
                  DW_AT_data_member_location	(0x14)

0x000006ed:     NULL

0x000006ee:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x06f3 "subroutine int")

0x000006f3:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_prototyped	(true)

0x000006f8:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0037 "int")

0x000006fd:     NULL

0x000006fe:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0703 "subroutine int")

0x00000703:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_prototyped	(true)

0x00000708:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x028b "*")

0x0000070d:     NULL

0x0000070e:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0713 "subroutine int")

0x00000713:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_prototyped	(true)

0x00000718:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x028c "u8*")

0x0000071d:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0396 "u16")

0x00000722:     NULL

0x00000723:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0728 "char")

0x00000728:   DW_TAG_base_type
                DW_AT_name	("char")
                DW_AT_encoding	(DW_ATE_signed_char)
                DW_AT_byte_size	(0x01)

0x0000072f:   DW_TAG_base_type
                DW_AT_name	("long unsigned int")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x04)

0x00000736:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x073b "avdtp_common_header")

0x0000073b:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0746 "_avdtp_common_header")
                DW_AT_name	("avdtp_common_header")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(87)

0x00000746:   DW_TAG_structure_type
                DW_AT_name	("_avdtp_common_header")
                DW_AT_byte_size	(0x01)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(83)

0x0000074e:     DW_TAG_member
                  DW_AT_name	("message_type")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(84)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x06)
                  DW_AT_data_member_location	(0x00)

0x0000075d:     DW_TAG_member
                  DW_AT_name	("packet_type")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(85)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x00)

0x0000076c:     DW_TAG_member
                  DW_AT_name	("transaction")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(86)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x00)

0x0000077b:     NULL

0x0000077c:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0781 "avdtp_single_header")

0x00000781:   DW_TAG_typedef
                DW_AT_type	(cu + 0x078c "_avdtp_single_header")
                DW_AT_name	("avdtp_single_header")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(95)

0x0000078c:   DW_TAG_structure_type
                DW_AT_name	("_avdtp_single_header")
                DW_AT_byte_size	(0x02)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(89)

0x00000794:     DW_TAG_member
                  DW_AT_name	("message_type")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(90)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x06)
                  DW_AT_data_member_location	(0x00)

0x000007a3:     DW_TAG_member
                  DW_AT_name	("packet_type")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(91)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x00)

0x000007b2:     DW_TAG_member
                  DW_AT_name	("transaction")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(92)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x00)

0x000007c1:     DW_TAG_member
                  DW_AT_name	("signal_id")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(93)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x06)
                  DW_AT_bit_offset	(0x02)
                  DW_AT_data_member_location	(0x01)

0x000007d0:     DW_TAG_member
                  DW_AT_name	("rfa0")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(94)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x01)

0x000007df:     NULL

0x000007e0:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x07e5 "avdtp_start_header")

0x000007e5:   DW_TAG_typedef
                DW_AT_type	(cu + 0x07f0 "_avdtp_start_header")
                DW_AT_name	("avdtp_start_header")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(104)

0x000007f0:   DW_TAG_structure_type
                DW_AT_name	("_avdtp_start_header")
                DW_AT_byte_size	(0x03)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(97)

0x000007f8:     DW_TAG_member
                  DW_AT_name	("message_type")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(98)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x06)
                  DW_AT_data_member_location	(0x00)

0x00000807:     DW_TAG_member
                  DW_AT_name	("packet_type")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(99)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x00)

0x00000816:     DW_TAG_member
                  DW_AT_name	("transaction")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(100)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x00)

0x00000825:     DW_TAG_member
                  DW_AT_name	("no_of_packets")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(101)
                  DW_AT_data_member_location	(0x01)

0x00000831:     DW_TAG_member
                  DW_AT_name	("signal_id")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(102)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x06)
                  DW_AT_bit_offset	(0x02)
                  DW_AT_data_member_location	(0x02)

0x00000840:     DW_TAG_member
                  DW_AT_name	("rfa0")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(103)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x02)

0x0000084f:     NULL

0x00000850:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x050d "seid_req")

0x00000855:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x085a "setconf_req")

0x0000085a:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0865 "_setconf_req")
                DW_AT_name	("setconf_req")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(136)

0x00000865:   DW_TAG_structure_type
                DW_AT_name	("_setconf_req")
                DW_AT_byte_size	(0x02)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(131)

0x0000086d:     DW_TAG_member
                  DW_AT_name	("rfa0")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(132)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x06)
                  DW_AT_data_member_location	(0x00)

0x0000087c:     DW_TAG_member
                  DW_AT_name	("acp_seid")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(133)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x06)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x00)

0x0000088b:     DW_TAG_member
                  DW_AT_name	("rfa1")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(134)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x06)
                  DW_AT_data_member_location	(0x01)

0x0000089a:     DW_TAG_member
                  DW_AT_name	("int_seid")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(135)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x06)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x01)

0x000008a9:     NULL

0x000008aa:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x08af "start_req")

0x000008af:   DW_TAG_typedef
                DW_AT_type	(cu + 0x08bb "_start_req")
                DW_AT_name	("start_req")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(261)

0x000008bb:   DW_TAG_structure_type
                DW_AT_name	("_start_req")
                DW_AT_byte_size	(0x02)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(258)

0x000008c4:     DW_TAG_member
                  DW_AT_name	("first_seid")
                  DW_AT_type	(cu + 0x08df "seid")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(259)
                  DW_AT_data_member_location	(0x00)

0x000008d1:     DW_TAG_member
                  DW_AT_name	("other_seids")
                  DW_AT_type	(cu + 0x0911 "seid[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(260)
                  DW_AT_data_member_location	(0x01)

0x000008de:     NULL

0x000008df:   DW_TAG_typedef
                DW_AT_type	(cu + 0x08ea "_seid")
                DW_AT_name	("seid")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(115)

0x000008ea:   DW_TAG_structure_type
                DW_AT_name	("_seid")
                DW_AT_byte_size	(0x01)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(112)

0x000008f2:     DW_TAG_member
                  DW_AT_name	("rfa0")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(113)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x06)
                  DW_AT_data_member_location	(0x00)

0x00000901:     DW_TAG_member
                  DW_AT_name	("seid")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(114)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x06)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x00)

0x00000910:     NULL

0x00000911:   DW_TAG_array_type
                DW_AT_type	(cu + 0x08df "seid")

0x00000916:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x00f4 "sizetype")
                  DW_AT_count	(0x01)

0x0000091c:     NULL

0x0000091d:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0922 "suspend_req")

0x00000922:   DW_TAG_typedef
                DW_AT_type	(cu + 0x092e "_suspend_req")
                DW_AT_name	("suspend_req")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(266)

0x0000092e:   DW_TAG_structure_type
                DW_AT_name	("_suspend_req")
                DW_AT_byte_size	(0x02)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(263)

0x00000937:     DW_TAG_member
                  DW_AT_name	("first_seid")
                  DW_AT_type	(cu + 0x08df "seid")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(264)
                  DW_AT_data_member_location	(0x00)

0x00000944:     DW_TAG_member
                  DW_AT_name	("other_seids")
                  DW_AT_type	(cu + 0x0911 "seid[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(265)
                  DW_AT_data_member_location	(0x01)

0x00000951:     NULL

0x00000952:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0957 "conf_rej")

0x00000957:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0962 "_conf_rej")
                DW_AT_name	("conf_rej")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(76)

0x00000962:   DW_TAG_structure_type
                DW_AT_name	("_conf_rej")
                DW_AT_byte_size	(0x02)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(73)

0x0000096a:     DW_TAG_member
                  DW_AT_name	("category")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(74)
                  DW_AT_data_member_location	(0x00)

0x00000976:     DW_TAG_member
                  DW_AT_name	("error")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(75)
                  DW_AT_data_member_location	(0x01)

0x00000982:     NULL

0x00000983:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0988 "reconf_req")

0x00000988:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0993 "_reconf_req")
                DW_AT_name	("reconf_req")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(150)

0x00000993:   DW_TAG_structure_type
                DW_AT_name	("_reconf_req")
                DW_AT_byte_size	(0x03)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(144)

0x0000099b:     DW_TAG_member
                  DW_AT_name	("rfa0")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(145)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x06)
                  DW_AT_data_member_location	(0x00)

0x000009aa:     DW_TAG_member
                  DW_AT_name	("acp_seid")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(146)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x06)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x00)

0x000009b9:     DW_TAG_member
                  DW_AT_name	("serv_cap")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(148)
                  DW_AT_data_member_location	(0x01)

0x000009c5:     DW_TAG_member
                  DW_AT_name	("serv_cap_len")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(149)
                  DW_AT_data_member_location	(0x02)

0x000009d1:     NULL

0x000009d2:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x09d7 "stream_rej")

0x000009d7:   DW_TAG_typedef
                DW_AT_type	(cu + 0x09e2 "_stream_rej")
                DW_AT_name	("stream_rej")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(142)

0x000009e2:   DW_TAG_structure_type
                DW_AT_name	("_stream_rej")
                DW_AT_byte_size	(0x02)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(138)

0x000009ea:     DW_TAG_member
                  DW_AT_name	("rfa0")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(139)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x06)
                  DW_AT_data_member_location	(0x00)

0x000009f9:     DW_TAG_member
                  DW_AT_name	("acp_seid")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(140)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x06)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x00)

0x00000a08:     DW_TAG_member
                  DW_AT_name	("error")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(141)
                  DW_AT_data_member_location	(0x01)

0x00000a14:     NULL

0x00000a15:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x03ad "seid_info")

0x00000a1a:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0a1f "avdtp_service_capability")

0x00000a1f:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0a2a "_avdtp_service_capability")
                DW_AT_name	("avdtp_service_capability")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(71)

0x00000a2a:   DW_TAG_structure_type
                DW_AT_name	("_avdtp_service_capability")
                DW_AT_byte_size	(0x02)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(68)

0x00000a32:     DW_TAG_member
                  DW_AT_name	("category")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(69)
                  DW_AT_data_member_location	(0x00)

0x00000a3e:     DW_TAG_member
                  DW_AT_name	("length")
                  DW_AT_type	(cu + 0x0138 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(70)
                  DW_AT_data_member_location	(0x01)

0x00000a4a:     NULL

0x00000a4b:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000000)
                DW_AT_high_pc	(0x0000000000000005)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("avdtp_retry_send")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                DW_AT_decl_line	(82)
                DW_AT_prototyped	(true)
                DW_AT_external	(true)

0x00000a5c:     DW_TAG_formal_parameter
                  DW_AT_name	("session")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                  DW_AT_decl_line	(82)
                  DW_AT_type	(cu + 0x0ae9 "avdtp_t*")

0x00000a67:     NULL

0x00000a68:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000005)
                DW_AT_high_pc	(0x0000000000000067)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_abstract_origin	(cu + 0x1685 "find_local_sep_by_seid")

0x00000a77:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000000
                     0x0000000000000005 - 0x0000000000000027: DW_OP_reg1 ECX)
                  DW_AT_abstract_origin	(cu + 0x1691 "session")

0x00000a80:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000013
                     0x0000000000000005 - 0x000000000000001a: DW_OP_reg0 EAX
                     0x000000000000001a - 0x0000000000000067: DW_OP_breg5 EBP-8)
                  DW_AT_abstract_origin	(cu + 0x169c "seid")

0x00000a89:     DW_TAG_variable
                  DW_AT_location	(0x00000032
                     0x0000000000000012 - 0x0000000000000027: DW_OP_reg1 ECX
                     0x000000000000004d - 0x0000000000000055: DW_OP_reg1 ECX
                     0x0000000000000055 - 0x0000000000000067: DW_OP_breg5 EBP-16)
                  DW_AT_abstract_origin	(cu + 0x16a7 "sep")

0x00000a92:     NULL

0x00000a93:   DW_TAG_subprogram
                DW_AT_name	("send_request")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                DW_AT_decl_line	(984)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_inline	(DW_INL_inlined)

0x00000aa0:     DW_TAG_formal_parameter
                  DW_AT_name	("session")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                  DW_AT_decl_line	(984)
                  DW_AT_type	(cu + 0x0ae9 "avdtp_t*")

0x00000aac:     DW_TAG_formal_parameter
                  DW_AT_name	("signal_id")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                  DW_AT_decl_line	(984)
                  DW_AT_type	(cu + 0x0138 "u8")

0x00000ab8:     DW_TAG_formal_parameter
                  DW_AT_name	("buffer")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                  DW_AT_decl_line	(984)
                  DW_AT_type	(cu + 0x028b "*")

0x00000ac4:     DW_TAG_formal_parameter
                  DW_AT_name	("size")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                  DW_AT_decl_line	(984)
                  DW_AT_type	(cu + 0x0037 "int")

0x00000ad0:     DW_TAG_variable
                  DW_AT_name	("send_buf_ptr")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                  DW_AT_decl_line	(986)
                  DW_AT_type	(cu + 0x0afa "avdtp_send_info*")

0x00000adc:     DW_TAG_variable
                  DW_AT_name	("t_send")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                  DW_AT_decl_line	(990)
                  DW_AT_type	(cu + 0x0aff "avdtp_send_info")

0x00000ae8:     NULL

0x00000ae9:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0aee "avdtp_t")

0x00000aee:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0143 "avdtp")
                DW_AT_name	("avdtp_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(345)

0x00000afa:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0aff "avdtp_send_info")

0x00000aff:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0b0b "_avdtp_send_info")
                DW_AT_name	("avdtp_send_info")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(312)

0x00000b0b:   DW_TAG_structure_type
                DW_AT_name	("_avdtp_send_info")
                DW_AT_byte_size	(0x80)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                DW_AT_decl_line	(309)

0x00000b14:     DW_TAG_member
                  DW_AT_name	("header")
                  DW_AT_type	(cu + 0x0781 "avdtp_single_header")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(310)
                  DW_AT_data_member_location	(0x00)

0x00000b21:     DW_TAG_member
                  DW_AT_name	("buf")
                  DW_AT_type	(cu + 0x0b2f "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avdtp.h")
                  DW_AT_decl_line	(311)
                  DW_AT_data_member_location	(0x02)

0x00000b2e:     NULL

0x00000b2f:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0138 "u8")

0x00000b34:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x00f4 "sizetype")
                  DW_AT_count	(0x7e)

0x00000b3a:     NULL

0x00000b3b:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000067)
                DW_AT_high_pc	(0x00000000000001b5)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("avdtp_discover_req")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                DW_AT_decl_line	(1036)
                DW_AT_prototyped	(true)
                DW_AT_external	(true)

0x00000b4d:     DW_TAG_formal_parameter
                  DW_AT_location	(0x0000005c
                     0x0000000000000067 - 0x0000000000000090: DW_OP_reg0 EAX
                     0x0000000000000090 - 0x00000000000001b5: DW_OP_breg5 EBP-140)
                  DW_AT_name	("session")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                  DW_AT_decl_line	(1036)
                  DW_AT_type	(cu + 0x0ae9 "avdtp_t*")

0x00000b5d:     DW_TAG_variable
                  DW_AT_location	(0x000000c7
                     0x0000000000000165 - 0x0000000000000192: DW_OP_breg5 EBP-140
                     0x0000000000000192 - 0x00000000000001a0: DW_OP_reg0 EAX
                     0x00000000000001a0 - 0x00000000000001a6: DW_OP_breg5 EBP-180
                     0x00000000000001a6 - 0x00000000000001a6: DW_OP_reg0 EAX
                     0x00000000000001a6 - 0x00000000000001b5: DW_OP_breg5 EBP-140)
                  DW_AT_name	("sep")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                  DW_AT_decl_line	(1038)
                  DW_AT_type	(cu + 0x02b0 "avdtp_local_sep*")

0x00000b6d:     DW_TAG_variable
                  DW_AT_name	("conn")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                  DW_AT_decl_line	(1039)
                  DW_AT_type	(cu + 0x0082 "a2dp_conn*")

0x00000b79:     DW_TAG_inlined_subroutine
                  DW_AT_abstract_origin	(cu + 0x0a93 "send_request")
                  DW_AT_low_pc	(0x00000000000000fd)
                  DW_AT_high_pc	(0x0000000000000165)
                  DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                  DW_AT_call_line	(1048)

0x00000b89:       DW_TAG_formal_parameter
                    DW_AT_location	(0x0000009c
                       0x0000000000000139 - 0x00000000000001b5: DW_OP_consts +0, DW_OP_stack_value)
                    DW_AT_abstract_origin	(cu + 0x0ac4 "size")

0x00000b92:       DW_TAG_variable
                    DW_AT_location	(0x0000007c
                       0x00000000000000ff - 0x0000000000000118: DW_OP_reg0 EAX
                       0x0000000000000118 - 0x00000000000001b5: DW_OP_breg5 EBP-160)
                    DW_AT_abstract_origin	(cu + 0x0ad0 "send_buf_ptr")

0x00000b9b:       DW_TAG_variable
                    DW_AT_location	(0x000000b1
                       0x0000000000000139 - 0x00000000000001b5: DW_OP_breg5 EBP-160, DW_OP_deref)
                    DW_AT_abstract_origin	(cu + 0x0adc "t_send")

0x00000ba4:       NULL

0x00000ba5:     NULL

0x00000ba6:   DW_TAG_subprogram
                DW_AT_low_pc	(0x00000000000001b5)
                DW_AT_high_pc	(0x0000000000000278)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("avdtp_start_req")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                DW_AT_decl_line	(1058)
                DW_AT_prototyped	(true)
                DW_AT_external	(true)

0x00000bb8:     DW_TAG_formal_parameter
                  DW_AT_location	(0x0000010c
                     0x00000000000001b5 - 0x00000000000001e1: DW_OP_reg0 EAX
                     0x00000000000001e1 - 0x0000000000000278: DW_OP_breg5 EBP-148)
                  DW_AT_name	("session")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                  DW_AT_decl_line	(1058)
                  DW_AT_type	(cu + 0x0ae9 "avdtp_t*")

0x00000bc8:     DW_TAG_inlined_subroutine
                  DW_AT_abstract_origin	(cu + 0x0a93 "send_request")
                  DW_AT_low_pc	(0x00000000000001e5)
                  DW_AT_high_pc	(0x000000000000026d)
                  DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                  DW_AT_call_line	(1061)

0x00000bd8:       DW_TAG_formal_parameter
                    DW_AT_location	(0x0000014c
                       0x000000000000023d - 0x0000000000000278: DW_OP_consts +1, DW_OP_stack_value)
                    DW_AT_abstract_origin	(cu + 0x0ac4 "size")

0x00000be1:       DW_TAG_variable
                    DW_AT_location	(0x0000012c
                       0x00000000000001ed - 0x000000000000020c: DW_OP_reg1 ECX
                       0x000000000000020c - 0x0000000000000278: DW_OP_breg5 EBP-160)
                    DW_AT_abstract_origin	(cu + 0x0ad0 "send_buf_ptr")

0x00000bea:       DW_TAG_variable
                    DW_AT_location	(0x00000161
                       0x000000000000023d - 0x0000000000000278: DW_OP_breg5 EBP-160, DW_OP_deref)
                    DW_AT_abstract_origin	(cu + 0x0adc "t_send")

0x00000bf3:       NULL

0x00000bf4:     NULL

0x00000bf5:   DW_TAG_subprogram
                DW_AT_name	("avdtp_suspend_response")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                DW_AT_decl_line	(1340)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0280 "bool")
                DW_AT_inline	(DW_INL_inlined)

0x00000c02:     DW_TAG_formal_parameter
                  DW_AT_name	("session")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                  DW_AT_decl_line	(1340)
                  DW_AT_type	(cu + 0x0ae9 "avdtp_t*")

0x00000c0e:     DW_TAG_formal_parameter
                  DW_AT_name	("packet")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                  DW_AT_decl_line	(1340)
                  DW_AT_type	(cu + 0x028c "u8*")

0x00000c1a:     DW_TAG_formal_parameter
                  DW_AT_name	("size")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                  DW_AT_decl_line	(1340)
                  DW_AT_type	(cu + 0x05d6 "u32")

0x00000c26:     DW_TAG_variable
                  DW_AT_name	("local_sep")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                  DW_AT_decl_line	(1342)
                  DW_AT_type	(cu + 0x02b0 "avdtp_local_sep*")

0x00000c32:     NULL

0x00000c33:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000278)
                DW_AT_high_pc	(0x0000000000000365)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("avdtp_suspend_req")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                DW_AT_decl_line	(1068)
                DW_AT_prototyped	(true)
                DW_AT_external	(true)

0x00000c45:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000177
                     0x0000000000000278 - 0x00000000000002a4: DW_OP_reg0 EAX
                     0x00000000000002a4 - 0x0000000000000365: DW_OP_breg5 EBP-148)
                  DW_AT_name	("session")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                  DW_AT_decl_line	(1068)
                  DW_AT_type	(cu + 0x0ae9 "avdtp_t*")

0x00000c55:     DW_TAG_inlined_subroutine
                  DW_AT_abstract_origin	(cu + 0x0a93 "send_request")
                  DW_AT_low_pc	(0x00000000000002a8)
                  DW_AT_high_pc	(0x0000000000000330)
                  DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                  DW_AT_call_line	(1071)

0x00000c65:       DW_TAG_formal_parameter
                    DW_AT_location	(0x000001b7
                       0x0000000000000300 - 0x0000000000000365: DW_OP_consts +1, DW_OP_stack_value)
                    DW_AT_abstract_origin	(cu + 0x0ac4 "size")

0x00000c6e:       DW_TAG_variable
                    DW_AT_location	(0x00000197
                       0x00000000000002b0 - 0x00000000000002cf: DW_OP_reg1 ECX
                       0x00000000000002cf - 0x0000000000000365: DW_OP_breg5 EBP-160)
                    DW_AT_abstract_origin	(cu + 0x0ad0 "send_buf_ptr")

0x00000c77:       DW_TAG_variable
                    DW_AT_location	(0x000001cc
                       0x0000000000000300 - 0x0000000000000365: DW_OP_breg5 EBP-160, DW_OP_deref)
                    DW_AT_abstract_origin	(cu + 0x0adc "t_send")

0x00000c80:       NULL

0x00000c81:     DW_TAG_inlined_subroutine
                  DW_AT_abstract_origin	(cu + 0x0bf5 "avdtp_suspend_response")
                  DW_AT_low_pc	(0x0000000000000330)
                  DW_AT_high_pc	(0x0000000000000354)
                  DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                  DW_AT_call_line	(1075)

0x00000c91:       DW_TAG_formal_parameter
                    DW_AT_const_value	(0)
                    DW_AT_abstract_origin	(cu + 0x0c1a "size")

0x00000c97:       DW_TAG_variable
                    DW_AT_location	(0x000001e2
                       0x0000000000000339 - 0x0000000000000354: DW_OP_reg2 EDX)
                    DW_AT_abstract_origin	(cu + 0x0c26 "local_sep")

0x00000ca0:       NULL

0x00000ca1:     NULL

0x00000ca2:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000365)
                DW_AT_high_pc	(0x0000000000000428)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("avdtp_close_req")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                DW_AT_decl_line	(1079)
                DW_AT_prototyped	(true)
                DW_AT_external	(true)

0x00000cb4:     DW_TAG_formal_parameter
                  DW_AT_location	(0x000001f5
                     0x0000000000000365 - 0x0000000000000391: DW_OP_reg0 EAX
                     0x0000000000000391 - 0x0000000000000428: DW_OP_breg5 EBP-148)
                  DW_AT_name	("session")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                  DW_AT_decl_line	(1079)
                  DW_AT_type	(cu + 0x0ae9 "avdtp_t*")

0x00000cc4:     DW_TAG_inlined_subroutine
                  DW_AT_abstract_origin	(cu + 0x0a93 "send_request")
                  DW_AT_low_pc	(0x0000000000000395)
                  DW_AT_high_pc	(0x000000000000041d)
                  DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                  DW_AT_call_line	(1082)

0x00000cd4:       DW_TAG_formal_parameter
                    DW_AT_location	(0x00000235
                       0x00000000000003ed - 0x0000000000000428: DW_OP_consts +1, DW_OP_stack_value)
                    DW_AT_abstract_origin	(cu + 0x0ac4 "size")

0x00000cdd:       DW_TAG_variable
                    DW_AT_location	(0x00000215
                       0x000000000000039d - 0x00000000000003bc: DW_OP_reg1 ECX
                       0x00000000000003bc - 0x0000000000000428: DW_OP_breg5 EBP-160)
                    DW_AT_abstract_origin	(cu + 0x0ad0 "send_buf_ptr")

0x00000ce6:       DW_TAG_variable
                    DW_AT_location	(0x0000024a
                       0x00000000000003ed - 0x0000000000000428: DW_OP_breg5 EBP-160, DW_OP_deref)
                    DW_AT_abstract_origin	(cu + 0x0adc "t_send")

0x00000cef:       NULL

0x00000cf0:     NULL

0x00000cf1:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000428)
                DW_AT_high_pc	(0x0000000000000515)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("avdtp_abort_req")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                DW_AT_decl_line	(1088)
                DW_AT_prototyped	(true)
                DW_AT_external	(true)

0x00000d03:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000260
                     0x0000000000000428 - 0x0000000000000449: DW_OP_reg0 EAX
                     0x0000000000000449 - 0x0000000000000515: DW_OP_breg5 EBP-148)
                  DW_AT_name	("session")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                  DW_AT_decl_line	(1088)
                  DW_AT_type	(cu + 0x0ae9 "avdtp_t*")

0x00000d13:     DW_TAG_inlined_subroutine
                  DW_AT_abstract_origin	(cu + 0x0a93 "send_request")
                  DW_AT_low_pc	(0x0000000000000484)
                  DW_AT_high_pc	(0x000000000000050a)
                  DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                  DW_AT_call_line	(1091)

0x00000d23:       DW_TAG_formal_parameter
                    DW_AT_location	(0x00000295
                       0x00000000000004da - 0x0000000000000515: DW_OP_consts +1, DW_OP_stack_value)
                    DW_AT_abstract_origin	(cu + 0x0ac4 "size")

0x00000d2c:       DW_TAG_variable
                    DW_AT_location	(0x00000280
                       0x000000000000048a - 0x0000000000000515: DW_OP_breg5 EBP-156)
                    DW_AT_abstract_origin	(cu + 0x0ad0 "send_buf_ptr")

0x00000d35:       DW_TAG_variable
                    DW_AT_location	(0x000002aa
                       0x00000000000004da - 0x0000000000000515: DW_OP_breg5 EBP-156, DW_OP_deref)
                    DW_AT_abstract_origin	(cu + 0x0adc "t_send")

0x00000d3e:       NULL

0x00000d3f:     NULL

0x00000d40:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000515)
                DW_AT_high_pc	(0x00000000000005d8)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("avdtp_get_configuation_req")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avdtp.c")
                DW_AT_decl_line	(1097)
                DW_AT_prototyped	(true)
                DW_AT_external	(true)

0x00000d52:     DW_TAG_formal_parameter
                  DW_AT_location	(0x000002c0
