; ModuleID = 'avrcp.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avrcp.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.user_interface_handler = type { void (i8*, i32, i32)*, void (i8, i8*, i8*)*, void (i8*, i32)*, i32 ()*, void (i8, i16, i8*, i16)*, void (i8*, i32, i32, i8)*, i32 ()*, void (i32)*, void (i8, i32, i8*, i16)*, i32 (i8*, i8, i8)*, void ()*, void (i8)*, i8 (i8*, i8, i8*, i32, i8)*, void (i8, i16, i8*, i16)*, i32 ()* }
%struct.respone_pdu_handler = type { i8, i8, i8 (%struct.avctp*, i8, i8, i8*, i32)* }
%struct.avctp = type { [6 x i8], i16, i8, %struct.control_pdu_handler*, %struct.respone_pdu_handler*, %struct.avrcp_core_data_t }
%struct.control_pdu_handler = type { i8, i8, i8 (%struct.avctp*, %struct.avrcp_header*, i8)* }
%struct.avrcp_header = type <{ [3 x i8], i8, i8, i16, [0 x i8] }>
%struct.avrcp_core_data_t = type { i32, i8, i8, [5 x i8], i8, i8, [3 x i8], i8, i8, [9 x i8], [14 x %struct.avrcp_event_info] }
%struct.avrcp_event_info = type { i8 }

@app_info_debug_enable = weak hidden local_unnamed_addr global i32 0, align 4, !dbg !0
@user_interface = external local_unnamed_addr global %struct.user_interface_handler*, align 4
@l2cap_debug_enable = external local_unnamed_addr global i8, align 1
@.str = private unnamed_addr constant [28 x i8] c"<BT-log> :Unknown event %u\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "app_info_debug_enable", scope: !2, file: !164, line: 190, type: !151, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !45, globals: !54)
!3 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avrcp.c", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!4 = !{!5, !13, !32, !40}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 209, size: 32, elements: !7)
!6 = !DIFile(filename: "../btstack/Profile/include/bredr/avctp.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!7 = !{!8, !9, !10, !11, !12}
!8 = !DIEnumerator(name: "AVCTP_STATE_DISCONNECTED", value: 0)
!9 = !DIEnumerator(name: "AVCTP_STATE_CONNECTING", value: 1)
!10 = !DIEnumerator(name: "AVCTP_STATE_CONNECTED", value: 2)
!11 = !DIEnumerator(name: "AVCTP_STATE_BROWSING_CONNECTING", value: 3)
!12 = !DIEnumerator(name: "AVCTP_STATE_BROWSING_CONNECTED", value: 4)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 217, size: 32, elements: !14)
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!15 = !DIEnumerator(name: "AVCTP_CMD_GET_CAPABILITIES", value: 0)
!16 = !DIEnumerator(name: "AVCTP_CMD_REGISTER_EVENT_STATUS", value: 1)
!17 = !DIEnumerator(name: "AVCTP_CMD_REGISTER_EVENT_TRACK", value: 2)
!18 = !DIEnumerator(name: "AVCTP_CMD_REGISTER_EVENT_SETTING", value: 3)
!19 = !DIEnumerator(name: "AVCTP_CMD_REGISTER_EVENT_LIST_ATTR", value: 4)
!20 = !DIEnumerator(name: "AVCTP_CMD_REGISTER_EVENT_SET_REP", value: 5)
!21 = !DIEnumerator(name: "AVCTP_CMD_REGISTER_EVENT_SET_SHUFFLE", value: 6)
!22 = !DIEnumerator(name: "AVCTP_CMD_REGISTER_EVENT_VOL_CHANGED", value: 7)
!23 = !DIEnumerator(name: "AVCTP_CMD_REGISTER_EVENT_STATUS_CHANGED", value: 8)
!24 = !DIEnumerator(name: "AVCTP_CMD_REGISTER_EVENT_PLAYBACK_POS", value: 9)
!25 = !DIEnumerator(name: "AVCTP_CMD_REGISTER_SEEK_RELEASE", value: 10)
!26 = !DIEnumerator(name: "AVCTP_CMD_REGISTER_GET_PLAY_STATUS", value: 11)
!27 = !DIEnumerator(name: "AVCTP_CMD_REGISTER_GET_MUSIC_INFO", value: 12)
!28 = !DIEnumerator(name: "AVCTP_CMD_REGISTER_BQB_VOL_CHANGED", value: 13)
!29 = !DIEnumerator(name: "AVCTP_CMD_CONNECT_A2DP_MEDIA", value: 14)
!30 = !DIEnumerator(name: "AVCTP_RESPONSE_ERROR_TYPE_1", value: 15)
!31 = !DIEnumerator(name: "AVCTP_CMD_MAX_OP_VALUE", value: 16)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 157, size: 32, elements: !34)
!33 = !DIFile(filename: "../btstack/Profile/include/bredr/a2dp.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!34 = !{!35, !36, !37, !38, !39}
!35 = !DIEnumerator(name: "A2DP_STATUS_IDLE", value: 0)
!36 = !DIEnumerator(name: "A2DP_STATUS_STARTING", value: 1)
!37 = !DIEnumerator(name: "A2DP_STATUS_SUSPENDING", value: 2)
!38 = !DIEnumerator(name: "A2DP_STATUS_FWD_SEEK", value: 3)
!39 = !DIEnumerator(name: "A2DP_STATUS_REV_SEEK", value: 4)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 65, size: 32, elements: !42)
!41 = !DIFile(filename: "../btstack/Profile/include/bredr/profile_common.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!42 = !{!43, !44}
!43 = !DIEnumerator(name: "AVCTP_INDSTA_CTRL_STA_CHANGED", value: 16)
!44 = !DIEnumerator(name: "AVCTP_INDSTA_MAX", value: 17)
!45 = !{!46, !47, !50, !52}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !48, line: 48, baseType: !49)
!48 = !DIFile(filename: "../btcommon/typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!49 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !48, line: 46, baseType: !51)
!51 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !48, line: 44, baseType: !53)
!53 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!54 = !{!0, !55, !154, !159}
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "arp_deal_respone_handlers", scope: !2, file: !3, line: 779, type: !57, isLocal: true, isDefinition: true)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 512, elements: !152)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "respone_pdu_handler", file: !6, line: 252, size: 64, elements: !60)
!60 = !{!61, !63, !64}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "pdu_id", scope: !59, file: !6, line: 253, baseType: !62, size: 8)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !48, line: 44, baseType: !53)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !59, file: !6, line: 254, baseType: !62, size: 8, offset: 8)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !59, file: !6, line: 255, baseType: !65, size: 32, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32)
!66 = !DISubroutineType(types: !67)
!67 = !{!62, !68, !62, !62, !150, !151}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 32)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "avctp", file: !6, line: 296, size: 512, elements: !70)
!70 = !{!71, !77, !79, !80, !106, !108}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "dev_addr", scope: !69, file: !6, line: 297, baseType: !72, size: 48)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_addr_t", file: !73, line: 66, baseType: !74)
!73 = !DIFile(filename: "../btcommon/utils.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 48, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 6)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "control_cid", scope: !69, file: !6, line: 298, baseType: !78, size: 16, offset: 48)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !48, line: 46, baseType: !51)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "avctp_conn_cnt", scope: !69, file: !6, line: 299, baseType: !52, size: 8, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "arp_control_handlers", scope: !69, file: !6, line: 300, baseType: !81, size: 32, offset: 96)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_pdu_handler", file: !6, line: 246, size: 64, elements: !84)
!84 = !{!85, !86, !87}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "pdu_id", scope: !83, file: !6, line: 247, baseType: !62, size: 8)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !83, file: !6, line: 248, baseType: !62, size: 8, offset: 8)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !83, file: !6, line: 249, baseType: !88, size: 32, offset: 32)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 32)
!89 = !DISubroutineType(types: !90)
!90 = !{!62, !68, !91, !62}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 32)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "avrcp_header", file: !3, line: 95, size: 56, elements: !93)
!93 = !{!94, !98, !99, !100, !101, !102}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "company_id", scope: !92, file: !3, line: 96, baseType: !95, size: 24)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 24, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 3)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "pdu_id", scope: !92, file: !3, line: 97, baseType: !62, size: 8, offset: 24)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "packet_type", scope: !92, file: !3, line: 98, baseType: !62, size: 2, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd", scope: !92, file: !3, line: 99, baseType: !62, size: 6, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "params_len", scope: !92, file: !3, line: 100, baseType: !50, size: 16, offset: 40)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !92, file: !3, line: 101, baseType: !103, offset: 56)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 0)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "arp_respone_handlers", scope: !69, file: !6, line: 301, baseType: !107, size: 32, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "acp_core_data", scope: !69, file: !6, line: 306, baseType: !109, size: 352, offset: 160)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "avrcp_core_data_t", file: !6, line: 294, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 274, size: 352, elements: !111)
!111 = !{!112, !114, !115, !116, !120, !121, !122, !123, !125, !127, !128, !129, !130, !131, !132, !133, !134, !135, !139}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "pending_cmd", scope: !110, file: !6, line: 275, baseType: !113, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !48, line: 48, baseType: !49)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "pending_release_cnt", scope: !110, file: !6, line: 276, baseType: !62, size: 8, offset: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "pending_release_cmd", scope: !110, file: !6, line: 277, baseType: !62, size: 8, offset: 40)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "remote_player_setting_attr_value", scope: !110, file: !6, line: 278, baseType: !117, size: 40, offset: 48)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 40, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 5)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "remote_player_setting_cnt", scope: !110, file: !6, line: 279, baseType: !62, size: 8, offset: 88)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "remote_player_setting_attr", scope: !110, file: !6, line: 280, baseType: !62, size: 8, offset: 96)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "remote_transaction", scope: !110, file: !6, line: 281, baseType: !62, size: 4, offset: 104, flags: DIFlagBitField, extraData: i64 104)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !110, file: !6, line: 282, baseType: !124, size: 3, offset: 108, flags: DIFlagBitField, extraData: i64 104)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "avctp_state_t", file: !6, line: 215, baseType: !5)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "initiator", scope: !110, file: !6, line: 283, baseType: !126, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 104)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !48, line: 44, baseType: !53)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "pre_sta", scope: !110, file: !6, line: 284, baseType: !52, size: 3, offset: 112, flags: DIFlagBitField, extraData: i64 104)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "a2dp_play_sta", scope: !110, file: !6, line: 285, baseType: !52, size: 3, offset: 115, flags: DIFlagBitField, extraData: i64 104)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "is_play_have_sent", scope: !110, file: !6, line: 286, baseType: !126, size: 1, offset: 118, flags: DIFlagBitField, extraData: i64 104)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "is_inuse", scope: !110, file: !6, line: 287, baseType: !126, size: 1, offset: 119, flags: DIFlagBitField, extraData: i64 104)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "pos_read", scope: !110, file: !6, line: 288, baseType: !52, size: 4, offset: 120, flags: DIFlagBitField, extraData: i64 104)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "pos_write", scope: !110, file: !6, line: 289, baseType: !52, size: 4, offset: 124, flags: DIFlagBitField, extraData: i64 104)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "avrcp_volume", scope: !110, file: !6, line: 290, baseType: !52, size: 8, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "avctp_send_buf_len", scope: !110, file: !6, line: 291, baseType: !52, size: 8, offset: 136)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "avctp_opid_buf", scope: !110, file: !6, line: 292, baseType: !136, size: 72, offset: 144)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 72, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 9)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "avrcp_event", scope: !110, file: !6, line: 293, baseType: !140, size: 112, offset: 216)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 112, elements: !148)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "avrcp_event_info", file: !6, line: 263, size: 8, elements: !142)
!142 = !{!143, !144, !145, !146, !147}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "supported_events", scope: !141, file: !6, line: 264, baseType: !62, size: 1, flags: DIFlagBitField, extraData: i64 0)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "registered_events", scope: !141, file: !6, line: 265, baseType: !62, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "remote_supported_events", scope: !141, file: !6, line: 266, baseType: !62, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "remote_registered_events", scope: !141, file: !6, line: 267, baseType: !62, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "transaction_events", scope: !141, file: !6, line: 268, baseType: !62, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!148 = !{!149}
!149 = !DISubrange(count: 14)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 32)
!151 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!152 = !{!153}
!153 = !DISubrange(count: 8)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "arp_control_handlers", scope: !2, file: !3, line: 1084, type: !156, isLocal: true, isDefinition: true)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 448, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 7)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "arp_company_ids", scope: !2, file: !3, line: 955, type: !161, isLocal: true, isDefinition: true)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 32, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 1)
!164 = !DIFile(filename: "../btcommon/profile_stack_debug.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!165 = !{i32 2, !"Dwarf Version", i32 4}
!166 = !{i32 2, !"Debug Info Version", i32 3}
!167 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!168 = distinct !DISubprogram(name: "avrcp_player_event", scope: !3, file: !3, line: 156, type: !169, isLocal: false, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !173)
!169 = !DISubroutineType(types: !170)
!170 = !{!151, !68, !62, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!173 = !{!174, !175, !176, !177, !181, !182, !183}
!174 = !DILocalVariable(name: "conn", arg: 1, scope: !168, file: !3, line: 156, type: !68)
!175 = !DILocalVariable(name: "id", arg: 2, scope: !168, file: !3, line: 156, type: !62)
!176 = !DILocalVariable(name: "data", arg: 3, scope: !168, file: !3, line: 157, type: !171)
!177 = !DILocalVariable(name: "buf", scope: !168, file: !3, line: 159, type: !178)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 128, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 16)
!181 = !DILocalVariable(name: "pdu", scope: !168, file: !3, line: 160, type: !91)
!182 = !DILocalVariable(name: "size", scope: !168, file: !3, line: 161, type: !50)
!183 = !DILocalVariable(name: "err", scope: !168, file: !3, line: 162, type: !151)
!184 = !DILocation(line: 156, column: 38, scope: !168)
!185 = !DILocation(line: 156, column: 52, scope: !168)
!186 = !DILocation(line: 157, column: 34, scope: !168)
!187 = !DILocation(line: 159, column: 5, scope: !168)
!188 = !DILocation(line: 159, column: 13, scope: !168)
!189 = !DILocation(line: 162, column: 9, scope: !168)
!190 = !DILocation(line: 164, column: 14, scope: !191)
!191 = distinct !DILexicalBlock(scope: !168, file: !3, line: 164, column: 9)
!192 = !DILocation(line: 164, column: 9, scope: !168)
!193 = !DILocation(line: 168, column: 11, scope: !194)
!194 = distinct !DILexicalBlock(scope: !168, file: !3, line: 168, column: 9)
!195 = !DILocation(line: 168, column: 47, scope: !194)
!196 = !DILocation(line: 168, column: 10, scope: !194)
!197 = !DILocation(line: 168, column: 9, scope: !168)
!198 = !DILocalVariable(name: "cid", arg: 1, scope: !199, file: !3, line: 146, type: !150)
!199 = distinct !DISubprogram(name: "set_company_id", scope: !3, file: !3, line: 146, type: !200, isLocal: true, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !203)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !150, !202}
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
