temp.o:	file format ELF32-i386

.debug_info contents:
0x00000000: Compile Unit: length = 0x0000121f version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x00001223)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)")
              DW_AT_language	(DW_LANG_C99)
              DW_AT_name	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avrcp.c")
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
              DW_AT_GNU_pubnames	(true)
              DW_AT_low_pc	(0x0000000000000000)
              DW_AT_high_pc	(0x0000000000001971)

0x00000026:   DW_TAG_variable
                DW_AT_name	("app_info_debug_enable")
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/profile_stack_debug.h")
                DW_AT_decl_line	(190)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000037:   DW_TAG_base_type
                DW_AT_name	("int")
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_byte_size	(0x04)

0x0000003e:   DW_TAG_variable
                DW_AT_name	("arp_deal_respone_handlers")
                DW_AT_type	(cu + 0x0050 "const respone_pdu_handler[]")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avrcp.c")
                DW_AT_decl_line	(779)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000050:   DW_TAG_array_type
                DW_AT_type	(cu + 0x005c "const respone_pdu_handler")

0x00000055:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0138 "sizetype")
                  DW_AT_count	(0x08)

0x0000005b:     NULL

0x0000005c:   DW_TAG_const_type
                DW_AT_type	(cu + 0x0061 "respone_pdu_handler")

0x00000061:   DW_TAG_structure_type
                DW_AT_name	("respone_pdu_handler")
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                DW_AT_decl_line	(252)

0x00000069:     DW_TAG_member
                  DW_AT_name	("pdu_id")
                  DW_AT_type	(cu + 0x008e "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(253)
                  DW_AT_data_member_location	(0x00)

0x00000075:     DW_TAG_member
                  DW_AT_name	("code")
                  DW_AT_type	(cu + 0x008e "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(254)
                  DW_AT_data_member_location	(0x01)

0x00000081:     DW_TAG_member
                  DW_AT_name	("func")
                  DW_AT_type	(cu + 0x00a0 "subroutine uint8_t*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(255)
                  DW_AT_data_member_location	(0x04)

0x0000008d:     NULL

0x0000008e:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0099 "unsigned char")
                DW_AT_name	("uint8_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(44)

0x00000099:   DW_TAG_base_type
                DW_AT_name	("unsigned char")
                DW_AT_encoding	(DW_ATE_unsigned_char)
                DW_AT_byte_size	(0x01)

0x000000a0:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x00a5 "subroutine uint8_t")

0x000000a5:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x008e "uint8_t")
                DW_AT_prototyped	(true)

0x000000aa:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x00c4 "avctp*")

0x000000af:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x008e "uint8_t")

0x000000b4:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x008e "uint8_t")

0x000000b9:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x041e "uint8_t*")

0x000000be:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0037 "int")

0x000000c3:     NULL

0x000000c4:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x00c9 "avctp")

0x000000c9:   DW_TAG_structure_type
                DW_AT_name	("avctp")
                DW_AT_byte_size	(0x40)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                DW_AT_decl_line	(296)

0x000000d2:     DW_TAG_member
                  DW_AT_name	("dev_addr")
                  DW_AT_type	(cu + 0x0121 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(297)
                  DW_AT_data_member_location	(0x00)

0x000000df:     DW_TAG_member
                  DW_AT_name	("control_cid")
                  DW_AT_type	(cu + 0x013f "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(298)
                  DW_AT_data_member_location	(0x06)

0x000000ec:     DW_TAG_member
                  DW_AT_name	("avctp_conn_cnt")
                  DW_AT_type	(cu + 0x0151 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(299)
                  DW_AT_data_member_location	(0x08)

0x000000f9:     DW_TAG_member
                  DW_AT_name	("arp_control_handlers")
                  DW_AT_type	(cu + 0x015c "const control_pdu_handler*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(300)
                  DW_AT_data_member_location	(0x0c)

0x00000106:     DW_TAG_member
                  DW_AT_name	("arp_respone_handlers")
                  DW_AT_type	(cu + 0x022c "const respone_pdu_handler*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(301)
                  DW_AT_data_member_location	(0x10)

0x00000113:     DW_TAG_member
                  DW_AT_name	("acp_core_data")
                  DW_AT_type	(cu + 0x0231 "avrcp_core_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(306)
                  DW_AT_data_member_location	(0x14)

0x00000120:     NULL

0x00000121:   DW_TAG_typedef
                DW_AT_type	(cu + 0x012c "uint8_t[]")
                DW_AT_name	("bd_addr_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/utils.h")
                DW_AT_decl_line	(66)

0x0000012c:   DW_TAG_array_type
                DW_AT_type	(cu + 0x008e "uint8_t")

0x00000131:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0138 "sizetype")
                  DW_AT_count	(0x06)

0x00000137:     NULL

0x00000138:   DW_TAG_base_type
                DW_AT_name	("sizetype")
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_unsigned)

0x0000013f:   DW_TAG_typedef
                DW_AT_type	(cu + 0x014a "unsigned short")
                DW_AT_name	("u16")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(46)

0x0000014a:   DW_TAG_base_type
                DW_AT_name	("unsigned short")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x02)

0x00000151:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0099 "unsigned char")
                DW_AT_name	("u8")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(44)

0x0000015c:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0161 "const control_pdu_handler")

0x00000161:   DW_TAG_const_type
                DW_AT_type	(cu + 0x0166 "control_pdu_handler")

0x00000166:   DW_TAG_structure_type
                DW_AT_name	("control_pdu_handler")
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                DW_AT_decl_line	(246)

0x0000016e:     DW_TAG_member
                  DW_AT_name	("pdu_id")
                  DW_AT_type	(cu + 0x008e "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(247)
                  DW_AT_data_member_location	(0x00)

0x0000017a:     DW_TAG_member
                  DW_AT_name	("code")
                  DW_AT_type	(cu + 0x008e "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(248)
                  DW_AT_data_member_location	(0x01)

0x00000186:     DW_TAG_member
                  DW_AT_name	("func")
                  DW_AT_type	(cu + 0x0193 "subroutine uint8_t*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(249)
                  DW_AT_data_member_location	(0x04)

0x00000192:     NULL

0x00000193:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0198 "subroutine uint8_t")

0x00000198:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x008e "uint8_t")
                DW_AT_prototyped	(true)

0x0000019d:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x00c4 "avctp*")

0x000001a2:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x01ad "avrcp_header*")

0x000001a7:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x008e "uint8_t")

0x000001ac:     NULL

0x000001ad:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x01b2 "avrcp_header")

0x000001b2:   DW_TAG_structure_type
                DW_AT_name	("avrcp_header")
                DW_AT_byte_size	(0x07)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avrcp.c")
                DW_AT_decl_line	(95)

0x000001ba:     DW_TAG_member
                  DW_AT_name	("company_id")
                  DW_AT_type	(cu + 0x0209 "uint8_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avrcp.c")
                  DW_AT_decl_line	(96)
                  DW_AT_data_member_location	(0x00)

0x000001c6:     DW_TAG_member
                  DW_AT_name	("pdu_id")
                  DW_AT_type	(cu + 0x008e "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avrcp.c")
                  DW_AT_decl_line	(97)
                  DW_AT_data_member_location	(0x03)

0x000001d2:     DW_TAG_member
                  DW_AT_name	("packet_type")
                  DW_AT_type	(cu + 0x008e "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avrcp.c")
                  DW_AT_decl_line	(98)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x06)
                  DW_AT_data_member_location	(0x04)

0x000001e1:     DW_TAG_member
                  DW_AT_name	("rsvd")
                  DW_AT_type	(cu + 0x008e "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avrcp.c")
                  DW_AT_decl_line	(99)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x06)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x04)

0x000001f0:     DW_TAG_member
                  DW_AT_name	("params_len")
                  DW_AT_type	(cu + 0x0215 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avrcp.c")
                  DW_AT_decl_line	(100)
                  DW_AT_data_member_location	(0x05)

0x000001fc:     DW_TAG_member
                  DW_AT_name	("params")
                  DW_AT_type	(cu + 0x0220 "uint8_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avrcp.c")
                  DW_AT_decl_line	(101)
                  DW_AT_data_member_location	(0x07)

0x00000208:     NULL

0x00000209:   DW_TAG_array_type
                DW_AT_type	(cu + 0x008e "uint8_t")

0x0000020e:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0138 "sizetype")
                  DW_AT_count	(0x03)

0x00000214:     NULL

0x00000215:   DW_TAG_typedef
                DW_AT_type	(cu + 0x014a "unsigned short")
                DW_AT_name	("uint16_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(46)

0x00000220:   DW_TAG_array_type
                DW_AT_type	(cu + 0x008e "uint8_t")

0x00000225:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0138 "sizetype")
                  DW_AT_count	(0x00)

0x0000022b:     NULL

0x0000022c:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x005c "const respone_pdu_handler")

0x00000231:   DW_TAG_typedef
                DW_AT_type	(cu + 0x023d "structure ")
                DW_AT_name	("avrcp_core_data_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                DW_AT_decl_line	(294)

0x0000023d:   DW_TAG_structure_type
                DW_AT_byte_size	(0x2c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                DW_AT_decl_line	(274)

0x00000242:     DW_TAG_member
                  DW_AT_name	("pending_cmd")
                  DW_AT_type	(cu + 0x0355 "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(275)
                  DW_AT_data_member_location	(0x00)

0x0000024f:     DW_TAG_member
                  DW_AT_name	("pending_release_cnt")
                  DW_AT_type	(cu + 0x008e "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(276)
                  DW_AT_data_member_location	(0x04)

0x0000025c:     DW_TAG_member
                  DW_AT_name	("pending_release_cmd")
                  DW_AT_type	(cu + 0x008e "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(277)
                  DW_AT_data_member_location	(0x05)

0x00000269:     DW_TAG_member
                  DW_AT_name	("remote_player_setting_attr_value")
                  DW_AT_type	(cu + 0x0367 "uint8_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(278)
                  DW_AT_data_member_location	(0x06)

0x00000276:     DW_TAG_member
                  DW_AT_name	("remote_player_setting_cnt")
                  DW_AT_type	(cu + 0x008e "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(279)
                  DW_AT_data_member_location	(0x0b)

0x00000283:     DW_TAG_member
                  DW_AT_name	("remote_player_setting_attr")
                  DW_AT_type	(cu + 0x008e "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(280)
                  DW_AT_data_member_location	(0x0c)

0x00000290:     DW_TAG_member
                  DW_AT_name	("remote_transaction")
                  DW_AT_type	(cu + 0x008e "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(281)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x0d)

0x000002a0:     DW_TAG_member
                  DW_AT_name	("state")
                  DW_AT_type	(cu + 0x0373 "avctp_state_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(282)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x03)
                  DW_AT_bit_offset	(0x11)
                  DW_AT_data_member_location	(0x0c)

0x000002b0:     DW_TAG_member
                  DW_AT_name	("initiator")
                  DW_AT_type	(cu + 0x03a1 "bool")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(283)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x0d)

0x000002c0:     DW_TAG_member
                  DW_AT_name	("pre_sta")
                  DW_AT_type	(cu + 0x0151 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(284)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x03)
                  DW_AT_bit_offset	(0x05)
                  DW_AT_data_member_location	(0x0e)

0x000002d0:     DW_TAG_member
                  DW_AT_name	("a2dp_play_sta")
                  DW_AT_type	(cu + 0x0151 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(285)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x03)
                  DW_AT_bit_offset	(0x02)
                  DW_AT_data_member_location	(0x0e)

0x000002e0:     DW_TAG_member
                  DW_AT_name	("is_play_have_sent")
                  DW_AT_type	(cu + 0x03a1 "bool")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(286)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x01)
                  DW_AT_data_member_location	(0x0e)

0x000002f0:     DW_TAG_member
                  DW_AT_name	("is_inuse")
                  DW_AT_type	(cu + 0x03a1 "bool")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(287)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x0e)

0x00000300:     DW_TAG_member
                  DW_AT_name	("pos_read")
                  DW_AT_type	(cu + 0x0151 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(288)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x0f)

0x00000310:     DW_TAG_member
                  DW_AT_name	("pos_write")
                  DW_AT_type	(cu + 0x0151 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(289)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x0f)

0x00000320:     DW_TAG_member
                  DW_AT_name	("avrcp_volume")
                  DW_AT_type	(cu + 0x0151 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(290)
                  DW_AT_data_member_location	(0x10)

0x0000032d:     DW_TAG_member
                  DW_AT_name	("avctp_send_buf_len")
                  DW_AT_type	(cu + 0x0151 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(291)
                  DW_AT_data_member_location	(0x11)

0x0000033a:     DW_TAG_member
                  DW_AT_name	("avctp_opid_buf")
                  DW_AT_type	(cu + 0x03ac "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(292)
                  DW_AT_data_member_location	(0x12)

0x00000347:     DW_TAG_member
                  DW_AT_name	("avrcp_event")
                  DW_AT_type	(cu + 0x03b8 "avrcp_event_info[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(293)
                  DW_AT_data_member_location	(0x1b)

0x00000354:     NULL

0x00000355:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0360 "unsigned int")
                DW_AT_name	("u32")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(48)

0x00000360:   DW_TAG_base_type
                DW_AT_name	("unsigned int")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x04)

0x00000367:   DW_TAG_array_type
                DW_AT_type	(cu + 0x008e "uint8_t")

0x0000036c:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0138 "sizetype")
                  DW_AT_count	(0x05)

0x00000372:     NULL

0x00000373:   DW_TAG_typedef
                DW_AT_type	(cu + 0x037e "enumeration ")
                DW_AT_name	("avctp_state_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                DW_AT_decl_line	(215)

0x0000037e:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                DW_AT_decl_line	(209)

0x00000382:     DW_TAG_enumerator
                  DW_AT_name	("AVCTP_STATE_DISCONNECTED")
                  DW_AT_const_value	(0)

0x00000388:     DW_TAG_enumerator
                  DW_AT_name	("AVCTP_STATE_CONNECTING")
                  DW_AT_const_value	(1)

0x0000038e:     DW_TAG_enumerator
                  DW_AT_name	("AVCTP_STATE_CONNECTED")
                  DW_AT_const_value	(2)

0x00000394:     DW_TAG_enumerator
                  DW_AT_name	("AVCTP_STATE_BROWSING_CONNECTING")
                  DW_AT_const_value	(3)

0x0000039a:     DW_TAG_enumerator
                  DW_AT_name	("AVCTP_STATE_BROWSING_CONNECTED")
                  DW_AT_const_value	(4)

0x000003a0:     NULL

0x000003a1:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0099 "unsigned char")
                DW_AT_name	("bool")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(44)

0x000003ac:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0151 "u8")

0x000003b1:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0138 "sizetype")
                  DW_AT_count	(0x09)

0x000003b7:     NULL

0x000003b8:   DW_TAG_array_type
                DW_AT_type	(cu + 0x03c4 "avrcp_event_info")

0x000003bd:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0138 "sizetype")
                  DW_AT_count	(0x0e)

0x000003c3:     NULL

0x000003c4:   DW_TAG_structure_type
                DW_AT_name	("avrcp_event_info")
                DW_AT_byte_size	(0x01)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                DW_AT_decl_line	(263)

0x000003cd:     DW_TAG_member
                  DW_AT_name	("supported_events")
                  DW_AT_type	(cu + 0x008e "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(264)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x07)
                  DW_AT_data_member_location	(0x00)

0x000003dd:     DW_TAG_member
                  DW_AT_name	("registered_events")
                  DW_AT_type	(cu + 0x008e "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(265)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x06)
                  DW_AT_data_member_location	(0x00)

0x000003ed:     DW_TAG_member
                  DW_AT_name	("remote_supported_events")
                  DW_AT_type	(cu + 0x008e "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(266)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x05)
                  DW_AT_data_member_location	(0x00)

0x000003fd:     DW_TAG_member
                  DW_AT_name	("remote_registered_events")
                  DW_AT_type	(cu + 0x008e "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(267)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x00)

0x0000040d:     DW_TAG_member
                  DW_AT_name	("transaction_events")
                  DW_AT_type	(cu + 0x008e "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                  DW_AT_decl_line	(268)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x00)

0x0000041d:     NULL

0x0000041e:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x008e "uint8_t")

0x00000423:   DW_TAG_variable
                DW_AT_name	("arp_control_handlers")
                DW_AT_type	(cu + 0x0435 "const control_pdu_handler[]")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avrcp.c")
                DW_AT_decl_line	(1084)
                DW_AT_location	(DW_OP_addr 0x40)

0x00000435:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0161 "const control_pdu_handler")

0x0000043a:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0138 "sizetype")
                  DW_AT_count	(0x07)

0x00000440:     NULL

0x00000441:   DW_TAG_variable
                DW_AT_name	("arp_company_ids")
                DW_AT_type	(cu + 0x044d "uint32_t[]")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/avrcp.c")
                DW_AT_decl_line	(955)

0x0000044d:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0459 "uint32_t")

0x00000452:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0138 "sizetype")
                  DW_AT_count	(0x01)

0x00000458:     NULL

0x00000459:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0360 "unsigned int")
                DW_AT_name	("uint32_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(48)

0x00000464:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/avctp.h")
                DW_AT_decl_line	(217)

0x00000468:     DW_TAG_enumerator
                  DW_AT_name	("AVCTP_CMD_GET_CAPABILITIES")
                  DW_AT_const_value	(0)

0x0000046e:     DW_TAG_enumerator
                  DW_AT_name	("AVCTP_CMD_REGISTER_EVENT_STATUS")
                  DW_AT_const_value	(1)

0x00000474:     DW_TAG_enumerator
                  DW_AT_name	("AVCTP_CMD_REGISTER_EVENT_TRACK")
                  DW_AT_const_value	(2)

0x0000047a:     DW_TAG_enumerator
                  DW_AT_name	("AVCTP_CMD_REGISTER_EVENT_SETTING")
                  DW_AT_const_value	(3)

0x00000480:     DW_TAG_enumerator
                  DW_AT_name	("AVCTP_CMD_REGISTER_EVENT_LIST_ATTR")
                  DW_AT_const_value	(4)

0x00000486:     DW_TAG_enumerator
                  DW_AT_name	("AVCTP_CMD_REGISTER_EVENT_SET_REP")
                  DW_AT_const_value	(5)

0x0000048c:     DW_TAG_enumerator
                  DW_AT_name	("AVCTP_CMD_REGISTER_EVENT_SET_SHUFFLE")
                  DW_AT_const_value	(6)

0x00000492:     DW_TAG_enumerator
                  DW_AT_name	("AVCTP_CMD_REGISTER_EVENT_VOL_CHANGED")
                  DW_AT_const_value	(7)

0x00000498:     DW_TAG_enumerator
                  DW_AT_name	("AVCTP_CMD_REGISTER_EVENT_STATUS_CHANGED")
                  DW_AT_const_value	(8)

0x0000049e:     DW_TAG_enumerator
                  DW_AT_name	("AVCTP_CMD_REGISTER_EVENT_PLAYBACK_POS")
                  DW_AT_const_value	(9)

0x000004a4:     DW_TAG_enumerator
                  DW_AT_name	("AVCTP_CMD_REGISTER_SEEK_RELEASE")
                  DW_AT_const_value	(10)

0x000004aa:     DW_TAG_enumerator
                  DW_AT_name	("AVCTP_CMD_REGISTER_GET_PLAY_STATUS")
                  DW_AT_const_value	(11)

0x000004b0:     DW_TAG_enumerator
                  DW_AT_name	("AVCTP_CMD_REGISTER_GET_MUSIC_INFO")
                  DW_AT_const_value	(12)

0x000004b6:     DW_TAG_enumerator
                  DW_AT_name	("AVCTP_CMD_REGISTER_BQB_VOL_CHANGED")
                  DW_AT_const_value	(13)

0x000004bc:     DW_TAG_enumerator
