; ModuleID = 'bnep.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/bnep.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.btstack_linked_item = type { %struct.btstack_linked_item* }
%struct.user_interface_handler = type { void (i8*, i32, i32)*, void (i8, i8*, i8*)*, void (i8*, i32)*, i32 ()*, void (i8, i16, i8*, i16)*, void (i8*, i32, i32, i8)*, i32 ()*, void (i32)*, void (i8, i32, i8*, i16)*, i32 (i8*, i8, i8)*, void ()*, void (i8)*, i8 (i8*, i8, i8*, i32, i8)*, void (i8, i16, i8*, i16)*, i32 ()* }
%struct.bnep_channel_t = type { %struct.btstack_linked_item, i32, i32, i16, i8*, [6 x i8], [6 x i8], i16, i16, i16, i16, i8, i16, [8 x %struct.bnep_net_filter_t], i16, %struct.bnep_net_filter_t*, i16, [8 x %struct.bnep_multi_filter_t], i16, %struct.bnep_multi_filter_t*, i16, %struct.btstack_timer_source, i32, i32, void (i8, i16, i8*, i16)*, i8, %struct.btstack_linked_item*, i32 }
%struct.bnep_net_filter_t = type { i16, i16 }
%struct.bnep_multi_filter_t = type { [6 x i8], [6 x i8] }
%struct.btstack_timer_source = type { %struct.btstack_linked_item, i32, i32, void (%struct.btstack_timer_source*)*, i8* }
%struct.bnep_channel_event = type { i32 }
%struct.resend_t = type { %struct.btstack_linked_item, i16, [0 x i8] }
%struct.bnep_service_t = type { %struct.btstack_linked_item, i16, i16, void (i8, i16, i8*, i16)* }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "app_info_debug_enable", scope: !2, file: !155, line: 190, type: !109, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !25, globals: !147)
!3 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/bnep.c", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!4 = !{!5, !12, !22}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 42, size: 32, elements: !7)
!6 = !DIFile(filename: "../btstack/Profile/include/bredr/bnep.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!7 = !{!8, !9, !10, !11}
!8 = !DIEnumerator(name: "BNEP_CHANNEL_STATE_CLOSED", value: 1)
!9 = !DIEnumerator(name: "BNEP_CHANNEL_STATE_WAIT_FOR_CONNECTION_REQUEST", value: 2)
!10 = !DIEnumerator(name: "BNEP_CHANNEL_STATE_WAIT_FOR_CONNECTION_RESPONSE", value: 3)
!11 = !DIEnumerator(name: "BNEP_CHANNEL_STATE_CONNECTED", value: 4)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 49, size: 32, elements: !13)
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21}
!14 = !DIEnumerator(name: "BNEP_CHANNEL_STATE_VAR_NONE", value: 0)
!15 = !DIEnumerator(name: "BNEP_CHANNEL_STATE_VAR_SND_NOT_UNDERSTOOD", value: 1)
!16 = !DIEnumerator(name: "BNEP_CHANNEL_STATE_VAR_SND_CONNECTION_REQUEST", value: 2)
!17 = !DIEnumerator(name: "BNEP_CHANNEL_STATE_VAR_SND_CONNECTION_RESPONSE", value: 4)
!18 = !DIEnumerator(name: "BNEP_CHANNEL_STATE_VAR_SND_FILTER_NET_TYPE_SET", value: 8)
!19 = !DIEnumerator(name: "BNEP_CHANNEL_STATE_VAR_SND_FILTER_NET_TYPE_RESPONSE", value: 16)
!20 = !DIEnumerator(name: "BNEP_CHANNEL_STATE_VAR_SND_FILTER_MULTI_ADDR_SET", value: 32)
!21 = !DIEnumerator(name: "BNEP_CHANNEL_STATE_VAR_SND_FILTER_MULTI_ADDR_RESPONSE", value: 64)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 60, size: 32, elements: !23)
!23 = !{!24}
!24 = !DIEnumerator(name: "BNEP_CH_EVT_READY_TO_SEND", value: 0)
!25 = !{!26, !27, !34, !123, !125, !42, !117, !133, !146}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 32)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_linked_item_t", file: !29, line: 55, baseType: !30)
!29 = !DIFile(filename: "../btcommon/btstack_linked_list.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btstack_linked_item", file: !29, line: 53, size: 32, elements: !31)
!31 = !{!32}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !30, file: !29, line: 54, baseType: !33, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 32)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "bnep_channel_t", file: !6, line: 127, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 83, size: 1888, elements: !37)
!37 = !{!38, !39, !41, !43, !47, !48, !56, !57, !58, !60, !61, !62, !63, !64, !73, !74, !76, !77, !84, !85, !87, !88, !108, !110, !111, !118, !119, !121}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !36, file: !6, line: 85, baseType: !28, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !36, file: !6, line: 87, baseType: !40, size: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "BNEP_CHANNEL_STATE", file: !6, line: 47, baseType: !5)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "state_var", scope: !36, file: !6, line: 89, baseType: !42, size: 32, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "BNEP_CHANNEL_STATE_VAR", file: !6, line: 58, baseType: !12)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "max_frame_size", scope: !36, file: !6, line: 91, baseType: !44, size: 16, offset: 96)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !45, line: 46, baseType: !46)
!45 = !DIFile(filename: "../btcommon/typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!46 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !36, file: !6, line: 92, baseType: !26, size: 32, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "local_addr", scope: !36, file: !6, line: 93, baseType: !49, size: 48, offset: 160)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_addr_t", file: !50, line: 7, baseType: !51)
!50 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 48, elements: !54)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !45, line: 44, baseType: !53)
!53 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!54 = !{!55}
!55 = !DISubrange(count: 6)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "remote_addr", scope: !36, file: !6, line: 94, baseType: !49, size: 48, offset: 208)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "l2cap_cid", scope: !36, file: !6, line: 95, baseType: !44, size: 16, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "con_handle", scope: !36, file: !6, line: 96, baseType: !59, size: 16, offset: 272)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "hci_con_handle_t", file: !50, line: 9, baseType: !44)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "uuid_source", scope: !36, file: !6, line: 98, baseType: !44, size: 16, offset: 288)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "uuid_dest", scope: !36, file: !6, line: 99, baseType: !44, size: 16, offset: 304)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "last_control_type", scope: !36, file: !6, line: 101, baseType: !52, size: 8, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "response_code", scope: !36, file: !6, line: 102, baseType: !44, size: 16, offset: 336)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "net_filter", scope: !36, file: !6, line: 104, baseType: !65, size: 256, offset: 352)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 256, elements: !71)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "bnep_net_filter_t", file: !6, line: 72, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 69, size: 32, elements: !68)
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "range_start", scope: !67, file: !6, line: 70, baseType: !44, size: 16)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "range_end", scope: !67, file: !6, line: 71, baseType: !44, size: 16, offset: 16)
!71 = !{!72}
!72 = !DISubrange(count: 8)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "net_filter_count", scope: !36, file: !6, line: 105, baseType: !44, size: 16, offset: 608)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "net_filter_out", scope: !36, file: !6, line: 107, baseType: !75, size: 32, offset: 640)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "net_filter_out_count", scope: !36, file: !6, line: 108, baseType: !44, size: 16, offset: 672)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "multicast_filter", scope: !36, file: !6, line: 110, baseType: !78, size: 768, offset: 688)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 768, elements: !71)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "bnep_multi_filter_t", file: !6, line: 78, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 75, size: 96, elements: !81)
!81 = !{!82, !83}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "addr_start", scope: !80, file: !6, line: 76, baseType: !51, size: 48)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "addr_end", scope: !80, file: !6, line: 77, baseType: !51, size: 48, offset: 48)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "multicast_filter_count", scope: !36, file: !6, line: 111, baseType: !44, size: 16, offset: 1456)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "multicast_filter_out", scope: !36, file: !6, line: 113, baseType: !86, size: 32, offset: 1472)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "multicast_filter_out_count", scope: !36, file: !6, line: 114, baseType: !44, size: 16, offset: 1504)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !36, file: !6, line: 117, baseType: !89, size: 160, offset: 1536)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_timer_source_t", file: !90, line: 19, baseType: !91)
!90 = !DIFile(filename: "../btcommon/btstack_sys_timer.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btstack_timer_source", file: !90, line: 7, size: 160, elements: !92)
!92 = !{!93, !94, !97, !98, !99, !100, !101, !102, !107}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !91, file: !90, line: 8, baseType: !28, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !91, file: !90, line: 10, baseType: !95, size: 32, offset: 32)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !45, line: 48, baseType: !96)
!96 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_interval", scope: !91, file: !90, line: 11, baseType: !95, size: 16, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "timer_type", scope: !91, file: !90, line: 12, baseType: !95, size: 4, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "timer_tick_overflow", scope: !91, file: !90, line: 13, baseType: !95, size: 1, offset: 84, flags: DIFlagBitField, extraData: i64 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "loop_flag", scope: !91, file: !90, line: 14, baseType: !95, size: 1, offset: 85, flags: DIFlagBitField, extraData: i64 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "loop_times", scope: !91, file: !90, line: 15, baseType: !95, size: 10, offset: 86, flags: DIFlagBitField, extraData: i64 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !91, file: !90, line: 17, baseType: !103, size: 32, offset: 96)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 32)
!104 = !DISubroutineType(types: !105)
!105 = !{null, !106}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !91, file: !90, line: 18, baseType: !26, size: 32, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "timer_active", scope: !36, file: !6, line: 118, baseType: !109, size: 32, offset: 1696)
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "retry_count", scope: !36, file: !6, line: 119, baseType: !109, size: 32, offset: 1728)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "packet_handler", scope: !36, file: !6, line: 121, baseType: !112, size: 32, offset: 1760)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_packet_handler_t", file: !113, line: 58, baseType: !114)
!113 = !DIFile(filename: "../btcommon/hci_cmds.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !52, !44, !117, !44}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_for_can_send_now", scope: !36, file: !6, line: 123, baseType: !52, size: 8, offset: 1792)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "send_item", scope: !36, file: !6, line: 125, baseType: !120, size: 32, offset: 1824)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_list_t", file: !29, line: 101, baseType: !27)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_bit_flag", scope: !36, file: !6, line: 126, baseType: !122, size: 32, offset: 1856)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !45, line: 48, baseType: !96)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_item_t", file: !29, line: 100, baseType: !28)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "bnep_service_t", file: !6, line: 137, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 130, size: 96, elements: !128)
!128 = !{!129, !130, !131, !132}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !127, file: !6, line: 131, baseType: !28, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "service_uuid", scope: !127, file: !6, line: 132, baseType: !44, size: 16, offset: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "max_frame_size", scope: !127, file: !6, line: 133, baseType: !44, size: 16, offset: 48)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "packet_handler", scope: !127, file: !6, line: 136, baseType: !112, size: 32, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "resend_t", file: !135, line: 74, baseType: !136)
!135 = !DIFile(filename: "../btstack/Profile/include/bredr/profile_common.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !135, line: 70, size: 64, elements: !137)
!137 = !{!138, !139, !141}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !136, file: !135, line: 71, baseType: !124, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !136, file: !135, line: 72, baseType: !140, size: 16, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !45, line: 46, baseType: !46)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !136, file: !135, line: 73, baseType: !142, offset: 48)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, elements: !144)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !45, line: 44, baseType: !53)
!144 = !{!145}
!145 = !DISubrange(count: 0)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!147 = !{!0, !148, !150, !153}
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "bnep_security_level", scope: !2, file: !3, line: 80, type: !52, isLocal: true, isDefinition: true)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "bnep_channels", scope: !2, file: !3, line: 78, type: !152, isLocal: true, isDefinition: true)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_linked_list_t", file: !29, line: 58, baseType: !27)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "bnep_services", scope: !2, file: !3, line: 77, type: !152, isLocal: true, isDefinition: true)
!155 = !DIFile(filename: "../btcommon/profile_stack_debug.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!156 = !{i32 2, !"Dwarf Version", i32 4}
!157 = !{i32 2, !"Debug Info Version", i32 3}
!158 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!159 = distinct !DISubprogram(name: "bnep_can_send_packet_now", scope: !3, file: !3, line: 390, type: !160, isLocal: false, isDefinition: true, scopeLine: 391, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !162)
!160 = !DISubroutineType(types: !161)
!161 = !{!109, !44}
!162 = !{!163, !164}
!163 = !DILocalVariable(name: "bnep_cid", arg: 1, scope: !159, file: !3, line: 390, type: !44)
!164 = !DILocalVariable(name: "channel", scope: !159, file: !3, line: 392, type: !34)
!165 = !DILocation(line: 390, column: 39, scope: !159)
!166 = !DILocalVariable(name: "l2cap_cid", arg: 1, scope: !167, file: !3, line: 768, type: !44)
!167 = distinct !DISubprogram(name: "bnep_channel_for_l2cap_cid", scope: !3, file: !3, line: 768, type: !168, isLocal: true, isDefinition: true, scopeLine: 769, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !170)
!168 = !DISubroutineType(types: !169)
!169 = !{!34, !44}
!170 = !{!166, !171, !172}
!171 = !DILocalVariable(name: "it", scope: !167, file: !3, line: 770, type: !27)
!172 = !DILocalVariable(name: "channel", scope: !173, file: !3, line: 772, type: !34)
!173 = distinct !DILexicalBlock(scope: !174, file: !3, line: 771, column: 76)
!174 = distinct !DILexicalBlock(scope: !175, file: !3, line: 771, column: 5)
!175 = distinct !DILexicalBlock(scope: !167, file: !3, line: 771, column: 5)
!176 = !DILocation(line: 768, column: 60, scope: !167, inlinedAt: !177)
!177 = distinct !DILocation(line: 392, column: 31, scope: !159)
!178 = !{!179, !179, i64 0}
!179 = !{!"any pointer", !180, i64 0}
!180 = !{!"omnipotent char", !181, i64 0}
!181 = !{!"Simple C/C++ TBAA"}
!182 = !DILocation(line: 770, column: 28, scope: !167, inlinedAt: !177)
!183 = !DILocation(line: 771, column: 5, scope: !184, inlinedAt: !177)
!184 = !DILexicalBlockFile(scope: !175, file: !3, discriminator: 1)
!185 = !DILocation(line: 773, column: 22, scope: !186, inlinedAt: !177)
!186 = distinct !DILexicalBlock(scope: !173, file: !3, line: 773, column: 13)
!187 = !DILocation(line: 771, column: 70, scope: !188, inlinedAt: !177)
!188 = !DILexicalBlockFile(scope: !174, file: !3, discriminator: 2)
!189 = distinct !{!189, !190, !191}
!190 = !DILocation(line: 771, column: 5, scope: !175)
!191 = !DILocation(line: 776, column: 5, scope: !175)
!192 = !{!193, !195, i64 32}
