; ModuleID = 'bt_configs.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/bt_configs.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.user_interface_handler = type { void (i8*, i32, i32)*, void (i8, i8*, i8*)*, void (i8*, i32)*, i32 ()*, void (i8, i16, i8*, i16)*, void (i8*, i32, i32, i8)*, i32 ()*, void (i32)*, void (i8, i32, i8*, i16)*, i32 (i8*, i8, i8)*, void ()*, void (i8)*, i8 (i8*, i8, i8*, i32, i8)*, void (i8, i16, i8*, i16)*, i32 ()* }

@app_info_debug_enable = weak hidden local_unnamed_addr global i32 0, align 4, !dbg !0
@a2dp_source_bqb_support = weak hidden local_unnamed_addr global i8 0, section ".bt_stack_data", align 1, !dbg !6
@user_at_cmd_send_support = weak hidden local_unnamed_addr global i8 0, section ".bt_stack_data", align 1, !dbg !11
@l2cap_debug_enable = weak hidden local_unnamed_addr global i8 0, section ".bt_stack_data", align 1, !dbg !13
@rfcomm_debug_enable = weak hidden local_unnamed_addr global i8 0, section ".bt_stack_data", align 1, !dbg !15
@profile_debug_enable = weak hidden local_unnamed_addr global i8 0, section ".bt_stack_data", align 1, !dbg !17
@ble_debug_enable = weak hidden local_unnamed_addr global i8 0, section ".bt_stack_data", align 1, !dbg !19
@btstack_tws_debug_enable = weak hidden local_unnamed_addr global i8 0, section ".bt_stack_data", align 1, !dbg !21
@user_interface_app = hidden local_unnamed_addr global %struct.user_interface_handler zeroinitializer, section ".bt_stack_data", align 4, !dbg !23
@stack_configs_app = hidden local_unnamed_addr global { i32, i16, i16, i16, i16, i16, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, [6 x i8], i8 } { i32 2360324, i16 8000, i16 8000, i16 0, i16 0, i16 0, i8 60, i8 53, i8 0, i8 17, i8 16, i8 8, i8 35, i8 1, i8 70, i8 30, i8 10, [6 x i8] zeroinitializer, i8 0 }, section ".bt_stack_data", align 4, !dbg !89

; Function Attrs: nounwind optsize readonly
define hidden i32 @__bt_profile_enable(i32) local_unnamed_addr #0 section ".bt_stack_code" !dbg !141 {
  call void @llvm.dbg.value(metadata i32 %0, metadata !145, metadata !DIExpression()), !dbg !146
  %2 = load i16, i16* getelementptr inbounds ({ i32, i16, i16, i16, i16, i16, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, [6 x i8], i8 }, { i32, i16, i16, i16, i16, i16, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, [6 x i8], i8 }* @stack_configs_app, i32 0, i32 4), align 2, !dbg !147, !tbaa !148
  %3 = zext i16 %2 to i32, !dbg !154
  %4 = and i32 %3, %0, !dbg !155
  ret i32 %4, !dbg !156
}

; Function Attrs: nounwind readnone speculatable
declare void @llvm.dbg.value(metadata, metadata, metadata) #1

attributes #0 = { nounwind optsize readonly "allow-nullptr-deref" "correctly-rounded-divide-sqrt-fp-math"="false" "disable-tail-calls"="false" "less-precise-fpmad"="false" "no-frame-pointer-elim"="true" "no-frame-pointer-elim-non-leaf" "no-infs-fp-math"="false" "no-jump-tables"="false" "no-nans-fp-math"="false" "no-signed-zeros-fp-math"="false" "no-trapping-math"="false" "stack-protector-buffer-size"="8" "target-features"="+no-constpool" "unsafe-fp-math"="false" "use-soft-float"="false" }
attributes #1 = { nounwind readnone speculatable }

!llvm.dbg.cu = !{!2}
!llvm.module.flags = !{!138, !139}
!llvm.ident = !{!140}

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "app_info_debug_enable", scope: !2, file: !137, line: 190, type: !35, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5)
!3 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/bt_configs.c", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!4 = !{}
!5 = !{!0, !6, !11, !13, !15, !17, !19, !21, !23, !89}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "a2dp_source_bqb_support", scope: !2, file: !3, line: 20, type: !8, isLocal: false, isDefinition: true)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !9, line: 44, baseType: !10)
!9 = !DIFile(filename: "../btcommon/typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!10 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "user_at_cmd_send_support", scope: !2, file: !3, line: 21, type: !8, isLocal: false, isDefinition: true)
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "l2cap_debug_enable", scope: !2, file: !3, line: 22, type: !8, isLocal: false, isDefinition: true)
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "rfcomm_debug_enable", scope: !2, file: !3, line: 23, type: !8, isLocal: false, isDefinition: true)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "profile_debug_enable", scope: !2, file: !3, line: 24, type: !8, isLocal: false, isDefinition: true)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "ble_debug_enable", scope: !2, file: !3, line: 25, type: !8, isLocal: false, isDefinition: true)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "btstack_tws_debug_enable", scope: !2, file: !3, line: 26, type: !8, isLocal: false, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "user_interface_app", scope: !2, file: !3, line: 28, type: !25, isLocal: false, isDefinition: true)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "user_interface_handler", file: !26, line: 28, size: 480, elements: !27)
!26 = !DIFile(filename: "../btstack/Host/include/bredr/user_interface.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!27 = !{!28, !36, !40, !44, !48, !54, !58, !59, !63, !67, !73, !77, !81, !87, !88}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "profile_function_status", scope: !25, file: !26, line: 29, baseType: !29, size: 32)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 32)
!30 = !DISubroutineType(types: !31)
!31 = !{null, !32, !33, !35}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !9, line: 48, baseType: !34)
!34 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!35 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "read_remote_name_handle", scope: !25, file: !26, line: 30, baseType: !37, size: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 32)
!38 = !DISubroutineType(types: !39)
!39 = !{null, !8, !32, !32}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "discon_complete_handle", scope: !25, file: !26, line: 31, baseType: !41, size: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 32)
!42 = !DISubroutineType(types: !43)
!43 = !{null, !32, !35}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "hfp_get_battery_value", scope: !25, file: !26, line: 32, baseType: !45, size: 32, offset: 96)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 32)
!46 = !DISubroutineType(types: !47)
!47 = !{!35}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "spp_data_deal_handle", scope: !25, file: !26, line: 33, baseType: !49, size: 32, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 32)
!50 = !DISubroutineType(types: !51)
!51 = !{null, !8, !52, !32, !52}
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !9, line: 46, baseType: !53)
!53 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "profile_channels_status", scope: !25, file: !26, line: 34, baseType: !55, size: 32, offset: 160)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !32, !35, !35, !8}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "get_music_current_vol_handle", scope: !25, file: !26, line: 35, baseType: !45, size: 32, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "music_vol_change_handle", scope: !25, file: !26, line: 36, baseType: !60, size: 32, offset: 224)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 32)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !35}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "bt_music_info", scope: !25, file: !26, line: 41, baseType: !64, size: 32, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 32)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !8, !33, !32, !52}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "multi_bd_deal_handle", scope: !25, file: !26, line: 42, baseType: !68, size: 32, offset: 288)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 32)
!69 = !DISubroutineType(types: !70)
!70 = !{!71, !72, !8, !8}
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !9, line: 49, baseType: !35)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "bt_fast_test", scope: !25, file: !26, line: 43, baseType: !74, size: 32, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 32)
!75 = !DISubroutineType(types: !76)
!76 = !{null}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "bt_dut_test", scope: !25, file: !26, line: 44, baseType: !78, size: 32, offset: 352)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!79 = !DISubroutineType(types: !80)
!80 = !{null, !8}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "inquiry_result", scope: !25, file: !26, line: 45, baseType: !82, size: 32, offset: 384)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 32)
!83 = !DISubroutineType(types: !84)
!84 = !{!8, !85, !8, !32, !33, !86}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 32)
!86 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "iap_data_deal_handle", scope: !25, file: !26, line: 46, baseType: !49, size: 32, offset: 416)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "hfp_get_battery_percent", scope: !25, file: !26, line: 47, baseType: !45, size: 32, offset: 448)
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(name: "stack_configs_app", scope: !2, file: !3, line: 45, type: !91, isLocal: false, isDefinition: true)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stack_config", file: !26, line: 57, size: 256, elements: !92)
!92 = !{!93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !106, !107, !108, !109, !110, !111, !112, !113, !114, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !135, !136}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "hci_dev_class", scope: !91, file: !26, line: 58, baseType: !33, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "page_timeout", scope: !91, file: !26, line: 59, baseType: !52, size: 16, offset: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "super_timeout", scope: !91, file: !26, line: 60, baseType: !52, size: 16, offset: 48)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "pending_sdp_handler", scope: !91, file: !26, line: 61, baseType: !52, size: 16, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "support_profile", scope: !91, file: !26, line: 62, baseType: !52, size: 16, offset: 80)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "connecting_support_profile", scope: !91, file: !26, line: 63, baseType: !52, size: 16, offset: 96)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "update_battery_timeout", scope: !91, file: !26, line: 64, baseType: !8, size: 8, offset: 112)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "sbc_cap_bitpoola", scope: !91, file: !26, line: 65, baseType: !8, size: 8, offset: 120)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "background_goback", scope: !91, file: !26, line: 66, baseType: !8, size: 8, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "auto_conn_device_num", scope: !91, file: !26, line: 67, baseType: !8, size: 4, offset: 136, flags: DIFlagBitField, extraData: i64 136)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "user_ctrl_conn_num", scope: !91, file: !26, line: 68, baseType: !8, size: 2, offset: 140, flags: DIFlagBitField, extraData: i64 136)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "hid_independent_flag", scope: !91, file: !26, line: 69, baseType: !105, size: 1, offset: 142, flags: DIFlagBitField, extraData: i64 136)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !9, line: 44, baseType: !10)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "support_aac", scope: !91, file: !26, line: 70, baseType: !105, size: 1, offset: 143, flags: DIFlagBitField, extraData: i64 136)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "support_aptx", scope: !91, file: !26, line: 71, baseType: !105, size: 1, offset: 144, flags: DIFlagBitField, extraData: i64 136)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "support_ldac", scope: !91, file: !26, line: 72, baseType: !105, size: 1, offset: 145, flags: DIFlagBitField, extraData: i64 136)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "support_lc3", scope: !91, file: !26, line: 73, baseType: !105, size: 1, offset: 146, flags: DIFlagBitField, extraData: i64 136)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "support_msbc", scope: !91, file: !26, line: 74, baseType: !105, size: 1, offset: 147, flags: DIFlagBitField, extraData: i64 136)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "simple_pair_en", scope: !91, file: !26, line: 75, baseType: !105, size: 1, offset: 148, flags: DIFlagBitField, extraData: i64 136)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "display_battery", scope: !91, file: !26, line: 76, baseType: !105, size: 1, offset: 149, flags: DIFlagBitField, extraData: i64 136)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "disable_sco", scope: !91, file: !26, line: 77, baseType: !105, size: 1, offset: 150, flags: DIFlagBitField, extraData: i64 136)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "esco_coder_busy_flag", scope: !91, file: !26, line: 78, baseType: !115, size: 1, offset: 151, flags: DIFlagBitField, extraData: i64 136)
!115 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !8)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "hfp_switch", scope: !91, file: !26, line: 79, baseType: !8, size: 1, offset: 152, flags: DIFlagBitField, extraData: i64 136)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "hfp_restore", scope: !91, file: !26, line: 80, baseType: !8, size: 1, offset: 153, flags: DIFlagBitField, extraData: i64 136)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "own_remote_test_flag", scope: !91, file: !26, line: 81, baseType: !105, size: 1, offset: 154, flags: DIFlagBitField, extraData: i64 136)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "music_break_in_flag", scope: !91, file: !26, line: 82, baseType: !8, size: 1, offset: 155, flags: DIFlagBitField, extraData: i64 136)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "emitter_enable", scope: !91, file: !26, line: 83, baseType: !8, size: 1, offset: 156, flags: DIFlagBitField, extraData: i64 136)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "a2dp_auto_play_en", scope: !91, file: !26, line: 84, baseType: !8, size: 1, offset: 157, flags: DIFlagBitField, extraData: i64 136)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "get_l2cap_info_once", scope: !91, file: !26, line: 85, baseType: !8, size: 1, offset: 158, flags: DIFlagBitField, extraData: i64 136)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "a2dp_not_support_remote_connect", scope: !91, file: !26, line: 86, baseType: !8, size: 1, offset: 159, flags: DIFlagBitField, extraData: i64 136)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "io_capabilities", scope: !91, file: !26, line: 89, baseType: !8, size: 2, offset: 160, flags: DIFlagBitField, extraData: i64 136)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "oob_authentication_data", scope: !91, file: !26, line: 90, baseType: !8, size: 2, offset: 162, flags: DIFlagBitField, extraData: i64 136)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "authentication_requirements", scope: !91, file: !26, line: 98, baseType: !8, size: 4, offset: 164, flags: DIFlagBitField, extraData: i64 136)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "auto_pause_when_interrupt", scope: !91, file: !26, line: 102, baseType: !8, size: 8, offset: 168)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "sound_come_cnt", scope: !91, file: !26, line: 103, baseType: !8, size: 8, offset: 176)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "sound_go_cnt", scope: !91, file: !26, line: 104, baseType: !8, size: 8, offset: 184)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "phone_history_call_num", scope: !91, file: !26, line: 105, baseType: !8, size: 8, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "esco_addr", scope: !91, file: !26, line: 106, baseType: !132, size: 48, offset: 200)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 48, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 6)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "keep_spp_connect", scope: !91, file: !26, line: 107, baseType: !8, size: 1, offset: 248, flags: DIFlagBitField, extraData: i64 248)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "res_7bit", scope: !91, file: !26, line: 108, baseType: !8, size: 7, offset: 249, flags: DIFlagBitField, extraData: i64 248)
!137 = !DIFile(filename: "../btcommon/profile_stack_debug.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!138 = !{i32 2, !"Dwarf Version", i32 4}
!139 = !{i32 2, !"Debug Info Version", i32 3}
!140 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!141 = distinct !DISubprogram(name: "__bt_profile_enable", scope: !3, file: !3, line: 147, type: !142, isLocal: false, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !144)
!142 = !DISubroutineType(types: !143)
!143 = !{!35, !35}
!144 = !{!145}
!145 = !DILocalVariable(name: "bit", arg: 1, scope: !141, file: !3, line: 147, type: !35)
!146 = !DILocation(line: 147, column: 29, scope: !141)
!147 = !DILocation(line: 149, column: 30, scope: !141)
!148 = !{!149, !153, i64 10}
!149 = !{!"_stack_config", !150, i64 0, !153, i64 4, !153, i64 6, !153, i64 8, !153, i64 10, !153, i64 12, !151, i64 14, !151, i64 15, !151, i64 16, !151, i64 17, !151, i64 17, !151, i64 17, !151, i64 17, !151, i64 18, !151, i64 18, !151, i64 18, !151, i64 18, !151, i64 18, !151, i64 18, !151, i64 18, !151, i64 18, !151, i64 19, !151, i64 19, !151, i64 19, !151, i64 19, !151, i64 19, !151, i64 19, !151, i64 19, !151, i64 19, !151, i64 20, !151, i64 20, !151, i64 20, !151, i64 21, !151, i64 22, !151, i64 23, !151, i64 24, !151, i64 25, !151, i64 31, !151, i64 31}
!150 = !{!"int", !151, i64 0}
!151 = !{!"omnipotent char", !152, i64 0}
!152 = !{!"Simple C/C++ TBAA"}
!153 = !{!"short", !151, i64 0}
!154 = !DILocation(line: 149, column: 12, scope: !141)
!155 = !DILocation(line: 149, column: 46, scope: !141)
!156 = !DILocation(line: 149, column: 5, scope: !141)
