; ModuleID = 'btstack_3th_protocol_user.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/third_party_profile/common/btstack_3th_protocol_user.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.__BT_3TH_USER_CB = type { i32, i32, %struct.__JL_PRO_CB, void (i16, i8*, i32)*, void (i8*, i32)*, i32 (i8)* }
%struct.__JL_PRO_CB = type { i8*, i8 (i8*)*, i32 (i8*, i8*, i16)*, void (i8*, i8, i8, i8*, i16)*, void (i8*, i8, i8, i8*, i16)*, void (i8*, i8, i8*, i16)*, void (i8*, i8, i8*, i16)*, void (i8*, i8, i8, i8*, i16)*, void (i8*, i8, i8, i8*, i16)*, i8 (i8*, i8, i8)*, void (i8*)* }
%struct.__BT_3TH_PROTOCOL_CB = type { i32, void (i8)*, void ()*, void (i8*, i8*, i16)* }

@app_info_debug_enable = weak hidden local_unnamed_addr global i32 0, align 4, !dbg !0
@config_rcsp_stack_enable = external local_unnamed_addr constant i32, align 4
@g_bt_3th_user_pro = internal unnamed_addr global %struct.__BT_3TH_USER_CB* null, align 4, !dbg !58
@bt_3th_spp_callback = internal global %struct.__JL_PRO_CB zeroinitializer, align 4, !dbg !11
@bt_3th_ble_callback = internal global %struct.__JL_PRO_CB zeroinitializer, align 4, !dbg !56
@JL_bt_chl = internal global i8 0, align 1, !dbg !79
@g_bt_3th_lib_pro = internal unnamed_addr global %struct.__BT_3TH_PROTOCOL_CB* null, align 4, !dbg !82

; Function Attrs: nounwind optsize

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "app_info_debug_enable", scope: !2, file: !101, line: 190, type: !31, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !10)
!3 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/third_party_profile/common/btstack_3th_protocol_user.c", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 35, size: 32, elements: !7)
!6 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/third_party/common/btstack_3th_protocol_user.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!7 = !{!8, !9}
!8 = !DIEnumerator(name: "RCSP_BLE", value: 0)
!9 = !DIEnumerator(name: "RCSP_SPP", value: 1)
!10 = !{!0, !11, !56, !58, !79, !82}
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "bt_3th_spp_callback", scope: !2, file: !3, line: 11, type: !13, isLocal: true, isDefinition: true)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "JL_PRO_CB", file: !14, line: 177, baseType: !15)
!14 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/third_party/rcsp/JL_rcsp_protocol.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__JL_PRO_CB", file: !14, line: 163, size: 352, elements: !16)
!16 = !{!17, !19, !26, !34, !40, !41, !45, !46, !47, !48, !52}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !15, file: !14, line: 165, baseType: !18, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "fw_ready", scope: !15, file: !14, line: 166, baseType: !20, size: 32, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 32)
!21 = !DISubroutineType(types: !22)
!22 = !{!23, !18}
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !24, line: 11, baseType: !25)
!24 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "fw_send", scope: !15, file: !14, line: 167, baseType: !27, size: 32, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 32)
!28 = !DISubroutineType(types: !29)
!29 = !{!30, !18, !18, !32}
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !24, line: 16, baseType: !31)
!31 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !24, line: 13, baseType: !33)
!33 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "CMD_resp", scope: !15, file: !14, line: 169, baseType: !35, size: 32, offset: 96)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 32)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !18, !38, !38, !39, !32}
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !24, line: 11, baseType: !25)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "DATA_resp", scope: !15, file: !14, line: 170, baseType: !35, size: 32, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "CMD_no_resp", scope: !15, file: !14, line: 171, baseType: !42, size: 32, offset: 160)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 32)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !18, !38, !39, !32}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "DATA_no_resp", scope: !15, file: !14, line: 172, baseType: !42, size: 32, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "CMD_recieve_resp", scope: !15, file: !14, line: 173, baseType: !35, size: 32, offset: 224)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "DATA_recieve_resp", scope: !15, file: !14, line: 174, baseType: !35, size: 32, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "wait_resp_timeout", scope: !15, file: !14, line: 175, baseType: !49, size: 32, offset: 288)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 32)
!50 = !DISubroutineType(types: !51)
!51 = !{!38, !18, !38, !38}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "auth_pass_callback", scope: !15, file: !14, line: 176, baseType: !53, size: 32, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 32)
!54 = !DISubroutineType(types: !55)
!55 = !{null, !18}
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "bt_3th_ble_callback", scope: !2, file: !3, line: 12, type: !13, isLocal: true, isDefinition: true)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "g_bt_3th_user_pro", scope: !2, file: !3, line: 13, type: !60, isLocal: true, isDefinition: true)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 32)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "BT_3TH_USER_CB", file: !6, line: 48, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__BT_3TH_USER_CB", file: !6, line: 41, size: 512, elements: !63)
!63 = !{!64, !65, !66, !67, !71, !75}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !62, file: !6, line: 42, baseType: !31, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "bt_config", scope: !62, file: !6, line: 43, baseType: !31, size: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "bt_3th_handler", scope: !62, file: !6, line: 44, baseType: !13, size: 352, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "BT_3TH_event_handler", scope: !62, file: !6, line: 45, baseType: !68, size: 32, offset: 416)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 32)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !32, !39, !31}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "BT_3TH_data_handler", scope: !62, file: !6, line: 46, baseType: !72, size: 32, offset: 448)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 32)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !39, !31}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "BT_3TH_spp_state_specific", scope: !62, file: !6, line: 47, baseType: !76, size: 32, offset: 480)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 32)
!77 = !DISubroutineType(types: !78)
!78 = !{!31, !38}
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "JL_bt_chl", scope: !2, file: !3, line: 10, type: !81, isLocal: true, isDefinition: true)
!81 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !38)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "g_bt_3th_lib_pro", scope: !2, file: !3, line: 14, type: !84, isLocal: true, isDefinition: true)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "BT_3TH_PROTOCOL_CB", file: !6, line: 55, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__BT_3TH_PROTOCOL_CB", file: !6, line: 50, size: 128, elements: !87)
!87 = !{!88, !89, !93, !97}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !86, file: !6, line: 51, baseType: !31, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "BT_3TH_type_dev_select", scope: !86, file: !6, line: 52, baseType: !90, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 32)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !38}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "resume", scope: !86, file: !6, line: 53, baseType: !94, size: 32, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 32)
!95 = !DISubroutineType(types: !96)
!96 = !{null}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "recieve", scope: !86, file: !6, line: 54, baseType: !98, size: 32, offset: 96)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 32)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !18, !18, !32}
!101 = !DIFile(filename: "../btcommon/profile_stack_debug.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!102 = !{i32 2, !"Dwarf Version", i32 4}
!103 = !{i32 2, !"Debug Info Version", i32 3}
!104 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!105 = distinct !DISubprogram(name: "btstack_3th_protocol_open", scope: !3, file: !3, line: 27, type: !106, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !108)
!106 = !DISubroutineType(types: !107)
!107 = !{!31, !31}
!108 = !{!109}
!109 = !DILocalVariable(name: "type", arg: 1, scope: !105, file: !3, line: 27, type: !31)
!110 = !DILocation(line: 27, column: 35, scope: !105)
!111 = !DILocation(line: 29, column: 5, scope: !105)
!112 = !DILocation(line: 31, column: 13, scope: !113)
!113 = distinct !DILexicalBlock(scope: !114, file: !3, line: 31, column: 13)
!114 = distinct !DILexicalBlock(scope: !105, file: !3, line: 29, column: 19)
!115 = !DILocation(line: 32, column: 13, scope: !116)
!116 = distinct !DILexicalBlock(scope: !113, file: !3, line: 31, column: 39)
!117 = !DILocation(line: 33, column: 9, scope: !116)
!118 = !DILocation(line: 39, column: 5, scope: !105)
!119 = distinct !DISubprogram(name: "btstack_3th_protocol_user_init", scope: !3, file: !3, line: 51, type: !120, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !122)
!120 = !DISubroutineType(types: !121)
!121 = !{!31, !60}
!122 = !{!123}
!123 = !DILocalVariable(name: "protocol_user_callback", arg: 1, scope: !119, file: !3, line: 51, type: !60)
!124 = !DILocation(line: 51, column: 52, scope: !119)
!125 = !DILocation(line: 53, column: 9, scope: !126)
!126 = distinct !DILexicalBlock(scope: !119, file: !3, line: 53, column: 9)
!127 = !DILocation(line: 53, column: 9, scope: !119)
!128 = !DILocation(line: 54, column: 16, scope: !129)
!129 = distinct !DILexicalBlock(scope: !126, file: !3, line: 53, column: 33)
!130 = !{!131, !131, i64 0}
!131 = !{!"any pointer", !132, i64 0}
!132 = !{!"omnipotent char", !133, i64 0}
!133 = !{!"Simple C/C++ TBAA"}
!134 = !DILocation(line: 55, column: 21, scope: !135)
!135 = distinct !DILexicalBlock(scope: !129, file: !3, line: 55, column: 13)
!136 = !{!137, !138, i64 4}
!137 = !{!"__BT_3TH_USER_CB", !138, i64 0, !138, i64 4, !139, i64 8, !131, i64 52, !131, i64 56, !131, i64 60}
!138 = !{!"int", !132, i64 0}
!139 = !{!"__JL_PRO_CB", !131, i64 0, !131, i64 4, !131, i64 8, !131, i64 12, !131, i64 16, !131, i64 20, !131, i64 24, !131, i64 28, !131, i64 32, !131, i64 36, !131, i64 40}
!140 = !DILocation(line: 55, column: 31, scope: !135)
!141 = !DILocation(line: 55, column: 13, scope: !129)
!142 = !DILocation(line: 56, column: 13, scope: !143)
!143 = distinct !DILexicalBlock(scope: !135, file: !3, line: 55, column: 48)
!144 = !DILocation(line: 57, column: 44, scope: !143)
!145 = !DILocation(line: 57, column: 52, scope: !143)
!146 = !{i64 0, i64 4, !130, i64 4, i64 4, !130, i64 8, i64 4, !130, i64 12, i64 4, !130, i64 16, i64 4, !130, i64 20, i64 4, !130, i64 24, i64 4, !130, i64 28, i64 4, !130, i64 32, i64 4, !130, i64 36, i64 4, !130, i64 40, i64 4, !130}
!147 = !DILocation(line: 58, column: 42, scope: !143)
!148 = !{!139, !131, i64 4}
!149 = !DILocation(line: 59, column: 42, scope: !143)
!150 = !{!139, !131, i64 8}
!151 = !DILocation(line: 60, column: 13, scope: !143)
!152 = !DILocation(line: 61, column: 9, scope: !143)
!153 = !DILocation(line: 63, column: 21, scope: !154)
