temp.o:	file format ELF32-i386

.debug_info contents:
0x00000000: Compile Unit: length = 0x00001d19 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x00001d1d)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)")
              DW_AT_language	(DW_LANG_C99)
              DW_AT_name	("../btcommon/btstack_memory.c")
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
              DW_AT_GNU_pubnames	(true)
              DW_AT_low_pc	(0x0000000000000000)
              DW_AT_ranges	(0x00000000
                 [0x00000000 - 0x00000a27)
                 [0x00000a27 - 0x00000a99)
                 [0x00000000 - 0x00000009))

0x00000026:   DW_TAG_variable
                DW_AT_name	("app_info_debug_enable")
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/profile_stack_debug.h")
                DW_AT_decl_line	(190)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000037:   DW_TAG_base_type
                DW_AT_name	("int")
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_byte_size	(0x04)

0x0000003e:   DW_TAG_variable
                DW_AT_name	("bredr_stack_pool")
                DW_AT_type	(cu + 0x004f "stack_bredr_pool_t*")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btcommon/btstack_memory.c")
                DW_AT_decl_line	(23)
                DW_AT_location	(DW_OP_addr 0x0)

0x0000004f:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0054 "stack_bredr_pool_t")

0x00000054:   DW_TAG_typedef
                DW_AT_type	(cu + 0x005f "structure ")
                DW_AT_name	("stack_bredr_pool_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                DW_AT_decl_line	(59)

0x0000005f:   DW_TAG_structure_type
                DW_AT_byte_size	(0x01c8)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                DW_AT_decl_line	(29)

0x00000064:     DW_TAG_member
                  DW_AT_name	("l2cap_service_pool")
                  DW_AT_type	(cu + 0x00e0 "memory_pool_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                  DW_AT_decl_line	(33)
                  DW_AT_data_member_location	(0x00)

0x00000070:     DW_TAG_member
                  DW_AT_name	("l2cap_channel_pool")
                  DW_AT_type	(cu + 0x00e0 "memory_pool_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                  DW_AT_decl_line	(34)
                  DW_AT_data_member_location	(0x04)

0x0000007c:     DW_TAG_member
                  DW_AT_name	("rfcomm_multiplexer_pool")
                  DW_AT_type	(cu + 0x00e0 "memory_pool_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                  DW_AT_decl_line	(36)
                  DW_AT_data_member_location	(0x08)

0x00000088:     DW_TAG_member
                  DW_AT_name	("rfcomm_service_pool")
                  DW_AT_type	(cu + 0x00e0 "memory_pool_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                  DW_AT_decl_line	(37)
                  DW_AT_data_member_location	(0x0c)

0x00000094:     DW_TAG_member
                  DW_AT_name	("rfcomm_channel_pool")
                  DW_AT_type	(cu + 0x00e0 "memory_pool_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                  DW_AT_decl_line	(38)
                  DW_AT_data_member_location	(0x10)

0x000000a0:     DW_TAG_member
                  DW_AT_name	("l2cap_service_storage")
                  DW_AT_type	(cu + 0x00ec "l2cap_service_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                  DW_AT_decl_line	(48)
                  DW_AT_data_member_location	(0x14)

0x000000ac:     DW_TAG_member
                  DW_AT_name	("l2cap_channel_storage")
                  DW_AT_type	(cu + 0x01eb "l2cap_channel_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                  DW_AT_decl_line	(49)
                  DW_AT_data_member_location	(0x54)

0x000000b8:     DW_TAG_member
                  DW_AT_name	("rfcomm_multiplexer_storage")
                  DW_AT_type	(cu + 0x03b6 "rfcomm_multiplexer_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                  DW_AT_decl_line	(51)
                  DW_AT_data_member_location	(0x016c)

0x000000c5:     DW_TAG_member
                  DW_AT_name	("rfcomm_service_storage")
                  DW_AT_type	(cu + 0x046c "rfcomm_service_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                  DW_AT_decl_line	(52)
                  DW_AT_data_member_location	(0x0180)

0x000000d2:     DW_TAG_member
                  DW_AT_name	("rfcomm_channel_storage")
                  DW_AT_type	(cu + 0x04dc "rfcomm_channel_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                  DW_AT_decl_line	(53)
                  DW_AT_data_member_location	(0x0194)

0x000000df:     NULL

0x000000e0:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00eb "*")
                DW_AT_name	("memory_pool_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                DW_AT_decl_line	(28)

0x000000eb:   DW_TAG_pointer_type

0x000000ec:   DW_TAG_array_type
                DW_AT_type	(cu + 0x00f8 "l2cap_service_t")

0x000000f1:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x01e4 "sizetype")
                  DW_AT_count	(0x04)

0x000000f7:     NULL

0x000000f8:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0103 "structure ")
                DW_AT_name	("l2cap_service_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(241)

0x00000103:   DW_TAG_structure_type
                DW_AT_byte_size	(0x10)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(225)

0x00000107:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x0144 "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(227)
                  DW_AT_data_member_location	(0x00)

0x00000113:     DW_TAG_member
                  DW_AT_name	("psm")
                  DW_AT_type	(cu + 0x0174 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(230)
                  DW_AT_data_member_location	(0x04)

0x0000011f:     DW_TAG_member
                  DW_AT_name	("mtu")
                  DW_AT_type	(cu + 0x0174 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(233)
                  DW_AT_data_member_location	(0x06)

0x0000012b:     DW_TAG_member
                  DW_AT_name	("connection")
                  DW_AT_type	(cu + 0x00eb "*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(236)
                  DW_AT_data_member_location	(0x08)

0x00000137:     DW_TAG_member
                  DW_AT_name	("packet_handler")
                  DW_AT_type	(cu + 0x0186 "btstack_packet_handler_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(239)
                  DW_AT_data_member_location	(0x0c)

0x00000143:     NULL

0x00000144:   DW_TAG_typedef
                DW_AT_type	(cu + 0x014f "btstack_linked_item_t")
                DW_AT_name	("linked_item_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(100)

0x0000014f:   DW_TAG_typedef
                DW_AT_type	(cu + 0x015a "btstack_linked_item")
                DW_AT_name	("btstack_linked_item_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(55)

0x0000015a:   DW_TAG_structure_type
                DW_AT_name	("btstack_linked_item")
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(53)

0x00000162:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(cu + 0x016f "btstack_linked_item*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                  DW_AT_decl_line	(54)
                  DW_AT_data_member_location	(0x00)

0x0000016e:     NULL

0x0000016f:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x015a "btstack_linked_item")

0x00000174:   DW_TAG_typedef
                DW_AT_type	(cu + 0x017f "unsigned short")
                DW_AT_name	("u16")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(13)

0x0000017f:   DW_TAG_base_type
                DW_AT_name	("unsigned short")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x02)

0x00000186:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0191 "subroutine *")
                DW_AT_name	("btstack_packet_handler_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(58)

0x00000191:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0196 "subroutine ")

0x00000196:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x00000197:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x01ac "uint8_t")

0x0000019c:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x01c9 "uint16_t")

0x000001a1:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x01df "uint8_t*")

0x000001a6:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x01c9 "uint16_t")

0x000001ab:     NULL

0x000001ac:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01b7 "__uint8_t")
                DW_AT_name	("uint8_t")
                DW_AT_decl_file	("/opt/q32s/include/sys/_stdint.h")
                DW_AT_decl_line	(20)

0x000001b7:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01c2 "unsigned char")
                DW_AT_name	("__uint8_t")
                DW_AT_decl_file	("/opt/q32s/include/machine/_default_types.h")
                DW_AT_decl_line	(29)

0x000001c2:   DW_TAG_base_type
                DW_AT_name	("unsigned char")
                DW_AT_encoding	(DW_ATE_unsigned_char)
                DW_AT_byte_size	(0x01)

0x000001c9:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01d4 "__uint16_t")
                DW_AT_name	("uint16_t")
                DW_AT_decl_file	("/opt/q32s/include/sys/_stdint.h")
                DW_AT_decl_line	(26)

0x000001d4:   DW_TAG_typedef
                DW_AT_type	(cu + 0x017f "unsigned short")
                DW_AT_name	("__uint16_t")
                DW_AT_decl_file	("/opt/q32s/include/machine/_default_types.h")
                DW_AT_decl_line	(43)

0x000001df:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x01ac "uint8_t")

0x000001e4:   DW_TAG_base_type
                DW_AT_name	("sizetype")
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_unsigned)

0x000001eb:   DW_TAG_array_type
                DW_AT_type	(cu + 0x01f7 "l2cap_channel_t")

0x000001f0:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x01e4 "sizetype")
                  DW_AT_count	(0x05)

0x000001f6:     NULL

0x000001f7:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0202 "structure ")
                DW_AT_name	("l2cap_channel_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(222)

0x00000202:   DW_TAG_structure_type
                DW_AT_byte_size	(0x38)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(204)

0x00000206:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x0144 "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(206)
                  DW_AT_data_member_location	(0x00)

0x00000212:     DW_TAG_member
                  DW_AT_name	("handle")
                  DW_AT_type	(cu + 0x024f "hci_con_handle_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(208)
                  DW_AT_data_member_location	(0x04)

0x0000021e:     DW_TAG_member
                  DW_AT_name	("waiting_for_can_send_now")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(211)
                  DW_AT_data_member_location	(0x06)

0x0000022a:     DW_TAG_member
                  DW_AT_name	("connection")
                  DW_AT_type	(cu + 0x00eb "*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(215)
                  DW_AT_data_member_location	(0x08)

0x00000236:     DW_TAG_member
                  DW_AT_name	("packet_handler")
                  DW_AT_type	(cu + 0x0186 "btstack_packet_handler_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(218)
                  DW_AT_data_member_location	(0x0c)

0x00000242:     DW_TAG_member
                  DW_AT_name	("channel_core_data")
                  DW_AT_type	(cu + 0x0265 "channel_core_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(220)
                  DW_AT_data_member_location	(0x10)

0x0000024e:     NULL

0x0000024f:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01c9 "uint16_t")
                DW_AT_name	("hci_con_handle_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h")
                DW_AT_decl_line	(9)

0x0000025a:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01c2 "unsigned char")
                DW_AT_name	("u8")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(11)

0x00000265:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0270 "structure ")
                DW_AT_name	("channel_core_data_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(200)

0x00000270:   DW_TAG_structure_type
                DW_AT_byte_size	(0x28)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(178)

0x00000274:     DW_TAG_member
                  DW_AT_name	("state_var")
                  DW_AT_type	(cu + 0x0174 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(180)
                  DW_AT_data_member_location	(0x00)

0x00000280:     DW_TAG_member
                  DW_AT_name	("state")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(181)
                  DW_AT_data_member_location	(0x02)

0x0000028c:     DW_TAG_member
                  DW_AT_name	("remote_sig_id")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(183)
                  DW_AT_data_member_location	(0x03)

0x00000298:     DW_TAG_member
                  DW_AT_name	("local_sig_id")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(184)
                  DW_AT_data_member_location	(0x04)

0x000002a4:     DW_TAG_member
                  DW_AT_name	("reason")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(186)
                  DW_AT_data_member_location	(0x05)

0x000002b0:     DW_TAG_member
                  DW_AT_name	("address")
                  DW_AT_type	(cu + 0x031d "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(188)
                  DW_AT_data_member_location	(0x06)

0x000002bc:     DW_TAG_member
                  DW_AT_name	("psm")
                  DW_AT_type	(cu + 0x0174 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(189)
                  DW_AT_data_member_location	(0x0c)

0x000002c8:     DW_TAG_member
                  DW_AT_name	("local_cid")
                  DW_AT_type	(cu + 0x0174 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(191)
                  DW_AT_data_member_location	(0x0e)

0x000002d4:     DW_TAG_member
                  DW_AT_name	("remote_cid")
                  DW_AT_type	(cu + 0x0174 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(192)
                  DW_AT_data_member_location	(0x10)

0x000002e0:     DW_TAG_member
                  DW_AT_name	("local_mtu")
                  DW_AT_type	(cu + 0x0174 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(194)
                  DW_AT_data_member_location	(0x12)

0x000002ec:     DW_TAG_member
                  DW_AT_name	("remote_mtu")
                  DW_AT_type	(cu + 0x0174 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(195)
                  DW_AT_data_member_location	(0x14)

0x000002f8:     DW_TAG_member
                  DW_AT_name	("channel_mode")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(197)
                  DW_AT_data_member_location	(0x16)

0x00000304:     DW_TAG_member
                  DW_AT_name	("remote_extended_feature")
                  DW_AT_type	(cu + 0x0334 "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(198)
                  DW_AT_data_member_location	(0x18)

0x00000310:     DW_TAG_member
                  DW_AT_name	("retran_op")
                  DW_AT_type	(cu + 0x0346 "retran_flow_ctl_op_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(199)
                  DW_AT_data_member_location	(0x1c)

0x0000031c:     NULL

0x0000031d:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0328 "uint8_t[]")
                DW_AT_name	("bd_addr_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h")
                DW_AT_decl_line	(7)

0x00000328:   DW_TAG_array_type
                DW_AT_type	(cu + 0x01ac "uint8_t")

0x0000032d:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x01e4 "sizetype")
                  DW_AT_count	(0x06)

0x00000333:     NULL

0x00000334:   DW_TAG_typedef
                DW_AT_type	(cu + 0x033f "unsigned int")
                DW_AT_name	("u32")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(15)

0x0000033f:   DW_TAG_base_type
                DW_AT_name	("unsigned int")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x04)

0x00000346:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0351 "structure ")
                DW_AT_name	("retran_flow_ctl_op_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(174)

0x00000351:   DW_TAG_structure_type
                DW_AT_byte_size	(0x0c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(165)

0x00000355:     DW_TAG_member
                  DW_AT_name	("retransmission_flow_ctl")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(166)
                  DW_AT_data_member_location	(0x00)

0x00000361:     DW_TAG_member
                  DW_AT_name	("length")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(167)
                  DW_AT_data_member_location	(0x01)

0x0000036d:     DW_TAG_member
                  DW_AT_name	("mode")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(168)
                  DW_AT_data_member_location	(0x02)

0x00000379:     DW_TAG_member
                  DW_AT_name	("tx_window")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(169)
                  DW_AT_data_member_location	(0x03)

0x00000385:     DW_TAG_member
                  DW_AT_name	("max_transmit")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(170)
                  DW_AT_data_member_location	(0x04)

0x00000391:     DW_TAG_member
                  DW_AT_name	("retransmission_timeout")
                  DW_AT_type	(cu + 0x0174 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(171)
                  DW_AT_data_member_location	(0x06)

0x0000039d:     DW_TAG_member
                  DW_AT_name	("monitor_timeout")
                  DW_AT_type	(cu + 0x0174 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(172)
                  DW_AT_data_member_location	(0x08)

0x000003a9:     DW_TAG_member
                  DW_AT_name	("max_pdu")
                  DW_AT_type	(cu + 0x0174 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(173)
                  DW_AT_data_member_location	(0x0a)

0x000003b5:     NULL

0x000003b6:   DW_TAG_array_type
                DW_AT_type	(cu + 0x03c2 "rfcomm_multiplexer_t")

0x000003bb:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x01e4 "sizetype")
                  DW_AT_count	(0x01)

0x000003c1:     NULL

0x000003c2:   DW_TAG_typedef
                DW_AT_type	(cu + 0x03cd "structure ")
                DW_AT_name	("rfcomm_multiplexer_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(221)

0x000003cd:   DW_TAG_structure_type
                DW_AT_byte_size	(0x14)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(211)

0x000003d1:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x0144 "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(213)
                  DW_AT_data_member_location	(0x00)

0x000003dd:     DW_TAG_member
                  DW_AT_name	("max_frame_size")
                  DW_AT_type	(cu + 0x0174 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(218)
                  DW_AT_data_member_location	(0x04)

0x000003e9:     DW_TAG_member
                  DW_AT_name	("multiplexer_core_data")
                  DW_AT_type	(cu + 0x03f6 "multiplexer_core_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(219)
                  DW_AT_data_member_location	(0x06)

0x000003f5:     NULL

0x000003f6:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0401 "structure ")
                DW_AT_name	("multiplexer_core_data_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(207)

0x00000401:   DW_TAG_structure_type
                DW_AT_byte_size	(0x0e)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(191)

0x00000405:     DW_TAG_member
                  DW_AT_name	("remote_addr")
                  DW_AT_type	(cu + 0x031d "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(192)
                  DW_AT_data_member_location	(0x00)

0x00000411:     DW_TAG_member
                  DW_AT_name	("l2cap_cid")
                  DW_AT_type	(cu + 0x0174 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(193)
                  DW_AT_data_member_location	(0x06)

0x0000041d:     DW_TAG_member
                  DW_AT_name	("state")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(196)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x08)

0x0000042c:     DW_TAG_member
                  DW_AT_name	("l2cap_credits")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(197)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x08)

0x0000043b:     DW_TAG_member
                  DW_AT_name	("outgoing")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(200)
                  DW_AT_data_member_location	(0x09)

0x00000447:     DW_TAG_member
                  DW_AT_name	("at_least_one_connection")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(202)
                  DW_AT_data_member_location	(0x0a)

0x00000453:     DW_TAG_member
                  DW_AT_name	("send_dm_for_dlci")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(205)
                  DW_AT_data_member_location	(0x0b)

0x0000045f:     DW_TAG_member
                  DW_AT_name	("con_handle")
                  DW_AT_type	(cu + 0x024f "hci_con_handle_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(206)
                  DW_AT_data_member_location	(0x0c)

0x0000046b:     NULL

0x0000046c:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0478 "rfcomm_service_t")

0x00000471:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x01e4 "sizetype")
                  DW_AT_count	(0x01)

0x00000477:     NULL

0x00000478:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0483 "structure ")
                DW_AT_name	("rfcomm_service_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(189)

0x00000483:   DW_TAG_structure_type
                DW_AT_byte_size	(0x14)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(167)

0x00000487:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x0144 "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(169)
                  DW_AT_data_member_location	(0x00)

0x00000493:     DW_TAG_member
                  DW_AT_name	("server_channel")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(172)
                  DW_AT_data_member_location	(0x04)

0x0000049f:     DW_TAG_member
                  DW_AT_name	("incoming_flow_control")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(175)
                  DW_AT_data_member_location	(0x05)

0x000004ab:     DW_TAG_member
                  DW_AT_name	("incoming_initial_credits")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(178)
                  DW_AT_data_member_location	(0x06)

0x000004b7:     DW_TAG_member
                  DW_AT_name	("max_frame_size")
                  DW_AT_type	(cu + 0x0174 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(181)
                  DW_AT_data_member_location	(0x08)

0x000004c3:     DW_TAG_member
                  DW_AT_name	("connection")
                  DW_AT_type	(cu + 0x00eb "*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(184)
                  DW_AT_data_member_location	(0x0c)

0x000004cf:     DW_TAG_member
                  DW_AT_name	("packet_handler")
                  DW_AT_type	(cu + 0x0186 "btstack_packet_handler_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(187)
                  DW_AT_data_member_location	(0x10)

0x000004db:     NULL

0x000004dc:   DW_TAG_array_type
                DW_AT_type	(cu + 0x04e8 "rfcomm_channel_t")

0x000004e1:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x01e4 "sizetype")
                  DW_AT_count	(0x01)

0x000004e7:     NULL

0x000004e8:   DW_TAG_typedef
                DW_AT_type	(cu + 0x04f4 "structure ")
                DW_AT_name	("rfcomm_channel_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(282)

0x000004f4:   DW_TAG_structure_type
                DW_AT_byte_size	(0x34)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(262)

0x000004f9:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x0144 "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(264)
                  DW_AT_data_member_location	(0x00)

0x00000506:     DW_TAG_member
                  DW_AT_name	("multiplexer")
                  DW_AT_type	(cu + 0x0555 "rfcomm_multiplexer_t*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(266)
                  DW_AT_data_member_location	(0x04)

0x00000513:     DW_TAG_member
                  DW_AT_name	("rfc_channel_core_data")
                  DW_AT_type	(cu + 0x055a "rfc_channel_core_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(268)
                  DW_AT_data_member_location	(0x08)

0x00000520:     DW_TAG_member
                  DW_AT_name	("max_frame_size")
                  DW_AT_type	(cu + 0x0174 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(271)
                  DW_AT_data_member_location	(0x26)

0x0000052d:     DW_TAG_member
                  DW_AT_name	("service")
                  DW_AT_type	(cu + 0x067c "rfcomm_service_t*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(274)
                  DW_AT_data_member_location	(0x28)

0x0000053a:     DW_TAG_member
                  DW_AT_name	("packet_handler")
                  DW_AT_type	(cu + 0x0186 "btstack_packet_handler_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(277)
                  DW_AT_data_member_location	(0x2c)

0x00000547:     DW_TAG_member
                  DW_AT_name	("connection")
                  DW_AT_type	(cu + 0x00eb "*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(280)
                  DW_AT_data_member_location	(0x30)

0x00000554:     NULL

0x00000555:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x03c2 "rfcomm_multiplexer_t")

0x0000055a:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0566 "structure ")
                DW_AT_name	("rfc_channel_core_data_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(259)

0x00000566:   DW_TAG_structure_type
                DW_AT_byte_size	(0x1e)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(223)

0x0000056a:     DW_TAG_member
                  DW_AT_name	("rfc_channel_type")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(224)
                  DW_AT_data_member_location	(0x00)

0x00000576:     DW_TAG_member
                  DW_AT_name	("remote_addr")
                  DW_AT_type	(cu + 0x031d "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(225)
                  DW_AT_data_member_location	(0x01)

0x00000582:     DW_TAG_member
                  DW_AT_name	("rfcomm_cid")
                  DW_AT_type	(cu + 0x0174 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(226)
                  DW_AT_data_member_location	(0x08)

0x0000058e:     DW_TAG_member
                  DW_AT_name	("outgoing")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(227)
                  DW_AT_data_member_location	(0x0a)

0x0000059a:     DW_TAG_member
                  DW_AT_name	("dlci")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(228)
                  DW_AT_data_member_location	(0x0b)

0x000005a6:     DW_TAG_member
                  DW_AT_name	("packets_granted")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(231)
                  DW_AT_data_member_location	(0x0c)

0x000005b2:     DW_TAG_member
                  DW_AT_name	("credits_outgoing")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(234)
                  DW_AT_data_member_location	(0x0d)

0x000005be:     DW_TAG_member
                  DW_AT_name	("new_credits_incoming")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(237)
                  DW_AT_data_member_location	(0x0e)

0x000005ca:     DW_TAG_member
                  DW_AT_name	("credits_incoming")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(240)
                  DW_AT_data_member_location	(0x0f)

0x000005d6:     DW_TAG_member
                  DW_AT_name	("incoming_flow_control")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(243)
                  DW_AT_data_member_location	(0x10)

0x000005e2:     DW_TAG_member
                  DW_AT_name	("state")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(247)
                  DW_AT_data_member_location	(0x11)

0x000005ee:     DW_TAG_member
                  DW_AT_name	("pn_priority")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(250)
                  DW_AT_data_member_location	(0x12)

0x000005fa:     DW_TAG_member
                  DW_AT_name	("state_var")
                  DW_AT_type	(cu + 0x0174 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(254)
                  DW_AT_data_member_location	(0x14)

0x00000606:     DW_TAG_member
                  DW_AT_name	("rpn_data")
                  DW_AT_type	(cu + 0x0614 "rfcomm_rpn_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(257)
                  DW_AT_data_member_location	(0x16)

0x00000613:     NULL

0x00000614:   DW_TAG_typedef
                DW_AT_type	(cu + 0x061f "rfcomm_rpn_data")
                DW_AT_name	("rfcomm_rpn_data_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(159)

0x0000061f:   DW_TAG_structure_type
                DW_AT_name	("rfcomm_rpn_data")
                DW_AT_byte_size	(0x07)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(151)

0x00000627:     DW_TAG_member
                  DW_AT_name	("baud_rate")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(152)
                  DW_AT_data_member_location	(0x00)

0x00000633:     DW_TAG_member
                  DW_AT_name	("flags")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(153)
                  DW_AT_data_member_location	(0x01)

0x0000063f:     DW_TAG_member
                  DW_AT_name	("flow_control")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(154)
                  DW_AT_data_member_location	(0x02)

0x0000064b:     DW_TAG_member
                  DW_AT_name	("xon")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(155)
                  DW_AT_data_member_location	(0x03)

0x00000657:     DW_TAG_member
                  DW_AT_name	("xoff")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(156)
                  DW_AT_data_member_location	(0x04)

0x00000663:     DW_TAG_member
                  DW_AT_name	("parameter_mask_0")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(157)
                  DW_AT_data_member_location	(0x05)

0x0000066f:     DW_TAG_member
                  DW_AT_name	("parameter_mask_1")
                  DW_AT_type	(cu + 0x025a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(158)
                  DW_AT_data_member_location	(0x06)

0x0000067b:     NULL

0x0000067c:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0478 "rfcomm_service_t")

0x00000681:   DW_TAG_variable
                DW_AT_name	("le_stack_pool")
                DW_AT_type	(cu + 0x0692 "stack_le_pool_t*")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btcommon/btstack_memory.c")
                DW_AT_decl_line	(24)
                DW_AT_location	(DW_OP_addr 0x4)

0x00000692:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0697 "stack_le_pool_t")

0x00000697:   DW_TAG_typedef
                DW_AT_type	(cu + 0x06a2 "structure ")
                DW_AT_name	("stack_le_pool_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                DW_AT_decl_line	(93)

0x000006a2:   DW_TAG_structure_type
                DW_AT_byte_size	(0x10)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                DW_AT_decl_line	(61)

0x000006a6:     DW_TAG_member
                  DW_AT_name	("le_hci_connection_pool")
                  DW_AT_type	(cu + 0x00e0 "memory_pool_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                  DW_AT_decl_line	(64)
                  DW_AT_data_member_location	(0x00)

0x000006b2:     DW_TAG_member
                  DW_AT_name	("gatt_client_pool")
                  DW_AT_type	(cu + 0x00e0 "memory_pool_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                  DW_AT_decl_line	(67)
                  DW_AT_data_member_location	(0x04)

0x000006be:     DW_TAG_member
                  DW_AT_name	("le_hci_connection_storage")
                  DW_AT_type	(cu + 0x06d7 "le_hci_connection_t*[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                  DW_AT_decl_line	(79)
                  DW_AT_data_member_location	(0x08)

0x000006ca:     DW_TAG_member
                  DW_AT_name	("gatt_client_storage")
                  DW_AT_type	(cu + 0x0eb4 "gatt_client_t*[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                  DW_AT_decl_line	(83)
                  DW_AT_data_member_location	(0x0c)

0x000006d6:     NULL

0x000006d7:   DW_TAG_array_type
                DW_AT_type	(cu + 0x06e3 "le_hci_connection_t*")

0x000006dc:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x01e4 "sizetype")
                  DW_AT_count	(0x01)

0x000006e2:     NULL

0x000006e3:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x06e8 "le_hci_connection_t")

0x000006e8:   DW_TAG_typedef
                DW_AT_type	(cu + 0x06f4 "__le_hci_connection")
                DW_AT_name	("le_hci_connection_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(605)

0x000006f4:   DW_TAG_structure_type
                DW_AT_name	("__le_hci_connection")
                DW_AT_byte_size	(0x04c8)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(571)

0x000006fe:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x0144 "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(572)
                  DW_AT_data_member_location	(0x00)

0x0000070b:     DW_TAG_member
                  DW_AT_name	("address")
                  DW_AT_type	(cu + 0x031d "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(574)
                  DW_AT_data_member_location	(0x04)

0x00000718:     DW_TAG_member
                  DW_AT_name	("con_handle")
                  DW_AT_type	(cu + 0x024f "hci_con_handle_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(576)
                  DW_AT_data_member_location	(0x0a)

0x00000725:     DW_TAG_member
                  DW_AT_name	("address_type")
                  DW_AT_type	(cu + 0x080a "bd_addr_type_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(578)
                  DW_AT_data_member_location	(0x0c)

0x00000732:     DW_TAG_member
                  DW_AT_name	("role")
                  DW_AT_type	(cu + 0x01ac "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(581)
                  DW_AT_data_member_location	(0x10)

0x0000073f:     DW_TAG_member
                  DW_AT_name	("le_con_parameter_update_state")
                  DW_AT_type	(cu + 0x083d "le_con_parameter_update_state_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(584)
                  DW_AT_data_member_location	(0x14)

0x0000074c:     DW_TAG_member
                  DW_AT_name	("le_con_param_update_identifier")
                  DW_AT_type	(cu + 0x01ac "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(585)
                  DW_AT_data_member_location	(0x18)

0x00000759:     DW_TAG_member
                  DW_AT_name	("le_conn_interval_min")
                  DW_AT_type	(cu + 0x01c9 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(586)
                  DW_AT_data_member_location	(0x1a)

0x00000766:     DW_TAG_member
                  DW_AT_name	("le_conn_interval_max")
                  DW_AT_type	(cu + 0x01c9 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(587)
                  DW_AT_data_member_location	(0x1c)

0x00000773:     DW_TAG_member
                  DW_AT_name	("le_conn_latency")
                  DW_AT_type	(cu + 0x01c9 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(588)
                  DW_AT_data_member_location	(0x1e)

0x00000780:     DW_TAG_member
                  DW_AT_name	("le_supervision_timeout")
                  DW_AT_type	(cu + 0x01c9 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(589)
                  DW_AT_data_member_location	(0x20)

0x0000078d:     DW_TAG_member
                  DW_AT_name	("sm_connection")
                  DW_AT_type	(cu + 0x086b "sm_connection_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(592)
                  DW_AT_data_member_location	(0x24)

0x0000079a:     DW_TAG_member
                  DW_AT_name	("att_server")
                  DW_AT_type	(cu + 0x0c69 "att_server_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(595)
                  DW_AT_data_member_location	(0x5c)

0x000007a7:     DW_TAG_member
                  DW_AT_name	("acl_recombination_buffer")
                  DW_AT_type	(cu + 0x0ea7 "uint8_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(597)
                  DW_AT_data_member_location	(0x02a0)

0x000007b5:     DW_TAG_member
                  DW_AT_name	("acl_recombination_pos")
                  DW_AT_type	(cu + 0x01c9 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(598)
                  DW_AT_data_member_location	(0x04b2)

0x000007c3:     DW_TAG_member
                  DW_AT_name	("acl_recombination_length")
                  DW_AT_type	(cu + 0x01c9 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(599)
                  DW_AT_data_member_location	(0x04b4)

0x000007d1:     DW_TAG_member
                  DW_AT_name	("num_acl_packets_sent")
                  DW_AT_type	(cu + 0x01ac "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(600)
                  DW_AT_data_member_location	(0x04b6)

0x000007df:     DW_TAG_member
                  DW_AT_name	("own_id_address")
                  DW_AT_type	(cu + 0x031d "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(602)
                  DW_AT_data_member_location	(0x04b7)

0x000007ed:     DW_TAG_member
                  DW_AT_name	("own_address")
                  DW_AT_type	(cu + 0x031d "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(603)
                  DW_AT_data_member_location	(0x04bd)

0x000007fb:     DW_TAG_member
                  DW_AT_name	("own_address_type")
                  DW_AT_type	(cu + 0x080a "bd_addr_type_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(604)
                  DW_AT_data_member_location	(0x04c4)

0x00000809:     NULL

0x0000080a:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0816 "enumeration ")
                DW_AT_name	("bd_addr_type_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(1475)

0x00000816:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(1469)

0x0000081b:     DW_TAG_enumerator
                  DW_AT_name	("BD_ADDR_TYPE_LE_PUBLIC")
                  DW_AT_const_value	(0)

0x00000821:     DW_TAG_enumerator
                  DW_AT_name	("BD_ADDR_TYPE_LE_RANDOM")
                  DW_AT_const_value	(1)

0x00000827:     DW_TAG_enumerator
                  DW_AT_name	("BD_ADDR_TYPE_SCO")
                  DW_AT_const_value	(254)

0x0000082e:     DW_TAG_enumerator
                  DW_AT_name	("BD_ADDR_TYPE_CLASSIC")
                  DW_AT_const_value	(255)

0x00000835:     DW_TAG_enumerator
                  DW_AT_name	("BD_ADDR_TYPE_UNKNOWN")
                  DW_AT_const_value	(254)

0x0000083c:     NULL

0x0000083d:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0848 "enumeration ")
                DW_AT_name	("le_con_parameter_update_state_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(252)

0x00000848:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(246)

0x0000084c:     DW_TAG_enumerator
                  DW_AT_name	("CON_PARAMETER_UPDATE_NONE")
                  DW_AT_const_value	(0)

0x00000852:     DW_TAG_enumerator
                  DW_AT_name	("CON_PARAMETER_UPDATE_SEND_REQUEST")
                  DW_AT_const_value	(1)

0x00000858:     DW_TAG_enumerator
                  DW_AT_name	("CON_PARAMETER_UPDATE_SEND_RESPONSE")
                  DW_AT_const_value	(2)

0x0000085e:     DW_TAG_enumerator
                  DW_AT_name	("CON_PARAMETER_UPDATE_CHANGE_HCI_CON_PARAMETERS")
                  DW_AT_const_value	(3)

0x00000864:     DW_TAG_enumerator
                  DW_AT_name	("CON_PARAMETER_UPDATE_DENY")
                  DW_AT_const_value	(4)

0x0000086a:     NULL

0x0000086b:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0877 "sm_connection")
                DW_AT_name	("sm_connection_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(475)

0x00000877:   DW_TAG_structure_type
                DW_AT_name	("sm_connection")
                DW_AT_byte_size	(0x38)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(456)

0x00000880:     DW_TAG_member
                  DW_AT_name	("sm_handle")
                  DW_AT_type	(cu + 0x024f "hci_con_handle_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(457)
                  DW_AT_data_member_location	(0x00)

0x0000088d:     DW_TAG_member
                  DW_AT_name	("sm_role")
                  DW_AT_type	(cu + 0x01ac "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(458)
                  DW_AT_data_member_location	(0x02)

0x0000089a:     DW_TAG_member
                  DW_AT_name	("sm_security_request_received")
                  DW_AT_type	(cu + 0x01ac "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(459)
                  DW_AT_data_member_location	(0x03)

0x000008a7:     DW_TAG_member
                  DW_AT_name	("sm_bonding_requested")
                  DW_AT_type	(cu + 0x01ac "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(460)
                  DW_AT_data_member_location	(0x04)

0x000008b4:     DW_TAG_member
                  DW_AT_name	("sm_peer_addr_type")
                  DW_AT_type	(cu + 0x01ac "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(461)
                  DW_AT_data_member_location	(0x05)

0x000008c1:     DW_TAG_member
                  DW_AT_name	("sm_peer_address")
                  DW_AT_type	(cu + 0x031d "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(462)
                  DW_AT_data_member_location	(0x06)

0x000008ce:     DW_TAG_member
                  DW_AT_name	("sm_engine_state")
                  DW_AT_type	(cu + 0x096b "security_manager_state_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(463)
                  DW_AT_data_member_location	(0x0c)

0x000008db:     DW_TAG_member
                  DW_AT_name	("sm_irk_lookup_state")
                  DW_AT_type	(cu + 0x0beb "irk_lookup_state_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(464)
                  DW_AT_data_member_location	(0x10)

0x000008e8:     DW_TAG_member
                  DW_AT_name	("sm_connection_encrypted")
                  DW_AT_type	(cu + 0x01ac "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(465)
                  DW_AT_data_member_location	(0x14)

0x000008f5:     DW_TAG_member
                  DW_AT_name	("sm_connection_authenticated")
                  DW_AT_type	(cu + 0x01ac "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(466)
                  DW_AT_data_member_location	(0x15)

0x00000902:     DW_TAG_member
                  DW_AT_name	("sm_actual_encryption_key_size")
                  DW_AT_type	(cu + 0x01ac "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(467)
                  DW_AT_data_member_location	(0x16)

0x0000090f:     DW_TAG_member
                  DW_AT_name	("sm_m_preq")
                  DW_AT_type	(cu + 0x0c1b "sm_pairing_packet_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(468)
                  DW_AT_data_member_location	(0x17)

0x0000091c:     DW_TAG_member
                  DW_AT_name	("sm_connection_authorization_state")
                  DW_AT_type	(cu + 0x0c33 "authorization_state_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(469)
                  DW_AT_data_member_location	(0x20)

0x00000929:     DW_TAG_member
                  DW_AT_name	("sm_local_ediv")
                  DW_AT_type	(cu + 0x01c9 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(470)
                  DW_AT_data_member_location	(0x24)

0x00000936:     DW_TAG_member
                  DW_AT_name	("sm_local_rand")
                  DW_AT_type	(cu + 0x0c5d "uint8_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(471)
                  DW_AT_data_member_location	(0x26)

0x00000943:     DW_TAG_member
                  DW_AT_name	("sm_disconn_reason")
                  DW_AT_type	(cu + 0x01ac "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(472)
                  DW_AT_data_member_location	(0x2e)

0x00000950:     DW_TAG_member
                  DW_AT_name	("sm_le_db_index")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(473)
                  DW_AT_data_member_location	(0x30)

0x0000095d:     DW_TAG_member
                  DW_AT_name	("sm_timeout_id")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(474)
                  DW_AT_data_member_location	(0x34)

0x0000096a:     NULL

0x0000096b:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0977 "enumeration ")
                DW_AT_name	("security_manager_state_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(433)

0x00000977:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(295)

0x0000097c:     DW_TAG_enumerator
                  DW_AT_name	("SM_GENERAL_IDLE")
                  DW_AT_const_value	(0)

0x00000982:     DW_TAG_enumerator
                  DW_AT_name	("SM_GENERAL_SEND_PAIRING_FAILED")
                  DW_AT_const_value	(1)

0x00000988:     DW_TAG_enumerator
                  DW_AT_name	("SM_GENERAL_TIMEOUT")
                  DW_AT_const_value	(2)

0x0000098e:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH1_W4_USER_RESPONSE")
                  DW_AT_const_value	(3)

0x00000994:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_GET_RANDOM_TK")
                  DW_AT_const_value	(4)

0x0000099a:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_W4_RANDOM_TK")
                  DW_AT_const_value	(5)

0x000009a0:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_GET_RANDOM_A")
                  DW_AT_const_value	(6)

0x000009a6:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_W4_RANDOM_A")
                  DW_AT_const_value	(7)

0x000009ac:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_GET_RANDOM_B")
                  DW_AT_const_value	(8)

0x000009b2:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_W4_RANDOM_B")
                  DW_AT_const_value	(9)

0x000009b8:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_GET_ENC_A")
                  DW_AT_const_value	(10)

0x000009be:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_W4_ENC_A")
                  DW_AT_const_value	(11)

0x000009c4:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_GET_ENC_B")
                  DW_AT_const_value	(12)

0x000009ca:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_W4_ENC_B")
                  DW_AT_const_value	(13)

0x000009d0:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_GET_ENC_C")
                  DW_AT_const_value	(14)

0x000009d6:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_W4_ENC_C")
                  DW_AT_const_value	(15)

0x000009dc:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_GET_ENC_D")
                  DW_AT_const_value	(16)

0x000009e2:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_W4_ENC_D")
                  DW_AT_const_value	(17)

0x000009e8:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_SEND_PAIRING_CONFIRM")
                  DW_AT_const_value	(18)

0x000009ee:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_SEND_PAIRING_RANDOM")
                  DW_AT_const_value	(19)

0x000009f4:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_CALC_STK")
                  DW_AT_const_value	(20)

0x000009fa:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_W4_STK")
                  DW_AT_const_value	(21)

0x00000a00:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_W4_CONNECTION_ENCRYPTED")
                  DW_AT_const_value	(22)

0x00000a06:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_GET_RANDOM")
                  DW_AT_const_value	(23)

0x00000a0c:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_W4_RANDOM")
                  DW_AT_const_value	(24)

0x00000a12:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_GET_DIV")
                  DW_AT_const_value	(25)

0x00000a18:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_W4_DIV")
                  DW_AT_const_value	(26)

0x00000a1e:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_Y_GET_ENC")
                  DW_AT_const_value	(27)

0x00000a24:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_Y_W4_ENC")
                  DW_AT_const_value	(28)

0x00000a2a:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_LTK_GET_ENC")
                  DW_AT_const_value	(29)

0x00000a30:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_LTK_W4_ENC")
                  DW_AT_const_value	(30)

0x00000a36:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_CSRK_GET_ENC")
                  DW_AT_const_value	(31)

0x00000a3c:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_CSRK_W4_ENC")
                  DW_AT_const_value	(32)

0x00000a42:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_DISTRIBUTE_KEYS")
                  DW_AT_const_value	(33)

0x00000a48:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_RECEIVE_KEYS")
                  DW_AT_const_value	(34)

0x00000a4e:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_IDLE")
                  DW_AT_const_value	(35)

0x00000a54:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_SEND_SECURITY_REQUEST")
                  DW_AT_const_value	(36)

0x00000a5a:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH0_RECEIVED_LTK_REQUEST")
                  DW_AT_const_value	(37)

0x00000a60:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH0_RECEIVED_LTK_W4_IRK")
                  DW_AT_const_value	(38)

0x00000a66:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH0_SEND_LTK_REQUESTED_NEGATIVE_REPLY")
                  DW_AT_const_value	(39)

0x00000a6c:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH1_W4_PAIRING_REQUEST")
                  DW_AT_const_value	(40)

0x00000a72:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH1_PAIRING_REQUEST_RECEIVED")
                  DW_AT_const_value	(41)

0x00000a78:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH1_SEND_PAIRING_RESPONSE")
                  DW_AT_const_value	(42)

0x00000a7e:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH1_W4_PAIRING_CONFIRM")
                  DW_AT_const_value	(43)

0x00000a84:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH2_W4_PAIRING_RANDOM")
                  DW_AT_const_value	(44)

0x00000a8a:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH2_W4_LTK_REQUEST")
                  DW_AT_const_value	(45)

0x00000a90:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH2_SEND_LTK_REPLY")
                  DW_AT_const_value	(46)

0x00000a96:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH4_Y_GET_ENC")
                  DW_AT_const_value	(47)

0x00000a9c:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH4_Y_W4_ENC")
                  DW_AT_const_value	(48)

0x00000aa2:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH4_LTK_GET_ENC")
                  DW_AT_const_value	(49)

0x00000aa8:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH4_LTK_W4_ENC")
                  DW_AT_const_value	(50)

0x00000aae:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH4_SEND_LTK_REPLY")
                  DW_AT_const_value	(51)

0x00000ab4:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_CONNECTED")
                  DW_AT_const_value	(52)

0x00000aba:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_PH0_HAS_LTK")
                  DW_AT_const_value	(53)

0x00000ac0:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_PH0_SEND_START_ENCRYPTION")
                  DW_AT_const_value	(54)

0x00000ac6:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_PH0_W4_CONNECTION_ENCRYPTED")
                  DW_AT_const_value	(55)

0x00000acc:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_PH1_W2_SEND_PAIRING_REQUEST")
                  DW_AT_const_value	(56)

0x00000ad2:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_PH1_SEND_PAIRING_REQUEST")
                  DW_AT_const_value	(57)

0x00000ad8:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_PH1_W4_PAIRING_RESPONSE")
                  DW_AT_const_value	(58)

0x00000ade:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_PH2_W4_PAIRING_CONFIRM")
                  DW_AT_const_value	(59)

0x00000ae4:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_PH2_W4_PAIRING_RANDOM")
                  DW_AT_const_value	(60)

0x00000aea:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_PH3_SEND_START_ENCRYPTION")
                  DW_AT_const_value	(61)

0x00000af0:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_RECEIVED_LTK_REQUEST")
                  DW_AT_const_value	(62)

0x00000af6:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_SEND_PUBLIC_KEY_COMMAND")
                  DW_AT_const_value	(63)

0x00000afc:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_PUBLIC_KEY_COMMAND")
                  DW_AT_const_value	(64)

0x00000b03:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_GET_RANDOM_A")
                  DW_AT_const_value	(65)

0x00000b0a:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_GET_RANDOM_A")
                  DW_AT_const_value	(66)

0x00000b11:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_GET_RANDOM_B")
                  DW_AT_const_value	(67)

0x00000b18:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_GET_RANDOM_B")
                  DW_AT_const_value	(68)

0x00000b1f:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CMAC_FOR_CONFIRMATION")
                  DW_AT_const_value	(69)

0x00000b26:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CMAC_FOR_CONFIRMATION")
                  DW_AT_const_value	(70)

0x00000b2d:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_SEND_CONFIRMATION")
                  DW_AT_const_value	(71)

0x00000b34:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CMAC_FOR_CHECK_CONFIRMATION")
                  DW_AT_const_value	(72)

0x00000b3b:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CMAC_FOR_CHECK_CONFIRMATION")
                  DW_AT_const_value	(73)

0x00000b42:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CONFIRMATION")
                  DW_AT_const_value	(74)

0x00000b49:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_SEND_PAIRING_RANDOM")
                  DW_AT_const_value	(75)

0x00000b50:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_PAIRING_RANDOM")
                  DW_AT_const_value	(76)

0x00000b57:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CALCULATE_G2")
                  DW_AT_const_value	(77)

0x00000b5e:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CALCULATE_G2")
                  DW_AT_const_value	(78)

0x00000b65:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CALCULATE_DHKEY")
                  DW_AT_const_value	(79)

0x00000b6c:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CALCULATE_F5_SALT")
                  DW_AT_const_value	(80)

0x00000b73:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CALCULATE_F5_SALT")
                  DW_AT_const_value	(81)

0x00000b7a:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CALCULATE_F5_MACKEY")
                  DW_AT_const_value	(82)

0x00000b81:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CALCULATE_F5_MACKEY")
                  DW_AT_const_value	(83)

0x00000b88:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CALCULATE_F5_LTK")
                  DW_AT_const_value	(84)

0x00000b8f:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CALCULATE_F5_LTK")
                  DW_AT_const_value	(85)

0x00000b96:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CALCULATE_F6_FOR_DHKEY_CHECK")
                  DW_AT_const_value	(86)

0x00000b9d:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CALCULATE_F6_FOR_DHKEY_CHECK")
                  DW_AT_const_value	(87)

0x00000ba4:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CALCULATE_F6_TO_VERIFY_DHKEY_CHECK")
                  DW_AT_const_value	(88)

0x00000bab:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CALCULATE_F6_TO_VERIFY_DHKEY_CHECK")
                  DW_AT_const_value	(89)

0x00000bb2:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_USER_RESPONSE")
                  DW_AT_const_value	(90)

0x00000bb9:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_SEND_DHKEY_CHECK_COMMAND")
                  DW_AT_const_value	(91)

0x00000bc0:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_DHKEY_CHECK_COMMAND")
                  DW_AT_const_value	(92)

0x00000bc7:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_LTK_REQUEST_SC")
                  DW_AT_const_value	(93)

0x00000bce:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CALCULATE_H6_ILK")
                  DW_AT_const_value	(94)

0x00000bd5:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CALCULATE_H6_ILK")
                  DW_AT_const_value	(95)

0x00000bdc:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CALCULATE_H6_BR_EDR_LINK_KEY")
                  DW_AT_const_value	(96)

0x00000be3:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CALCULATE_H6_BR_EDR_LINK_KEY")
                  DW_AT_const_value	(97)

0x00000bea:     NULL

0x00000beb:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0bf7 "enumeration ")
                DW_AT_name	("irk_lookup_state_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(442)

0x00000bf7:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(436)

0x00000bfc:     DW_TAG_enumerator
                  DW_AT_name	("IRK_LOOKUP_IDLE")
                  DW_AT_const_value	(0)

0x00000c02:     DW_TAG_enumerator
                  DW_AT_name	("IRK_LOOKUP_W4_READY")
                  DW_AT_const_value	(1)

0x00000c08:     DW_TAG_enumerator
                  DW_AT_name	("IRK_LOOKUP_STARTED")
                  DW_AT_const_value	(2)

0x00000c0e:     DW_TAG_enumerator
                  DW_AT_name	("IRK_LOOKUP_SUCCEEDED")
                  DW_AT_const_value	(3)

0x00000c14:     DW_TAG_enumerator
                  DW_AT_name	("IRK_LOOKUP_FAILED")
                  DW_AT_const_value	(4)

0x00000c1a:     NULL

0x00000c1b:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0c27 "uint8_t[]")
                DW_AT_name	("sm_pairing_packet_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(452)

0x00000c27:   DW_TAG_array_type
                DW_AT_type	(cu + 0x01ac "uint8_t")

0x00000c2c:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x01e4 "sizetype")
                  DW_AT_count	(0x07)

0x00000c32:     NULL

0x00000c33:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0c3f "enumeration ")
                DW_AT_name	("authorization_state_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(450)

0x00000c3f:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(445)

0x00000c44:     DW_TAG_enumerator
                  DW_AT_name	("AUTHORIZATION_UNKNOWN")
                  DW_AT_const_value	(0)

0x00000c4a:     DW_TAG_enumerator
                  DW_AT_name	("AUTHORIZATION_PENDING")
                  DW_AT_const_value	(1)

0x00000c50:     DW_TAG_enumerator
                  DW_AT_name	("AUTHORIZATION_DECLINED")
                  DW_AT_const_value	(2)

0x00000c56:     DW_TAG_enumerator
                  DW_AT_name	("AUTHORIZATION_GRANTED")
                  DW_AT_const_value	(3)

0x00000c5c:     NULL

0x00000c5d:   DW_TAG_array_type
                DW_AT_type	(cu + 0x01ac "uint8_t")

0x00000c62:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x01e4 "sizetype")
                  DW_AT_count	(0x08)

0x00000c68:     NULL

0x00000c69:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0c74 "structure ")
                DW_AT_name	("att_server_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                DW_AT_decl_line	(187)

0x00000c74:   DW_TAG_structure_type
                DW_AT_byte_size	(0x0244)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                DW_AT_decl_line	(164)

0x00000c79:     DW_TAG_member
                  DW_AT_name	("state")
                  DW_AT_type	(cu + 0x0d4f "att_server_state_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(165)
                  DW_AT_data_member_location	(0x00)

0x00000c85:     DW_TAG_member
                  DW_AT_name	("peer_addr_type")
                  DW_AT_type	(cu + 0x01ac "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(167)
                  DW_AT_data_member_location	(0x04)

0x00000c91:     DW_TAG_member
                  DW_AT_name	("peer_address")
                  DW_AT_type	(cu + 0x031d "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(168)
                  DW_AT_data_member_location	(0x05)

0x00000c9d:     DW_TAG_member
                  DW_AT_name	("ir_le_device_db_index")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(170)
                  DW_AT_data_member_location	(0x0c)

0x00000ca9:     DW_TAG_member
                  DW_AT_name	("ir_lookup_active")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(171)
                  DW_AT_data_member_location	(0x10)

0x00000cb5:     DW_TAG_member
                  DW_AT_name	("value_indication_handle")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(173)
                  DW_AT_data_member_location	(0x14)

0x00000cc1:     DW_TAG_member
                  DW_AT_name	("value_indication_timer")
                  DW_AT_type	(cu + 0x0d77 "btstack_timer_source_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(174)
                  DW_AT_data_member_location	(0x18)

0x00000ccd:     DW_TAG_member
                  DW_AT_name	("connection")
                  DW_AT_type	(cu + 0x0e2d "att_connection_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(176)
                  DW_AT_data_member_location	(0x2c)

0x00000cd9:     DW_TAG_member
                  DW_AT_name	("request_size")
                  DW_AT_type	(cu + 0x01c9 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(178)
                  DW_AT_data_member_location	(0x36)

0x00000ce5:     DW_TAG_member
                  DW_AT_name	("request_buffer")
                  DW_AT_type	(cu + 0x0e89 "uint8_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(179)
                  DW_AT_data_member_location	(0x38)

0x00000cf1:     DW_TAG_member
                  DW_AT_name	("flow_hold_flag")
                  DW_AT_type	(cu + 0x01ac "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(181)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x07)
                  DW_AT_data_member_location	(0x023d)

0x00000d01:     DW_TAG_member
                  DW_AT_name	("mtu_request_flag")
                  DW_AT_type	(cu + 0x01ac "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(182)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x06)
                  DW_AT_data_member_location	(0x023d)

0x00000d11:     DW_TAG_member
                  DW_AT_name	("check_remote_tag")
                  DW_AT_type	(cu + 0x01ac "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(183)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x03)
                  DW_AT_bit_offset	(0x03)
                  DW_AT_data_member_location	(0x023d)

0x00000d21:     DW_TAG_member
                  DW_AT_name	("request_busy")
                  DW_AT_type	(cu + 0x01ac "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(184)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x02)
                  DW_AT_data_member_location	(0x023d)

0x00000d31:     DW_TAG_member
                  DW_AT_name	("reserverd")
                  DW_AT_type	(cu + 0x01ac "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(185)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x023d)

0x00000d41:     DW_TAG_member
                  DW_AT_name	("result_callback")
                  DW_AT_type	(cu + 0x0e96 "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(186)
                  DW_AT_data_member_location	(0x0240)

0x00000d4e:     NULL

0x00000d4f:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0d5a "enumeration ")
                DW_AT_name	("att_server_state_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                DW_AT_decl_line	(162)

0x00000d5a:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                DW_AT_decl_line	(157)

0x00000d5e:     DW_TAG_enumerator
                  DW_AT_name	("ATT_SERVER_IDLE")
                  DW_AT_const_value	(0)

0x00000d64:     DW_TAG_enumerator
                  DW_AT_name	("ATT_SERVER_REQUEST_RECEIVED")
                  DW_AT_const_value	(1)

0x00000d6a:     DW_TAG_enumerator
                  DW_AT_name	("ATT_SERVER_W4_SIGNED_WRITE_VALIDATION")
                  DW_AT_const_value	(2)

0x00000d70:     DW_TAG_enumerator
                  DW_AT_name	("ATT_SERVER_REQUEST_RECEIVED_AND_VALIDATED")
                  DW_AT_const_value	(3)

0x00000d76:     NULL

0x00000d77:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0d82 "btstack_timer_source")
                DW_AT_name	("btstack_timer_source_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                DW_AT_decl_line	(19)

0x00000d82:   DW_TAG_structure_type
                DW_AT_name	("btstack_timer_source")
                DW_AT_byte_size	(0x14)
