; ModuleID = 'btstack_memory.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btcommon/btstack_memory.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.stack_bredr_pool_t = type { i8*, i8*, i8*, i8*, i8*, [4 x %struct.l2cap_service_t], [5 x %struct.l2cap_channel_t], [1 x %struct.rfcomm_multiplexer_t], [1 x %struct.rfcomm_service_t], [1 x %struct.rfcomm_channel_t] }
%struct.l2cap_service_t = type { %struct.btstack_linked_item, i16, i16, i8*, void (i8, i16, i8*, i16)* }
%struct.btstack_linked_item = type { %struct.btstack_linked_item* }
%struct.l2cap_channel_t = type { %struct.btstack_linked_item, i16, i8, i8*, void (i8, i16, i8*, i16)*, %struct.channel_core_data_t }
%struct.channel_core_data_t = type { i16, i8, i8, i8, i8, [6 x i8], i16, i16, i16, i16, i16, i8, i32, %struct.retran_flow_ctl_op_t }
%struct.retran_flow_ctl_op_t = type { i8, i8, i8, i8, i8, i16, i16, i16 }
%struct.rfcomm_multiplexer_t = type { %struct.btstack_linked_item, i16, %struct.multiplexer_core_data_t }
%struct.multiplexer_core_data_t = type { [6 x i8], i16, i8, i8, i8, i8, i16 }
%struct.rfcomm_service_t = type { %struct.btstack_linked_item, i8, i8, i8, i16, i8*, void (i8, i16, i8*, i16)* }
%struct.rfcomm_channel_t = type { %struct.btstack_linked_item, %struct.rfcomm_multiplexer_t*, %struct.rfc_channel_core_data_t, i16, %struct.rfcomm_service_t*, void (i8, i16, i8*, i16)*, i8* }

!172 = !DIEnumerator(name: "P_W2_SEND_INCLUDED_SERVICE_QUERY", value: 11)
!173 = !DIEnumerator(name: "P_W4_INCLUDED_SERVICE_QUERY_RESULT", value: 12)
!174 = !DIEnumerator(name: "P_W2_SEND_INCLUDED_SERVICE_WITH_UUID_QUERY", value: 13)
!175 = !DIEnumerator(name: "P_W4_INCLUDED_SERVICE_UUID_WITH_QUERY_RESULT", value: 14)
!176 = !DIEnumerator(name: "P_W2_SEND_READ_CHARACTERISTIC_VALUE_QUERY", value: 15)
!177 = !DIEnumerator(name: "P_W4_READ_CHARACTERISTIC_VALUE_RESULT", value: 16)
!178 = !DIEnumerator(name: "P_W2_SEND_READ_BLOB_QUERY", value: 17)
!179 = !DIEnumerator(name: "P_W4_READ_BLOB_RESULT", value: 18)
!180 = !DIEnumerator(name: "P_W2_SEND_READ_BY_TYPE_REQUEST", value: 19)
!181 = !DIEnumerator(name: "P_W4_READ_BY_TYPE_RESPONSE", value: 20)
!182 = !DIEnumerator(name: "P_W2_SEND_READ_MULTIPLE_REQUEST", value: 21)
!183 = !DIEnumerator(name: "P_W4_READ_MULTIPLE_RESPONSE", value: 22)
!184 = !DIEnumerator(name: "P_W2_SEND_WRITE_CHARACTERISTIC_VALUE", value: 23)
!185 = !DIEnumerator(name: "P_W4_WRITE_CHARACTERISTIC_VALUE_RESULT", value: 24)
!186 = !DIEnumerator(name: "P_W2_PREPARE_WRITE", value: 25)
!187 = !DIEnumerator(name: "P_W4_PREPARE_WRITE_RESULT", value: 26)
!188 = !DIEnumerator(name: "P_W2_PREPARE_RELIABLE_WRITE", value: 27)
!189 = !DIEnumerator(name: "P_W4_PREPARE_RELIABLE_WRITE_RESULT", value: 28)
!190 = !DIEnumerator(name: "P_W2_EXECUTE_PREPARED_WRITE", value: 29)
!191 = !DIEnumerator(name: "P_W4_EXECUTE_PREPARED_WRITE_RESULT", value: 30)
!192 = !DIEnumerator(name: "P_W2_CANCEL_PREPARED_WRITE", value: 31)
!193 = !DIEnumerator(name: "P_W4_CANCEL_PREPARED_WRITE_RESULT", value: 32)
!194 = !DIEnumerator(name: "P_W2_CANCEL_PREPARED_WRITE_DATA_MISMATCH", value: 33)
!195 = !DIEnumerator(name: "P_W4_CANCEL_PREPARED_WRITE_DATA_MISMATCH_RESULT", value: 34)
!196 = !DIEnumerator(name: "P_W2_SEND_READ_CLIENT_CHARACTERISTIC_CONFIGURATION_QUERY", value: 35)
!197 = !DIEnumerator(name: "P_W4_READ_CLIENT_CHARACTERISTIC_CONFIGURATION_QUERY_RESULT", value: 36)
!198 = !DIEnumerator(name: "P_W2_WRITE_CLIENT_CHARACTERISTIC_CONFIGURATION", value: 37)
!199 = !DIEnumerator(name: "P_W4_CLIENT_CHARACTERISTIC_CONFIGURATION_RESULT", value: 38)
!200 = !DIEnumerator(name: "P_W2_SEND_READ_CHARACTERISTIC_DESCRIPTOR_QUERY", value: 39)
!201 = !DIEnumerator(name: "P_W4_READ_CHARACTERISTIC_DESCRIPTOR_RESULT", value: 40)
!202 = !DIEnumerator(name: "P_W2_SEND_READ_BLOB_CHARACTERISTIC_DESCRIPTOR_QUERY", value: 41)
!203 = !DIEnumerator(name: "P_W4_READ_BLOB_CHARACTERISTIC_DESCRIPTOR_RESULT", value: 42)
!204 = !DIEnumerator(name: "P_W2_SEND_WRITE_CHARACTERISTIC_DESCRIPTOR", value: 43)
!205 = !DIEnumerator(name: "P_W4_WRITE_CHARACTERISTIC_DESCRIPTOR_RESULT", value: 44)
!206 = !DIEnumerator(name: "P_W2_PREPARE_WRITE_CHARACTERISTIC_DESCRIPTOR", value: 45)
!207 = !DIEnumerator(name: "P_W4_PREPARE_WRITE_CHARACTERISTIC_DESCRIPTOR_RESULT", value: 46)
!208 = !DIEnumerator(name: "P_W2_EXECUTE_PREPARED_WRITE_CHARACTERISTIC_DESCRIPTOR", value: 47)
!209 = !DIEnumerator(name: "P_W4_EXECUTE_PREPARED_WRITE_CHARACTERISTIC_DESCRIPTOR_RESULT", value: 48)
!210 = !DIEnumerator(name: "P_W2_PREPARE_WRITE_SINGLE", value: 49)
!211 = !DIEnumerator(name: "P_W4_PREPARE_WRITE_SINGLE_RESULT", value: 50)
!212 = !DIEnumerator(name: "P_W4_CMAC_READY", value: 51)
!213 = !DIEnumerator(name: "P_W4_CMAC_RESULT", value: 52)
!214 = !DIEnumerator(name: "P_W2_SEND_SIGNED_WRITE", value: 53)
!215 = !DIEnumerator(name: "P_W4_SEND_SINGED_WRITE_DONE", value: 54)
!216 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !159, line: 127, size: 32, elements: !217)
!217 = !{!218, !219, !220, !221}
!218 = !DIEnumerator(name: "SEND_MTU_EXCHANGE", value: 0)
!219 = !DIEnumerator(name: "SENT_MTU_EXCHANGE", value: 1)
!220 = !DIEnumerator(name: "MTU_EXCHANGED", value: 2)
!221 = !DIEnumerator(name: "SEND_MTU_EXCHANGED_RSP", value: 3)
!222 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !159, line: 134, size: 32, elements: !223)
!223 = !{!224, !225}
!224 = !DIEnumerator(name: "SEND_RSP_NULL", value: 0)
!225 = !DIEnumerator(name: "SEND_RSP_ERROR", value: 1)
!226 = !{!227, !228, !235}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_t", file: !230, line: 28, baseType: !231)
!230 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btcommon/btstack_memory.c", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !230, line: 26, size: 32, elements: !232)
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !231, file: !230, line: 27, baseType: !234, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!236 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!237 = !{!0, !238, !411}
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "bredr_stack_pool", scope: !2, file: !230, line: 23, type: !240, isLocal: true, isDefinition: true)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "stack_bredr_pool_t", file: !242, line: 59, baseType: !243)
!242 = !DIFile(filename: "../btcommon/btstack_memory.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !242, line: 29, size: 3648, elements: !244)
!244 = !{!245, !247, !248, !249, !250, !251, !286, !336, !358, !370}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "l2cap_service_pool", scope: !243, file: !242, line: 33, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "memory_pool_t", file: !242, line: 28, baseType: !227)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "l2cap_channel_pool", scope: !243, file: !242, line: 34, baseType: !246, size: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_multiplexer_pool", scope: !243, file: !242, line: 36, baseType: !246, size: 32, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_service_pool", scope: !243, file: !242, line: 37, baseType: !246, size: 32, offset: 96)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_channel_pool", scope: !243, file: !242, line: 38, baseType: !246, size: 32, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "l2cap_service_storage", scope: !243, file: !242, line: 48, baseType: !252, size: 512, offset: 160)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 512, elements: !284)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "l2cap_service_t", file: !254, line: 241, baseType: !255)
!254 = !DIFile(filename: "../btstack/Host/include/common/l2cap.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !254, line: 225, size: 128, elements: !256)
!256 = !{!257, !265, !269, !270, !271}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !255, file: !254, line: 227, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_item_t", file: !259, line: 100, baseType: !260)
!259 = !DIFile(filename: "../btcommon/btstack_linked_list.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_linked_item_t", file: !259, line: 55, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btstack_linked_item", file: !259, line: 53, size: 32, elements: !262)
!262 = !{!263}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !261, file: !259, line: 54, baseType: !264, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "psm", scope: !255, file: !254, line: 230, baseType: !266, size: 16, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !267, line: 13, baseType: !268)
!267 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!268 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !255, file: !254, line: 233, baseType: !266, size: 16, offset: 48)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !255, file: !254, line: 236, baseType: !227, size: 32, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "packet_handler", scope: !255, file: !254, line: 239, baseType: !272, size: 32, offset: 96)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_packet_handler_t", file: !23, line: 58, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !276, !281, !283, !281}
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !277, line: 20, baseType: !278)
!277 = !DIFile(filename: "/opt/q32s/include/sys/_stdint.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !279, line: 29, baseType: !280)
!279 = !DIFile(filename: "/opt/q32s/include/machine/_default_types.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!280 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !277, line: 26, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !279, line: 43, baseType: !268)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!284 = !{!285}
!285 = !DISubrange(count: 4)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "l2cap_channel_storage", scope: !243, file: !242, line: 49, baseType: !287, size: 2240, offset: 672)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 2240, elements: !334)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "l2cap_channel_t", file: !254, line: 222, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !254, line: 204, size: 448, elements: !290)
!290 = !{!291, !292, !295, !297, !298, !299}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !289, file: !254, line: 206, baseType: !258, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !289, file: !254, line: 208, baseType: !293, size: 16, offset: 32)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "hci_con_handle_t", file: !294, line: 9, baseType: !281)
!294 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!295 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_for_can_send_now", scope: !289, file: !254, line: 211, baseType: !296, size: 8, offset: 48)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !267, line: 11, baseType: !280)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !289, file: !254, line: 215, baseType: !227, size: 32, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "packet_handler", scope: !289, file: !254, line: 218, baseType: !272, size: 32, offset: 96)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "channel_core_data", scope: !289, file: !254, line: 220, baseType: !300, size: 320, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "channel_core_data_t", file: !254, line: 200, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !254, line: 178, size: 320, elements: !302)
!302 = !{!303, !304, !305, !306, !307, !308, !313, !314, !315, !316, !317, !318, !319, !322}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "state_var", scope: !301, file: !254, line: 180, baseType: !266, size: 16)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !301, file: !254, line: 181, baseType: !296, size: 8, offset: 16)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "remote_sig_id", scope: !301, file: !254, line: 183, baseType: !296, size: 8, offset: 24)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "local_sig_id", scope: !301, file: !254, line: 184, baseType: !296, size: 8, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !301, file: !254, line: 186, baseType: !296, size: 8, offset: 40)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !301, file: !254, line: 188, baseType: !309, size: 48, offset: 48)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_addr_t", file: !294, line: 7, baseType: !310)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 48, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 6)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "psm", scope: !301, file: !254, line: 189, baseType: !266, size: 16, offset: 96)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "local_cid", scope: !301, file: !254, line: 191, baseType: !266, size: 16, offset: 112)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "remote_cid", scope: !301, file: !254, line: 192, baseType: !266, size: 16, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "local_mtu", scope: !301, file: !254, line: 194, baseType: !266, size: 16, offset: 144)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "remote_mtu", scope: !301, file: !254, line: 195, baseType: !266, size: 16, offset: 160)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "channel_mode", scope: !301, file: !254, line: 197, baseType: !296, size: 8, offset: 176)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "remote_extended_feature", scope: !301, file: !254, line: 198, baseType: !320, size: 32, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !267, line: 15, baseType: !321)
!321 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "retran_op", scope: !301, file: !254, line: 199, baseType: !323, size: 96, offset: 224)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "retran_flow_ctl_op_t", file: !254, line: 174, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !254, line: 165, size: 96, elements: !325)
!325 = !{!326, !327, !328, !329, !330, !331, !332, !333}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "retransmission_flow_ctl", scope: !324, file: !254, line: 166, baseType: !296, size: 8)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !324, file: !254, line: 167, baseType: !296, size: 8, offset: 8)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !324, file: !254, line: 168, baseType: !296, size: 8, offset: 16)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window", scope: !324, file: !254, line: 169, baseType: !296, size: 8, offset: 24)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "max_transmit", scope: !324, file: !254, line: 170, baseType: !296, size: 8, offset: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "retransmission_timeout", scope: !324, file: !254, line: 171, baseType: !266, size: 16, offset: 48)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "monitor_timeout", scope: !324, file: !254, line: 172, baseType: !266, size: 16, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "max_pdu", scope: !324, file: !254, line: 173, baseType: !266, size: 16, offset: 80)
!334 = !{!335}
!335 = !DISubrange(count: 5)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_multiplexer_storage", scope: !243, file: !242, line: 51, baseType: !337, size: 160, offset: 2912)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 160, elements: !356)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "rfcomm_multiplexer_t", file: !339, line: 221, baseType: !340)
!339 = !DIFile(filename: "../btstack/Protocol/include/bredr/rfcomm.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !339, line: 211, size: 160, elements: !341)
!341 = !{!342, !343, !344}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !340, file: !339, line: 213, baseType: !258, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "max_frame_size", scope: !340, file: !339, line: 218, baseType: !266, size: 16, offset: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "multiplexer_core_data", scope: !340, file: !339, line: 219, baseType: !345, size: 112, offset: 48)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiplexer_core_data_t", file: !339, line: 207, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !339, line: 191, size: 112, elements: !347)
!347 = !{!348, !349, !350, !351, !352, !353, !354, !355}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "remote_addr", scope: !346, file: !339, line: 192, baseType: !309, size: 48)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "l2cap_cid", scope: !346, file: !339, line: 193, baseType: !266, size: 16, offset: 48)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !346, file: !339, line: 196, baseType: !296, size: 4, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "l2cap_credits", scope: !346, file: !339, line: 197, baseType: !296, size: 4, offset: 68, flags: DIFlagBitField, extraData: i64 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "outgoing", scope: !346, file: !339, line: 200, baseType: !296, size: 8, offset: 72)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "at_least_one_connection", scope: !346, file: !339, line: 202, baseType: !296, size: 8, offset: 80)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "send_dm_for_dlci", scope: !346, file: !339, line: 205, baseType: !296, size: 8, offset: 88)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "con_handle", scope: !346, file: !339, line: 206, baseType: !293, size: 16, offset: 96)
!356 = !{!357}
!357 = !DISubrange(count: 1)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_service_storage", scope: !243, file: !242, line: 52, baseType: !359, size: 160, offset: 3072)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 160, elements: !356)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "rfcomm_service_t", file: !339, line: 189, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !339, line: 167, size: 160, elements: !362)
!362 = !{!363, !364, !365, !366, !367, !368, !369}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !361, file: !339, line: 169, baseType: !258, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "server_channel", scope: !361, file: !339, line: 172, baseType: !296, size: 8, offset: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_flow_control", scope: !361, file: !339, line: 175, baseType: !296, size: 8, offset: 40)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_initial_credits", scope: !361, file: !339, line: 178, baseType: !296, size: 8, offset: 48)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "max_frame_size", scope: !361, file: !339, line: 181, baseType: !266, size: 16, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !361, file: !339, line: 184, baseType: !227, size: 32, offset: 96)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "packet_handler", scope: !361, file: !339, line: 187, baseType: !272, size: 32, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_channel_storage", scope: !243, file: !242, line: 53, baseType: !371, size: 416, offset: 3232)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 416, elements: !356)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "rfcomm_channel_t", file: !339, line: 282, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !339, line: 262, size: 416, elements: !374)
!374 = !{!375, !376, !378, !406, !407, !409, !410}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !373, file: !339, line: 264, baseType: !258, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "multiplexer", scope: !373, file: !339, line: 266, baseType: !377, size: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "rfc_channel_core_data", scope: !373, file: !339, line: 268, baseType: !379, size: 240, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "rfc_channel_core_data_t", file: !339, line: 259, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !339, line: 223, size: 240, elements: !381)
!381 = !{!382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "rfc_channel_type", scope: !380, file: !339, line: 224, baseType: !296, size: 8)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "remote_addr", scope: !380, file: !339, line: 225, baseType: !309, size: 48, offset: 8)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_cid", scope: !380, file: !339, line: 226, baseType: !266, size: 16, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "outgoing", scope: !380, file: !339, line: 227, baseType: !296, size: 8, offset: 80)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !380, file: !339, line: 228, baseType: !296, size: 8, offset: 88)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "packets_granted", scope: !380, file: !339, line: 231, baseType: !296, size: 8, offset: 96)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "credits_outgoing", scope: !380, file: !339, line: 234, baseType: !296, size: 8, offset: 104)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "new_credits_incoming", scope: !380, file: !339, line: 237, baseType: !296, size: 8, offset: 112)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "credits_incoming", scope: !380, file: !339, line: 240, baseType: !296, size: 8, offset: 120)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_flow_control", scope: !380, file: !339, line: 243, baseType: !296, size: 8, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !380, file: !339, line: 247, baseType: !296, size: 8, offset: 136)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pn_priority", scope: !380, file: !339, line: 250, baseType: !296, size: 8, offset: 144)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "state_var", scope: !380, file: !339, line: 254, baseType: !266, size: 16, offset: 160)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "rpn_data", scope: !380, file: !339, line: 257, baseType: !396, size: 56, offset: 176)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "rfcomm_rpn_data_t", file: !339, line: 159, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rfcomm_rpn_data", file: !339, line: 151, size: 56, elements: !398)
!398 = !{!399, !400, !401, !402, !403, !404, !405}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "baud_rate", scope: !397, file: !339, line: 152, baseType: !296, size: 8)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !397, file: !339, line: 153, baseType: !296, size: 8, offset: 8)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "flow_control", scope: !397, file: !339, line: 154, baseType: !296, size: 8, offset: 16)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "xon", scope: !397, file: !339, line: 155, baseType: !296, size: 8, offset: 24)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "xoff", scope: !397, file: !339, line: 156, baseType: !296, size: 8, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "parameter_mask_0", scope: !397, file: !339, line: 157, baseType: !296, size: 8, offset: 40)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "parameter_mask_1", scope: !397, file: !339, line: 158, baseType: !296, size: 8, offset: 48)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "max_frame_size", scope: !373, file: !339, line: 271, baseType: !266, size: 16, offset: 304)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "service", scope: !373, file: !339, line: 274, baseType: !408, size: 32, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "packet_handler", scope: !373, file: !339, line: 277, baseType: !272, size: 32, offset: 352)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !373, file: !339, line: 280, baseType: !227, size: 32, offset: 384)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "le_stack_pool", scope: !2, file: !230, line: 24, type: !413, isLocal: true, isDefinition: true)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "stack_le_pool_t", file: !242, line: 93, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !242, line: 61, size: 128, elements: !416)
!416 = !{!417, !418, !419, !537}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "le_hci_connection_pool", scope: !415, file: !242, line: 64, baseType: !246, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "gatt_client_pool", scope: !415, file: !242, line: 67, baseType: !246, size: 32, offset: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "le_hci_connection_storage", scope: !415, file: !242, line: 79, baseType: !420, size: 32, offset: 64)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 32, elements: !356)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "le_hci_connection_t", file: !31, line: 605, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__le_hci_connection", file: !31, line: 571, size: 9792, elements: !424)
!424 = !{!425, !426, !427, !428, !430, !431, !433, !434, !435, !436, !437, !438, !471, !527, !531, !532, !533, !534, !535, !536}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !423, file: !31, line: 572, baseType: !258, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !423, file: !31, line: 574, baseType: !309, size: 48, offset: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "con_handle", scope: !423, file: !31, line: 576, baseType: !293, size: 16, offset: 80)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "address_type", scope: !423, file: !31, line: 578, baseType: !429, size: 32, offset: 96)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_addr_type_t", file: !23, line: 1475, baseType: !22)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "role", scope: !423, file: !31, line: 581, baseType: !276, size: 8, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "le_con_parameter_update_state", scope: !423, file: !31, line: 584, baseType: !432, size: 32, offset: 160)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "le_con_parameter_update_state_t", file: !31, line: 252, baseType: !30)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "le_con_param_update_identifier", scope: !423, file: !31, line: 585, baseType: !276, size: 8, offset: 192)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "le_conn_interval_min", scope: !423, file: !31, line: 586, baseType: !281, size: 16, offset: 208)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "le_conn_interval_max", scope: !423, file: !31, line: 587, baseType: !281, size: 16, offset: 224)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "le_conn_latency", scope: !423, file: !31, line: 588, baseType: !281, size: 16, offset: 240)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "le_supervision_timeout", scope: !423, file: !31, line: 589, baseType: !281, size: 16, offset: 256)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "sm_connection", scope: !423, file: !31, line: 592, baseType: !439, size: 448, offset: 288)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "sm_connection_t", file: !31, line: 475, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sm_connection", file: !31, line: 456, size: 448, elements: !441)
!441 = !{!442, !443, !444, !445, !446, !447, !448, !450, !452, !453, !454, !455, !460, !462, !463, !467, !468, !470}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sm_handle", scope: !440, file: !31, line: 457, baseType: !293, size: 16)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "sm_role", scope: !440, file: !31, line: 458, baseType: !276, size: 8, offset: 16)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "sm_security_request_received", scope: !440, file: !31, line: 459, baseType: !276, size: 8, offset: 24)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "sm_bonding_requested", scope: !440, file: !31, line: 460, baseType: !276, size: 8, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "sm_peer_addr_type", scope: !440, file: !31, line: 461, baseType: !276, size: 8, offset: 40)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "sm_peer_address", scope: !440, file: !31, line: 462, baseType: !309, size: 48, offset: 48)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sm_engine_state", scope: !440, file: !31, line: 463, baseType: !449, size: 32, offset: 96)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "security_manager_state_t", file: !31, line: 433, baseType: !38)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "sm_irk_lookup_state", scope: !440, file: !31, line: 464, baseType: !451, size: 32, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "irk_lookup_state_t", file: !31, line: 442, baseType: !138)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "sm_connection_encrypted", scope: !440, file: !31, line: 465, baseType: !276, size: 8, offset: 160)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sm_connection_authenticated", scope: !440, file: !31, line: 466, baseType: !276, size: 8, offset: 168)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "sm_actual_encryption_key_size", scope: !440, file: !31, line: 467, baseType: !276, size: 8, offset: 176)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "sm_m_preq", scope: !440, file: !31, line: 468, baseType: !456, size: 56, offset: 184)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "sm_pairing_packet_t", file: !31, line: 452, baseType: !457)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 56, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 7)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "sm_connection_authorization_state", scope: !440, file: !31, line: 469, baseType: !461, size: 32, offset: 256)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "authorization_state_t", file: !31, line: 450, baseType: !145)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "sm_local_ediv", scope: !440, file: !31, line: 470, baseType: !281, size: 16, offset: 288)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "sm_local_rand", scope: !440, file: !31, line: 471, baseType: !464, size: 64, offset: 304)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 64, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 8)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "sm_disconn_reason", scope: !440, file: !31, line: 472, baseType: !276, size: 8, offset: 368)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "sm_le_db_index", scope: !440, file: !31, line: 473, baseType: !469, size: 32, offset: 384)
!469 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "sm_timeout_id", scope: !440, file: !31, line: 474, baseType: !469, size: 32, offset: 416)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "att_server", scope: !423, file: !31, line: 595, baseType: !472, size: 4640, offset: 736)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_server_t", file: !152, line: 187, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !152, line: 164, size: 4640, elements: !474)
!474 = !{!475, !477, !478, !479, !480, !481, !482, !502, !513, !514, !518, !519, !520, !521, !522, !523}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !473, file: !152, line: 165, baseType: !476, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_server_state_t", file: !152, line: 162, baseType: !151)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "peer_addr_type", scope: !473, file: !152, line: 167, baseType: !276, size: 8, offset: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "peer_address", scope: !473, file: !152, line: 168, baseType: !309, size: 48, offset: 40)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ir_le_device_db_index", scope: !473, file: !152, line: 170, baseType: !469, size: 32, offset: 96)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ir_lookup_active", scope: !473, file: !152, line: 171, baseType: !469, size: 32, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "value_indication_handle", scope: !473, file: !152, line: 173, baseType: !469, size: 32, offset: 160)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "value_indication_timer", scope: !473, file: !152, line: 174, baseType: !483, size: 160, offset: 192)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_timer_source_t", file: !484, line: 19, baseType: !485)
!484 = !DIFile(filename: "../btcommon/btstack_sys_timer.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btstack_timer_source", file: !484, line: 7, size: 160, elements: !486)
!486 = !{!487, !488, !491, !492, !493, !494, !495, !496, !501}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !485, file: !484, line: 8, baseType: !260, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !485, file: !484, line: 10, baseType: !489, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !277, line: 32, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !279, line: 65, baseType: !321)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_interval", scope: !485, file: !484, line: 11, baseType: !489, size: 16, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "timer_type", scope: !485, file: !484, line: 12, baseType: !489, size: 4, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "timer_tick_overflow", scope: !485, file: !484, line: 13, baseType: !489, size: 1, offset: 84, flags: DIFlagBitField, extraData: i64 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "loop_flag", scope: !485, file: !484, line: 14, baseType: !489, size: 1, offset: 85, flags: DIFlagBitField, extraData: i64 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "loop_times", scope: !485, file: !484, line: 15, baseType: !489, size: 10, offset: 86, flags: DIFlagBitField, extraData: i64 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !485, file: !484, line: 17, baseType: !497, size: 32, offset: 96)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 32)
!498 = !DISubroutineType(types: !499)
!499 = !{null, !500}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !485, file: !484, line: 18, baseType: !227, size: 32, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !473, file: !152, line: 176, baseType: !503, size: 80, offset: 352)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_connection_t", file: !504, line: 41, baseType: !505)
!504 = !DIFile(filename: "../btstack/Protocol/include/ble/att_db.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "att_connection", file: !504, line: 34, size: 80, elements: !506)
!506 = !{!507, !508, !509, !510, !511, !512}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "con_handle", scope: !505, file: !504, line: 35, baseType: !293, size: 16)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !505, file: !504, line: 36, baseType: !281, size: 16, offset: 16)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "max_mtu", scope: !505, file: !504, line: 37, baseType: !281, size: 16, offset: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "encryption_key_size", scope: !505, file: !504, line: 38, baseType: !276, size: 8, offset: 48)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !505, file: !504, line: 39, baseType: !276, size: 8, offset: 56)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "authorized", scope: !505, file: !504, line: 40, baseType: !276, size: 8, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "request_size", scope: !473, file: !152, line: 178, baseType: !281, size: 16, offset: 432)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "request_buffer", scope: !473, file: !152, line: 179, baseType: !515, size: 4136, offset: 448)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 4136, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 517)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "flow_hold_flag", scope: !473, file: !152, line: 181, baseType: !276, size: 1, offset: 4584, flags: DIFlagBitField, extraData: i64 4584)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mtu_request_flag", scope: !473, file: !152, line: 182, baseType: !276, size: 1, offset: 4585, flags: DIFlagBitField, extraData: i64 4584)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "check_remote_tag", scope: !473, file: !152, line: 183, baseType: !276, size: 3, offset: 4586, flags: DIFlagBitField, extraData: i64 4584)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "request_busy", scope: !473, file: !152, line: 184, baseType: !276, size: 1, offset: 4589, flags: DIFlagBitField, extraData: i64 4584)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "reserverd", scope: !473, file: !152, line: 185, baseType: !276, size: 2, offset: 4590, flags: DIFlagBitField, extraData: i64 4584)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "result_callback", scope: !473, file: !152, line: 186, baseType: !524, size: 32, offset: 4608)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 32)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !266, !296}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "acl_recombination_buffer", scope: !423, file: !31, line: 597, baseType: !528, size: 4232, offset: 5376)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 4232, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 529)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "acl_recombination_pos", scope: !423, file: !31, line: 598, baseType: !281, size: 16, offset: 9616)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "acl_recombination_length", scope: !423, file: !31, line: 599, baseType: !281, size: 16, offset: 9632)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "num_acl_packets_sent", scope: !423, file: !31, line: 600, baseType: !276, size: 8, offset: 9648)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "own_id_address", scope: !423, file: !31, line: 602, baseType: !309, size: 48, offset: 9656)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "own_address", scope: !423, file: !31, line: 603, baseType: !309, size: 48, offset: 9704)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "own_address_type", scope: !423, file: !31, line: 604, baseType: !429, size: 32, offset: 9760)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "gatt_client_storage", scope: !415, file: !242, line: 83, baseType: !538, size: 32, offset: 96)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 32, elements: !356)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "gatt_client_t", file: !159, line: 191, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gatt_client", file: !159, line: 140, size: 1024, elements: !542)
!542 = !{!543, !544, !546, !547, !548, !549, !550, !551, !553, !554, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !571, !572, !576, !577, !578, !579, !580, !581, !583, !584}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !541, file: !159, line: 141, baseType: !258, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "gatt_client_state", scope: !541, file: !159, line: 143, baseType: !545, size: 32, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "gatt_client_state_t", file: !159, line: 124, baseType: !158)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !541, file: !159, line: 146, baseType: !272, size: 32, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "con_handle", scope: !541, file: !159, line: 148, baseType: !293, size: 16, offset: 96)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "address_type", scope: !541, file: !159, line: 150, baseType: !276, size: 8, offset: 112)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !541, file: !159, line: 151, baseType: !309, size: 48, offset: 120)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !541, file: !159, line: 152, baseType: !281, size: 16, offset: 176)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "mtu_state", scope: !541, file: !159, line: 153, baseType: !552, size: 32, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "gatt_client_mtu_t", file: !159, line: 132, baseType: !216)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "uuid16", scope: !541, file: !159, line: 155, baseType: !281, size: 16, offset: 224)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "uuid128", scope: !541, file: !159, line: 156, baseType: !555, size: 128, offset: 240)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 128, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 16)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "start_group_handle", scope: !541, file: !159, line: 158, baseType: !281, size: 16, offset: 368)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "end_group_handle", scope: !541, file: !159, line: 159, baseType: !281, size: 16, offset: 384)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "query_start_handle", scope: !541, file: !159, line: 161, baseType: !281, size: 16, offset: 400)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "query_end_handle", scope: !541, file: !159, line: 162, baseType: !281, size: 16, offset: 416)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "characteristic_properties", scope: !541, file: !159, line: 164, baseType: !276, size: 8, offset: 432)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "characteristic_start_handle", scope: !541, file: !159, line: 165, baseType: !281, size: 16, offset: 448)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "attribute_handle", scope: !541, file: !159, line: 167, baseType: !281, size: 16, offset: 464)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "attribute_offset", scope: !541, file: !159, line: 168, baseType: !281, size: 16, offset: 480)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "attribute_length", scope: !541, file: !159, line: 169, baseType: !281, size: 16, offset: 496)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "attribute_value", scope: !541, file: !159, line: 170, baseType: !283, size: 32, offset: 512)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "read_multiple_handle_count", scope: !541, file: !159, line: 173, baseType: !281, size: 16, offset: 544)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "read_multiple_handles", scope: !541, file: !159, line: 174, baseType: !570, size: 32, offset: 576)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "client_characteristic_configuration_handle", scope: !541, file: !159, line: 176, baseType: !281, size: 16, offset: 608)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "client_characteristic_configuration_value", scope: !541, file: !159, line: 177, baseType: !573, size: 16, offset: 624)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 16, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 2)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "filter_with_uuid", scope: !541, file: !159, line: 179, baseType: !276, size: 8, offset: 640)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "send_confirmation", scope: !541, file: !159, line: 180, baseType: !276, size: 8, offset: 648)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "le_device_index", scope: !541, file: !159, line: 182, baseType: !469, size: 32, offset: 672)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "cmac", scope: !541, file: !159, line: 183, baseType: !464, size: 64, offset: 704)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "gc_timeout", scope: !541, file: !159, line: 185, baseType: !483, size: 160, offset: 768)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "rsp_state", scope: !541, file: !159, line: 188, baseType: !582, size: 32, offset: 928)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "gatt_client_rsp_t", file: !159, line: 137, baseType: !222)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "send_packet_buffer", scope: !541, file: !159, line: 189, baseType: !457, size: 56, offset: 960)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "send_packet_len", scope: !541, file: !159, line: 190, baseType: !276, size: 8, offset: 1016)
!585 = !DIFile(filename: "../btcommon/profile_stack_debug.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!586 = !{i32 2, !"Dwarf Version", i32 4}
!587 = !{i32 2, !"Debug Info Version", i32 3}
!588 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!589 = distinct !DISubprogram(name: "btstack_memory_hci_connection_get", scope: !230, file: !230, line: 91, type: !590, isLocal: false, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !592)
!590 = !DISubroutineType(types: !591)
!591 = !{!227}
!592 = !{}
!593 = !DILocation(line: 93, column: 5, scope: !589)
!594 = distinct !DISubprogram(name: "btstack_memory_hci_connection_free", scope: !230, file: !230, line: 95, type: !595, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !597)
!595 = !DISubroutineType(types: !596)
!596 = !{null, !227}
!597 = !{!598}
!598 = !DILocalVariable(name: "hci_connection", arg: 1, scope: !594, file: !230, line: 95, type: !227)
!599 = !DILocation(line: 95, column: 47, scope: !594)
!600 = !DILocation(line: 97, column: 1, scope: !594)
!601 = distinct !DISubprogram(name: "btstack_memory_l2cap_service_get", scope: !230, file: !230, line: 106, type: !590, isLocal: false, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !592)
!602 = !DILocation(line: 108, column: 29, scope: !601)
!603 = !{!604, !604, i64 0}
!604 = !{!"any pointer", !605, i64 0}
!605 = !{!"omnipotent char", !606, i64 0}
!606 = !{!"Simple C/C++ TBAA"}
!607 = !DILocation(line: 66, column: 23, scope: !608, inlinedAt: !617)
!608 = distinct !DILexicalBlock(scope: !609, file: !230, line: 66, column: 9)
!609 = distinct !DISubprogram(name: "memory_pool_get", scope: !230, file: !230, line: 62, type: !610, isLocal: true, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !613)
!610 = !DISubroutineType(types: !611)
!611 = !{!227, !612}
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!613 = !{!614, !615, !616}
!614 = !DILocalVariable(name: "pool", arg: 1, scope: !609, file: !230, line: 62, type: !612)
!615 = !DILocalVariable(name: "free_blocks", scope: !609, file: !230, line: 64, type: !228)
!616 = !DILocalVariable(name: "node", scope: !609, file: !230, line: 71, type: !228)
!617 = distinct !DILocation(line: 108, column: 12, scope: !601)
!618 = !{!619, !604, i64 0}
!619 = !{!"node", !604, i64 0}
!620 = !DILocation(line: 66, column: 10, scope: !608, inlinedAt: !617)
!621 = !DILocation(line: 66, column: 9, scope: !609, inlinedAt: !617)
!622 = !DILocation(line: 71, column: 13, scope: !609, inlinedAt: !617)
!623 = !DILocation(line: 72, column: 31, scope: !609, inlinedAt: !617)
!624 = !DILocation(line: 72, column: 23, scope: !609, inlinedAt: !617)
!625 = !DILocation(line: 74, column: 12, scope: !609, inlinedAt: !617)
!626 = !DILocation(line: 108, column: 5, scope: !601)
!627 = distinct !DISubprogram(name: "btstack_memory_l2cap_service_free", scope: !230, file: !230, line: 110, type: !595, isLocal: false, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !628)
!628 = !{!629}
!629 = !DILocalVariable(name: "l2cap_service", arg: 1, scope: !627, file: !230, line: 110, type: !227)
!630 = !DILocation(line: 110, column: 46, scope: !627)
!631 = !DILocation(line: 112, column: 23, scope: !627)
!632 = !DILocation(line: 112, column: 41, scope: !627)
!633 = !DILocalVariable(name: "pool", arg: 1, scope: !634, file: !230, line: 30, type: !612)
!634 = distinct !DISubprogram(name: "memory_pool_free", scope: !230, file: !230, line: 30, type: !635, isLocal: true, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !637)
!635 = !DISubroutineType(types: !636)
!636 = !{null, !612, !227}
!637 = !{!633, !638, !639, !640, !641}
!638 = !DILocalVariable(name: "block", arg: 2, scope: !634, file: !230, line: 30, type: !227)
!639 = !DILocalVariable(name: "free_blocks", scope: !634, file: !230, line: 32, type: !228)
!640 = !DILocalVariable(name: "node", scope: !634, file: !230, line: 33, type: !228)
!641 = !DILocalVariable(name: "it", scope: !634, file: !230, line: 36, type: !228)
!642 = !DILocation(line: 30, column: 45, scope: !634, inlinedAt: !643)
!643 = distinct !DILocation(line: 112, column: 5, scope: !627)
!644 = !DILocation(line: 30, column: 57, scope: !634, inlinedAt: !643)
!645 = !DILocation(line: 33, column: 27, scope: !634, inlinedAt: !643)
!646 = !DILocation(line: 33, column: 13, scope: !634, inlinedAt: !643)
!647 = !DILocation(line: 37, column: 28, scope: !648, inlinedAt: !643)
!648 = distinct !DILexicalBlock(scope: !634, file: !230, line: 37, column: 5)
!649 = !DILocation(line: 36, column: 13, scope: !634, inlinedAt: !643)
!650 = !DILocation(line: 37, column: 5, scope: !651, inlinedAt: !643)
!651 = !DILexicalBlockFile(scope: !648, file: !230, discriminator: 1)
!652 = !DILocation(line: 38, column: 16, scope: !653, inlinedAt: !643)
!653 = distinct !DILexicalBlock(scope: !654, file: !230, line: 38, column: 13)
!654 = distinct !DILexicalBlock(scope: !655, file: !230, line: 37, column: 54)
!655 = distinct !DILexicalBlock(scope: !648, file: !230, line: 37, column: 5)
!656 = !DILocation(line: 37, column: 48, scope: !657, inlinedAt: !643)
!657 = !DILexicalBlockFile(scope: !655, file: !230, discriminator: 2)
!658 = distinct !{!658, !659, !660}
!659 = !DILocation(line: 37, column: 5, scope: !648)
!660 = !DILocation(line: 42, column: 5, scope: !648)
!661 = !DILocation(line: 38, column: 13, scope: !654, inlinedAt: !643)
!662 = !DILocation(line: 45, column: 25, scope: !634, inlinedAt: !643)
!663 = !DILocation(line: 46, column: 25, scope: !634, inlinedAt: !643)
!664 = !DILocation(line: 47, column: 1, scope: !634, inlinedAt: !643)
!665 = !DILocation(line: 113, column: 1, scope: !627)
!666 = distinct !DISubprogram(name: "btstack_memory_l2cap_channel_get", scope: !230, file: !230, line: 128, type: !590, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !592)
!667 = !DILocation(line: 130, column: 29, scope: !666)
!668 = !DILocation(line: 130, column: 47, scope: !666)
!669 = !DILocation(line: 62, column: 45, scope: !609, inlinedAt: !670)
!670 = distinct !DILocation(line: 130, column: 12, scope: !666)
!671 = !DILocation(line: 66, column: 23, scope: !608, inlinedAt: !670)
!672 = !DILocation(line: 66, column: 10, scope: !608, inlinedAt: !670)
!673 = !DILocation(line: 66, column: 9, scope: !609, inlinedAt: !670)
!674 = !DILocation(line: 71, column: 13, scope: !609, inlinedAt: !670)
!675 = !DILocation(line: 72, column: 31, scope: !609, inlinedAt: !670)
!676 = !DILocation(line: 72, column: 23, scope: !609, inlinedAt: !670)
!677 = !DILocation(line: 74, column: 12, scope: !609, inlinedAt: !670)
!678 = !DILocation(line: 130, column: 5, scope: !666)
!679 = distinct !DISubprogram(name: "btstack_memory_l2cap_channel_free", scope: !230, file: !230, line: 132, type: !595, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !680)
!680 = !{!681}
!681 = !DILocalVariable(name: "l2cap_channel", arg: 1, scope: !679, file: !230, line: 132, type: !227)
!682 = !DILocation(line: 132, column: 46, scope: !679)
!683 = !DILocation(line: 134, column: 23, scope: !679)
!684 = !DILocation(line: 134, column: 41, scope: !679)
!685 = !DILocation(line: 30, column: 45, scope: !634, inlinedAt: !686)
!686 = distinct !DILocation(line: 134, column: 5, scope: !679)
!687 = !DILocation(line: 30, column: 57, scope: !634, inlinedAt: !686)
!688 = !DILocation(line: 33, column: 27, scope: !634, inlinedAt: !686)
!689 = !DILocation(line: 33, column: 13, scope: !634, inlinedAt: !686)
!690 = !DILocation(line: 37, column: 28, scope: !648, inlinedAt: !686)
!691 = !DILocation(line: 36, column: 13, scope: !634, inlinedAt: !686)
!692 = !DILocation(line: 37, column: 5, scope: !651, inlinedAt: !686)
!693 = !DILocation(line: 38, column: 16, scope: !653, inlinedAt: !686)
!694 = !DILocation(line: 37, column: 48, scope: !657, inlinedAt: !686)
!695 = !DILocation(line: 38, column: 13, scope: !654, inlinedAt: !686)
!696 = !DILocation(line: 45, column: 25, scope: !634, inlinedAt: !686)
!697 = !DILocation(line: 46, column: 25, scope: !634, inlinedAt: !686)
!698 = !DILocation(line: 47, column: 1, scope: !634, inlinedAt: !686)
!699 = !DILocation(line: 135, column: 1, scope: !679)
!700 = distinct !DISubprogram(name: "btstack_memory_rfcomm_multiplexer_get", scope: !230, file: !230, line: 151, type: !590, isLocal: false, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !592)
!701 = !DILocation(line: 153, column: 29, scope: !700)
!702 = !DILocation(line: 153, column: 47, scope: !700)
!703 = !DILocation(line: 62, column: 45, scope: !609, inlinedAt: !704)
!704 = distinct !DILocation(line: 153, column: 12, scope: !700)
!705 = !DILocation(line: 66, column: 23, scope: !608, inlinedAt: !704)
!706 = !DILocation(line: 66, column: 10, scope: !608, inlinedAt: !704)
!707 = !DILocation(line: 66, column: 9, scope: !609, inlinedAt: !704)
!708 = !DILocation(line: 71, column: 13, scope: !609, inlinedAt: !704)
!709 = !DILocation(line: 72, column: 31, scope: !609, inlinedAt: !704)
!710 = !DILocation(line: 72, column: 23, scope: !609, inlinedAt: !704)
!711 = !DILocation(line: 74, column: 12, scope: !609, inlinedAt: !704)
!712 = !DILocation(line: 153, column: 5, scope: !700)
!713 = distinct !DISubprogram(name: "btstack_memory_rfcomm_multiplexer_free", scope: !230, file: !230, line: 155, type: !595, isLocal: false, isDefinition: true, scopeLine: 156, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !714)
!714 = !{!715}
!715 = !DILocalVariable(name: "rfcomm_multiplexer", arg: 1, scope: !713, file: !230, line: 155, type: !227)
!716 = !DILocation(line: 155, column: 51, scope: !713)
!717 = !DILocation(line: 157, column: 23, scope: !713)
!718 = !DILocation(line: 157, column: 41, scope: !713)
!719 = !DILocation(line: 30, column: 45, scope: !634, inlinedAt: !720)
!720 = distinct !DILocation(line: 157, column: 5, scope: !713)
!721 = !DILocation(line: 30, column: 57, scope: !634, inlinedAt: !720)
!722 = !DILocation(line: 33, column: 27, scope: !634, inlinedAt: !720)
!723 = !DILocation(line: 33, column: 13, scope: !634, inlinedAt: !720)
!724 = !DILocation(line: 37, column: 28, scope: !648, inlinedAt: !720)
!725 = !DILocation(line: 36, column: 13, scope: !634, inlinedAt: !720)
!726 = !DILocation(line: 37, column: 5, scope: !651, inlinedAt: !720)
!727 = !DILocation(line: 38, column: 16, scope: !653, inlinedAt: !720)
!728 = !DILocation(line: 37, column: 48, scope: !657, inlinedAt: !720)
!729 = !DILocation(line: 38, column: 13, scope: !654, inlinedAt: !720)
!730 = !DILocation(line: 45, column: 25, scope: !634, inlinedAt: !720)
!731 = !DILocation(line: 46, column: 25, scope: !634, inlinedAt: !720)
!732 = !DILocation(line: 47, column: 1, scope: !634, inlinedAt: !720)
!733 = !DILocation(line: 158, column: 1, scope: !713)
!734 = distinct !DISubprogram(name: "btstack_memory_rfcomm_service_get", scope: !230, file: !230, line: 174, type: !590, isLocal: false, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !592)
!735 = !DILocation(line: 176, column: 29, scope: !734)
!736 = !DILocation(line: 176, column: 47, scope: !734)
!737 = !DILocation(line: 62, column: 45, scope: !609, inlinedAt: !738)
!738 = distinct !DILocation(line: 176, column: 12, scope: !734)
!739 = !DILocation(line: 66, column: 23, scope: !608, inlinedAt: !738)
!740 = !DILocation(line: 66, column: 10, scope: !608, inlinedAt: !738)
!741 = !DILocation(line: 66, column: 9, scope: !609, inlinedAt: !738)
!742 = !DILocation(line: 71, column: 13, scope: !609, inlinedAt: !738)
!743 = !DILocation(line: 72, column: 31, scope: !609, inlinedAt: !738)
!744 = !DILocation(line: 72, column: 23, scope: !609, inlinedAt: !738)
!745 = !DILocation(line: 74, column: 12, scope: !609, inlinedAt: !738)
!746 = !DILocation(line: 176, column: 5, scope: !734)
!747 = distinct !DISubprogram(name: "btstack_memory_rfcomm_service_free", scope: !230, file: !230, line: 178, type: !595, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !748)
!748 = !{!749}
!749 = !DILocalVariable(name: "rfcomm_service", arg: 1, scope: !747, file: !230, line: 178, type: !227)
!750 = !DILocation(line: 178, column: 47, scope: !747)
!751 = !DILocation(line: 180, column: 23, scope: !747)
!752 = !DILocation(line: 180, column: 41, scope: !747)
!753 = !DILocation(line: 30, column: 45, scope: !634, inlinedAt: !754)
!754 = distinct !DILocation(line: 180, column: 5, scope: !747)
!755 = !DILocation(line: 30, column: 57, scope: !634, inlinedAt: !754)
!756 = !DILocation(line: 33, column: 27, scope: !634, inlinedAt: !754)
!757 = !DILocation(line: 33, column: 13, scope: !634, inlinedAt: !754)
!758 = !DILocation(line: 37, column: 28, scope: !648, inlinedAt: !754)
!759 = !DILocation(line: 36, column: 13, scope: !634, inlinedAt: !754)
!760 = !DILocation(line: 37, column: 5, scope: !651, inlinedAt: !754)
!761 = !DILocation(line: 38, column: 16, scope: !653, inlinedAt: !754)
!762 = !DILocation(line: 37, column: 48, scope: !657, inlinedAt: !754)
!763 = !DILocation(line: 38, column: 13, scope: !654, inlinedAt: !754)
!764 = !DILocation(line: 45, column: 25, scope: !634, inlinedAt: !754)
!765 = !DILocation(line: 46, column: 25, scope: !634, inlinedAt: !754)
!766 = !DILocation(line: 47, column: 1, scope: !634, inlinedAt: !754)
!767 = !DILocation(line: 181, column: 1, scope: !747)
!768 = distinct !DISubprogram(name: "btstack_memory_rfcomm_channel_get", scope: !230, file: !230, line: 197, type: !590, isLocal: false, isDefinition: true, scopeLine: 198, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !592)
!769 = !DILocation(line: 199, column: 29, scope: !768)
!770 = !DILocation(line: 199, column: 47, scope: !768)
!771 = !DILocation(line: 62, column: 45, scope: !609, inlinedAt: !772)
!772 = distinct !DILocation(line: 199, column: 12, scope: !768)
!773 = !DILocation(line: 66, column: 23, scope: !608, inlinedAt: !772)
!774 = !DILocation(line: 66, column: 10, scope: !608, inlinedAt: !772)
!775 = !DILocation(line: 66, column: 9, scope: !609, inlinedAt: !772)
!776 = !DILocation(line: 71, column: 13, scope: !609, inlinedAt: !772)
!777 = !DILocation(line: 72, column: 31, scope: !609, inlinedAt: !772)
!778 = !DILocation(line: 72, column: 23, scope: !609, inlinedAt: !772)
!779 = !DILocation(line: 74, column: 12, scope: !609, inlinedAt: !772)
!780 = !DILocation(line: 199, column: 5, scope: !768)
!781 = distinct !DISubprogram(name: "btstack_memory_rfcomm_channel_free", scope: !230, file: !230, line: 201, type: !595, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !782)
!782 = !{!783}
!783 = !DILocalVariable(name: "rfcomm_channel", arg: 1, scope: !781, file: !230, line: 201, type: !227)
!784 = !DILocation(line: 201, column: 47, scope: !781)
!785 = !DILocation(line: 203, column: 23, scope: !781)
!786 = !DILocation(line: 203, column: 41, scope: !781)
!787 = !DILocation(line: 30, column: 45, scope: !634, inlinedAt: !788)
!788 = distinct !DILocation(line: 203, column: 5, scope: !781)
!789 = !DILocation(line: 30, column: 57, scope: !634, inlinedAt: !788)
!790 = !DILocation(line: 33, column: 27, scope: !634, inlinedAt: !788)
!791 = !DILocation(line: 33, column: 13, scope: !634, inlinedAt: !788)
!792 = !DILocation(line: 37, column: 28, scope: !648, inlinedAt: !788)
!793 = !DILocation(line: 36, column: 13, scope: !634, inlinedAt: !788)
!794 = !DILocation(line: 37, column: 5, scope: !651, inlinedAt: !788)
!795 = !DILocation(line: 38, column: 16, scope: !653, inlinedAt: !788)
!796 = !DILocation(line: 37, column: 48, scope: !657, inlinedAt: !788)
!797 = !DILocation(line: 38, column: 13, scope: !654, inlinedAt: !788)
!798 = !DILocation(line: 45, column: 25, scope: !634, inlinedAt: !788)
!799 = !DILocation(line: 46, column: 25, scope: !634, inlinedAt: !788)
!800 = !DILocation(line: 47, column: 1, scope: !634, inlinedAt: !788)
!801 = !DILocation(line: 204, column: 1, scope: !781)
!802 = distinct !DISubprogram(name: "btstack_memory_le_hci_connection_get", scope: !230, file: !230, line: 221, type: !590, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !592)
!803 = !DILocation(line: 223, column: 29, scope: !802)
!804 = !DILocation(line: 66, column: 23, scope: !608, inlinedAt: !805)
!805 = distinct !DILocation(line: 223, column: 12, scope: !802)
!806 = !DILocation(line: 66, column: 10, scope: !608, inlinedAt: !805)
!807 = !DILocation(line: 66, column: 9, scope: !609, inlinedAt: !805)
!808 = !DILocation(line: 71, column: 13, scope: !609, inlinedAt: !805)
!809 = !DILocation(line: 72, column: 31, scope: !609, inlinedAt: !805)
!810 = !DILocation(line: 72, column: 23, scope: !609, inlinedAt: !805)
!811 = !DILocation(line: 74, column: 12, scope: !609, inlinedAt: !805)
!812 = !DILocation(line: 223, column: 5, scope: !802)
!813 = distinct !DISubprogram(name: "btstack_memory_le_hci_connection_free", scope: !230, file: !230, line: 225, type: !595, isLocal: false, isDefinition: true, scopeLine: 226, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !814)
!814 = !{!815}
!815 = !DILocalVariable(name: "le_hci_connection", arg: 1, scope: !813, file: !230, line: 225, type: !227)
!816 = !DILocation(line: 225, column: 50, scope: !813)
!817 = !DILocation(line: 227, column: 23, scope: !813)
!818 = !DILocation(line: 227, column: 38, scope: !813)
!819 = !DILocation(line: 30, column: 45, scope: !634, inlinedAt: !820)
!820 = distinct !DILocation(line: 227, column: 5, scope: !813)
!821 = !DILocation(line: 30, column: 57, scope: !634, inlinedAt: !820)
!822 = !DILocation(line: 33, column: 27, scope: !634, inlinedAt: !820)
!823 = !DILocation(line: 33, column: 13, scope: !634, inlinedAt: !820)
!824 = !DILocation(line: 37, column: 28, scope: !648, inlinedAt: !820)
!825 = !DILocation(line: 36, column: 13, scope: !634, inlinedAt: !820)
!826 = !DILocation(line: 37, column: 5, scope: !651, inlinedAt: !820)
!827 = !DILocation(line: 38, column: 16, scope: !653, inlinedAt: !820)
!828 = !DILocation(line: 37, column: 48, scope: !657, inlinedAt: !820)
!829 = !DILocation(line: 38, column: 13, scope: !654, inlinedAt: !820)
!830 = !DILocation(line: 45, column: 25, scope: !634, inlinedAt: !820)
!831 = !DILocation(line: 46, column: 25, scope: !634, inlinedAt: !820)
!832 = !DILocation(line: 47, column: 1, scope: !634, inlinedAt: !820)
!833 = !DILocation(line: 228, column: 1, scope: !813)
!834 = distinct !DISubprogram(name: "btstack_memory_gatt_client_get", scope: !230, file: !230, line: 243, type: !590, isLocal: false, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !592)
!835 = !DILocation(line: 245, column: 38, scope: !834)
!836 = !DILocation(line: 245, column: 53, scope: !834)
!837 = !DILocation(line: 62, column: 45, scope: !609, inlinedAt: !838)
!838 = distinct !DILocation(line: 245, column: 21, scope: !834)
!839 = !DILocation(line: 66, column: 23, scope: !608, inlinedAt: !838)
!840 = !DILocation(line: 66, column: 10, scope: !608, inlinedAt: !838)
!841 = !DILocation(line: 66, column: 9, scope: !609, inlinedAt: !838)
!842 = !DILocation(line: 71, column: 13, scope: !609, inlinedAt: !838)
!843 = !DILocation(line: 72, column: 31, scope: !609, inlinedAt: !838)
!844 = !DILocation(line: 72, column: 23, scope: !609, inlinedAt: !838)
!845 = !DILocation(line: 74, column: 12, scope: !609, inlinedAt: !838)
!846 = !DILocation(line: 245, column: 5, scope: !834)
!847 = distinct !DISubprogram(name: "btstack_memory_gatt_client_free", scope: !230, file: !230, line: 247, type: !595, isLocal: false, isDefinition: true, scopeLine: 248, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !848)
!848 = !{!849}
!849 = !DILocalVariable(name: "gatt_client", arg: 1, scope: !847, file: !230, line: 247, type: !227)
!850 = !DILocation(line: 247, column: 44, scope: !847)
!851 = !DILocation(line: 249, column: 23, scope: !847)
!852 = !DILocation(line: 249, column: 38, scope: !847)
!853 = !DILocation(line: 30, column: 45, scope: !634, inlinedAt: !854)
!854 = distinct !DILocation(line: 249, column: 5, scope: !847)
!855 = !DILocation(line: 30, column: 57, scope: !634, inlinedAt: !854)
!856 = !DILocation(line: 33, column: 27, scope: !634, inlinedAt: !854)
!857 = !DILocation(line: 33, column: 13, scope: !634, inlinedAt: !854)
!858 = !DILocation(line: 37, column: 28, scope: !648, inlinedAt: !854)
!859 = !DILocation(line: 36, column: 13, scope: !634, inlinedAt: !854)
!860 = !DILocation(line: 37, column: 5, scope: !651, inlinedAt: !854)
!861 = !DILocation(line: 38, column: 16, scope: !653, inlinedAt: !854)
!862 = !DILocation(line: 37, column: 48, scope: !657, inlinedAt: !854)
!863 = !DILocation(line: 38, column: 13, scope: !654, inlinedAt: !854)
!864 = !DILocation(line: 45, column: 25, scope: !634, inlinedAt: !854)
!865 = !DILocation(line: 46, column: 25, scope: !634, inlinedAt: !854)
!866 = !DILocation(line: 47, column: 1, scope: !634, inlinedAt: !854)
!867 = !DILocation(line: 250, column: 1, scope: !847)
!868 = distinct !DISubprogram(name: "btstack_memory_sm_lookup_entry_get", scope: !230, file: !230, line: 275, type: !590, isLocal: false, isDefinition: true, scopeLine: 276, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !592)
!869 = !DILocation(line: 277, column: 5, scope: !868)
!870 = distinct !DISubprogram(name: "btstack_memory_sm_lookup_entry_free", scope: !230, file: !230, line: 279, type: !595, isLocal: false, isDefinition: true, scopeLine: 280, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !871)
!871 = !{!872}
!872 = !DILocalVariable(name: "sm_lookup_entry", arg: 1, scope: !870, file: !230, line: 279, type: !227)
!873 = !DILocation(line: 279, column: 48, scope: !870)
!874 = !DILocation(line: 283, column: 1, scope: !870)
!875 = distinct !DISubprogram(name: "btstack_memory_whitelist_entry_get", scope: !230, file: !230, line: 299, type: !590, isLocal: false, isDefinition: true, scopeLine: 300, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !592)
!876 = !DILocation(line: 301, column: 5, scope: !875)
!877 = distinct !DISubprogram(name: "btstack_memory_whitelist_entry_free", scope: !230, file: !230, line: 303, type: !595, isLocal: false, isDefinition: true, scopeLine: 304, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !878)
!878 = !{!879}
!879 = !DILocalVariable(name: "whitelist_entry", arg: 1, scope: !877, file: !230, line: 303, type: !227)
!880 = !DILocation(line: 303, column: 48, scope: !877)
!881 = !DILocation(line: 307, column: 1, scope: !877)
!882 = distinct !DISubprogram(name: "btstack_memory_bnep_service_get", scope: !230, file: !230, line: 327, type: !883, isLocal: false, isDefinition: true, scopeLine: 328, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !592)
!883 = !DISubroutineType(types: !884)
!884 = !{!885}
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "bnep_service_t", file: !6, line: 137, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 130, size: 96, elements: !888)
!888 = !{!889, !890, !891, !892}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !887, file: !6, line: 131, baseType: !260, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "service_uuid", scope: !887, file: !6, line: 132, baseType: !281, size: 16, offset: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "max_frame_size", scope: !887, file: !6, line: 133, baseType: !281, size: 16, offset: 48)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "packet_handler", scope: !887, file: !6, line: 136, baseType: !272, size: 32, offset: 64)
!893 = !DILocation(line: 329, column: 5, scope: !882)
!894 = distinct !DISubprogram(name: "btstack_memory_bnep_service_free", scope: !230, file: !230, line: 331, type: !895, isLocal: false, isDefinition: true, scopeLine: 332, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !897)
!895 = !DISubroutineType(types: !896)
!896 = !{null, !885}
!897 = !{!898}
!898 = !DILocalVariable(name: "bnep_service", arg: 1, scope: !894, file: !230, line: 331, type: !885)
!899 = !DILocation(line: 331, column: 55, scope: !894)
!900 = !DILocation(line: 335, column: 1, scope: !894)
!901 = distinct !DISubprogram(name: "btstack_memory_bnep_channel_get", scope: !230, file: !230, line: 354, type: !902, isLocal: false, isDefinition: true, scopeLine: 355, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !592)
!902 = !DISubroutineType(types: !903)
!903 = !{!904}
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "bnep_channel_t", file: !6, line: 127, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 83, size: 1888, elements: !907)
!907 = !{!908, !909, !911, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !930, !931, !933, !934, !941, !942, !944, !945, !946, !947, !948, !949, !950, !953}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !906, file: !6, line: 85, baseType: !260, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !906, file: !6, line: 87, baseType: !910, size: 32, offset: 32)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "BNEP_CHANNEL_STATE", file: !6, line: 47, baseType: !5)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "state_var", scope: !906, file: !6, line: 89, baseType: !912, size: 32, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "BNEP_CHANNEL_STATE_VAR", file: !6, line: 58, baseType: !12)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "max_frame_size", scope: !906, file: !6, line: 91, baseType: !281, size: 16, offset: 96)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !906, file: !6, line: 92, baseType: !227, size: 32, offset: 128)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "local_addr", scope: !906, file: !6, line: 93, baseType: !309, size: 48, offset: 160)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "remote_addr", scope: !906, file: !6, line: 94, baseType: !309, size: 48, offset: 208)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "l2cap_cid", scope: !906, file: !6, line: 95, baseType: !281, size: 16, offset: 256)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "con_handle", scope: !906, file: !6, line: 96, baseType: !293, size: 16, offset: 272)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "uuid_source", scope: !906, file: !6, line: 98, baseType: !281, size: 16, offset: 288)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "uuid_dest", scope: !906, file: !6, line: 99, baseType: !281, size: 16, offset: 304)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "last_control_type", scope: !906, file: !6, line: 101, baseType: !276, size: 8, offset: 320)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "response_code", scope: !906, file: !6, line: 102, baseType: !281, size: 16, offset: 336)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "net_filter", scope: !906, file: !6, line: 104, baseType: !924, size: 256, offset: 352)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 256, elements: !465)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "bnep_net_filter_t", file: !6, line: 72, baseType: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 69, size: 32, elements: !927)
!927 = !{!928, !929}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "range_start", scope: !926, file: !6, line: 70, baseType: !281, size: 16)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "range_end", scope: !926, file: !6, line: 71, baseType: !281, size: 16, offset: 16)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "net_filter_count", scope: !906, file: !6, line: 105, baseType: !281, size: 16, offset: 608)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "net_filter_out", scope: !906, file: !6, line: 107, baseType: !932, size: 32, offset: 640)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "net_filter_out_count", scope: !906, file: !6, line: 108, baseType: !281, size: 16, offset: 672)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "multicast_filter", scope: !906, file: !6, line: 110, baseType: !935, size: 768, offset: 688)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 768, elements: !465)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "bnep_multi_filter_t", file: !6, line: 78, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 75, size: 96, elements: !938)
!938 = !{!939, !940}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "addr_start", scope: !937, file: !6, line: 76, baseType: !310, size: 48)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "addr_end", scope: !937, file: !6, line: 77, baseType: !310, size: 48, offset: 48)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "multicast_filter_count", scope: !906, file: !6, line: 111, baseType: !281, size: 16, offset: 1456)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "multicast_filter_out", scope: !906, file: !6, line: 113, baseType: !943, size: 32, offset: 1472)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "multicast_filter_out_count", scope: !906, file: !6, line: 114, baseType: !281, size: 16, offset: 1504)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !906, file: !6, line: 117, baseType: !483, size: 160, offset: 1536)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "timer_active", scope: !906, file: !6, line: 118, baseType: !469, size: 32, offset: 1696)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "retry_count", scope: !906, file: !6, line: 119, baseType: !469, size: 32, offset: 1728)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "packet_handler", scope: !906, file: !6, line: 121, baseType: !272, size: 32, offset: 1760)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_for_can_send_now", scope: !906, file: !6, line: 123, baseType: !276, size: 8, offset: 1792)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "send_item", scope: !906, file: !6, line: 125, baseType: !951, size: 32, offset: 1824)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_list_t", file: !259, line: 101, baseType: !952)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_bit_flag", scope: !906, file: !6, line: 126, baseType: !320, size: 32, offset: 1856)
!954 = !DILocation(line: 356, column: 5, scope: !901)
!955 = distinct !DISubprogram(name: "btstack_memory_bnep_channel_free", scope: !230, file: !230, line: 358, type: !956, isLocal: false, isDefinition: true, scopeLine: 359, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !958)
!956 = !DISubroutineType(types: !957)
!957 = !{null, !904}
!958 = !{!959}
!959 = !DILocalVariable(name: "bnep_channel", arg: 1, scope: !955, file: !230, line: 358, type: !904)
!960 = !DILocation(line: 358, column: 55, scope: !955)
!961 = !DILocation(line: 362, column: 1, scope: !955)
!962 = distinct !DISubprogram(name: "btstack_bredr_memory_init", scope: !230, file: !230, line: 367, type: !963, isLocal: false, isDefinition: true, scopeLine: 368, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !965)
!963 = !DISubroutineType(types: !964)
!964 = !{null, !240}
!965 = !{!966}
!966 = !DILocalVariable(name: "stack", arg: 1, scope: !962, file: !230, line: 367, type: !240)
!967 = !DILocation(line: 367, column: 52, scope: !962)
!968 = !DILocation(line: 369, column: 22, scope: !962)
!969 = !DILocation(line: 374, column: 43, scope: !962)
!970 = !DILocation(line: 374, column: 63, scope: !962)
!971 = !DILocalVariable(name: "pool", arg: 1, scope: !972, file: !230, line: 48, type: !612)
!972 = distinct !DISubprogram(name: "memory_pool_create", scope: !230, file: !230, line: 48, type: !973, isLocal: true, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !975)
!973 = !DISubroutineType(types: !974)
!974 = !{null, !612, !227, !469, !469}
!975 = !{!971, !976, !977, !978, !979, !980, !981}
!976 = !DILocalVariable(name: "storage", arg: 2, scope: !972, file: !230, line: 48, type: !227)
!977 = !DILocalVariable(name: "count", arg: 3, scope: !972, file: !230, line: 48, type: !469)
!978 = !DILocalVariable(name: "block_size", arg: 4, scope: !972, file: !230, line: 48, type: !469)
!979 = !DILocalVariable(name: "free_blocks", scope: !972, file: !230, line: 50, type: !228)
!980 = !DILocalVariable(name: "mem_ptr", scope: !972, file: !230, line: 51, type: !235)
!981 = !DILocalVariable(name: "i", scope: !972, file: !230, line: 52, type: !469)
!982 = !DILocation(line: 48, column: 47, scope: !972, inlinedAt: !983)
!983 = distinct !DILocation(line: 374, column: 5, scope: !962)
!984 = !DILocation(line: 48, column: 59, scope: !972, inlinedAt: !983)
!985 = !DILocation(line: 48, column: 72, scope: !972, inlinedAt: !983)
!986 = !DILocation(line: 48, column: 83, scope: !972, inlinedAt: !983)
!987 = !DILocation(line: 51, column: 13, scope: !972, inlinedAt: !983)
!988 = !DILocation(line: 55, column: 18, scope: !972, inlinedAt: !983)
!989 = !DILocation(line: 55, column: 23, scope: !972, inlinedAt: !983)
!990 = !DILocation(line: 52, column: 9, scope: !972, inlinedAt: !983)
!991 = !DILocation(line: 30, column: 45, scope: !634, inlinedAt: !992)
!992 = distinct !DILocation(line: 57, column: 9, scope: !993, inlinedAt: !983)
!993 = distinct !DILexicalBlock(scope: !994, file: !230, line: 56, column: 35)
!994 = distinct !DILexicalBlock(scope: !995, file: !230, line: 56, column: 5)
!995 = distinct !DILexicalBlock(scope: !972, file: !230, line: 56, column: 5)
!996 = !DILocation(line: 30, column: 57, scope: !634, inlinedAt: !992)
!997 = !DILocation(line: 33, column: 27, scope: !634, inlinedAt: !992)
!998 = !DILocation(line: 33, column: 13, scope: !634, inlinedAt: !992)
!999 = !DILocation(line: 36, column: 13, scope: !634, inlinedAt: !992)
!1000 = !DILocation(line: 37, column: 5, scope: !651, inlinedAt: !992)
!1001 = !DILocation(line: 38, column: 16, scope: !653, inlinedAt: !992)
!1002 = !DILocation(line: 37, column: 48, scope: !657, inlinedAt: !992)
!1003 = !DILocation(line: 38, column: 13, scope: !654, inlinedAt: !992)
!1004 = !DILocation(line: 45, column: 25, scope: !634, inlinedAt: !992)
