temp.o:	file format ELF32-i386

.debug_info contents:
0x00000000: Compile Unit: length = 0x00002b9a version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x00002b9e)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)")
              DW_AT_language	(DW_LANG_C99)
              DW_AT_name	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/common/btstack_main.c")
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
              DW_AT_GNU_pubnames	(true)
              DW_AT_low_pc	(0x0000000000000000)
              DW_AT_ranges	(0x00000030
                 [0x00000000 - 0x000001de)
                 [0x000001de - 0x000029c6)
                 [0x00000000 - 0x00000009))

0x00000026:   DW_TAG_variable
                DW_AT_name	("app_info_debug_enable")
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/profile_stack_debug.h")
                DW_AT_decl_line	(190)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000037:   DW_TAG_base_type

                DW_AT_decl_line	(62)
                DW_AT_location	(DW_OP_addr 0x0)

0x0000004f:   DW_TAG_typedef
                DW_AT_type	(cu + 0x005a "unsigned char")
                DW_AT_name	("u8")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(44)

0x0000005a:   DW_TAG_base_type
                DW_AT_name	("unsigned char")
                DW_AT_encoding	(DW_ATE_unsigned_char)
                DW_AT_byte_size	(0x01)

0x00000061:   DW_TAG_variable
                DW_AT_name	("hfp_profile_support")
                DW_AT_type	(cu + 0x004f "u8")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/common/btstack_main.c")
                DW_AT_decl_line	(63)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000072:   DW_TAG_variable
                DW_AT_name	("acp_profile_support")
                DW_AT_type	(cu + 0x004f "u8")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/common/btstack_main.c")
                DW_AT_decl_line	(64)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000083:   DW_TAG_variable
                DW_AT_name	("a2dp_profile_support")
                DW_AT_type	(cu + 0x004f "u8")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/common/btstack_main.c")
                DW_AT_decl_line	(65)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000094:   DW_TAG_variable
                DW_AT_name	("spp_profile_support")
                DW_AT_type	(cu + 0x004f "u8")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/common/btstack_main.c")
                DW_AT_decl_line	(66)
                DW_AT_location	(DW_OP_addr 0x0)

0x000000a5:   DW_TAG_variable
                DW_AT_name	("spp_up_profile_support")
                DW_AT_type	(cu + 0x004f "u8")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/common/btstack_main.c")
                DW_AT_decl_line	(67)
                DW_AT_location	(DW_OP_addr 0x0)

0x000000b6:   DW_TAG_variable
                DW_AT_name	("hid_profile_support")
                DW_AT_type	(cu + 0x004f "u8")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/common/btstack_main.c")
                DW_AT_decl_line	(68)
                DW_AT_location	(DW_OP_addr 0x0)

0x000000c7:   DW_TAG_variable
                DW_AT_name	("pbap_profile_support")
                DW_AT_type	(cu + 0x004f "u8")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/common/btstack_main.c")
                DW_AT_decl_line	(69)
                DW_AT_location	(DW_OP_addr 0x0)

0x000000d8:   DW_TAG_variable
                DW_AT_name	("pan_profile_support")
                DW_AT_type	(cu + 0x004f "u8")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/common/btstack_main.c")
                DW_AT_decl_line	(70)
                DW_AT_location	(DW_OP_addr 0x0)

0x000000e9:   DW_TAG_variable
                DW_AT_name	("iap_profile_support")
                DW_AT_type	(cu + 0x004f "u8")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/common/btstack_main.c")
                DW_AT_decl_line	(71)
                DW_AT_location	(DW_OP_addr 0x0)

0x000000fa:   DW_TAG_variable
                DW_AT_name	("emitter_hfp_hf_support")
                DW_AT_type	(cu + 0x004f "u8")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/common/btstack_main.c")
                DW_AT_decl_line	(72)
                DW_AT_location	(DW_OP_addr 0x0)

0x0000010b:   DW_TAG_variable
                DW_AT_name	("profile_cmd_hdl_str")
                DW_AT_type	(cu + 0x011c "cmd_handle_str")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/common/btstack_main.c")
                DW_AT_decl_line	(77)
                DW_AT_location	(DW_OP_addr 0x0)

0x0000011c:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0127 "profile_cmd_handle")
                DW_AT_name	("cmd_handle_str")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/profile_common.h")
                DW_AT_decl_line	(27)

0x00000127:   DW_TAG_structure_type
                DW_AT_name	("profile_cmd_handle")
                DW_AT_byte_size	(0x2c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/profile_common.h")
                DW_AT_decl_line	(15)

0x0000012f:     DW_TAG_member
                  DW_AT_name	("hfp_send_cmd")
                  DW_AT_type	(cu + 0x01b4 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/profile_common.h")
                  DW_AT_decl_line	(16)
                  DW_AT_data_member_location	(0x00)

0x0000013b:     DW_TAG_member
                  DW_AT_name	("hid_send_cmd")
                  DW_AT_type	(cu + 0x01c5 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/profile_common.h")
                  DW_AT_decl_line	(17)
                  DW_AT_data_member_location	(0x04)

0x00000147:     DW_TAG_member
                  DW_AT_name	("spp_send_cmd")
                  DW_AT_type	(cu + 0x01b4 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/profile_common.h")
                  DW_AT_decl_line	(18)
                  DW_AT_data_member_location	(0x08)

0x00000153:     DW_TAG_member
                  DW_AT_name	("spp_up_send_cmd")
                  DW_AT_type	(cu + 0x01b4 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/profile_common.h")
                  DW_AT_decl_line	(19)
                  DW_AT_data_member_location	(0x0c)

0x0000015f:     DW_TAG_member
                  DW_AT_name	("avctp_send_cmd")
                  DW_AT_type	(cu + 0x01f1 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/profile_common.h")
                  DW_AT_decl_line	(20)
                  DW_AT_data_member_location	(0x10)

0x0000016b:     DW_TAG_member
                  DW_AT_name	("a2dp_send_cmd")
                  DW_AT_type	(cu + 0x01c5 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/profile_common.h")
                  DW_AT_decl_line	(21)
                  DW_AT_data_member_location	(0x14)

0x00000177:     DW_TAG_member
                  DW_AT_name	("hfp_ag_send_cmd")
                  DW_AT_type	(cu + 0x01b4 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/profile_common.h")
                  DW_AT_decl_line	(22)
                  DW_AT_data_member_location	(0x18)

0x00000183:     DW_TAG_member
                  DW_AT_name	("opp_send_cmd")
                  DW_AT_type	(cu + 0x01f1 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/profile_common.h")
                  DW_AT_decl_line	(23)
                  DW_AT_data_member_location	(0x1c)

0x0000018f:     DW_TAG_member
                  DW_AT_name	("sdp_send_cmd")
                  DW_AT_type	(cu + 0x01f1 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/profile_common.h")
                  DW_AT_decl_line	(24)
                  DW_AT_data_member_location	(0x20)

0x0000019b:     DW_TAG_member
                  DW_AT_name	("pan_send_cmd")
                  DW_AT_type	(cu + 0x020b "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/profile_common.h")
                  DW_AT_decl_line	(25)
                  DW_AT_data_member_location	(0x24)

0x000001a7:     DW_TAG_member
                  DW_AT_name	("iap_send_cmd")
                  DW_AT_type	(cu + 0x01b4 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/profile_common.h")
                  DW_AT_decl_line	(26)
                  DW_AT_data_member_location	(0x28)

0x000001b3:     NULL

0x000001b4:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x01b9 "subroutine int")

0x000001b9:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_prototyped	(true)

0x000001be:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x01c4 "*")

0x000001c3:     NULL

0x000001c4:   DW_TAG_pointer_type

0x000001c5:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x01ca "subroutine int")

0x000001ca:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_prototyped	(true)

0x000001cf:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x01da "u8*")

0x000001d4:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x01df "u32")

0x000001d9:     NULL

0x000001da:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x004f "u8")

0x000001df:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01ea "unsigned int")
                DW_AT_name	("u32")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(48)

0x000001ea:   DW_TAG_base_type
                DW_AT_name	("unsigned int")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x04)

0x000001f1:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x01f6 "subroutine int")

0x000001f6:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_prototyped	(true)

0x000001fb:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x01da "u8*")

0x00000200:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x01df "u32")

0x00000205:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x01df "u32")

0x0000020a:     NULL

0x0000020b:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0210 "subroutine int")

0x00000210:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_prototyped	(true)

0x00000215:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x01da "u8*")

0x0000021a:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x01df "u32")

0x0000021f:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x01df "u32")

0x00000224:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x01da "u8*")

0x00000229:     NULL

0x0000022a:   DW_TAG_variable
                DW_AT_name	("btstack_global_info")
                DW_AT_type	(cu + 0x023b "btstack_ctrl")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/common/btstack_main.c")
                DW_AT_decl_line	(107)
                DW_AT_location	(DW_OP_addr 0x42c)

0x0000023b:   DW_TAG_structure_type
                DW_AT_name	("btstack_ctrl")
                DW_AT_byte_size	(0xb8)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/common/btstack_main.c")
                DW_AT_decl_line	(103)

0x00000243:     DW_TAG_member
                  DW_AT_name	("ble_ctl_info")
                  DW_AT_type	(cu + 0x0250 "ble_mode_ctrl")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/common/btstack_main.c")
                  DW_AT_decl_line	(104)
                  DW_AT_data_member_location	(0x00)

0x0000024f:     NULL

0x00000250:   DW_TAG_structure_type
                DW_AT_name	("ble_mode_ctrl")
                DW_AT_byte_size	(0xb8)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/common/btstack_main.c")
                DW_AT_decl_line	(93)

0x00000258:     DW_TAG_member
                  DW_AT_name	("loop")
                  DW_AT_type	(cu + 0x02b3 "run_loop")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/common/btstack_main.c")
                  DW_AT_decl_line	(94)
                  DW_AT_data_member_location	(0x00)

0x00000264:     DW_TAG_member
                  DW_AT_name	("cmd_cbuf")
                  DW_AT_type	(cu + 0x0316 "cbuffer_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/common/btstack_main.c")
                  DW_AT_decl_line	(95)
                  DW_AT_data_member_location	(0x0c)

0x00000270:     DW_TAG_member
                  DW_AT_name	("cmd_buffer")
                  DW_AT_type	(cu + 0x03bb "u32[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/common/btstack_main.c")
                  DW_AT_decl_line	(96)
                  DW_AT_data_member_location	(0x30)

0x0000027c:     DW_TAG_member
                  DW_AT_name	("regist_thread_call")
                  DW_AT_type	(cu + 0x03ce "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/common/btstack_main.c")
                  DW_AT_decl_line	(97)
                  DW_AT_data_member_location	(0xb0)

0x00000288:     DW_TAG_member
                  DW_AT_name	("run_flag")
                  DW_AT_type	(cu + 0x03d4 "volatile u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/common/btstack_main.c")
                  DW_AT_decl_line	(98)
                  DW_AT_data_member_location	(0xb4)

0x00000294:     DW_TAG_member
                  DW_AT_name	("gatt_role")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/common/btstack_main.c")
                  DW_AT_decl_line	(99)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x03)
                  DW_AT_bit_offset	(0x05)
                  DW_AT_data_member_location	(0xb5)

0x000002a3:     DW_TAG_member
                  DW_AT_name	("Reserved")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/common/btstack_main.c")
                  DW_AT_decl_line	(100)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x05)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0xb5)

0x000002b2:     NULL

0x000002b3:   DW_TAG_structure_type
                DW_AT_name	("run_loop")
                DW_AT_byte_size	(0x0c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/run_loop.h")
                DW_AT_decl_line	(9)

0x000002bb:     DW_TAG_member
                  DW_AT_name	("entry")
                  DW_AT_type	(cu + 0x02e0 "btstack_linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/run_loop.h")
                  DW_AT_decl_line	(10)
                  DW_AT_data_member_location	(0x00)

0x000002c7:     DW_TAG_member
                  DW_AT_name	("run")
                  DW_AT_type	(cu + 0x0305 "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/run_loop.h")
                  DW_AT_decl_line	(11)
                  DW_AT_data_member_location	(0x04)

0x000002d3:     DW_TAG_member
                  DW_AT_name	("var")
                  DW_AT_type	(cu + 0x01c4 "*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/run_loop.h")
                  DW_AT_decl_line	(12)
                  DW_AT_data_member_location	(0x08)

0x000002df:     NULL

0x000002e0:   DW_TAG_typedef
                DW_AT_type	(cu + 0x02eb "btstack_linked_item")
                DW_AT_name	("btstack_linked_item_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(55)

0x000002eb:   DW_TAG_structure_type
                DW_AT_name	("btstack_linked_item")
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(53)

0x000002f3:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(cu + 0x0300 "btstack_linked_item*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                  DW_AT_decl_line	(54)
                  DW_AT_data_member_location	(0x00)

0x000002ff:     NULL

0x00000300:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x02eb "btstack_linked_item")

0x00000305:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x030a "subroutine ")

0x0000030a:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x0000030b:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0311 "run_loop*")

0x00000310:     NULL

0x00000311:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x02b3 "run_loop")

0x00000316:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0321 "_cbuffer")
                DW_AT_name	("cbuffer_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/generic/circular_buf.h")
                DW_AT_decl_line	(26)

0x00000321:   DW_TAG_structure_type
                DW_AT_name	("_cbuffer")
                DW_AT_byte_size	(0x24)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/generic/circular_buf.h")
                DW_AT_decl_line	(16)

0x00000329:     DW_TAG_member
                  DW_AT_name	("begin")
                  DW_AT_type	(cu + 0x01da "u8*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/generic/circular_buf.h")
                  DW_AT_decl_line	(17)
                  DW_AT_data_member_location	(0x00)

0x00000335:     DW_TAG_member
                  DW_AT_name	("end")
                  DW_AT_type	(cu + 0x01da "u8*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/generic/circular_buf.h")
                  DW_AT_decl_line	(18)
                  DW_AT_data_member_location	(0x04)

0x00000341:     DW_TAG_member
                  DW_AT_name	("read_ptr")
                  DW_AT_type	(cu + 0x01da "u8*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/generic/circular_buf.h")
                  DW_AT_decl_line	(19)
                  DW_AT_data_member_location	(0x08)

0x0000034d:     DW_TAG_member
                  DW_AT_name	("write_ptr")
                  DW_AT_type	(cu + 0x01da "u8*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/generic/circular_buf.h")
                  DW_AT_decl_line	(20)
                  DW_AT_data_member_location	(0x0c)

0x00000359:     DW_TAG_member
                  DW_AT_name	("tmp_ptr")
                  DW_AT_type	(cu + 0x01da "u8*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/generic/circular_buf.h")
                  DW_AT_decl_line	(21)
                  DW_AT_data_member_location	(0x10)

0x00000365:     DW_TAG_member
                  DW_AT_name	("tmp_len")
                  DW_AT_type	(cu + 0x01df "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/generic/circular_buf.h")
                  DW_AT_decl_line	(22)
                  DW_AT_data_member_location	(0x14)

0x00000371:     DW_TAG_member
                  DW_AT_name	("data_len")
                  DW_AT_type	(cu + 0x01df "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/generic/circular_buf.h")
                  DW_AT_decl_line	(23)
                  DW_AT_data_member_location	(0x18)

0x0000037d:     DW_TAG_member
                  DW_AT_name	("total_len")
                  DW_AT_type	(cu + 0x01df "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/generic/circular_buf.h")
                  DW_AT_decl_line	(24)
                  DW_AT_data_member_location	(0x1c)

0x00000389:     DW_TAG_member
                  DW_AT_name	("lock")
                  DW_AT_type	(cu + 0x0396 "spinlock_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/generic/circular_buf.h")
                  DW_AT_decl_line	(25)
                  DW_AT_data_member_location	(0x20)

0x00000395:     NULL

0x00000396:   DW_TAG_typedef
                DW_AT_type	(cu + 0x03a1 "__spinlock")
                DW_AT_name	("spinlock_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/spinlock.h")
                DW_AT_decl_line	(13)

0x000003a1:   DW_TAG_structure_type
                DW_AT_name	("__spinlock")
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/spinlock.h")
                DW_AT_decl_line	(9)

0x000003a9:     DW_TAG_member
                  DW_AT_name	("rwlock")
                  DW_AT_type	(cu + 0x03b6 "volatile u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/spinlock.h")
                  DW_AT_decl_line	(10)
                  DW_AT_data_member_location	(0x00)

0x000003b5:     NULL

0x000003b6:   DW_TAG_volatile_type
                DW_AT_type	(cu + 0x01df "u32")

0x000003bb:   DW_TAG_array_type
                DW_AT_type	(cu + 0x01df "u32")

0x000003c0:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x03c7 "sizetype")
                  DW_AT_count	(0x20)

0x000003c6:     NULL

0x000003c7:   DW_TAG_base_type
                DW_AT_name	("sizetype")
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_unsigned)

0x000003ce:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x03d3 "subroutine ")

0x000003d3:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x000003d4:   DW_TAG_volatile_type
                DW_AT_type	(cu + 0x004f "u8")

0x000003d9:   DW_TAG_variable
                DW_AT_name	("profile_l2cap_hdl")
                DW_AT_type	(cu + 0x03ea "l2cap_stack_t")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/common/btstack_main.c")
                DW_AT_decl_line	(114)
                DW_AT_location	(DW_OP_addr 0x0)

0x000003ea:   DW_TAG_typedef
                DW_AT_type	(cu + 0x03f6 "structure ")
                DW_AT_name	("l2cap_stack_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(284)

0x000003f6:   DW_TAG_structure_type
                DW_AT_byte_size	(0x38)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(273)

0x000003fb:     DW_TAG_member
                  DW_AT_name	("packet_handler")
                  DW_AT_type	(cu + 0x0430 "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(274)
                  DW_AT_data_member_location	(0x00)

0x00000408:     DW_TAG_member
                  DW_AT_name	("l2cap_services")
                  DW_AT_type	(cu + 0x0462 "linked_list_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(279)
                  DW_AT_data_member_location	(0x04)

0x00000415:     DW_TAG_member
                  DW_AT_name	("l2cap_channels")
                  DW_AT_type	(cu + 0x0462 "linked_list_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(280)
                  DW_AT_data_member_location	(0x08)

0x00000422:     DW_TAG_member
                  DW_AT_name	("statck_core_data")
                  DW_AT_type	(cu + 0x0472 "l2cap_core_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(282)
                  DW_AT_data_member_location	(0x0c)

0x0000042f:     NULL

0x00000430:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0435 "subroutine ")

0x00000435:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x00000436:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x01c4 "*")

0x0000043b:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x004f "u8")

0x00000440:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0450 "u16")

0x00000445:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x01da "u8*")

0x0000044a:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0450 "u16")

0x0000044f:     NULL

0x00000450:   DW_TAG_typedef
                DW_AT_type	(cu + 0x045b "unsigned short")
                DW_AT_name	("u16")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(46)

0x0000045b:   DW_TAG_base_type
                DW_AT_name	("unsigned short")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x02)

0x00000462:   DW_TAG_typedef
                DW_AT_type	(cu + 0x046d "btstack_linked_item_t*")
                DW_AT_name	("linked_list_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(101)

0x0000046d:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x02e0 "btstack_linked_item_t")

0x00000472:   DW_TAG_typedef
                DW_AT_type	(cu + 0x047e "structure ")
                DW_AT_name	("l2cap_core_data_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(271)

0x0000047e:   DW_TAG_structure_type
                DW_AT_byte_size	(0x2c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(262)

0x00000483:     DW_TAG_member
                  DW_AT_name	("signaling_responses")
                  DW_AT_type	(cu + 0x04d2 "l2cap_signaling_response_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(264)
                  DW_AT_data_member_location	(0x00)

0x00000490:     DW_TAG_member
                  DW_AT_name	("signaling_responses_pending")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(266)
                  DW_AT_data_member_location	(0x18)

0x0000049d:     DW_TAG_member
                  DW_AT_name	("extended_feature")
                  DW_AT_type	(cu + 0x01df "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(267)
                  DW_AT_data_member_location	(0x1c)

0x000004aa:     DW_TAG_member
                  DW_AT_name	("authentication_flag")
                  DW_AT_type	(cu + 0x0544 "l2cap_authentication_flag_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(268)
                  DW_AT_data_member_location	(0x20)

0x000004b7:     DW_TAG_member
                  DW_AT_name	("l2cap_sig_seq_nr")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(269)
                  DW_AT_data_member_location	(0x28)

0x000004c4:     DW_TAG_member
                  DW_AT_name	("l2cap_source_cid")
                  DW_AT_type	(cu + 0x0450 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(270)
                  DW_AT_data_member_location	(0x2a)

0x000004d1:     NULL

0x000004d2:   DW_TAG_array_type
                DW_AT_type	(cu + 0x04de "l2cap_signaling_response_t")

0x000004d7:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x03c7 "sizetype")
                  DW_AT_count	(0x03)

0x000004dd:     NULL

0x000004de:   DW_TAG_typedef
                DW_AT_type	(cu + 0x04e9 "l2cap_signaling_response")
                DW_AT_name	("l2cap_signaling_response_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(251)

0x000004e9:   DW_TAG_structure_type
                DW_AT_name	("l2cap_signaling_response")
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(245)

0x000004f1:     DW_TAG_member
                  DW_AT_name	("handle")
                  DW_AT_type	(cu + 0x052e "hci_con_handle_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(246)
                  DW_AT_data_member_location	(0x00)

0x000004fd:     DW_TAG_member
                  DW_AT_name	("sig_id")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(247)
                  DW_AT_data_member_location	(0x02)

0x00000509:     DW_TAG_member
                  DW_AT_name	("code")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(248)
                  DW_AT_data_member_location	(0x03)

0x00000515:     DW_TAG_member
                  DW_AT_name	("cid")
                  DW_AT_type	(cu + 0x0450 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(249)
                  DW_AT_data_member_location	(0x04)

0x00000521:     DW_TAG_member
                  DW_AT_name	("data")
                  DW_AT_type	(cu + 0x0450 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(250)
                  DW_AT_data_member_location	(0x06)

0x0000052d:     NULL

0x0000052e:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0539 "uint16_t")
                DW_AT_name	("hci_con_handle_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/utils.h")
                DW_AT_decl_line	(60)

0x00000539:   DW_TAG_typedef
                DW_AT_type	(cu + 0x045b "unsigned short")
                DW_AT_name	("uint16_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(46)

0x00000544:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0550 "l2cap_authentication_flag_t")

0x00000549:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x03c7 "sizetype")
                  DW_AT_count	(0x01)

0x0000054f:     NULL

0x00000550:   DW_TAG_typedef
                DW_AT_type	(cu + 0x055c "authentication_flag")
                DW_AT_name	("l2cap_authentication_flag_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(258)

0x0000055c:   DW_TAG_structure_type
                DW_AT_name	("authentication_flag")
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(253)

0x00000564:     DW_TAG_member
                  DW_AT_name	("addr")
                  DW_AT_type	(cu + 0x059d "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(254)
                  DW_AT_data_member_location	(0x00)

0x00000570:     DW_TAG_member
                  DW_AT_name	("in_used")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(255)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x06)

0x0000057f:     DW_TAG_member
                  DW_AT_name	("remote_dev_company")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(256)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x06)

0x0000058f:     DW_TAG_member
                  DW_AT_name	("authentication_status")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(257)
                  DW_AT_data_member_location	(0x07)

0x0000059c:     NULL

0x0000059d:   DW_TAG_typedef
                DW_AT_type	(cu + 0x05a8 "uint8_t[]")
                DW_AT_name	("bd_addr_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/utils.h")
                DW_AT_decl_line	(66)

0x000005a8:   DW_TAG_array_type
                DW_AT_type	(cu + 0x05b4 "uint8_t")

0x000005ad:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x03c7 "sizetype")
                  DW_AT_count	(0x06)

0x000005b3:     NULL

0x000005b4:   DW_TAG_typedef
                DW_AT_type	(cu + 0x005a "unsigned char")
                DW_AT_name	("uint8_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(44)

0x000005bf:   DW_TAG_variable
                DW_AT_name	("profile_bredr_pool_hdl")
                DW_AT_type	(cu + 0x05d0 "stack_bredr_pool_t")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/common/btstack_main.c")
                DW_AT_decl_line	(116)
                DW_AT_location	(DW_OP_addr 0x0)

0x000005d0:   DW_TAG_typedef
                DW_AT_type	(cu + 0x05db "structure ")
                DW_AT_name	("stack_bredr_pool_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                DW_AT_decl_line	(59)

0x000005db:   DW_TAG_structure_type
                DW_AT_byte_size	(0x01c8)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                DW_AT_decl_line	(29)

0x000005e0:     DW_TAG_member
                  DW_AT_name	("l2cap_service_pool")
                  DW_AT_type	(cu + 0x065c "memory_pool_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                  DW_AT_decl_line	(33)
                  DW_AT_data_member_location	(0x00)

0x000005ec:     DW_TAG_member
                  DW_AT_name	("l2cap_channel_pool")
                  DW_AT_type	(cu + 0x065c "memory_pool_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                  DW_AT_decl_line	(34)
                  DW_AT_data_member_location	(0x04)

0x000005f8:     DW_TAG_member
                  DW_AT_name	("rfcomm_multiplexer_pool")
                  DW_AT_type	(cu + 0x065c "memory_pool_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                  DW_AT_decl_line	(36)
                  DW_AT_data_member_location	(0x08)

0x00000604:     DW_TAG_member
                  DW_AT_name	("rfcomm_service_pool")
                  DW_AT_type	(cu + 0x065c "memory_pool_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                  DW_AT_decl_line	(37)
                  DW_AT_data_member_location	(0x0c)

0x00000610:     DW_TAG_member
                  DW_AT_name	("rfcomm_channel_pool")
                  DW_AT_type	(cu + 0x065c "memory_pool_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                  DW_AT_decl_line	(38)
                  DW_AT_data_member_location	(0x10)

0x0000061c:     DW_TAG_member
                  DW_AT_name	("l2cap_service_storage")
                  DW_AT_type	(cu + 0x0667 "l2cap_service_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                  DW_AT_decl_line	(48)
                  DW_AT_data_member_location	(0x14)

0x00000628:     DW_TAG_member
                  DW_AT_name	("l2cap_channel_storage")
                  DW_AT_type	(cu + 0x06f5 "l2cap_channel_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                  DW_AT_decl_line	(49)
                  DW_AT_data_member_location	(0x54)

0x00000634:     DW_TAG_member
                  DW_AT_name	("rfcomm_multiplexer_storage")
                  DW_AT_type	(cu + 0x0881 "rfcomm_multiplexer_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                  DW_AT_decl_line	(51)
                  DW_AT_data_member_location	(0x016c)

0x00000641:     DW_TAG_member
                  DW_AT_name	("rfcomm_service_storage")
                  DW_AT_type	(cu + 0x0937 "rfcomm_service_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                  DW_AT_decl_line	(52)
                  DW_AT_data_member_location	(0x0180)

0x0000064e:     DW_TAG_member
                  DW_AT_name	("rfcomm_channel_storage")
                  DW_AT_type	(cu + 0x09a7 "rfcomm_channel_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                  DW_AT_decl_line	(53)
                  DW_AT_data_member_location	(0x0194)

0x0000065b:     NULL

0x0000065c:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01c4 "*")
                DW_AT_name	("memory_pool_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_memory.h")
                DW_AT_decl_line	(28)

0x00000667:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0673 "l2cap_service_t")

0x0000066c:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x03c7 "sizetype")
                  DW_AT_count	(0x04)

0x00000672:     NULL

0x00000673:   DW_TAG_typedef
                DW_AT_type	(cu + 0x067e "structure ")
                DW_AT_name	("l2cap_service_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(241)

0x0000067e:   DW_TAG_structure_type
                DW_AT_byte_size	(0x10)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(225)

0x00000682:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x06bf "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(227)
                  DW_AT_data_member_location	(0x00)

0x0000068e:     DW_TAG_member
                  DW_AT_name	("psm")
                  DW_AT_type	(cu + 0x0450 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(230)
                  DW_AT_data_member_location	(0x04)

0x0000069a:     DW_TAG_member
                  DW_AT_name	("mtu")
                  DW_AT_type	(cu + 0x0450 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(233)
                  DW_AT_data_member_location	(0x06)

0x000006a6:     DW_TAG_member
                  DW_AT_name	("connection")
                  DW_AT_type	(cu + 0x01c4 "*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(236)
                  DW_AT_data_member_location	(0x08)

0x000006b2:     DW_TAG_member
                  DW_AT_name	("packet_handler")
                  DW_AT_type	(cu + 0x06ca "btstack_packet_handler_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(239)
                  DW_AT_data_member_location	(0x0c)

0x000006be:     NULL

0x000006bf:   DW_TAG_typedef
                DW_AT_type	(cu + 0x02e0 "btstack_linked_item_t")
                DW_AT_name	("linked_item_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(100)

0x000006ca:   DW_TAG_typedef
                DW_AT_type	(cu + 0x06d5 "subroutine *")
                DW_AT_name	("btstack_packet_handler_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(58)

0x000006d5:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x06da "subroutine ")

0x000006da:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x000006db:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x05b4 "uint8_t")

0x000006e0:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0539 "uint16_t")

0x000006e5:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x06f0 "uint8_t*")

0x000006ea:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0539 "uint16_t")

0x000006ef:     NULL

0x000006f0:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x05b4 "uint8_t")

0x000006f5:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0701 "l2cap_channel_t")

0x000006fa:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x03c7 "sizetype")
                  DW_AT_count	(0x05)

0x00000700:     NULL

0x00000701:   DW_TAG_typedef
                DW_AT_type	(cu + 0x070c "structure ")
                DW_AT_name	("l2cap_channel_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(222)

0x0000070c:   DW_TAG_structure_type
                DW_AT_byte_size	(0x38)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(204)

0x00000710:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x06bf "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(206)
                  DW_AT_data_member_location	(0x00)

0x0000071c:     DW_TAG_member
                  DW_AT_name	("handle")
                  DW_AT_type	(cu + 0x052e "hci_con_handle_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(208)
                  DW_AT_data_member_location	(0x04)

0x00000728:     DW_TAG_member
                  DW_AT_name	("waiting_for_can_send_now")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(211)
                  DW_AT_data_member_location	(0x06)

0x00000734:     DW_TAG_member
                  DW_AT_name	("connection")
                  DW_AT_type	(cu + 0x01c4 "*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(215)
                  DW_AT_data_member_location	(0x08)

0x00000740:     DW_TAG_member
                  DW_AT_name	("packet_handler")
                  DW_AT_type	(cu + 0x06ca "btstack_packet_handler_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(218)
                  DW_AT_data_member_location	(0x0c)

0x0000074c:     DW_TAG_member
                  DW_AT_name	("channel_core_data")
                  DW_AT_type	(cu + 0x0759 "channel_core_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(220)
                  DW_AT_data_member_location	(0x10)

0x00000758:     NULL

0x00000759:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0764 "structure ")
                DW_AT_name	("channel_core_data_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(200)

0x00000764:   DW_TAG_structure_type
                DW_AT_byte_size	(0x28)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(178)

0x00000768:     DW_TAG_member
                  DW_AT_name	("state_var")
                  DW_AT_type	(cu + 0x0450 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(180)
                  DW_AT_data_member_location	(0x00)

0x00000774:     DW_TAG_member
                  DW_AT_name	("state")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(181)
                  DW_AT_data_member_location	(0x02)

0x00000780:     DW_TAG_member
                  DW_AT_name	("remote_sig_id")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(183)
                  DW_AT_data_member_location	(0x03)

0x0000078c:     DW_TAG_member
                  DW_AT_name	("local_sig_id")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(184)
                  DW_AT_data_member_location	(0x04)

0x00000798:     DW_TAG_member
                  DW_AT_name	("reason")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(186)
                  DW_AT_data_member_location	(0x05)

0x000007a4:     DW_TAG_member
                  DW_AT_name	("address")
                  DW_AT_type	(cu + 0x059d "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(188)
                  DW_AT_data_member_location	(0x06)

0x000007b0:     DW_TAG_member
                  DW_AT_name	("psm")
                  DW_AT_type	(cu + 0x0450 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(189)
                  DW_AT_data_member_location	(0x0c)

0x000007bc:     DW_TAG_member
                  DW_AT_name	("local_cid")
                  DW_AT_type	(cu + 0x0450 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(191)
                  DW_AT_data_member_location	(0x0e)

0x000007c8:     DW_TAG_member
                  DW_AT_name	("remote_cid")
                  DW_AT_type	(cu + 0x0450 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(192)
                  DW_AT_data_member_location	(0x10)

0x000007d4:     DW_TAG_member
                  DW_AT_name	("local_mtu")
                  DW_AT_type	(cu + 0x0450 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(194)
                  DW_AT_data_member_location	(0x12)

0x000007e0:     DW_TAG_member
                  DW_AT_name	("remote_mtu")
                  DW_AT_type	(cu + 0x0450 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(195)
                  DW_AT_data_member_location	(0x14)

0x000007ec:     DW_TAG_member
                  DW_AT_name	("channel_mode")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(197)
                  DW_AT_data_member_location	(0x16)

0x000007f8:     DW_TAG_member
                  DW_AT_name	("remote_extended_feature")
                  DW_AT_type	(cu + 0x01df "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(198)
                  DW_AT_data_member_location	(0x18)

0x00000804:     DW_TAG_member
                  DW_AT_name	("retran_op")
                  DW_AT_type	(cu + 0x0811 "retran_flow_ctl_op_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(199)
                  DW_AT_data_member_location	(0x1c)

0x00000810:     NULL

0x00000811:   DW_TAG_typedef
                DW_AT_type	(cu + 0x081c "structure ")
                DW_AT_name	("retran_flow_ctl_op_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(174)

0x0000081c:   DW_TAG_structure_type
                DW_AT_byte_size	(0x0c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(165)

0x00000820:     DW_TAG_member
                  DW_AT_name	("retransmission_flow_ctl")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(166)
                  DW_AT_data_member_location	(0x00)

0x0000082c:     DW_TAG_member
                  DW_AT_name	("length")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(167)
                  DW_AT_data_member_location	(0x01)

0x00000838:     DW_TAG_member
                  DW_AT_name	("mode")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(168)
                  DW_AT_data_member_location	(0x02)

0x00000844:     DW_TAG_member
                  DW_AT_name	("tx_window")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(169)
                  DW_AT_data_member_location	(0x03)

0x00000850:     DW_TAG_member
                  DW_AT_name	("max_transmit")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(170)
                  DW_AT_data_member_location	(0x04)

0x0000085c:     DW_TAG_member
                  DW_AT_name	("retransmission_timeout")
                  DW_AT_type	(cu + 0x0450 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(171)
                  DW_AT_data_member_location	(0x06)

0x00000868:     DW_TAG_member
                  DW_AT_name	("monitor_timeout")
                  DW_AT_type	(cu + 0x0450 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(172)
                  DW_AT_data_member_location	(0x08)

0x00000874:     DW_TAG_member
                  DW_AT_name	("max_pdu")
                  DW_AT_type	(cu + 0x0450 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(173)
                  DW_AT_data_member_location	(0x0a)

0x00000880:     NULL

0x00000881:   DW_TAG_array_type
                DW_AT_type	(cu + 0x088d "rfcomm_multiplexer_t")

0x00000886:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x03c7 "sizetype")
                  DW_AT_count	(0x01)

0x0000088c:     NULL

0x0000088d:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0898 "structure ")
                DW_AT_name	("rfcomm_multiplexer_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(221)

0x00000898:   DW_TAG_structure_type
                DW_AT_byte_size	(0x14)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(211)

0x0000089c:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x06bf "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(213)
                  DW_AT_data_member_location	(0x00)

0x000008a8:     DW_TAG_member
                  DW_AT_name	("max_frame_size")
                  DW_AT_type	(cu + 0x0450 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(218)
                  DW_AT_data_member_location	(0x04)

0x000008b4:     DW_TAG_member
                  DW_AT_name	("multiplexer_core_data")
                  DW_AT_type	(cu + 0x08c1 "multiplexer_core_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(219)
                  DW_AT_data_member_location	(0x06)

0x000008c0:     NULL

0x000008c1:   DW_TAG_typedef
                DW_AT_type	(cu + 0x08cc "structure ")
                DW_AT_name	("multiplexer_core_data_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(207)

0x000008cc:   DW_TAG_structure_type
                DW_AT_byte_size	(0x0e)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(191)

0x000008d0:     DW_TAG_member
                  DW_AT_name	("remote_addr")
                  DW_AT_type	(cu + 0x059d "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(192)
                  DW_AT_data_member_location	(0x00)

0x000008dc:     DW_TAG_member
                  DW_AT_name	("l2cap_cid")
                  DW_AT_type	(cu + 0x0450 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(193)
                  DW_AT_data_member_location	(0x06)

0x000008e8:     DW_TAG_member
                  DW_AT_name	("state")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(196)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x08)

0x000008f7:     DW_TAG_member
                  DW_AT_name	("l2cap_credits")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(197)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x08)

0x00000906:     DW_TAG_member
                  DW_AT_name	("outgoing")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(200)
                  DW_AT_data_member_location	(0x09)

0x00000912:     DW_TAG_member
                  DW_AT_name	("at_least_one_connection")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(202)
                  DW_AT_data_member_location	(0x0a)

0x0000091e:     DW_TAG_member
                  DW_AT_name	("send_dm_for_dlci")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(205)
                  DW_AT_data_member_location	(0x0b)

0x0000092a:     DW_TAG_member
                  DW_AT_name	("con_handle")
                  DW_AT_type	(cu + 0x052e "hci_con_handle_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(206)
                  DW_AT_data_member_location	(0x0c)

0x00000936:     NULL

0x00000937:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0943 "rfcomm_service_t")

0x0000093c:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x03c7 "sizetype")
                  DW_AT_count	(0x01)

0x00000942:     NULL

0x00000943:   DW_TAG_typedef
                DW_AT_type	(cu + 0x094e "structure ")
                DW_AT_name	("rfcomm_service_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(189)

0x0000094e:   DW_TAG_structure_type
                DW_AT_byte_size	(0x14)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(167)

0x00000952:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x06bf "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(169)
                  DW_AT_data_member_location	(0x00)

0x0000095e:     DW_TAG_member
                  DW_AT_name	("server_channel")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(172)
                  DW_AT_data_member_location	(0x04)

0x0000096a:     DW_TAG_member
                  DW_AT_name	("incoming_flow_control")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(175)
                  DW_AT_data_member_location	(0x05)

0x00000976:     DW_TAG_member
                  DW_AT_name	("incoming_initial_credits")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(178)
                  DW_AT_data_member_location	(0x06)

0x00000982:     DW_TAG_member
                  DW_AT_name	("max_frame_size")
                  DW_AT_type	(cu + 0x0450 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(181)
                  DW_AT_data_member_location	(0x08)

0x0000098e:     DW_TAG_member
                  DW_AT_name	("connection")
                  DW_AT_type	(cu + 0x01c4 "*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(184)
                  DW_AT_data_member_location	(0x0c)

0x0000099a:     DW_TAG_member
                  DW_AT_name	("packet_handler")
                  DW_AT_type	(cu + 0x06ca "btstack_packet_handler_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(187)
                  DW_AT_data_member_location	(0x10)

0x000009a6:     NULL

0x000009a7:   DW_TAG_array_type
                DW_AT_type	(cu + 0x09b3 "rfcomm_channel_t")

0x000009ac:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x03c7 "sizetype")
                  DW_AT_count	(0x01)

0x000009b2:     NULL

0x000009b3:   DW_TAG_typedef
                DW_AT_type	(cu + 0x09bf "structure ")
                DW_AT_name	("rfcomm_channel_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(282)

0x000009bf:   DW_TAG_structure_type
                DW_AT_byte_size	(0x34)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(262)

0x000009c4:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x06bf "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(264)
                  DW_AT_data_member_location	(0x00)

0x000009d1:     DW_TAG_member
                  DW_AT_name	("multiplexer")
                  DW_AT_type	(cu + 0x0a20 "rfcomm_multiplexer_t*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(266)
                  DW_AT_data_member_location	(0x04)

0x000009de:     DW_TAG_member
                  DW_AT_name	("rfc_channel_core_data")
                  DW_AT_type	(cu + 0x0a25 "rfc_channel_core_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(268)
                  DW_AT_data_member_location	(0x08)

0x000009eb:     DW_TAG_member
                  DW_AT_name	("max_frame_size")
                  DW_AT_type	(cu + 0x0450 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(271)
                  DW_AT_data_member_location	(0x26)

0x000009f8:     DW_TAG_member
                  DW_AT_name	("service")
                  DW_AT_type	(cu + 0x0b47 "rfcomm_service_t*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(274)
                  DW_AT_data_member_location	(0x28)

0x00000a05:     DW_TAG_member
                  DW_AT_name	("packet_handler")
                  DW_AT_type	(cu + 0x06ca "btstack_packet_handler_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(277)
                  DW_AT_data_member_location	(0x2c)

0x00000a12:     DW_TAG_member
                  DW_AT_name	("connection")
                  DW_AT_type	(cu + 0x01c4 "*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(280)
                  DW_AT_data_member_location	(0x30)

0x00000a1f:     NULL

0x00000a20:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x088d "rfcomm_multiplexer_t")

0x00000a25:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0a31 "structure ")
                DW_AT_name	("rfc_channel_core_data_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(259)

0x00000a31:   DW_TAG_structure_type
                DW_AT_byte_size	(0x1e)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(223)

0x00000a35:     DW_TAG_member
                  DW_AT_name	("rfc_channel_type")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(224)
                  DW_AT_data_member_location	(0x00)

0x00000a41:     DW_TAG_member
                  DW_AT_name	("remote_addr")
                  DW_AT_type	(cu + 0x059d "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(225)
                  DW_AT_data_member_location	(0x01)

0x00000a4d:     DW_TAG_member
                  DW_AT_name	("rfcomm_cid")
                  DW_AT_type	(cu + 0x0450 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(226)
                  DW_AT_data_member_location	(0x08)

0x00000a59:     DW_TAG_member
                  DW_AT_name	("outgoing")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(227)
                  DW_AT_data_member_location	(0x0a)

0x00000a65:     DW_TAG_member
                  DW_AT_name	("dlci")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(228)
                  DW_AT_data_member_location	(0x0b)

0x00000a71:     DW_TAG_member
                  DW_AT_name	("packets_granted")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(231)
                  DW_AT_data_member_location	(0x0c)

0x00000a7d:     DW_TAG_member
                  DW_AT_name	("credits_outgoing")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(234)
                  DW_AT_data_member_location	(0x0d)

0x00000a89:     DW_TAG_member
                  DW_AT_name	("new_credits_incoming")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(237)
                  DW_AT_data_member_location	(0x0e)

0x00000a95:     DW_TAG_member
                  DW_AT_name	("credits_incoming")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(240)
                  DW_AT_data_member_location	(0x0f)

0x00000aa1:     DW_TAG_member
                  DW_AT_name	("incoming_flow_control")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(243)
                  DW_AT_data_member_location	(0x10)

0x00000aad:     DW_TAG_member
                  DW_AT_name	("state")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(247)
                  DW_AT_data_member_location	(0x11)

0x00000ab9:     DW_TAG_member
                  DW_AT_name	("pn_priority")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(250)
                  DW_AT_data_member_location	(0x12)

0x00000ac5:     DW_TAG_member
                  DW_AT_name	("state_var")
                  DW_AT_type	(cu + 0x0450 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(254)
                  DW_AT_data_member_location	(0x14)

0x00000ad1:     DW_TAG_member
                  DW_AT_name	("rpn_data")
                  DW_AT_type	(cu + 0x0adf "rfcomm_rpn_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(257)
                  DW_AT_data_member_location	(0x16)

0x00000ade:     NULL

0x00000adf:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0aea "rfcomm_rpn_data")
                DW_AT_name	("rfcomm_rpn_data_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(159)

0x00000aea:   DW_TAG_structure_type
                DW_AT_name	("rfcomm_rpn_data")
                DW_AT_byte_size	(0x07)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(151)

0x00000af2:     DW_TAG_member
                  DW_AT_name	("baud_rate")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(152)
                  DW_AT_data_member_location	(0x00)

0x00000afe:     DW_TAG_member
                  DW_AT_name	("flags")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(153)
                  DW_AT_data_member_location	(0x01)

0x00000b0a:     DW_TAG_member
                  DW_AT_name	("flow_control")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(154)
                  DW_AT_data_member_location	(0x02)

0x00000b16:     DW_TAG_member
                  DW_AT_name	("xon")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(155)
                  DW_AT_data_member_location	(0x03)

0x00000b22:     DW_TAG_member
                  DW_AT_name	("xoff")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(156)
                  DW_AT_data_member_location	(0x04)

0x00000b2e:     DW_TAG_member
                  DW_AT_name	("parameter_mask_0")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(157)
                  DW_AT_data_member_location	(0x05)

0x00000b3a:     DW_TAG_member
                  DW_AT_name	("parameter_mask_1")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(158)
                  DW_AT_data_member_location	(0x06)

0x00000b46:     NULL

0x00000b47:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0943 "rfcomm_service_t")

0x00000b4c:   DW_TAG_variable
                DW_AT_name	("profile_bredr_profile")
                DW_AT_type	(cu + 0x0b5d "bredr_profile_t")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/common/btstack_main.c")
                DW_AT_decl_line	(117)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000b5d:   DW_TAG_structure_type
                DW_AT_name	("bredr_profile_t")
                DW_AT_byte_size	(0x0208)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../User/include/btstack_main.h")
                DW_AT_decl_line	(35)

0x00000b66:     DW_TAG_member
                  DW_AT_name	("sdp_hdl")
                  DW_AT_type	(cu + 0x0ba5 "sdp_stack_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../User/include/btstack_main.h")
                  DW_AT_decl_line	(36)
                  DW_AT_data_member_location	(0x00)

0x00000b72:     DW_TAG_member
                  DW_AT_name	("rfcomm_hdl")
                  DW_AT_type	(cu + 0x0c19 "rfcomm_stack_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../User/include/btstack_main.h")
                  DW_AT_decl_line	(38)
                  DW_AT_data_member_location	(0x0c)

0x00000b7e:     DW_TAG_member
                  DW_AT_name	("hfp_hdl")
                  DW_AT_type	(cu + 0x0c6c "hfp_stack_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../User/include/btstack_main.h")
                  DW_AT_decl_line	(41)
                  DW_AT_data_member_location	(0x20)

0x00000b8a:     DW_TAG_member
                  DW_AT_name	("hid_hdl")
                  DW_AT_type	(cu + 0x0ee0 "hid_stack_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../User/include/btstack_main.h")
                  DW_AT_decl_line	(50)
                  DW_AT_data_member_location	(0x01c0)

0x00000b97:     DW_TAG_member
                  DW_AT_name	("spp_handl")
                  DW_AT_type	(cu + 0x107f "spp_profile_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../User/include/btstack_main.h")
                  DW_AT_decl_line	(53)
                  DW_AT_data_member_location	(0x01f4)

0x00000ba4:     NULL

0x00000ba5:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0bb0 "structure ")
                DW_AT_name	("sdp_stack_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/sdp.h")
                DW_AT_decl_line	(130)

0x00000bb0:   DW_TAG_structure_type
                DW_AT_byte_size	(0x0a)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/sdp.h")
                DW_AT_decl_line	(117)

0x00000bb4:     DW_TAG_member
                  DW_AT_name	("sdp_core_data")
                  DW_AT_type	(cu + 0x0bc1 "sdp_core_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/sdp.h")
                  DW_AT_decl_line	(128)
                  DW_AT_data_member_location	(0x00)

0x00000bc0:     NULL

0x00000bc1:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0bcc "structure ")
                DW_AT_name	("sdp_core_data_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/sdp.h")
                DW_AT_decl_line	(115)

0x00000bcc:   DW_TAG_structure_type
                DW_AT_byte_size	(0x0a)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/sdp.h")
                DW_AT_decl_line	(102)

0x00000bd0:     DW_TAG_member
                  DW_AT_name	("sdp_channel")
                  DW_AT_type	(cu + 0x0450 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/sdp.h")
                  DW_AT_decl_line	(106)
                  DW_AT_data_member_location	(0x00)

0x00000bdc:     DW_TAG_member
                  DW_AT_name	("sdp_master_channel")
                  DW_AT_type	(cu + 0x0450 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/sdp.h")
                  DW_AT_decl_line	(110)
                  DW_AT_data_member_location	(0x02)

0x00000be8:     DW_TAG_member
                  DW_AT_name	("read_sdp_service_type")
                  DW_AT_type	(cu + 0x0450 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/sdp.h")
                  DW_AT_decl_line	(111)
                  DW_AT_data_member_location	(0x04)

0x00000bf4:     DW_TAG_member
                  DW_AT_name	("sdp_master_waitint_accept")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/sdp.h")
                  DW_AT_decl_line	(112)
                  DW_AT_data_member_location	(0x06)

0x00000c00:     DW_TAG_member
                  DW_AT_name	("rfcomm_service_cid")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/sdp.h")
                  DW_AT_decl_line	(113)
                  DW_AT_data_member_location	(0x07)

0x00000c0c:     DW_TAG_member
                  DW_AT_name	("sdp_translaction_id")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/sdp.h")
                  DW_AT_decl_line	(114)
                  DW_AT_data_member_location	(0x08)

0x00000c18:     NULL

0x00000c19:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0c25 "structure ")
                DW_AT_name	("rfcomm_stack_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(299)

0x00000c25:   DW_TAG_structure_type
                DW_AT_byte_size	(0x14)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(286)

0x00000c2a:     DW_TAG_member
                  DW_AT_name	("app_packet_handler")
                  DW_AT_type	(cu + 0x0430 "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(288)
                  DW_AT_data_member_location	(0x00)

0x00000c37:     DW_TAG_member
                  DW_AT_name	("rfcomm_multiplexers")
                  DW_AT_type	(cu + 0x0462 "linked_list_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(291)
                  DW_AT_data_member_location	(0x04)

0x00000c44:     DW_TAG_member
                  DW_AT_name	("rfcomm_channels")
                  DW_AT_type	(cu + 0x0462 "linked_list_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(293)
                  DW_AT_data_member_location	(0x08)

0x00000c51:     DW_TAG_member
                  DW_AT_name	("rfcomm_services")
                  DW_AT_type	(cu + 0x0462 "linked_list_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(295)
                  DW_AT_data_member_location	(0x0c)

0x00000c5e:     DW_TAG_member
                  DW_AT_name	("rfcomm_client_cid_generator")
                  DW_AT_type	(cu + 0x0450 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(298)
                  DW_AT_data_member_location	(0x10)

0x00000c6b:     NULL

0x00000c6c:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0c78 "structure ")
                DW_AT_name	("hfp_stack_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hfp_profile.h")
                DW_AT_decl_line	(303)

0x00000c78:   DW_TAG_structure_type
                DW_AT_byte_size	(0x01a0)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hfp_profile.h")
                DW_AT_decl_line	(294)

0x00000c7e:     DW_TAG_member
                  DW_AT_name	("hfp_init_number")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hfp_profile.h")
                  DW_AT_decl_line	(295)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x05)
                  DW_AT_bit_offset	(0x03)
                  DW_AT_data_member_location	(0x00)

0x00000c8e:     DW_TAG_member
                  DW_AT_name	("hfp_background")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hfp_profile.h")
                  DW_AT_decl_line	(296)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x02)
                  DW_AT_data_member_location	(0x00)

0x00000c9e:     DW_TAG_member
                  DW_AT_name	("reserve1")
                  DW_AT_type	(cu + 0x004f "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hfp_profile.h")
                  DW_AT_decl_line	(297)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x00)

0x00000cae:     DW_TAG_member
                  DW_AT_name	("hfp_parse_sta")
                  DW_AT_type	(cu + 0x0ce4 "HFP_PARSE_STA")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hfp_profile.h")
                  DW_AT_decl_line	(298)
                  DW_AT_data_member_location	(0x01)

0x00000cbb:     DW_TAG_member
                  DW_AT_name	("parse_atcmd_buf")
                  DW_AT_type	(cu + 0x0d22 "char[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hfp_profile.h")
                  DW_AT_decl_line	(299)
                  DW_AT_data_member_location	(0x04)

0x00000cc8:     DW_TAG_member
                  DW_AT_name	("phone_number")
                  DW_AT_type	(cu + 0x0d35 "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hfp_profile.h")
                  DW_AT_decl_line	(301)
                  DW_AT_data_member_location	(0xfc)

0x00000cd5:     DW_TAG_member
                  DW_AT_name	("conn")
                  DW_AT_type	(cu + 0x0d41 "hfp_con_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hfp_profile.h")
                  DW_AT_decl_line	(302)
                  DW_AT_data_member_location	(0x0114)

0x00000ce3:     NULL

0x00000ce4:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0cef "__HFP_PARSE_STA")
                DW_AT_name	("HFP_PARSE_STA")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hfp_profile.h")
                DW_AT_decl_line	(248)

0x00000cef:   DW_TAG_structure_type
                DW_AT_name	("__HFP_PARSE_STA")
                DW_AT_byte_size	(0x03)
