; ModuleID = 'btstack_main.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/common/btstack_main.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.profile_cmd_handle = type { i32 (i8*)*, i32 (i8*, i32)*, i32 (i8*)*, i32 (i8*)*, i32 (i8*, i32, i32)*, i32 (i8*, i32)*, i32 (i8*)*, i32 (i8*, i32, i32)*, i32 (i8*, i32, i32)*, i32 (i8*, i32, i32, i8*)*, i32 (i8*)* }
%struct.l2cap_stack_t = type { void (i8*, i8, i16, i8*, i16)*, %struct.btstack_linked_item*, %struct.btstack_linked_item*, %struct.l2cap_core_data_t }
%struct.btstack_linked_item = type { %struct.btstack_linked_item* }
%struct.l2cap_core_data_t = type { [3 x %struct.l2cap_signaling_response], i32, i32, [1 x %struct.authentication_flag], i8, i16 }
%struct.l2cap_signaling_response = type { i16, i8, i8, i16, i16 }
%struct.authentication_flag = type { [6 x i8], i8, i8 }
%struct.btstack_comm_handle_t = type { %struct.stack_bredr_pool_t*, %struct.stack_le_pool_t*, %struct.l2cap_stack_t*, %struct.bredr_profile_t*, i8* }
%struct.stack_bredr_pool_t = type { i8*, i8*, i8*, i8*, i8*, [4 x %struct.l2cap_service_t], [5 x %struct.l2cap_channel_t], [1 x %struct.rfcomm_multiplexer_t], [1 x %struct.rfcomm_service_t], [1 x %struct.rfcomm_channel_t] }
%struct.l2cap_service_t = type { %struct.btstack_linked_item, i16, i16, i8*, void (i8, i16, i8*, i16)* }

!446 = !{!447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497}
!447 = !DIEnumerator(name: "BT_STATUS_POWER_ON", value: 1)
!448 = !DIEnumerator(name: "BT_STATUS_POWER_OFF", value: 2)
!449 = !DIEnumerator(name: "BT_STATUS_INIT_OK", value: 3)
!450 = !DIEnumerator(name: "BT_STATUS_EXIT_OK", value: 4)
!451 = !DIEnumerator(name: "BT_STATUS_START_CONNECTED", value: 5)
!452 = !DIEnumerator(name: "BT_STATUS_FIRST_CONNECTED", value: 6)
!453 = !DIEnumerator(name: "BT_STATUS_SECOND_CONNECTED", value: 7)
!454 = !DIEnumerator(name: "BT_STATUS_ENCRY_COMPLETE", value: 8)
!455 = !DIEnumerator(name: "BT_STATUS_FIRST_DISCONNECT", value: 9)
!456 = !DIEnumerator(name: "BT_STATUS_SECOND_DISCONNECT", value: 10)
!457 = !DIEnumerator(name: "BT_STATUS_PHONE_INCOME", value: 11)
!458 = !DIEnumerator(name: "BT_STATUS_PHONE_NUMBER", value: 12)
!459 = !DIEnumerator(name: "BT_STATUS_PHONE_MANUFACTURER", value: 13)
!460 = !DIEnumerator(name: "BT_STATUS_PHONE_OUT", value: 14)
!461 = !DIEnumerator(name: "BT_STATUS_PHONE_ACTIVE", value: 15)
!462 = !DIEnumerator(name: "BT_STATUS_PHONE_HANGUP", value: 16)
!463 = !DIEnumerator(name: "BT_STATUS_BEGIN_AUTO_CON", value: 17)
!464 = !DIEnumerator(name: "BT_STATUS_MUSIC_SOUND_COME", value: 18)
!465 = !DIEnumerator(name: "BT_STATUS_MUSIC_SOUND_GO", value: 19)
!466 = !DIEnumerator(name: "BT_STATUS_RESUME", value: 20)
!467 = !DIEnumerator(name: "BT_STATUS_RESUME_BTSTACK", value: 21)
!468 = !DIEnumerator(name: "BT_STATUS_SUSPEND", value: 22)
!469 = !DIEnumerator(name: "BT_STATUS_LAST_CALL_TYPE_CHANGE", value: 23)
!470 = !DIEnumerator(name: "BT_STATUS_CALL_VOL_CHANGE", value: 24)
!471 = !DIEnumerator(name: "BT_STATUS_SCO_STATUS_CHANGE", value: 25)
!472 = !DIEnumerator(name: "BT_STATUS_CONNECT_WITHOUT_LINKKEY", value: 26)
!473 = !DIEnumerator(name: "BT_STATUS_PHONE_BATTERY_CHANGE", value: 27)
!474 = !DIEnumerator(name: "BT_STATUS_RECONNECT_LINKKEY_LOST", value: 28)
!475 = !DIEnumerator(name: "BT_STATUS_RECONN_OR_CONN", value: 29)
!476 = !DIEnumerator(name: "BT_STATUS_BT_TEST_BOX_CMD", value: 30)
!477 = !DIEnumerator(name: "BT_STATUS_BT_TWS_CONNECT_CMD", value: 31)
!478 = !DIEnumerator(name: "BT_STATUS_SNIFF_STATE_UPDATE", value: 32)
!479 = !DIEnumerator(name: "BT_STATUS_TONE_BY_FILE_NAME", value: 33)
!480 = !DIEnumerator(name: "BT_STATUS_PHONE_DATE_AND_TIME", value: 34)
!481 = !DIEnumerator(name: "BT_STATUS_INBAND_RINGTONE", value: 35)
!482 = !DIEnumerator(name: "BT_STATUS_VOICE_RECOGNITION", value: 36)
!483 = !DIEnumerator(name: "BT_STATUS_AVRCP_INCOME_OPID", value: 37)
!484 = !DIEnumerator(name: "BT_STATUS_HFP_SERVICE_LEVEL_CONNECTION_OK", value: 38)
!485 = !DIEnumerator(name: "BT_STATUS_CONN_A2DP_CH", value: 39)
!486 = !DIEnumerator(name: "BT_STATUS_CONN_HFP_CH", value: 40)
!487 = !DIEnumerator(name: "BT_STATUS_INQUIRY_TIMEOUT", value: 41)
!488 = !DIEnumerator(name: "BT_STATUS_INITING", value: 42)
!489 = !DIEnumerator(name: "BT_STATUS_WAITINT_CONN", value: 43)
!490 = !DIEnumerator(name: "BT_STATUS_AUTO_CONNECTINT", value: 44)
!491 = !DIEnumerator(name: "BT_STATUS_CONNECTING", value: 45)
!492 = !DIEnumerator(name: "BT_STATUS_TAKEING_PHONE", value: 46)
!493 = !DIEnumerator(name: "BT_STATUS_PLAYING_MUSIC", value: 47)
!494 = !DIEnumerator(name: "BT_STATUS_A2DP_MEDIA_START", value: 48)
!495 = !DIEnumerator(name: "BT_STATUS_A2DP_MEDIA_STOP", value: 49)
!496 = !DIEnumerator(name: "BT_STATUS_BROADCAST_STATE", value: 50)
!497 = !DIEnumerator(name: "BT_STATUS_TRIM_OVER", value: 51)
!498 = !{!499, !503, !504, !507, !508, !691, !694, !695, !522}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !501, line: 44, baseType: !502)
!501 = !DIFile(filename: "../btcommon/typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!502 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !501, line: 48, baseType: !506)
!506 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!507 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 32)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bredr_profile_t", file: !510, line: 35, size: 4160, elements: !511)
!510 = !DIFile(filename: "../User/include/btstack_main.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!511 = !{!512, !529, !550, !622, !675}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "sdp_hdl", scope: !509, file: !510, line: 36, baseType: !513, size: 80)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "sdp_stack_t", file: !514, line: 130, baseType: !515)
!514 = !DIFile(filename: "../btstack/Protocol/include/bredr/sdp.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !514, line: 117, size: 80, elements: !516)
!516 = !{!517}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "sdp_core_data", scope: !515, file: !514, line: 128, baseType: !518, size: 80)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "sdp_core_data_t", file: !514, line: 115, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !514, line: 102, size: 80, elements: !520)
!520 = !{!521, !524, !525, !526, !527, !528}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "sdp_channel", scope: !519, file: !514, line: 106, baseType: !522, size: 16)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !501, line: 46, baseType: !523)
!523 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "sdp_master_channel", scope: !519, file: !514, line: 110, baseType: !522, size: 16, offset: 16)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "read_sdp_service_type", scope: !519, file: !514, line: 111, baseType: !522, size: 16, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "sdp_master_waitint_accept", scope: !519, file: !514, line: 112, baseType: !500, size: 8, offset: 48)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_service_cid", scope: !519, file: !514, line: 113, baseType: !500, size: 8, offset: 56)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "sdp_translaction_id", scope: !519, file: !514, line: 114, baseType: !500, size: 8, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_hdl", scope: !509, file: !510, line: 38, baseType: !530, size: 160, offset: 96)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "rfcomm_stack_t", file: !531, line: 299, baseType: !532)
!531 = !DIFile(filename: "../btstack/Protocol/include/bredr/rfcomm.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 286, size: 160, elements: !533)
!533 = !{!534, !538, !547, !548, !549}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "app_packet_handler", scope: !532, file: !531, line: 288, baseType: !535, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 32)
!536 = !DISubroutineType(types: !537)
!537 = !{null, !503, !500, !522, !499, !522}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_multiplexers", scope: !532, file: !531, line: 291, baseType: !539, size: 32, offset: 32)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_list_t", file: !540, line: 101, baseType: !541)
!540 = !DIFile(filename: "../btcommon/btstack_linked_list.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_linked_item_t", file: !540, line: 55, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btstack_linked_item", file: !540, line: 53, size: 32, elements: !544)
!544 = !{!545}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !543, file: !540, line: 54, baseType: !546, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_channels", scope: !532, file: !531, line: 293, baseType: !539, size: 32, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_services", scope: !532, file: !531, line: 295, baseType: !539, size: 32, offset: 96)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_client_cid_generator", scope: !532, file: !531, line: 298, baseType: !522, size: 16, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "hfp_hdl", scope: !509, file: !510, line: 41, baseType: !551, size: 3328, offset: 256)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "hfp_stack_t", file: !552, line: 303, baseType: !553)
!552 = !DIFile(filename: "../btstack/Profile/include/bredr/hfp_profile.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !552, line: 294, size: 3328, elements: !554)
!554 = !{!555, !556, !557, !558, !565, !570, !574}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "hfp_init_number", scope: !553, file: !552, line: 295, baseType: !500, size: 5, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "hfp_background", scope: !553, file: !552, line: 296, baseType: !500, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "reserve1", scope: !553, file: !552, line: 297, baseType: !500, size: 2, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "hfp_parse_sta", scope: !553, file: !552, line: 298, baseType: !559, size: 24, offset: 8)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "HFP_PARSE_STA", file: !552, line: 248, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__HFP_PARSE_STA", file: !552, line: 240, size: 24, elements: !561)
!561 = !{!562, !563, !564}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "parse_atcmd_type", scope: !560, file: !552, line: 242, baseType: !500, size: 7, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "atcmd_cr_type", scope: !560, file: !552, line: 244, baseType: !500, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "received_data_len", scope: !560, file: !552, line: 246, baseType: !522, size: 16, offset: 8)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "parse_atcmd_buf", scope: !553, file: !552, line: 299, baseType: !566, size: 1984, offset: 32)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 1984, elements: !568)
!567 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!568 = !{!569}
!569 = !DISubrange(count: 248)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "phone_number", scope: !553, file: !552, line: 301, baseType: !571, size: 192, offset: 2016)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 192, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 24)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !553, file: !552, line: 302, baseType: !575, size: 1120, offset: 2208)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 1120, elements: !620)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "hfp_con_t", file: !552, line: 292, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hfp_con", file: !552, line: 283, size: 1120, elements: !578)
!578 = !{!579, !619}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "hfp_core_data", scope: !577, file: !552, line: 284, baseType: !580, size: 1088)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "hfp_con_core_data_t", file: !552, line: 281, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !552, line: 257, size: 1088, elements: !582)
!582 = !{!583, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !607, !618}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !581, file: !552, line: 259, baseType: !584, size: 48)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_addr_t", file: !585, line: 66, baseType: !586)
!585 = !DIFile(filename: "../btcommon/utils.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 48, elements: !588)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !501, line: 44, baseType: !502)
!588 = !{!589}
!589 = !DISubrange(count: 6)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_channel_id", scope: !581, file: !552, line: 260, baseType: !522, size: 16, offset: 48)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "support_featurn_ag", scope: !581, file: !552, line: 262, baseType: !505, size: 32, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !581, file: !552, line: 264, baseType: !522, size: 16, offset: 96)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "hfp_init_battery_value", scope: !581, file: !552, line: 265, baseType: !500, size: 8, offset: 112)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "send_key_flag", scope: !581, file: !552, line: 266, baseType: !500, size: 8, offset: 120)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "hfp_speak_gain", scope: !581, file: !552, line: 268, baseType: !500, size: 4, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "hfp_mic_gain", scope: !581, file: !552, line: 269, baseType: !500, size: 4, offset: 132, flags: DIFlagBitField, extraData: i64 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "phone_call_status", scope: !581, file: !552, line: 270, baseType: !500, size: 4, offset: 136, flags: DIFlagBitField, extraData: i64 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "second_call_status", scope: !581, file: !552, line: 271, baseType: !500, size: 4, offset: 140, flags: DIFlagBitField, extraData: i64 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "hfp_init_step", scope: !581, file: !552, line: 273, baseType: !500, size: 5, offset: 144, flags: DIFlagBitField, extraData: i64 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "inused", scope: !581, file: !552, line: 274, baseType: !500, size: 1, offset: 149, flags: DIFlagBitField, extraData: i64 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "hfp_cmd_send_failed", scope: !581, file: !552, line: 275, baseType: !500, size: 1, offset: 150, flags: DIFlagBitField, extraData: i64 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ios_siri_status", scope: !581, file: !552, line: 276, baseType: !500, size: 3, offset: 152, flags: DIFlagBitField, extraData: i64 152)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "hf_indications", scope: !581, file: !552, line: 278, baseType: !604, size: 24, offset: 160)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 24, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 3)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "indicators", scope: !581, file: !552, line: 279, baseType: !608, size: 448, offset: 184)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !609, size: 448, elements: !616)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "INDICATOR", file: !552, line: 255, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__INDICATOR", file: !552, line: 250, size: 56, elements: !611)
!611 = !{!612, !613, !614, !615}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !610, file: !552, line: 251, baseType: !499, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "desc_index", scope: !610, file: !552, line: 252, baseType: !500, size: 8, offset: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "strlen", scope: !610, file: !552, line: 253, baseType: !500, size: 8, offset: 40)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !610, file: !552, line: 254, baseType: !500, size: 8, offset: 48)
!616 = !{!617}
!617 = !DISubrange(count: 8)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "prev_inds", scope: !581, file: !552, line: 280, baseType: !608, size: 448, offset: 632)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "fail_item", scope: !577, file: !552, line: 287, baseType: !539, size: 32, offset: 1088)
!620 = !{!621}
!621 = !DISubrange(count: 1)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "hid_hdl", scope: !509, file: !510, line: 50, baseType: !623, size: 416, offset: 3584)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "hid_stack_t", file: !624, line: 144, baseType: !625)
!624 = !DIFile(filename: "../btstack/Profile/include/bredr/hid_profile.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_handl", file: !624, line: 141, size: 416, elements: !626)
!626 = !{!627, !664}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "hid_core_data", scope: !625, file: !624, line: 142, baseType: !628, size: 304)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "hid_core_data_t", file: !624, line: 139, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !624, line: 135, size: 304, elements: !630)
!630 = !{!631, !651, !658}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !629, file: !624, line: 136, baseType: !632, size: 208)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 208, elements: !620)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_conn", file: !624, line: 120, size: 208, elements: !634)
!634 = !{!635, !639, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "cmdbuf", scope: !633, file: !624, line: 121, baseType: !636, size: 80)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 80, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 10)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !633, file: !624, line: 122, baseType: !640, size: 48, offset: 80)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 48, elements: !588)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "send_step", scope: !633, file: !624, line: 123, baseType: !500, size: 8, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "send_continue", scope: !633, file: !624, line: 124, baseType: !500, size: 8, offset: 136)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "inused", scope: !633, file: !624, line: 125, baseType: !500, size: 1, offset: 144, flags: DIFlagBitField, extraData: i64 144)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "connect_inter_channel", scope: !633, file: !624, line: 126, baseType: !500, size: 1, offset: 145, flags: DIFlagBitField, extraData: i64 144)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "hid_background", scope: !633, file: !624, line: 127, baseType: !500, size: 1, offset: 146, flags: DIFlagBitField, extraData: i64 144)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "income_con_flag", scope: !633, file: !624, line: 128, baseType: !500, size: 2, offset: 147, flags: DIFlagBitField, extraData: i64 144)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "cmdbuf_len", scope: !633, file: !624, line: 129, baseType: !500, size: 3, offset: 149, flags: DIFlagBitField, extraData: i64 144)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl_channel", scope: !633, file: !624, line: 130, baseType: !522, size: 16, offset: 160)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "inter_channel", scope: !633, file: !624, line: 131, baseType: !522, size: 16, offset: 176)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "pending_channel", scope: !633, file: !624, line: 132, baseType: !522, size: 16, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "hid_kb_cmd", scope: !629, file: !624, line: 137, baseType: !652, size: 48, offset: 208)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_keyboard_cmd", file: !624, line: 85, size: 48, elements: !653)
!653 = !{!654, !655, !656, !657}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "HIDP_Hdr", scope: !652, file: !624, line: 87, baseType: !500, size: 8)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "report_id", scope: !652, file: !624, line: 89, baseType: !500, size: 8, offset: 8)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "key_cmd1", scope: !652, file: !624, line: 92, baseType: !522, size: 16, offset: 16)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "key_cmd2", scope: !652, file: !624, line: 93, baseType: !522, size: 16, offset: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "hid_AC_cmd", scope: !629, file: !624, line: 138, baseType: !659, size: 40, offset: 256)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_HID_AC_CMD", file: !624, line: 101, size: 40, elements: !660)
!660 = !{!661, !662, !663}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "HIDP_Hdr", scope: !659, file: !624, line: 103, baseType: !500, size: 8)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "report_id", scope: !659, file: !624, line: 105, baseType: !505, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !659, file: !624, line: 106, baseType: !505, size: 24, offset: 16, flags: DIFlagBitField, extraData: i64 8)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !625, file: !624, line: 143, baseType: !665, size: 96, offset: 320)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "run_loop", file: !666, line: 9, size: 96, elements: !667)
!666 = !DIFile(filename: "../btcommon/run_loop.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!667 = !{!668, !669, !674}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !665, file: !666, line: 10, baseType: !542, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "run", scope: !665, file: !666, line: 11, baseType: !670, size: 32, offset: 32)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 32)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !673}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !665, file: !666, line: 12, baseType: !503, size: 32, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "spp_handl", scope: !509, file: !510, line: 53, baseType: !676, size: 160, offset: 4000)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "spp_profile_t", file: !677, line: 24, baseType: !678)
!677 = !DIFile(filename: "../btstack/Profile/include/bredr/spp_profile.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !677, line: 22, size: 160, elements: !679)
!679 = !{!680}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !678, file: !677, line: 23, baseType: !681, size: 160)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !682, size: 160, elements: !620)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "spp_conn_t", file: !677, line: 20, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !677, line: 9, size: 160, elements: !684)
!684 = !{!685, !686, !687, !688, !689, !690}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !683, file: !677, line: 14, baseType: !522, size: 16)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_cid", scope: !683, file: !677, line: 15, baseType: !522, size: 16, offset: 16)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "l2cap_send_cmd_handle", scope: !683, file: !677, line: 16, baseType: !522, size: 16, offset: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_dlci", scope: !683, file: !677, line: 17, baseType: !505, size: 32, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "inused", scope: !683, file: !677, line: 18, baseType: !500, size: 8, offset: 96)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !683, file: !677, line: 19, baseType: !584, size: 48, offset: 104)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 32)
!692 = !DISubroutineType(types: !693)
!693 = !{!507, !503}
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !501, line: 46, baseType: !523)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 32)
!696 = !{!0, !697, !699, !701, !703, !705, !707, !709, !711, !713, !715, !717, !719, !745, !785, !822, !964, !966, !1135, !1147, !1151}
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "hfp_ag_profile_support", scope: !2, file: !3, line: 62, type: !500, isLocal: false, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "hfp_profile_support", scope: !2, file: !3, line: 63, type: !500, isLocal: false, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "acp_profile_support", scope: !2, file: !3, line: 64, type: !500, isLocal: false, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "a2dp_profile_support", scope: !2, file: !3, line: 65, type: !500, isLocal: false, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "spp_profile_support", scope: !2, file: !3, line: 66, type: !500, isLocal: false, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "spp_up_profile_support", scope: !2, file: !3, line: 67, type: !500, isLocal: false, isDefinition: true)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "hid_profile_support", scope: !2, file: !3, line: 68, type: !500, isLocal: false, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "pbap_profile_support", scope: !2, file: !3, line: 69, type: !500, isLocal: false, isDefinition: true)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "pan_profile_support", scope: !2, file: !3, line: 70, type: !500, isLocal: false, isDefinition: true)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "iap_profile_support", scope: !2, file: !3, line: 71, type: !500, isLocal: false, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "emitter_hfp_hf_support", scope: !2, file: !3, line: 72, type: !500, isLocal: false, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "profile_cmd_hdl_str", scope: !2, file: !3, line: 77, type: !721, isLocal: false, isDefinition: true)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmd_handle_str", file: !722, line: 27, baseType: !723)
!722 = !DIFile(filename: "../btstack/Profile/include/bredr/profile_common.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "profile_cmd_handle", file: !722, line: 15, size: 352, elements: !724)
!724 = !{!725, !726, !730, !731, !732, !736, !737, !738, !739, !740, !744}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "hfp_send_cmd", scope: !723, file: !722, line: 16, baseType: !691, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "hid_send_cmd", scope: !723, file: !722, line: 17, baseType: !727, size: 32, offset: 32)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 32)
!728 = !DISubroutineType(types: !729)
!729 = !{!507, !499, !505}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "spp_send_cmd", scope: !723, file: !722, line: 18, baseType: !691, size: 32, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "spp_up_send_cmd", scope: !723, file: !722, line: 19, baseType: !691, size: 32, offset: 96)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "avctp_send_cmd", scope: !723, file: !722, line: 20, baseType: !733, size: 32, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 32)
!734 = !DISubroutineType(types: !735)
!735 = !{!507, !499, !505, !505}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "a2dp_send_cmd", scope: !723, file: !722, line: 21, baseType: !727, size: 32, offset: 160)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "hfp_ag_send_cmd", scope: !723, file: !722, line: 22, baseType: !691, size: 32, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "opp_send_cmd", scope: !723, file: !722, line: 23, baseType: !733, size: 32, offset: 224)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "sdp_send_cmd", scope: !723, file: !722, line: 24, baseType: !733, size: 32, offset: 256)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "pan_send_cmd", scope: !723, file: !722, line: 25, baseType: !741, size: 32, offset: 288)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 32)
!742 = !DISubroutineType(types: !743)
!743 = !{!507, !499, !505, !505, !499}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "iap_send_cmd", scope: !723, file: !722, line: 26, baseType: !691, size: 32, offset: 320)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "btstack_global_info", scope: !2, file: !3, line: 107, type: !747, isLocal: true, isDefinition: true)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btstack_ctrl", file: !3, line: 103, size: 1472, elements: !748)
!748 = !{!749}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ble_ctl_info", scope: !747, file: !3, line: 104, baseType: !750, size: 1472)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ble_mode_ctrl", file: !3, line: 93, size: 1472, elements: !751)
!751 = !{!752, !753, !773, !777, !781, !783, !784}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !750, file: !3, line: 94, baseType: !665, size: 96)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_cbuf", scope: !750, file: !3, line: 95, baseType: !754, size: 288, offset: 96)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "cbuffer_t", file: !755, line: 26, baseType: !756)
!755 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/generic/circular_buf.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cbuffer", file: !755, line: 16, size: 288, elements: !757)
!757 = !{!758, !759, !760, !761, !762, !763, !764, !765, !766}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !756, file: !755, line: 17, baseType: !499, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !756, file: !755, line: 18, baseType: !499, size: 32, offset: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !756, file: !755, line: 19, baseType: !499, size: 32, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !756, file: !755, line: 20, baseType: !499, size: 32, offset: 96)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_ptr", scope: !756, file: !755, line: 21, baseType: !499, size: 32, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_len", scope: !756, file: !755, line: 22, baseType: !505, size: 32, offset: 160)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !756, file: !755, line: 23, baseType: !505, size: 32, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "total_len", scope: !756, file: !755, line: 24, baseType: !505, size: 32, offset: 224)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !756, file: !755, line: 25, baseType: !767, size: 32, offset: 256)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !768, line: 13, baseType: !769)
!768 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/spinlock.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__spinlock", file: !768, line: 9, size: 32, elements: !770)
!770 = !{!771}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "rwlock", scope: !769, file: !768, line: 10, baseType: !772, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !505)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_buffer", scope: !750, file: !3, line: 96, baseType: !774, size: 1024, offset: 384)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 1024, elements: !775)
!775 = !{!776}
!776 = !DISubrange(count: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "regist_thread_call", scope: !750, file: !3, line: 97, baseType: !778, size: 32, offset: 1408)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 32)
!779 = !DISubroutineType(types: !780)
!780 = !{null}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "run_flag", scope: !750, file: !3, line: 98, baseType: !782, size: 8, offset: 1440)
!782 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !500)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "gatt_role", scope: !750, file: !3, line: 99, baseType: !500, size: 3, offset: 1448, flags: DIFlagBitField, extraData: i64 1448)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !750, file: !3, line: 100, baseType: !500, size: 5, offset: 1451, flags: DIFlagBitField, extraData: i64 1448)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "profile_l2cap_hdl", scope: !2, file: !3, line: 114, type: !787, isLocal: false, isDefinition: true)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "l2cap_stack_t", file: !788, line: 284, baseType: !789)
!788 = !DIFile(filename: "../btstack/Host/include/common/l2cap.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !788, line: 273, size: 448, elements: !790)
!790 = !{!791, !792, !793, !794}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "packet_handler", scope: !789, file: !788, line: 274, baseType: !535, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "l2cap_services", scope: !789, file: !788, line: 279, baseType: !539, size: 32, offset: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "l2cap_channels", scope: !789, file: !788, line: 280, baseType: !539, size: 32, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "statck_core_data", scope: !789, file: !788, line: 282, baseType: !795, size: 352, offset: 96)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "l2cap_core_data_t", file: !788, line: 271, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !788, line: 262, size: 352, elements: !797)
!797 = !{!798, !809, !810, !811, !820, !821}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "signaling_responses", scope: !796, file: !788, line: 264, baseType: !799, size: 192)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 192, elements: !605)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "l2cap_signaling_response_t", file: !788, line: 251, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "l2cap_signaling_response", file: !788, line: 245, size: 64, elements: !802)
!802 = !{!803, !805, !806, !807, !808}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !801, file: !788, line: 246, baseType: !804, size: 16)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "hci_con_handle_t", file: !585, line: 60, baseType: !694)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "sig_id", scope: !801, file: !788, line: 247, baseType: !500, size: 8, offset: 16)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !801, file: !788, line: 248, baseType: !500, size: 8, offset: 24)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "cid", scope: !801, file: !788, line: 249, baseType: !522, size: 16, offset: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !801, file: !788, line: 250, baseType: !522, size: 16, offset: 48)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "signaling_responses_pending", scope: !796, file: !788, line: 266, baseType: !507, size: 32, offset: 192)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "extended_feature", scope: !796, file: !788, line: 267, baseType: !505, size: 32, offset: 224)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "authentication_flag", scope: !796, file: !788, line: 268, baseType: !812, size: 64, offset: 256)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !813, size: 64, elements: !620)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "l2cap_authentication_flag_t", file: !788, line: 258, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "authentication_flag", file: !788, line: 253, size: 64, elements: !815)
!815 = !{!816, !817, !818, !819}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !814, file: !788, line: 254, baseType: !584, size: 48)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "in_used", scope: !814, file: !788, line: 255, baseType: !500, size: 4, offset: 48, flags: DIFlagBitField, extraData: i64 48)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "remote_dev_company", scope: !814, file: !788, line: 256, baseType: !500, size: 4, offset: 52, flags: DIFlagBitField, extraData: i64 48)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "authentication_status", scope: !814, file: !788, line: 257, baseType: !500, size: 8, offset: 56)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "l2cap_sig_seq_nr", scope: !796, file: !788, line: 269, baseType: !500, size: 8, offset: 320)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "l2cap_source_cid", scope: !796, file: !788, line: 270, baseType: !522, size: 16, offset: 336)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(name: "profile_bredr_pool_hdl", scope: !2, file: !3, line: 116, type: !824, isLocal: false, isDefinition: true)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "stack_bredr_pool_t", file: !825, line: 59, baseType: !826)
!825 = !DIFile(filename: "../btcommon/btstack_memory.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !825, line: 29, size: 3648, elements: !827)
!827 = !{!828, !830, !831, !832, !833, !834, !851, !892, !911, !923}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "l2cap_service_pool", scope: !826, file: !825, line: 33, baseType: !829, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "memory_pool_t", file: !825, line: 28, baseType: !503)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "l2cap_channel_pool", scope: !826, file: !825, line: 34, baseType: !829, size: 32, offset: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_multiplexer_pool", scope: !826, file: !825, line: 36, baseType: !829, size: 32, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_service_pool", scope: !826, file: !825, line: 37, baseType: !829, size: 32, offset: 96)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_channel_pool", scope: !826, file: !825, line: 38, baseType: !829, size: 32, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "l2cap_service_storage", scope: !826, file: !825, line: 48, baseType: !835, size: 512, offset: 160)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !836, size: 512, elements: !849)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "l2cap_service_t", file: !788, line: 241, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !788, line: 225, size: 128, elements: !838)
!838 = !{!839, !841, !842, !843, !844}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !837, file: !788, line: 227, baseType: !840, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_item_t", file: !540, line: 100, baseType: !542)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "psm", scope: !837, file: !788, line: 230, baseType: !522, size: 16, offset: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !837, file: !788, line: 233, baseType: !522, size: 16, offset: 48)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !837, file: !788, line: 236, baseType: !503, size: 32, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "packet_handler", scope: !837, file: !788, line: 239, baseType: !845, size: 32, offset: 96)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_packet_handler_t", file: !70, line: 58, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 32)
!847 = !DISubroutineType(types: !848)
!848 = !{null, !587, !694, !695, !694}
!849 = !{!850}
!850 = !DISubrange(count: 4)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "l2cap_channel_storage", scope: !826, file: !825, line: 49, baseType: !852, size: 2240, offset: 672)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !853, size: 2240, elements: !890)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "l2cap_channel_t", file: !788, line: 222, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !788, line: 204, size: 448, elements: !855)
!855 = !{!856, !857, !858, !859, !860, !861}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !854, file: !788, line: 206, baseType: !840, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !854, file: !788, line: 208, baseType: !804, size: 16, offset: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_for_can_send_now", scope: !854, file: !788, line: 211, baseType: !500, size: 8, offset: 48)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !854, file: !788, line: 215, baseType: !503, size: 32, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "packet_handler", scope: !854, file: !788, line: 218, baseType: !845, size: 32, offset: 96)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "channel_core_data", scope: !854, file: !788, line: 220, baseType: !862, size: 320, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "channel_core_data_t", file: !788, line: 200, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !788, line: 178, size: 320, elements: !864)
!864 = !{!865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "state_var", scope: !863, file: !788, line: 180, baseType: !522, size: 16)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !863, file: !788, line: 181, baseType: !500, size: 8, offset: 16)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "remote_sig_id", scope: !863, file: !788, line: 183, baseType: !500, size: 8, offset: 24)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "local_sig_id", scope: !863, file: !788, line: 184, baseType: !500, size: 8, offset: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !863, file: !788, line: 186, baseType: !500, size: 8, offset: 40)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !863, file: !788, line: 188, baseType: !584, size: 48, offset: 48)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "psm", scope: !863, file: !788, line: 189, baseType: !522, size: 16, offset: 96)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "local_cid", scope: !863, file: !788, line: 191, baseType: !522, size: 16, offset: 112)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "remote_cid", scope: !863, file: !788, line: 192, baseType: !522, size: 16, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "local_mtu", scope: !863, file: !788, line: 194, baseType: !522, size: 16, offset: 144)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "remote_mtu", scope: !863, file: !788, line: 195, baseType: !522, size: 16, offset: 160)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "channel_mode", scope: !863, file: !788, line: 197, baseType: !500, size: 8, offset: 176)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "remote_extended_feature", scope: !863, file: !788, line: 198, baseType: !505, size: 32, offset: 192)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "retran_op", scope: !863, file: !788, line: 199, baseType: !879, size: 96, offset: 224)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "retran_flow_ctl_op_t", file: !788, line: 174, baseType: !880)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !788, line: 165, size: 96, elements: !881)
!881 = !{!882, !883, !884, !885, !886, !887, !888, !889}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "retransmission_flow_ctl", scope: !880, file: !788, line: 166, baseType: !500, size: 8)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !880, file: !788, line: 167, baseType: !500, size: 8, offset: 8)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !880, file: !788, line: 168, baseType: !500, size: 8, offset: 16)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window", scope: !880, file: !788, line: 169, baseType: !500, size: 8, offset: 24)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "max_transmit", scope: !880, file: !788, line: 170, baseType: !500, size: 8, offset: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "retransmission_timeout", scope: !880, file: !788, line: 171, baseType: !522, size: 16, offset: 48)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "monitor_timeout", scope: !880, file: !788, line: 172, baseType: !522, size: 16, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "max_pdu", scope: !880, file: !788, line: 173, baseType: !522, size: 16, offset: 80)
!890 = !{!891}
!891 = !DISubrange(count: 5)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_multiplexer_storage", scope: !826, file: !825, line: 51, baseType: !893, size: 160, offset: 2912)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 160, elements: !620)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "rfcomm_multiplexer_t", file: !531, line: 221, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 211, size: 160, elements: !896)
!896 = !{!897, !898, !899}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !895, file: !531, line: 213, baseType: !840, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "max_frame_size", scope: !895, file: !531, line: 218, baseType: !522, size: 16, offset: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "multiplexer_core_data", scope: !895, file: !531, line: 219, baseType: !900, size: 112, offset: 48)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiplexer_core_data_t", file: !531, line: 207, baseType: !901)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 191, size: 112, elements: !902)
!902 = !{!903, !904, !905, !906, !907, !908, !909, !910}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "remote_addr", scope: !901, file: !531, line: 192, baseType: !584, size: 48)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "l2cap_cid", scope: !901, file: !531, line: 193, baseType: !522, size: 16, offset: 48)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !901, file: !531, line: 196, baseType: !500, size: 4, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "l2cap_credits", scope: !901, file: !531, line: 197, baseType: !500, size: 4, offset: 68, flags: DIFlagBitField, extraData: i64 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "outgoing", scope: !901, file: !531, line: 200, baseType: !500, size: 8, offset: 72)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "at_least_one_connection", scope: !901, file: !531, line: 202, baseType: !500, size: 8, offset: 80)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "send_dm_for_dlci", scope: !901, file: !531, line: 205, baseType: !500, size: 8, offset: 88)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "con_handle", scope: !901, file: !531, line: 206, baseType: !804, size: 16, offset: 96)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_service_storage", scope: !826, file: !825, line: 52, baseType: !912, size: 160, offset: 3072)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !913, size: 160, elements: !620)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "rfcomm_service_t", file: !531, line: 189, baseType: !914)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 167, size: 160, elements: !915)
!915 = !{!916, !917, !918, !919, !920, !921, !922}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !914, file: !531, line: 169, baseType: !840, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "server_channel", scope: !914, file: !531, line: 172, baseType: !500, size: 8, offset: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_flow_control", scope: !914, file: !531, line: 175, baseType: !500, size: 8, offset: 40)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_initial_credits", scope: !914, file: !531, line: 178, baseType: !500, size: 8, offset: 48)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "max_frame_size", scope: !914, file: !531, line: 181, baseType: !522, size: 16, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !914, file: !531, line: 184, baseType: !503, size: 32, offset: 96)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "packet_handler", scope: !914, file: !531, line: 187, baseType: !845, size: 32, offset: 128)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_channel_storage", scope: !826, file: !825, line: 53, baseType: !924, size: 416, offset: 3232)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 416, elements: !620)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "rfcomm_channel_t", file: !531, line: 282, baseType: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 262, size: 416, elements: !927)
!927 = !{!928, !929, !931, !959, !960, !962, !963}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !926, file: !531, line: 264, baseType: !840, size: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "multiplexer", scope: !926, file: !531, line: 266, baseType: !930, size: 32, offset: 32)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "rfc_channel_core_data", scope: !926, file: !531, line: 268, baseType: !932, size: 240, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "rfc_channel_core_data_t", file: !531, line: 259, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 223, size: 240, elements: !934)
!934 = !{!935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "rfc_channel_type", scope: !933, file: !531, line: 224, baseType: !500, size: 8)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "remote_addr", scope: !933, file: !531, line: 225, baseType: !584, size: 48, offset: 8)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_cid", scope: !933, file: !531, line: 226, baseType: !522, size: 16, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "outgoing", scope: !933, file: !531, line: 227, baseType: !500, size: 8, offset: 80)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !933, file: !531, line: 228, baseType: !500, size: 8, offset: 88)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "packets_granted", scope: !933, file: !531, line: 231, baseType: !500, size: 8, offset: 96)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "credits_outgoing", scope: !933, file: !531, line: 234, baseType: !500, size: 8, offset: 104)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "new_credits_incoming", scope: !933, file: !531, line: 237, baseType: !500, size: 8, offset: 112)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "credits_incoming", scope: !933, file: !531, line: 240, baseType: !500, size: 8, offset: 120)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_flow_control", scope: !933, file: !531, line: 243, baseType: !500, size: 8, offset: 128)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !933, file: !531, line: 247, baseType: !500, size: 8, offset: 136)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "pn_priority", scope: !933, file: !531, line: 250, baseType: !500, size: 8, offset: 144)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "state_var", scope: !933, file: !531, line: 254, baseType: !522, size: 16, offset: 160)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "rpn_data", scope: !933, file: !531, line: 257, baseType: !949, size: 56, offset: 176)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "rfcomm_rpn_data_t", file: !531, line: 159, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rfcomm_rpn_data", file: !531, line: 151, size: 56, elements: !951)
!951 = !{!952, !953, !954, !955, !956, !957, !958}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "baud_rate", scope: !950, file: !531, line: 152, baseType: !500, size: 8)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !950, file: !531, line: 153, baseType: !500, size: 8, offset: 8)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "flow_control", scope: !950, file: !531, line: 154, baseType: !500, size: 8, offset: 16)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "xon", scope: !950, file: !531, line: 155, baseType: !500, size: 8, offset: 24)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "xoff", scope: !950, file: !531, line: 156, baseType: !500, size: 8, offset: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "parameter_mask_0", scope: !950, file: !531, line: 157, baseType: !500, size: 8, offset: 40)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "parameter_mask_1", scope: !950, file: !531, line: 158, baseType: !500, size: 8, offset: 48)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "max_frame_size", scope: !926, file: !531, line: 271, baseType: !522, size: 16, offset: 304)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "service", scope: !926, file: !531, line: 274, baseType: !961, size: 32, offset: 320)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "packet_handler", scope: !926, file: !531, line: 277, baseType: !845, size: 32, offset: 352)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !926, file: !531, line: 280, baseType: !503, size: 32, offset: 384)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(name: "profile_bredr_profile", scope: !2, file: !3, line: 117, type: !509, isLocal: false, isDefinition: true)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(name: "profile_le_pool_hdl", scope: !2, file: !3, line: 119, type: !968, isLocal: false, isDefinition: true)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "stack_le_pool_t", file: !825, line: 93, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !825, line: 61, size: 128, elements: !970)
!970 = !{!971, !972, !973, !1087}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "le_hci_connection_pool", scope: !969, file: !825, line: 64, baseType: !829, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "gatt_client_pool", scope: !969, file: !825, line: 67, baseType: !829, size: 32, offset: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "le_hci_connection_storage", scope: !969, file: !825, line: 79, baseType: !974, size: 32, offset: 64)
!974 = !DICompositeType(tag: DW_TAG_array_type, baseType: !975, size: 32, elements: !620)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "le_hci_connection_t", file: !78, line: 605, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__le_hci_connection", file: !78, line: 571, size: 9792, elements: !978)
!978 = !{!979, !980, !981, !982, !984, !985, !987, !988, !989, !990, !991, !992, !1022, !1077, !1081, !1082, !1083, !1084, !1085, !1086}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !977, file: !78, line: 572, baseType: !840, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !977, file: !78, line: 574, baseType: !584, size: 48, offset: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "con_handle", scope: !977, file: !78, line: 576, baseType: !804, size: 16, offset: 80)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "address_type", scope: !977, file: !78, line: 578, baseType: !983, size: 32, offset: 96)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_addr_type_t", file: !70, line: 1475, baseType: !69)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "role", scope: !977, file: !78, line: 581, baseType: !587, size: 8, offset: 128)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "le_con_parameter_update_state", scope: !977, file: !78, line: 584, baseType: !986, size: 32, offset: 160)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "le_con_parameter_update_state_t", file: !78, line: 252, baseType: !77)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "le_con_param_update_identifier", scope: !977, file: !78, line: 585, baseType: !587, size: 8, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "le_conn_interval_min", scope: !977, file: !78, line: 586, baseType: !694, size: 16, offset: 208)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "le_conn_interval_max", scope: !977, file: !78, line: 587, baseType: !694, size: 16, offset: 224)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "le_conn_latency", scope: !977, file: !78, line: 588, baseType: !694, size: 16, offset: 240)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "le_supervision_timeout", scope: !977, file: !78, line: 589, baseType: !694, size: 16, offset: 256)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "sm_connection", scope: !977, file: !78, line: 592, baseType: !993, size: 448, offset: 288)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "sm_connection_t", file: !78, line: 475, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sm_connection", file: !78, line: 456, size: 448, elements: !995)
!995 = !{!996, !997, !998, !999, !1000, !1001, !1002, !1004, !1006, !1007, !1008, !1009, !1014, !1016, !1017, !1019, !1020, !1021}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "sm_handle", scope: !994, file: !78, line: 457, baseType: !804, size: 16)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "sm_role", scope: !994, file: !78, line: 458, baseType: !587, size: 8, offset: 16)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "sm_security_request_received", scope: !994, file: !78, line: 459, baseType: !587, size: 8, offset: 24)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "sm_bonding_requested", scope: !994, file: !78, line: 460, baseType: !587, size: 8, offset: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "sm_peer_addr_type", scope: !994, file: !78, line: 461, baseType: !587, size: 8, offset: 40)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "sm_peer_address", scope: !994, file: !78, line: 462, baseType: !584, size: 48, offset: 48)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "sm_engine_state", scope: !994, file: !78, line: 463, baseType: !1003, size: 32, offset: 96)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "security_manager_state_t", file: !78, line: 433, baseType: !85)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "sm_irk_lookup_state", scope: !994, file: !78, line: 464, baseType: !1005, size: 32, offset: 128)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "irk_lookup_state_t", file: !78, line: 442, baseType: !185)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "sm_connection_encrypted", scope: !994, file: !78, line: 465, baseType: !587, size: 8, offset: 160)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "sm_connection_authenticated", scope: !994, file: !78, line: 466, baseType: !587, size: 8, offset: 168)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "sm_actual_encryption_key_size", scope: !994, file: !78, line: 467, baseType: !587, size: 8, offset: 176)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "sm_m_preq", scope: !994, file: !78, line: 468, baseType: !1010, size: 56, offset: 184)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "sm_pairing_packet_t", file: !78, line: 452, baseType: !1011)
!1011 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 56, elements: !1012)
!1012 = !{!1013}
!1013 = !DISubrange(count: 7)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "sm_connection_authorization_state", scope: !994, file: !78, line: 469, baseType: !1015, size: 32, offset: 256)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "authorization_state_t", file: !78, line: 450, baseType: !192)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "sm_local_ediv", scope: !994, file: !78, line: 470, baseType: !694, size: 16, offset: 288)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "sm_local_rand", scope: !994, file: !78, line: 471, baseType: !1018, size: 64, offset: 304)
!1018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 64, elements: !616)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "sm_disconn_reason", scope: !994, file: !78, line: 472, baseType: !587, size: 8, offset: 368)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "sm_le_db_index", scope: !994, file: !78, line: 473, baseType: !507, size: 32, offset: 384)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "sm_timeout_id", scope: !994, file: !78, line: 474, baseType: !507, size: 32, offset: 416)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "att_server", scope: !977, file: !78, line: 595, baseType: !1023, size: 4640, offset: 736)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_server_t", file: !199, line: 187, baseType: !1024)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !199, line: 164, size: 4640, elements: !1025)
!1025 = !{!1026, !1028, !1029, !1030, !1031, !1032, !1033, !1052, !1063, !1064, !1068, !1069, !1070, !1071, !1072, !1073}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1024, file: !199, line: 165, baseType: !1027, size: 32)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_server_state_t", file: !199, line: 162, baseType: !198)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "peer_addr_type", scope: !1024, file: !199, line: 167, baseType: !587, size: 8, offset: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "peer_address", scope: !1024, file: !199, line: 168, baseType: !584, size: 48, offset: 40)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "ir_le_device_db_index", scope: !1024, file: !199, line: 170, baseType: !507, size: 32, offset: 96)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "ir_lookup_active", scope: !1024, file: !199, line: 171, baseType: !507, size: 32, offset: 128)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "value_indication_handle", scope: !1024, file: !199, line: 173, baseType: !507, size: 32, offset: 160)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "value_indication_timer", scope: !1024, file: !199, line: 174, baseType: !1034, size: 160, offset: 192)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_timer_source_t", file: !1035, line: 19, baseType: !1036)
!1035 = !DIFile(filename: "../btcommon/btstack_sys_timer.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btstack_timer_source", file: !1035, line: 7, size: 160, elements: !1037)
!1037 = !{!1038, !1039, !1041, !1042, !1043, !1044, !1045, !1046, !1051}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !1036, file: !1035, line: 8, baseType: !542, size: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !1036, file: !1035, line: 10, baseType: !1040, size: 32, offset: 32)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !501, line: 48, baseType: !506)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_interval", scope: !1036, file: !1035, line: 11, baseType: !1040, size: 16, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "timer_type", scope: !1036, file: !1035, line: 12, baseType: !1040, size: 4, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "timer_tick_overflow", scope: !1036, file: !1035, line: 13, baseType: !1040, size: 1, offset: 84, flags: DIFlagBitField, extraData: i64 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "loop_flag", scope: !1036, file: !1035, line: 14, baseType: !1040, size: 1, offset: 85, flags: DIFlagBitField, extraData: i64 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "loop_times", scope: !1036, file: !1035, line: 15, baseType: !1040, size: 10, offset: 86, flags: DIFlagBitField, extraData: i64 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !1036, file: !1035, line: 17, baseType: !1047, size: 32, offset: 96)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 32)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{null, !1050}
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 32)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1036, file: !1035, line: 18, baseType: !503, size: 32, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !1024, file: !199, line: 176, baseType: !1053, size: 80, offset: 352)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_connection_t", file: !1054, line: 41, baseType: !1055)
!1054 = !DIFile(filename: "../btstack/Protocol/include/ble/att_db.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "att_connection", file: !1054, line: 34, size: 80, elements: !1056)
!1056 = !{!1057, !1058, !1059, !1060, !1061, !1062}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "con_handle", scope: !1055, file: !1054, line: 35, baseType: !804, size: 16)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !1055, file: !1054, line: 36, baseType: !694, size: 16, offset: 16)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "max_mtu", scope: !1055, file: !1054, line: 37, baseType: !694, size: 16, offset: 32)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "encryption_key_size", scope: !1055, file: !1054, line: 38, baseType: !587, size: 8, offset: 48)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !1055, file: !1054, line: 39, baseType: !587, size: 8, offset: 56)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "authorized", scope: !1055, file: !1054, line: 40, baseType: !587, size: 8, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "request_size", scope: !1024, file: !199, line: 178, baseType: !694, size: 16, offset: 432)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "request_buffer", scope: !1024, file: !199, line: 179, baseType: !1065, size: 4136, offset: 448)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 4136, elements: !1066)
!1066 = !{!1067}
!1067 = !DISubrange(count: 517)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "flow_hold_flag", scope: !1024, file: !199, line: 181, baseType: !587, size: 1, offset: 4584, flags: DIFlagBitField, extraData: i64 4584)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "mtu_request_flag", scope: !1024, file: !199, line: 182, baseType: !587, size: 1, offset: 4585, flags: DIFlagBitField, extraData: i64 4584)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "check_remote_tag", scope: !1024, file: !199, line: 183, baseType: !587, size: 3, offset: 4586, flags: DIFlagBitField, extraData: i64 4584)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "request_busy", scope: !1024, file: !199, line: 184, baseType: !587, size: 1, offset: 4589, flags: DIFlagBitField, extraData: i64 4584)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "reserverd", scope: !1024, file: !199, line: 185, baseType: !587, size: 2, offset: 4590, flags: DIFlagBitField, extraData: i64 4584)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "result_callback", scope: !1024, file: !199, line: 186, baseType: !1074, size: 32, offset: 4608)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 32)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{null, !522, !500}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "acl_recombination_buffer", scope: !977, file: !78, line: 597, baseType: !1078, size: 4232, offset: 5376)
!1078 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 4232, elements: !1079)
!1079 = !{!1080}
!1080 = !DISubrange(count: 529)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "acl_recombination_pos", scope: !977, file: !78, line: 598, baseType: !694, size: 16, offset: 9616)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "acl_recombination_length", scope: !977, file: !78, line: 599, baseType: !694, size: 16, offset: 9632)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "num_acl_packets_sent", scope: !977, file: !78, line: 600, baseType: !587, size: 8, offset: 9648)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "own_id_address", scope: !977, file: !78, line: 602, baseType: !584, size: 48, offset: 9656)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "own_address", scope: !977, file: !78, line: 603, baseType: !584, size: 48, offset: 9704)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "own_address_type", scope: !977, file: !78, line: 604, baseType: !983, size: 32, offset: 9760)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "gatt_client_storage", scope: !969, file: !825, line: 83, baseType: !1088, size: 32, offset: 96)
!1088 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1089, size: 32, elements: !620)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 32)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "gatt_client_t", file: !206, line: 191, baseType: !1091)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gatt_client", file: !206, line: 140, size: 1024, elements: !1092)
!1092 = !{!1093, !1094, !1096, !1097, !1098, !1099, !1100, !1101, !1103, !1104, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1121, !1122, !1126, !1127, !1128, !1129, !1130, !1131, !1133, !1134}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !1091, file: !206, line: 141, baseType: !840, size: 32)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "gatt_client_state", scope: !1091, file: !206, line: 143, baseType: !1095, size: 32, offset: 32)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "gatt_client_state_t", file: !206, line: 124, baseType: !205)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1091, file: !206, line: 146, baseType: !845, size: 32, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "con_handle", scope: !1091, file: !206, line: 148, baseType: !804, size: 16, offset: 96)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "address_type", scope: !1091, file: !206, line: 150, baseType: !587, size: 8, offset: 112)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1091, file: !206, line: 151, baseType: !584, size: 48, offset: 120)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !1091, file: !206, line: 152, baseType: !694, size: 16, offset: 176)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "mtu_state", scope: !1091, file: !206, line: 153, baseType: !1102, size: 32, offset: 192)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "gatt_client_mtu_t", file: !206, line: 132, baseType: !263)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "uuid16", scope: !1091, file: !206, line: 155, baseType: !694, size: 16, offset: 224)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "uuid128", scope: !1091, file: !206, line: 156, baseType: !1105, size: 128, offset: 240)
!1105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 128, elements: !1106)
!1106 = !{!1107}
!1107 = !DISubrange(count: 16)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "start_group_handle", scope: !1091, file: !206, line: 158, baseType: !694, size: 16, offset: 368)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "end_group_handle", scope: !1091, file: !206, line: 159, baseType: !694, size: 16, offset: 384)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "query_start_handle", scope: !1091, file: !206, line: 161, baseType: !694, size: 16, offset: 400)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "query_end_handle", scope: !1091, file: !206, line: 162, baseType: !694, size: 16, offset: 416)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "characteristic_properties", scope: !1091, file: !206, line: 164, baseType: !587, size: 8, offset: 432)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "characteristic_start_handle", scope: !1091, file: !206, line: 165, baseType: !694, size: 16, offset: 448)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "attribute_handle", scope: !1091, file: !206, line: 167, baseType: !694, size: 16, offset: 464)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "attribute_offset", scope: !1091, file: !206, line: 168, baseType: !694, size: 16, offset: 480)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "attribute_length", scope: !1091, file: !206, line: 169, baseType: !694, size: 16, offset: 496)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "attribute_value", scope: !1091, file: !206, line: 170, baseType: !695, size: 32, offset: 512)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "read_multiple_handle_count", scope: !1091, file: !206, line: 173, baseType: !694, size: 16, offset: 544)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "read_multiple_handles", scope: !1091, file: !206, line: 174, baseType: !1120, size: 32, offset: 576)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 32)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "client_characteristic_configuration_handle", scope: !1091, file: !206, line: 176, baseType: !694, size: 16, offset: 608)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "client_characteristic_configuration_value", scope: !1091, file: !206, line: 177, baseType: !1123, size: 16, offset: 624)
!1123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 16, elements: !1124)
!1124 = !{!1125}
!1125 = !DISubrange(count: 2)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "filter_with_uuid", scope: !1091, file: !206, line: 179, baseType: !587, size: 8, offset: 640)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "send_confirmation", scope: !1091, file: !206, line: 180, baseType: !587, size: 8, offset: 648)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "le_device_index", scope: !1091, file: !206, line: 182, baseType: !507, size: 32, offset: 672)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "cmac", scope: !1091, file: !206, line: 183, baseType: !1018, size: 64, offset: 704)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "gc_timeout", scope: !1091, file: !206, line: 185, baseType: !1034, size: 160, offset: 768)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "rsp_state", scope: !1091, file: !206, line: 188, baseType: !1132, size: 32, offset: 928)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "gatt_client_rsp_t", file: !206, line: 137, baseType: !269)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "send_packet_buffer", scope: !1091, file: !206, line: 189, baseType: !1011, size: 56, offset: 960)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "send_packet_len", scope: !1091, file: !206, line: 190, baseType: !587, size: 8, offset: 1016)
!1135 = !DIGlobalVariableExpression(var: !1136, expr: !DIExpression())
!1136 = distinct !DIGlobalVariable(name: "btstack_stack", scope: !2, file: !3, line: 121, type: !1137, isLocal: false, isDefinition: true)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btstack_comm_handle_t", file: !510, line: 70, size: 160, elements: !1138)
!1138 = !{!1139, !1141, !1143, !1145, !1146}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "bredr_pool_hdl", scope: !1137, file: !510, line: 71, baseType: !1140, size: 32)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "le_pool_hdl", scope: !1137, file: !510, line: 72, baseType: !1142, size: 32, offset: 32)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 32)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "l2cap_hdl", scope: !1137, file: !510, line: 73, baseType: !1144, size: 32, offset: 64)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 32)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "bredr_profile", scope: !1137, file: !510, line: 74, baseType: !508, size: 32, offset: 96)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "user_var", scope: !1137, file: !510, line: 75, baseType: !503, size: 32, offset: 128)
!1147 = !DIGlobalVariableExpression(var: !1148, expr: !DIExpression())
!1148 = distinct !DIGlobalVariable(name: "crc_ta", scope: !2, file: !3, line: 493, type: !1149, isLocal: true, isDefinition: true)
!1149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1150, size: 256, elements: !1106)
!1150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !522)
!1151 = !DIGlobalVariableExpression(var: !1152, expr: !DIExpression())
!1152 = distinct !DIGlobalVariable(name: "ble_disconnect_reason", scope: !2, file: !3, line: 546, type: !500, isLocal: true, isDefinition: true)
!1153 = !DIFile(filename: "../btcommon/profile_stack_debug.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!1154 = !{i32 2, !"Dwarf Version", i32 4}
!1155 = !{i32 2, !"Debug Info Version", i32 3}
!1156 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!1157 = distinct !DISubprogram(name: "get_bredr_pool_len", scope: !3, file: !3, line: 128, type: !1158, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1160)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!522}
!1160 = !{}
!1161 = !DILocation(line: 130, column: 5, scope: !1157)
!1162 = distinct !DISubprogram(name: "get_le_pool_len", scope: !3, file: !3, line: 133, type: !1158, isLocal: false, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1160)
!1163 = !DILocation(line: 135, column: 5, scope: !1162)
!1164 = distinct !DISubprogram(name: "get_l2cap_stack_len", scope: !3, file: !3, line: 138, type: !1158, isLocal: false, isDefinition: true, scopeLine: 139, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1160)
!1165 = !DILocation(line: 140, column: 5, scope: !1164)
!1166 = distinct !DISubprogram(name: "get_profile_pool_len", scope: !3, file: !3, line: 143, type: !1158, isLocal: false, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1160)
!1167 = !DILocation(line: 145, column: 5, scope: !1166)
!1168 = distinct !DISubprogram(name: "btstack_mem_init", scope: !3, file: !3, line: 148, type: !779, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1160)
!1169 = !DILocation(line: 156, column: 34, scope: !1168)
!1170 = !{!1171, !1172, i64 8}
!1171 = !{!"btstack_comm_handle_t", !1172, i64 0, !1172, i64 4, !1172, i64 8, !1172, i64 12, !1172, i64 16}
!1172 = !{!"any pointer", !1173, i64 0}
!1173 = !{!"omnipotent char", !1174, i64 0}
!1174 = !{!"Simple C/C++ TBAA"}
!1175 = !DILocation(line: 159, column: 9, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1168, file: !3, line: 159, column: 9)
!1177 = !{!1178, !1178, i64 0}
!1178 = !{!"int", !1173, i64 0}
!1179 = !DILocation(line: 159, column: 9, scope: !1168)
!1180 = !DILocation(line: 160, column: 38, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1176, file: !3, line: 159, column: 55)
!1182 = !{!1171, !1172, i64 0}
!1183 = !DILocation(line: 161, column: 38, scope: !1181)
!1184 = !{!1171, !1172, i64 12}
!1185 = !DILocation(line: 164, column: 9, scope: !1181)
!1186 = !DILocation(line: 165, column: 9, scope: !1181)
!1187 = !DILocation(line: 166, column: 9, scope: !1181)
!1188 = !DILocation(line: 167, column: 5, scope: !1181)
!1189 = !DILocation(line: 169, column: 9, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !1168, file: !3, line: 169, column: 9)
!1191 = !DILocation(line: 169, column: 9, scope: !1168)
!1192 = !DILocation(line: 171, column: 9, scope: !1193)
!1193 = !DILexicalBlockFile(scope: !1194, file: !3, discriminator: 1)
!1194 = distinct !DILexicalBlock(scope: !1195, file: !3, line: 171, column: 9)
!1195 = distinct !DILexicalBlock(scope: !1196, file: !3, line: 171, column: 9)
!1196 = distinct !DILexicalBlock(scope: !1190, file: !3, line: 169, column: 50)
!1197 = !DILocation(line: 171, column: 9, scope: !1198)
!1198 = !DILexicalBlockFile(scope: !1195, file: !3, discriminator: 1)
!1199 = !DILocation(line: 171, column: 9, scope: !1200)
!1200 = !DILexicalBlockFile(scope: !1201, file: !3, discriminator: 2)
!1201 = distinct !DILexicalBlock(scope: !1194, file: !3, line: 171, column: 9)
!1202 = !DILocation(line: 171, column: 9, scope: !1203)
!1203 = !DILexicalBlockFile(scope: !1204, file: !3, discriminator: 3)
!1204 = distinct !DILexicalBlock(scope: !1205, file: !3, line: 171, column: 9)
!1205 = distinct !DILexicalBlock(scope: !1201, file: !3, line: 171, column: 9)
!1206 = !DILocation(line: 171, column: 9, scope: !1207)
!1207 = !DILexicalBlockFile(scope: !1204, file: !3, discriminator: 8)
!1208 = !DILocation(line: 171, column: 9, scope: !1209)
!1209 = !DILexicalBlockFile(scope: !1204, file: !3, discriminator: 9)
!1210 = !DILocation(line: 171, column: 9, scope: !1211)
!1211 = !DILexicalBlockFile(scope: !1212, file: !3, discriminator: 5)
!1212 = distinct !DILexicalBlock(scope: !1194, file: !3, line: 171, column: 9)
!1213 = !DILocation(line: 171, column: 9, scope: !1214)
!1214 = !DILexicalBlockFile(scope: !1215, file: !3, discriminator: 6)
!1215 = distinct !DILexicalBlock(scope: !1216, file: !3, line: 171, column: 9)
!1216 = distinct !DILexicalBlock(scope: !1212, file: !3, line: 171, column: 9)
!1217 = !DILocation(line: 173, column: 38, scope: !1196)
!1218 = !{!1171, !1172, i64 4}
!1219 = !DILocation(line: 176, column: 9, scope: !1196)
!1220 = !DILocation(line: 177, column: 9, scope: !1196)
!1221 = !DILocation(line: 179, column: 5, scope: !1196)
!1222 = !DILocation(line: 182, column: 26, scope: !1168)
!1223 = !DILocation(line: 182, column: 5, scope: !1168)
!1224 = !DILocation(line: 183, column: 1, scope: !1168)
!1225 = distinct !DISubprogram(name: "cpu_reset", scope: !1226, file: !1226, line: 145, type: !779, isLocal: true, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1160)
!1226 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!1227 = !DILocation(line: 148, column: 5, scope: !1225)
!1228 = !DILocation(line: 149, column: 1, scope: !1225)
!1229 = distinct !DISubprogram(name: "btstack_v21_main", scope: !3, file: !3, line: 484, type: !779, isLocal: false, isDefinition: true, scopeLine: 485, isOptimized: true, unit: !2, variables: !1160)
!1230 = !DILocation(line: 487, column: 38, scope: !1229)
!1231 = !DILocation(line: 487, column: 5, scope: !1229)
!1232 = !DILocation(line: 488, column: 33, scope: !1229)
!1233 = !DILocalVariable(name: "var", arg: 1, scope: !1234, file: !3, line: 351, type: !503)
!1234 = distinct !DISubprogram(name: "bt_bredr_init", scope: !3, file: !3, line: 351, type: !1235, isLocal: true, isDefinition: true, scopeLine: 352, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1237)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{null, !503}
!1237 = !{!1233, !1238, !1266}
!1238 = !DILocalVariable(name: "db_file", scope: !1234, file: !3, line: 353, type: !1239)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 32)
!1240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1241)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "database_file", file: !1242, line: 47, size: 224, elements: !1243)
!1242 = !DIFile(filename: "../User/include/bredr/remote_device_db.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!1243 = !{!1244, !1248, !1252, !1256, !1257, !1261, !1265}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !1241, file: !1242, line: 48, baseType: !1245, size: 32)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 32)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!507, null}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1241, file: !1242, line: 49, baseType: !1249, size: 32, offset: 32)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 32)
!1250 = !DISubroutineType(types: !1251)
!1251 = !{null, null}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !1241, file: !1242, line: 50, baseType: !1253, size: 32, offset: 64)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 32)
!1254 = !DISubroutineType(types: !1255)
!1255 = !{!507, !503, !507, !505}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !1241, file: !1242, line: 51, baseType: !1253, size: 32, offset: 96)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1241, file: !1242, line: 52, baseType: !1258, size: 32, offset: 128)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 32)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{null, !507, !507}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "getlen", scope: !1241, file: !1242, line: 53, baseType: !1262, size: 32, offset: 160)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 32)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{!507}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "get_fpos", scope: !1241, file: !1242, line: 54, baseType: !1245, size: 32, offset: 192)
!1266 = !DILocalVariable(name: "profile", scope: !1234, file: !3, line: 355, type: !508)
!1267 = !DILocation(line: 351, column: 33, scope: !1234, inlinedAt: !1268)
!1268 = distinct !DILocation(line: 488, column: 5, scope: !1229)
!1269 = !DILocation(line: 360, column: 15, scope: !1234, inlinedAt: !1268)
!1270 = !DILocation(line: 353, column: 33, scope: !1234, inlinedAt: !1268)
!1271 = !DILocation(line: 361, column: 5, scope: !1234, inlinedAt: !1268)
!1272 = !DILocation(line: 364, column: 43, scope: !1234, inlinedAt: !1268)
!1273 = !DILocation(line: 364, column: 5, scope: !1274, inlinedAt: !1268)
!1274 = !DILexicalBlockFile(scope: !1234, file: !3, discriminator: 1)
!1275 = !DILocation(line: 375, column: 27, scope: !1234, inlinedAt: !1268)
!1276 = !DILocation(line: 375, column: 5, scope: !1234, inlinedAt: !1268)
!1277 = !DILocation(line: 380, column: 38, scope: !1234, inlinedAt: !1268)
!1278 = !{!1279, !1172, i64 32}
!1279 = !{!"profile_cmd_handle", !1172, i64 0, !1172, i64 4, !1172, i64 8, !1172, i64 12, !1172, i64 16, !1172, i64 20, !1172, i64 24, !1172, i64 28, !1172, i64 32, !1172, i64 36, !1172, i64 40}
!1280 = !DILocation(line: 381, column: 24, scope: !1234, inlinedAt: !1268)
!1281 = !DILocation(line: 381, column: 5, scope: !1234, inlinedAt: !1268)
!1282 = !DILocation(line: 382, column: 5, scope: !1234, inlinedAt: !1268)
!1283 = !DILocation(line: 393, column: 9, scope: !1284, inlinedAt: !1268)
!1284 = distinct !DILexicalBlock(scope: !1234, file: !3, line: 393, column: 9)
!1285 = !{!1173, !1173, i64 0}
!1286 = !DILocation(line: 393, column: 9, scope: !1234, inlinedAt: !1268)
!1287 = !DILocation(line: 394, column: 43, scope: !1288, inlinedAt: !1268)
!1288 = distinct !DILexicalBlock(scope: !1284, file: !3, line: 393, column: 30)
!1289 = !{!1290, !1291, i64 10}
!1290 = !{!"_stack_config", !1178, i64 0, !1291, i64 4, !1291, i64 6, !1291, i64 8, !1291, i64 10, !1291, i64 12, !1173, i64 14, !1173, i64 15, !1173, i64 16, !1173, i64 17, !1173, i64 17, !1173, i64 17, !1173, i64 17, !1173, i64 18, !1173, i64 18, !1173, i64 18, !1173, i64 18, !1173, i64 18, !1173, i64 18, !1173, i64 18, !1173, i64 18, !1173, i64 19, !1173, i64 19, !1173, i64 19, !1173, i64 19, !1173, i64 19, !1173, i64 19, !1173, i64 19, !1173, i64 19, !1173, i64 20, !1173, i64 20, !1173, i64 20, !1173, i64 21, !1173, i64 22, !1173, i64 23, !1173, i64 24, !1173, i64 25, !1173, i64 31, !1173, i64 31}
!1291 = !{!"short", !1173, i64 0}
!1292 = !DILocation(line: 395, column: 42, scope: !1288, inlinedAt: !1268)
!1293 = !{!1279, !1172, i64 8}
!1294 = !DILocation(line: 396, column: 34, scope: !1288, inlinedAt: !1268)
!1295 = !DILocation(line: 396, column: 9, scope: !1288, inlinedAt: !1268)
!1296 = !DILocation(line: 397, column: 5, scope: !1288, inlinedAt: !1268)
!1297 = !DILocation(line: 413, column: 9, scope: !1298, inlinedAt: !1268)
!1298 = distinct !DILexicalBlock(scope: !1234, file: !3, line: 413, column: 9)
!1299 = !DILocation(line: 413, column: 9, scope: !1234, inlinedAt: !1268)
!1300 = !DILocation(line: 414, column: 43, scope: !1301, inlinedAt: !1268)
!1301 = distinct !DILexicalBlock(scope: !1298, file: !3, line: 413, column: 30)
!1302 = !DILocation(line: 415, column: 42, scope: !1301, inlinedAt: !1268)
!1303 = !{!1279, !1172, i64 0}
!1304 = !DILocation(line: 416, column: 36, scope: !1301, inlinedAt: !1268)
!1305 = !DILocation(line: 416, column: 45, scope: !1301, inlinedAt: !1268)
!1306 = !{!1172, !1172, i64 0}
!1307 = !DILocation(line: 416, column: 65, scope: !1301, inlinedAt: !1268)
!1308 = !DILocation(line: 416, column: 9, scope: !1301, inlinedAt: !1268)
!1309 = !DILocation(line: 417, column: 5, scope: !1301, inlinedAt: !1268)
!1310 = !DILocation(line: 445, column: 9, scope: !1311, inlinedAt: !1268)
!1311 = distinct !DILexicalBlock(scope: !1234, file: !3, line: 445, column: 9)
!1312 = !DILocation(line: 445, column: 9, scope: !1234, inlinedAt: !1268)
!1313 = !DILocation(line: 446, column: 43, scope: !1314, inlinedAt: !1268)
!1314 = distinct !DILexicalBlock(scope: !1311, file: !3, line: 445, column: 30)
!1315 = !DILocation(line: 447, column: 42, scope: !1314, inlinedAt: !1268)
!1316 = !{!1279, !1172, i64 4}
!1317 = !DILocation(line: 448, column: 28, scope: !1314, inlinedAt: !1268)
!1318 = !DILocation(line: 448, column: 9, scope: !1314, inlinedAt: !1268)
!1319 = !DILocation(line: 449, column: 5, scope: !1314, inlinedAt: !1268)
!1320 = !DILocation(line: 466, column: 5, scope: !1234, inlinedAt: !1268)
!1321 = !DILocation(line: 469, column: 5, scope: !1234, inlinedAt: !1268)
!1322 = !DILocation(line: 489, column: 1, scope: !1229)
!1323 = distinct !DISubprogram(name: "lib_make_ble_address", scope: !3, file: !3, line: 515, type: !1324, isLocal: false, isDefinition: true, scopeLine: 516, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1326)
!1324 = !DISubroutineType(types: !1325)
!1325 = !{null, !499, !499}
!1326 = !{!1327, !1328, !1329}
!1327 = !DILocalVariable(name: "ble_address", arg: 1, scope: !1323, file: !3, line: 515, type: !499)
!1328 = !DILocalVariable(name: "edr_address", arg: 2, scope: !1323, file: !3, line: 515, type: !499)
!1329 = !DILocalVariable(name: "tmp_crc", scope: !1323, file: !3, line: 517, type: !505)
!1330 = !DILocation(line: 515, column: 31, scope: !1323)
!1331 = !DILocation(line: 515, column: 48, scope: !1323)
!1332 = !DILocation(line: 517, column: 5, scope: !1323)
!1333 = !DILocation(line: 517, column: 9, scope: !1323)
!1334 = !DILocation(line: 518, column: 13, scope: !1323)
!1335 = !DILocation(line: 518, column: 30, scope: !1323)
!1336 = !DILocation(line: 518, column: 5, scope: !1323)
!1337 = !DILocation(line: 519, column: 15, scope: !1323)
!1338 = !DILocation(line: 519, column: 13, scope: !1323)
!1339 = !DILocation(line: 520, column: 5, scope: !1323)
!1340 = !DILocation(line: 521, column: 15, scope: !1323)
!1341 = !DILocation(line: 521, column: 32, scope: !1323)
!1342 = !DILocation(line: 521, column: 30, scope: !1323)
!1343 = !DILocation(line: 522, column: 5, scope: !1323)
!1344 = !DILocation(line: 522, column: 20, scope: !1323)
!1345 = !DILocation(line: 523, column: 1, scope: !1323)
!1346 = distinct !DISubprogram(name: "cal_crc16_private", scope: !3, file: !3, line: 497, type: !1347, isLocal: true, isDefinition: true, scopeLine: 498, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1349)
!1347 = !DISubroutineType(types: !1348)
!1348 = !{!522, !499, !522, !522}
!1349 = !{!1350, !1351, !1352, !1353, !1354}
!1350 = !DILocalVariable(name: "ptr", arg: 1, scope: !1346, file: !3, line: 497, type: !499)
!1351 = !DILocalVariable(name: "len", arg: 2, scope: !1346, file: !3, line: 497, type: !522)
!1352 = !DILocalVariable(name: "init_crc", arg: 3, scope: !1346, file: !3, line: 497, type: !522)
!1353 = !DILocalVariable(name: "da", scope: !1346, file: !3, line: 499, type: !500)
!1354 = !DILocalVariable(name: "my_crc16_value", scope: !1346, file: !3, line: 500, type: !522)
!1355 = !DILocation(line: 497, column: 34, scope: !1346)
!1356 = !DILocation(line: 497, column: 43, scope: !1346)
!1357 = !DILocation(line: 497, column: 52, scope: !1346)
!1358 = !DILocation(line: 500, column: 9, scope: !1346)
!1359 = !DILocation(line: 502, column: 16, scope: !1360)
!1360 = !DILexicalBlockFile(scope: !1346, file: !3, discriminator: 1)
!1361 = !DILocation(line: 502, column: 5, scope: !1360)
!1362 = !DILocation(line: 503, column: 14, scope: !1363)
!1363 = distinct !DILexicalBlock(scope: !1346, file: !3, line: 502, column: 22)
!1364 = !DILocation(line: 504, column: 24, scope: !1363)
!1365 = !DILocation(line: 505, column: 40, scope: !1363)
!1366 = !DILocation(line: 505, column: 45, scope: !1363)
!1367 = !DILocation(line: 505, column: 37, scope: !1363)
!1368 = !DILocation(line: 505, column: 27, scope: !1363)
!1369 = !{!1291, !1291, i64 0}
!1370 = !DILocation(line: 505, column: 24, scope: !1363)
!1371 = !DILocation(line: 506, column: 14, scope: !1363)
!1372 = !DILocation(line: 507, column: 24, scope: !1363)
!1373 = !DILocation(line: 508, column: 45, scope: !1363)
!1374 = !DILocation(line: 508, column: 37, scope: !1363)
!1375 = !DILocation(line: 508, column: 27, scope: !1363)
!1376 = !DILocation(line: 508, column: 24, scope: !1363)
!1377 = !DILocation(line: 509, column: 12, scope: !1363)
!1378 = !DILocation(line: 510, column: 12, scope: !1363)
!1379 = distinct !{!1379, !1380, !1381}
!1380 = !DILocation(line: 502, column: 5, scope: !1346)
!1381 = !DILocation(line: 511, column: 5, scope: !1346)
!1382 = !DILocation(line: 512, column: 5, scope: !1346)
!1383 = distinct !DISubprogram(name: "ble_vendor_change_disconn_reason", scope: !3, file: !3, line: 548, type: !1384, isLocal: false, isDefinition: true, scopeLine: 549, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1386)
!1384 = !DISubroutineType(types: !1385)
!1385 = !{null, !500}
!1386 = !{!1387}
!1387 = !DILocalVariable(name: "reason", arg: 1, scope: !1383, file: !3, line: 548, type: !500)
!1388 = !DILocation(line: 548, column: 42, scope: !1383)
!1389 = !DILocation(line: 550, column: 27, scope: !1383)
!1390 = !DILocation(line: 551, column: 1, scope: !1383)
!1391 = distinct !DISubprogram(name: "ble_stack_exit", scope: !3, file: !3, line: 797, type: !1392, isLocal: false, isDefinition: true, scopeLine: 798, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1394)
!1392 = !DISubroutineType(types: !1393)
!1393 = !{null, !505}
!1394 = !{!1395}
!1395 = !DILocalVariable(name: "param", arg: 1, scope: !1391, file: !3, line: 797, type: !505)
!1396 = !DILocation(line: 797, column: 25, scope: !1391)
!1397 = !DILocation(line: 799, column: 9, scope: !1398)
!1398 = distinct !DILexicalBlock(scope: !1391, file: !3, line: 799, column: 9)
!1399 = !DILocation(line: 799, column: 49, scope: !1398)
!1400 = !DILocation(line: 800, column: 9, scope: !1401)
!1401 = distinct !DILexicalBlock(scope: !1402, file: !3, line: 800, column: 9)
!1402 = distinct !DILexicalBlock(scope: !1398, file: !3, line: 799, column: 97)
!1403 = !DILocation(line: 800, column: 9, scope: !1402)
!1404 = !DILocation(line: 800, column: 9, scope: !1405)
!1405 = !DILexicalBlockFile(scope: !1401, file: !3, discriminator: 1)
!1406 = !DILocation(line: 801, column: 43, scope: !1407)
!1407 = distinct !DILexicalBlock(scope: !1402, file: !3, line: 801, column: 13)
!1408 = !{!1409, !1173, i64 180}
!1409 = !{!"btstack_ctrl", !1410, i64 0}
