; ModuleID = 'btstack_task.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btcommon/btstack_task.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.hci_transport_config_uart_t = type { i32, i32, i32, i32, i8* }
%struct.lp_target = type { i8*, i32 ()*, i8 ()* }
%struct.hci_transport_t = type { i8*, void (i8*)*, i32 ()*, i32 ()*, void (void (i32, i8*, i32)*)*, i32 (i8)*, i32 (i32, i8*, i32)*, i32 (i32)*, void ()*, void (i16, i32)* }
%struct.xSTATIC_QUEUE = type { [3 x i8*], %union.anon, [2 x %struct.xSTATIC_LIST], [3 x i32], [2 x i8], i8, i32, i8 }
%union.anon = type { i8* }
%struct.xSTATIC_LIST = type { i32, i8*, %struct.xSTATIC_MINI_LIST_ITEM }
%struct.xSTATIC_MINI_LIST_ITEM = type { i32, [2 x i8*] }

@app_info_debug_enable = weak hidden local_unnamed_addr global i32 0, align 4, !dbg !0
@.str = private unnamed_addr constant [8 x i8] c"btstack\00", align 1
@.str.1 = private unnamed_addr constant [26 x i8] c"btprofile: qfull: %d, %d\0A\00", align 1
@config = internal global %struct.hci_transport_config_uart_t { i32 0, i32 115200, i32 0, i32 0, i8* null }, section ".bt_stack_data", align 4, !dbg !228
@.str.2 = private unnamed_addr constant [18 x i8] c"le_support:%x %x\0A\00", align 1
@config_btctler_modules = external local_unnamed_addr constant i32, align 4
@config_btctler_mode = external local_unnamed_addr constant i32, align 4

!93 = !DIEnumerator(name: "BT_STATUS_ENCRY_COMPLETE", value: 8)
!94 = !DIEnumerator(name: "BT_STATUS_FIRST_DISCONNECT", value: 9)
!95 = !DIEnumerator(name: "BT_STATUS_SECOND_DISCONNECT", value: 10)
!96 = !DIEnumerator(name: "BT_STATUS_PHONE_INCOME", value: 11)
!97 = !DIEnumerator(name: "BT_STATUS_PHONE_NUMBER", value: 12)
!98 = !DIEnumerator(name: "BT_STATUS_PHONE_MANUFACTURER", value: 13)
!99 = !DIEnumerator(name: "BT_STATUS_PHONE_OUT", value: 14)
!100 = !DIEnumerator(name: "BT_STATUS_PHONE_ACTIVE", value: 15)
!101 = !DIEnumerator(name: "BT_STATUS_PHONE_HANGUP", value: 16)
!102 = !DIEnumerator(name: "BT_STATUS_BEGIN_AUTO_CON", value: 17)
!103 = !DIEnumerator(name: "BT_STATUS_MUSIC_SOUND_COME", value: 18)
!104 = !DIEnumerator(name: "BT_STATUS_MUSIC_SOUND_GO", value: 19)
!105 = !DIEnumerator(name: "BT_STATUS_RESUME", value: 20)
!106 = !DIEnumerator(name: "BT_STATUS_RESUME_BTSTACK", value: 21)
!107 = !DIEnumerator(name: "BT_STATUS_SUSPEND", value: 22)
!108 = !DIEnumerator(name: "BT_STATUS_LAST_CALL_TYPE_CHANGE", value: 23)
!109 = !DIEnumerator(name: "BT_STATUS_CALL_VOL_CHANGE", value: 24)
!110 = !DIEnumerator(name: "BT_STATUS_SCO_STATUS_CHANGE", value: 25)
!111 = !DIEnumerator(name: "BT_STATUS_CONNECT_WITHOUT_LINKKEY", value: 26)
!112 = !DIEnumerator(name: "BT_STATUS_PHONE_BATTERY_CHANGE", value: 27)
!113 = !DIEnumerator(name: "BT_STATUS_RECONNECT_LINKKEY_LOST", value: 28)
!114 = !DIEnumerator(name: "BT_STATUS_RECONN_OR_CONN", value: 29)
!115 = !DIEnumerator(name: "BT_STATUS_BT_TEST_BOX_CMD", value: 30)
!116 = !DIEnumerator(name: "BT_STATUS_BT_TWS_CONNECT_CMD", value: 31)
!117 = !DIEnumerator(name: "BT_STATUS_SNIFF_STATE_UPDATE", value: 32)
!118 = !DIEnumerator(name: "BT_STATUS_TONE_BY_FILE_NAME", value: 33)
!119 = !DIEnumerator(name: "BT_STATUS_PHONE_DATE_AND_TIME", value: 34)
!120 = !DIEnumerator(name: "BT_STATUS_INBAND_RINGTONE", value: 35)
!121 = !DIEnumerator(name: "BT_STATUS_VOICE_RECOGNITION", value: 36)
!122 = !DIEnumerator(name: "BT_STATUS_AVRCP_INCOME_OPID", value: 37)
!123 = !DIEnumerator(name: "BT_STATUS_HFP_SERVICE_LEVEL_CONNECTION_OK", value: 38)
!124 = !DIEnumerator(name: "BT_STATUS_CONN_A2DP_CH", value: 39)
!125 = !DIEnumerator(name: "BT_STATUS_CONN_HFP_CH", value: 40)
!126 = !DIEnumerator(name: "BT_STATUS_INQUIRY_TIMEOUT", value: 41)
!127 = !DIEnumerator(name: "BT_STATUS_INITING", value: 42)
!128 = !DIEnumerator(name: "BT_STATUS_WAITINT_CONN", value: 43)
!129 = !DIEnumerator(name: "BT_STATUS_AUTO_CONNECTINT", value: 44)
!130 = !DIEnumerator(name: "BT_STATUS_CONNECTING", value: 45)
!131 = !DIEnumerator(name: "BT_STATUS_TAKEING_PHONE", value: 46)
!132 = !DIEnumerator(name: "BT_STATUS_PLAYING_MUSIC", value: 47)
!133 = !DIEnumerator(name: "BT_STATUS_A2DP_MEDIA_START", value: 48)
!134 = !DIEnumerator(name: "BT_STATUS_A2DP_MEDIA_STOP", value: 49)
!135 = !DIEnumerator(name: "BT_STATUS_BROADCAST_STATE", value: 50)
!136 = !DIEnumerator(name: "BT_STATUS_TRIM_OVER", value: 51)
!137 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "LOW_POWER_LEVEL", file: !138, line: 346, size: 32, elements: !139)
!138 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/power_interface.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!139 = !{!140, !141, !142}
!140 = !DIEnumerator(name: "LOW_POWER_MODE_SLEEP", value: 0)
!141 = !DIEnumerator(name: "LOW_POWER_MODE_LIGHT_SLEEP", value: 1)
!142 = !DIEnumerator(name: "LOW_POWER_MODE_DEEP_SLEEP", value: 2)
!143 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !144, line: 184, size: 32, elements: !145)
!144 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btctrler/hci_transport.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!145 = !{!146, !147}
!146 = !DIEnumerator(name: "HCI_TRANSPORT_CONFIG_UART", value: 0)
!147 = !DIEnumerator(name: "HCI_TRANSPORT_CONFIG_USB", value: 1)
!148 = !{!149, !150, !151, !152, !156}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !154, line: 44, baseType: !155)
!154 = !DIFile(filename: "../btcommon/typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!155 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "OS_SEM", file: !158, line: 26, baseType: !159)
!158 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/os/os_type.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "StaticSemaphore_t", file: !160, line: 991, baseType: !161)
!160 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/os/FreeRTOS/FreeRTOS.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "StaticQueue_t", file: !160, line: 990, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xSTATIC_QUEUE", file: !160, line: 965, size: 640, elements: !163)
!163 = !{!164, !168, !176, !198, !200, !204, !205, !206}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "pvDummy1", scope: !162, file: !160, line: 966, baseType: !165, size: 96)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 96, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 3)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !162, file: !160, line: 971, baseType: !169, size: 32, offset: 96)
!169 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !162, file: !160, line: 968, size: 32, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pvDummy2", scope: !169, file: !160, line: 969, baseType: !151, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "uxDummy2", scope: !169, file: !160, line: 970, baseType: !173, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "UBaseType_t", file: !174, line: 89, baseType: !175)
!174 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/system/os/FreeRTOS/q32s/portmacro.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!175 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "xDummy3", scope: !162, file: !160, line: 973, baseType: !177, size: 320, offset: 128)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 320, elements: !196)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "StaticList_t", file: !160, line: 892, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xSTATIC_LIST", file: !160, line: 888, size: 160, elements: !180)
!180 = !{!181, !182, !183}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "uxDummy1", scope: !179, file: !160, line: 889, baseType: !173, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pvDummy2", scope: !179, file: !160, line: 890, baseType: !151, size: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "xDummy3", scope: !179, file: !160, line: 891, baseType: !184, size: 96, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "StaticMiniListItem_t", file: !160, line: 885, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xSTATIC_MINI_LIST_ITEM", file: !160, line: 881, size: 96, elements: !186)
!186 = !{!187, !194}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "xDummy1", scope: !185, file: !160, line: 882, baseType: !188, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "TickType_t", file: !174, line: 96, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !190, line: 32, baseType: !191)
!190 = !DIFile(filename: "/opt/q32s/include/sys/_stdint.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !192, line: 65, baseType: !193)
!192 = !DIFile(filename: "/opt/q32s/include/machine/_default_types.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!193 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "pvDummy2", scope: !185, file: !160, line: 883, baseType: !195, size: 64, offset: 32)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 64, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 2)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "uxDummy4", scope: !162, file: !160, line: 974, baseType: !199, size: 96, offset: 448)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 96, elements: !166)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ucDummy5", scope: !162, file: !160, line: 975, baseType: !201, size: 16, offset: 544)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 16, elements: !196)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !190, line: 20, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !192, line: 29, baseType: !155)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ucDummy6", scope: !162, file: !160, line: 978, baseType: !202, size: 8, offset: 560)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "uxDummy8", scope: !162, file: !160, line: 986, baseType: !173, size: 32, offset: 576)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ucDummy9", scope: !162, file: !160, line: 987, baseType: !202, size: 8, offset: 608)
!207 = !{!0, !208, !228, !241, !243}
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "btstack_lowpower_target", scope: !2, file: !6, line: 278, type: !210, isLocal: false, isDefinition: true)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lp_target", file: !138, line: 357, size: 96, elements: !212)
!212 = !{!213, !216, !221}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !211, file: !138, line: 358, baseType: !214, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !211, file: !138, line: 359, baseType: !217, size: 32, offset: 32)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "level_handler_t", file: !138, line: 355, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 32)
!219 = !DISubroutineType(types: !220)
!220 = !{!137}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "is_idle", scope: !211, file: !138, line: 360, baseType: !222, size: 32, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "idle_handler_t", file: !138, line: 354, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = !DISubroutineType(types: !225)
!225 = !{!226}
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !227, line: 11, baseType: !155)
!227 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "config", scope: !2, file: !6, line: 181, type: !230, isLocal: true, isDefinition: true)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "hci_transport_config_uart_t", file: !144, line: 199, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 193, size: 160, elements: !232)
!232 = !{!233, !235, !236, !237, !238}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !231, file: !144, line: 194, baseType: !234, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "hci_transport_config_type_t", file: !144, line: 187, baseType: !143)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate_init", scope: !231, file: !144, line: 195, baseType: !189, size: 32, offset: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate_main", scope: !231, file: !144, line: 196, baseType: !189, size: 32, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "flowcontrol", scope: !231, file: !144, line: 197, baseType: !150, size: 32, offset: 96)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "device_name", scope: !231, file: !144, line: 198, baseType: !239, size: 32, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !215)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "is_btstack_lowpower_active", scope: !2, file: !6, line: 42, type: !153, isLocal: true, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "btstack_task_create_flag", scope: !2, file: !6, line: 189, type: !153, isLocal: true, isDefinition: true)
!245 = !DIFile(filename: "../btcommon/profile_stack_debug.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!246 = !{i32 2, !"Dwarf Version", i32 4}
!247 = !{i32 2, !"Debug Info Version", i32 3}
!248 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!249 = distinct !DISubprogram(name: "stack_run_loop_resume", scope: !6, file: !6, line: 52, type: !250, isLocal: false, isDefinition: true, scopeLine: 53, isOptimized: true, unit: !2, variables: !252)
!250 = !DISubroutineType(types: !251)
!251 = !{null}
!252 = !{}
!253 = !DILocation(line: 54, column: 5, scope: !249)
!254 = !DILocation(line: 55, column: 1, scope: !249)
!255 = distinct !DISubprogram(name: "stack_handout_credit", scope: !6, file: !6, line: 58, type: !250, isLocal: false, isDefinition: true, scopeLine: 59, isOptimized: true, unit: !2, variables: !252)
!256 = !DILocation(line: 60, column: 5, scope: !255)
!257 = !DILocation(line: 61, column: 1, scope: !255)
!258 = distinct !DISubprogram(name: "btstack_send_msg_to_stack", scope: !6, file: !6, line: 62, type: !259, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !261)
!259 = !DISubroutineType(types: !260)
!260 = !{!150, !150, !149}
!261 = !{!262, !263}
!262 = !DILocalVariable(name: "argc", arg: 1, scope: !258, file: !6, line: 62, type: !150)
!263 = !DILocalVariable(name: "argv", arg: 2, scope: !258, file: !6, line: 62, type: !149)
!264 = !DILocation(line: 62, column: 35, scope: !258)
!265 = !DILocation(line: 62, column: 46, scope: !258)
!266 = !DILocation(line: 64, column: 12, scope: !258)
!267 = !DILocation(line: 64, column: 5, scope: !258)
!268 = distinct !DISubprogram(name: "btstack_task_init", scope: !6, file: !6, line: 71, type: !250, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !252)
!269 = !DILocation(line: 73, column: 5, scope: !268)
!270 = !DILocation(line: 75, column: 5, scope: !268)
!271 = !DILocation(line: 77, column: 5, scope: !268)
!272 = !DILocation(line: 78, column: 1, scope: !268)
!273 = distinct !DISubprogram(name: "hci_packet_handler", scope: !6, file: !6, line: 146, type: !274, isLocal: false, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !278)
!274 = !DISubroutineType(types: !275)
!275 = !{!150, !153, !152, !276}
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !154, line: 46, baseType: !277)
!277 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!278 = !{!279, !280, !281, !282, !283}
!279 = !DILocalVariable(name: "type", arg: 1, scope: !273, file: !6, line: 146, type: !153)
!280 = !DILocalVariable(name: "packet", arg: 2, scope: !273, file: !6, line: 146, type: !152)
!281 = !DILocalVariable(name: "size", arg: 3, scope: !273, file: !6, line: 146, type: !276)
!282 = !DILocalVariable(name: "err", scope: !273, file: !6, line: 148, type: !150)
!283 = !DILocalVariable(name: "msg", scope: !273, file: !6, line: 149, type: !284)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 64, elements: !196)
