; ModuleID = 'client_user.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/client_user.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.client_ctl_t = type { i32, %struct.le_service_t*, %struct.le_characteristic_t*, i16, i16, i16, i16, %struct.search_result_t, [16 x %struct.le_service_t], [4 x i32] }
%struct.le_service_t = type { i16, i16, i16, [16 x i8] }
%struct.le_characteristic_t = type { i16, i16, i16, i16, i16, [16 x i8] }
%struct.search_result_t = type { %struct.service_report_t, %struct.charact_report_t, i16, i16 }
%struct.service_report_t = type { i16, i16, i16, [16 x i8] }
%struct.charact_report_t = type { i16, i16, i16, i16, i16, [16 x i8] }
%struct.gatt_client_notification = type { %struct.btstack_linked_item, void (i8, i16, i8*, i16)*, i16, i16 }
%struct.btstack_linked_item = type { %struct.btstack_linked_item* }
%struct.att_data_report_t = type { i16, i16, i16, i16, i8*, i16 }

@app_info_debug_enable = weak hidden local_unnamed_addr global i32 0, align 4, !dbg !0
@config_le_gatt_client_num = external local_unnamed_addr constant i32, align 4
@ble_debug_enable = external local_unnamed_addr global i8, align 1
@.str = private unnamed_addr constant [40 x i8] c"[ble-info] :client cbk gatt event %x \0A\0A\00", align 1
@client_s_hdl = internal unnamed_addr global %struct.client_ctl_t* null, section ".bt_stack_bss", align 4, !dbg !79

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "app_info_debug_enable", scope: !2, file: !156, line: 190, type: !157, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !43, globals: !49)
!3 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/client_user.c", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!4 = !{!5, !31}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 41, size: 32, elements: !6)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!7 = !DIEnumerator(name: "TC_IDLE", value: 0)
!8 = !DIEnumerator(name: "TC_W4_SCAN_RESULT", value: 1)
!9 = !DIEnumerator(name: "TC_W4_CONNECT", value: 2)
!10 = !DIEnumerator(name: "TC_W4_ENCRYPTED_CONNECTION", value: 3)
!11 = !DIEnumerator(name: "TC_W4_SERVICE_RESULT", value: 4)
!12 = !DIEnumerator(name: "TC_W4_SERVICE_WITH_UUID_RESULT", value: 5)
!13 = !DIEnumerator(name: "TC_W4_CHARACTERISTIC_RESULT", value: 6)
!14 = !DIEnumerator(name: "TC_W4_CHARACTERISTIC_WITH_UUID_RESULT", value: 7)
!15 = !DIEnumerator(name: "TC_W4_CHARACTERISTIC_DESCRIPTOR_RESULT", value: 8)
!16 = !DIEnumerator(name: "TC_W4_INCLUDED_SERVICE_RESULT", value: 9)
!17 = !DIEnumerator(name: "TC_W4_READ_RESULT", value: 10)
!18 = !DIEnumerator(name: "TC_W4_READ_LONG_RESULT", value: 11)
!19 = !DIEnumerator(name: "TC_W2_WRITE_WITHOUT_RESPONSE", value: 12)
!20 = !DIEnumerator(name: "TC_W4_WRITE_WITHOUT_RESPONSE_SENT", value: 13)
!21 = !DIEnumerator(name: "TC_W4_WRITE_RESULT", value: 14)
!22 = !DIEnumerator(name: "TC_W4_LONG_WRITE_RESULT", value: 15)
!23 = !DIEnumerator(name: "TC_W4_RELIABLE_WRITE_RESULT", value: 16)
!24 = !DIEnumerator(name: "TC_W4_ACC_ENABLE", value: 17)
!25 = !DIEnumerator(name: "TC_W4_ACC_CLIENT_CONFIG_CHARACTERISTIC_RESULT", value: 18)
!26 = !DIEnumerator(name: "TC_W4_ACC_SUBSCRIBE", value: 19)
!27 = !DIEnumerator(name: "TC_W4_ACC_DATA", value: 20)
!28 = !DIEnumerator(name: "TC_W4_DISCONNECT", value: 21)
!29 = !DIEnumerator(name: "TC_DISCONNECTED", value: 22)
!30 = !DIEnumerator(name: "TC_CONNECTED", value: 23)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !32, line: 89, size: 32, elements: !33)
!32 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/le/ble_api.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42}
!34 = !DIEnumerator(name: "BLE_CMD_RET_SUCESS", value: 0)
!35 = !DIEnumerator(name: "BLE_CMD_RET_BUSY", value: -100)
!36 = !DIEnumerator(name: "BLE_CMD_PARAM_OVERFLOW", value: -99)
!37 = !DIEnumerator(name: "BLE_CMD_OPT_FAIL", value: -98)
!38 = !DIEnumerator(name: "BLE_BUFFER_FULL", value: -97)
!39 = !DIEnumerator(name: "BLE_BUFFER_ERROR", value: -96)
!40 = !DIEnumerator(name: "BLE_CMD_PARAM_ERROR", value: -95)
!41 = !DIEnumerator(name: "BLE_CMD_STACK_NOT_RUN", value: -94)
!42 = !DIEnumerator(name: "BLE_CMD_CCC_FAIL", value: -93)
!43 = !{!44, !47, !48}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !45, line: 46, baseType: !46)
!45 = !DIFile(filename: "../btcommon/typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!46 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !45, line: 46, baseType: !46)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!49 = !{!0, !50, !77, !79}
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "common_notification_registration", scope: !2, file: !3, line: 105, type: !52, isLocal: true, isDefinition: true)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "gatt_client_notification_t", file: !53, line: 198, baseType: !54)
!53 = !DIFile(filename: "../btstack/Protocol/include/ble/gatt_client.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gatt_client_notification", file: !53, line: 193, size: 96, elements: !55)
!55 = !{!56, !64, !73, !76}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !54, file: !53, line: 194, baseType: !57, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_item_t", file: !58, line: 100, baseType: !59)
!58 = !DIFile(filename: "../btcommon/btstack_linked_list.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_linked_item_t", file: !58, line: 55, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btstack_linked_item", file: !58, line: 53, size: 32, elements: !61)
!61 = !{!62}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !60, file: !58, line: 54, baseType: !63, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !54, file: !53, line: 195, baseType: !65, size: 32, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_packet_handler_t", file: !66, line: 58, baseType: !67)
!66 = !DIFile(filename: "../btcommon/hci_cmds.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 32)
!68 = !DISubroutineType(types: !69)
!69 = !{null, !70, !44, !72, !44}
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !45, line: 44, baseType: !71)
!71 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "con_handle", scope: !54, file: !53, line: 196, baseType: !74, size: 16, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "hci_con_handle_t", file: !75, line: 60, baseType: !44)
!75 = !DIFile(filename: "../btcommon/utils.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!76 = !DIDerivedType(tag: DW_TAG_member, name: "attribute_handle", scope: !54, file: !53, line: 197, baseType: !44, size: 16, offset: 80)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "gc_search_handle", scope: !2, file: !3, line: 106, type: !74, isLocal: true, isDefinition: true)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "client_s_hdl", scope: !2, file: !3, line: 108, type: !81, isLocal: true, isDefinition: true)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "client_ctl_t", file: !3, line: 103, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 85, size: 3520, elements: !84)
!84 = !{!85, !87, !106, !117, !118, !119, !120, !121, !148, !150}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "tc_state", scope: !83, file: !3, line: 86, baseType: !86, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "tc_state_t", file: !3, line: 75, baseType: !5)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "current_service", scope: !83, file: !3, line: 89, baseType: !88, size: 32, offset: 32)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "le_service_t", file: !90, line: 24, baseType: !91)
!90 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/le/gatt.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !90, line: 19, size: 176, elements: !92)
!92 = !{!93, !98, !99, !100}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "start_group_handle", scope: !91, file: !90, line: 20, baseType: !94, size: 16)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !95, line: 26, baseType: !96)
!95 = !DIFile(filename: "/opt/q32s/include/sys/_stdint.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !97, line: 43, baseType: !46)
!97 = !DIFile(filename: "/opt/q32s/include/machine/_default_types.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!98 = !DIDerivedType(tag: DW_TAG_member, name: "end_group_handle", scope: !91, file: !90, line: 21, baseType: !94, size: 16, offset: 16)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "uuid16", scope: !91, file: !90, line: 22, baseType: !94, size: 16, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "uuid128", scope: !91, file: !90, line: 23, baseType: !101, size: 128, offset: 48)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 128, elements: !104)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !95, line: 20, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !97, line: 29, baseType: !71)
!104 = !{!105}
!105 = !DISubrange(count: 16)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "current_characteristic", scope: !83, file: !3, line: 90, baseType: !107, size: 32, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "le_characteristic_t", file: !90, line: 34, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !90, line: 27, size: 208, elements: !110)
!110 = !{!111, !112, !113, !114, !115, !116}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "start_handle", scope: !109, file: !90, line: 28, baseType: !94, size: 16)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "value_handle", scope: !109, file: !90, line: 29, baseType: !94, size: 16, offset: 16)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "end_handle", scope: !109, file: !90, line: 30, baseType: !94, size: 16, offset: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !109, file: !90, line: 31, baseType: !94, size: 16, offset: 48)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "uuid16", scope: !109, file: !90, line: 32, baseType: !94, size: 16, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "uuid128", scope: !109, file: !90, line: 33, baseType: !101, size: 128, offset: 80)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "service_count", scope: !83, file: !3, line: 96, baseType: !47, size: 16, offset: 96)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "service_index", scope: !83, file: !3, line: 97, baseType: !47, size: 16, offset: 112)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "characteristic_count", scope: !83, file: !3, line: 98, baseType: !47, size: 16, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "characteristic_index", scope: !83, file: !3, line: 99, baseType: !47, size: 16, offset: 144)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "cur_search_info", scope: !83, file: !3, line: 100, baseType: !122, size: 416, offset: 160)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "search_result_t", file: !123, line: 90, baseType: !124)
!123 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/le/att.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 85, size: 416, elements: !125)
!125 = !{!126, !134, !144, !147}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "services", scope: !124, file: !123, line: 86, baseType: !127, size: 176)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "service_report_t", file: !123, line: 64, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 59, size: 176, elements: !129)
!129 = !{!130, !131, !132, !133}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "start_group_handle", scope: !128, file: !123, line: 60, baseType: !94, size: 16)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "end_group_handle", scope: !128, file: !123, line: 61, baseType: !94, size: 16, offset: 16)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "uuid16", scope: !128, file: !123, line: 62, baseType: !94, size: 16, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "uuid128", scope: !128, file: !123, line: 63, baseType: !101, size: 128, offset: 48)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "characteristic", scope: !124, file: !123, line: 87, baseType: !135, size: 208, offset: 176)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "charact_report_t", file: !123, line: 73, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 66, size: 208, elements: !137)
!137 = !{!138, !139, !140, !141, !142, !143}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "start_handle", scope: !136, file: !123, line: 67, baseType: !94, size: 16)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "value_handle", scope: !136, file: !123, line: 68, baseType: !94, size: 16, offset: 16)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "end_handle", scope: !136, file: !123, line: 69, baseType: !94, size: 16, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !136, file: !123, line: 70, baseType: !94, size: 16, offset: 48)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "uuid16", scope: !136, file: !123, line: 71, baseType: !94, size: 16, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "uuid128", scope: !136, file: !123, line: 72, baseType: !101, size: 128, offset: 80)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "service_index", scope: !124, file: !123, line: 88, baseType: !145, size: 16, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !146, line: 13, baseType: !46)
!146 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!147 = !DIDerivedType(tag: DW_TAG_member, name: "characteristic_index", scope: !124, file: !123, line: 89, baseType: !145, size: 16, offset: 400)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "remote_services", scope: !83, file: !3, line: 101, baseType: !149, size: 2816, offset: 576)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 2816, elements: !104)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_buf", scope: !83, file: !3, line: 102, baseType: !151, size: 128, offset: 3392)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 128, elements: !154)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !45, line: 48, baseType: !153)
!153 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!154 = !{!155}
!155 = !DISubrange(count: 4)
!156 = !DIFile(filename: "../btcommon/profile_stack_debug.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!157 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!158 = !{i32 2, !"Dwarf Version", i32 4}
!159 = !{i32 2, !"Debug Info Version", i32 3}
!160 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!161 = distinct !DISubprogram(name: "user_client_report_search_result", scope: !3, file: !3, line: 163, type: !162, isLocal: false, isDefinition: true, scopeLine: 164, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !165)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !164}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!165 = !{!166}
!166 = !DILocalVariable(name: "result_info", arg: 1, scope: !161, file: !3, line: 163, type: !164)
!167 = !DILocation(line: 163, column: 56, scope: !161)
!168 = !DILocation(line: 166, column: 1, scope: !161)
!169 = distinct !DISubprogram(name: "user_client_report_data_callback", scope: !3, file: !3, line: 256, type: !170, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !184)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !172}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_data_report_t", file: !123, line: 82, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 75, size: 128, elements: !175)
!175 = !{!176, !177, !178, !179, !180, !183}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "packet_type", scope: !174, file: !123, line: 76, baseType: !145, size: 16)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "value_handle", scope: !174, file: !123, line: 77, baseType: !145, size: 16, offset: 16)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "value_offset", scope: !174, file: !123, line: 78, baseType: !145, size: 16, offset: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "blob_length", scope: !174, file: !123, line: 79, baseType: !145, size: 16, offset: 48)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !174, file: !123, line: 80, baseType: !181, size: 32, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !146, line: 11, baseType: !71)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "conn_handle", scope: !174, file: !123, line: 81, baseType: !145, size: 16, offset: 96)
!184 = !{!185}
!185 = !DILocalVariable(name: "report_data", arg: 1, scope: !169, file: !3, line: 256, type: !172)
!186 = !DILocation(line: 256, column: 58, scope: !169)
!187 = !DILocation(line: 267, column: 1, scope: !169)
!188 = distinct !DISubprogram(name: "user_client_set_search_complete", scope: !3, file: !3, line: 316, type: !189, isLocal: false, isDefinition: true, scopeLine: 317, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !191)
!189 = !DISubroutineType(types: !190)
!190 = !{null}
!191 = !{}
!192 = !DILocation(line: 318, column: 5, scope: !188)
!193 = !DILocation(line: 319, column: 1, scope: !188)
!194 = distinct !DISubprogram(name: "user_client_search_profile_complete", scope: !3, file: !3, line: 168, type: !189, isLocal: true, isDefinition: true, scopeLine: 169, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !195)
!195 = !{!196}
!196 = !DILocalVariable(name: "mtu", scope: !194, file: !3, line: 174, type: !47)
!197 = !DILocation(line: 170, column: 10, scope: !198)
!198 = distinct !DILexicalBlock(scope: !194, file: !3, line: 170, column: 9)
!199 = !{!200, !200, i64 0}
!200 = !{!"int", !201, i64 0}
!201 = !{!"omnipotent char", !202, i64 0}
!202 = !{!"Simple C/C++ TBAA"}
!203 = !DILocation(line: 170, column: 9, scope: !194)
!204 = !DILocation(line: 174, column: 5, scope: !194)
!205 = !DILocation(line: 175, column: 9, scope: !206)
!206 = distinct !DILexicalBlock(scope: !194, file: !3, line: 175, column: 9)
!207 = !{!208, !208, i64 0}
!208 = !{!"any pointer", !201, i64 0}
!209 = !DILocation(line: 175, column: 17, scope: !206)
!210 = !{!211, !212, i64 12}
!211 = !{!"", !201, i64 0, !208, i64 4, !208, i64 8, !212, i64 12, !212, i64 14, !212, i64 16, !212, i64 18, !213, i64 20, !201, i64 72, !201, i64 424}
!212 = !{!"short", !201, i64 0}
!213 = !{!"", !214, i64 0, !215, i64 22, !212, i64 48, !212, i64 50}
!214 = !{!"", !212, i64 0, !212, i64 2, !212, i64 4, !201, i64 6}
!215 = !{!"", !212, i64 0, !212, i64 2, !212, i64 4, !212, i64 6, !212, i64 8, !201, i64 10}
!216 = !DILocation(line: 175, column: 31, scope: !206)
!217 = !DILocation(line: 175, column: 9, scope: !194)
!218 = !DILocation(line: 176, column: 9, scope: !219)
!219 = distinct !DILexicalBlock(scope: !220, file: !3, line: 176, column: 9)
!220 = distinct !DILexicalBlock(scope: !206, file: !3, line: 175, column: 37)
!221 = !{!201, !201, i64 0}
!222 = !DILocation(line: 176, column: 9, scope: !220)
!223 = !DILocation(line: 176, column: 9, scope: !224)
!224 = !DILexicalBlockFile(scope: !219, file: !3, discriminator: 1)
!225 = !DILocation(line: 179, column: 25, scope: !194)
!226 = !{!212, !212, i64 0}
!227 = !DILocation(line: 174, column: 9, scope: !194)
!228 = !DILocation(line: 179, column: 5, scope: !194)
!229 = !DILocation(line: 180, column: 9, scope: !194)
!230 = !DILocation(line: 181, column: 5, scope: !231)
!231 = distinct !DILexicalBlock(scope: !194, file: !3, line: 181, column: 5)
!232 = !DILocation(line: 181, column: 5, scope: !194)
!233 = !DILocation(line: 181, column: 5, scope: !234)
!234 = !DILexicalBlockFile(scope: !231, file: !3, discriminator: 1)
!235 = !DILocation(line: 182, column: 45, scope: !194)
!236 = !DILocation(line: 182, column: 27, scope: !194)
!237 = !DILocation(line: 182, column: 5, scope: !194)
!238 = !DILocation(line: 183, column: 5, scope: !239)
!239 = distinct !DILexicalBlock(scope: !194, file: !3, line: 183, column: 5)
!240 = !DILocation(line: 183, column: 5, scope: !194)
!241 = !DILocation(line: 183, column: 5, scope: !242)
!242 = !DILexicalBlockFile(scope: !239, file: !3, discriminator: 1)
!243 = !DILocation(line: 184, column: 5, scope: !194)
!244 = !DILocation(line: 185, column: 5, scope: !194)
!245 = !DILocation(line: 185, column: 13, scope: !194)
!246 = !DILocation(line: 185, column: 22, scope: !194)
!247 = !{!211, !201, i64 0}
!248 = !DILocation(line: 186, column: 22, scope: !194)
