; ModuleID = 'database_file.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/database_file.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.syscfg_file = type { i32 (i32, i32)*, i32 (i8*, i32)*, i32 (i8*, i32)*, i32 (i32, i32)*, i32 (...)* }
%struct.db_entry_t = type { i8, i8 }
%struct.database_file = type { i32 (...)*, void (...)*, i32 (i8*, i32, i32)*, i32 (i8*, i32, i32)*, void (i32, i32)*, i32 ()*, i32 (...)* }

@dbf_syscfg_remote_db_addr = internal unnamed_addr global i32 0, section ".bt_stack_data", align 4, !dbg !0
@dbf_bt_rw_file = internal unnamed_addr global %struct.syscfg_file* null, section ".bt_stack_data", align 4, !dbg !39
@dbf_entry_info = hidden local_unnamed_addr global [3 x %struct.db_entry_t] [%struct.db_entry_t { i8 0, i8 10 }, %struct.db_entry_t { i8 10, i8 10 }, %struct.db_entry_t { i8 20, i8 1 }], section ".bt_stack_data", align 1, !dbg !26
@dbf_remote_db_file = internal constant %struct.database_file { i32 (...)* bitcast (i32 ()* @db_file_open to i32 (...)*), void (...)* bitcast (void ()* @db_file_close to void (...)*), i32 (i8*, i32, i32)* @db_file_read, i32 (i8*, i32, i32)* @db_file_write, void (i32, i32)* @db_file_seek, i32 ()* @db_file_getlen, i32 (...)* bitcast (i32 (i32)* @db_file_fptr to i32 (...)*) }, section ".bt_stack_const", align 4, !dbg !41

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dbf_syscfg_remote_db_addr", scope: !2, file: !3, line: 28, type: !56, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !25)
!3 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/database_file.c", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!4 = !{}
!5 = !{!6, !18}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syscfg_file", file: !3, line: 17, size: 160, elements: !8)
!8 = !{!9, !14, !19, !20, !21}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !7, file: !3, line: 18, baseType: !10, size: 32)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 32)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !13, !13}
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !7, file: !3, line: 19, baseType: !15, size: 32, offset: 32)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 32)
!16 = !DISubroutineType(types: !17)
!17 = !{!13, !18, !13}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !7, file: !3, line: 20, baseType: !15, size: 32, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !7, file: !3, line: 21, baseType: !10, size: 32, offset: 96)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !7, file: !3, line: 22, baseType: !22, size: 32, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 32)
!23 = !DISubroutineType(types: !24)
!24 = !{!13, null}
!25 = !{!26, !0, !39, !41, !68}
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "dbf_entry_info", scope: !2, file: !3, line: 57, type: !28, isLocal: false, isDefinition: true)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 48, elements: !37)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "db_entry_t", file: !3, line: 52, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 49, size: 16, elements: !31)
!31 = !{!32, !36}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !30, file: !3, line: 50, baseType: !33, size: 8)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !34, line: 44, baseType: !35)
!34 = !DIFile(filename: "../btcommon/typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!35 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !30, file: !3, line: 51, baseType: !33, size: 8, offset: 8)
!37 = !{!38}
!38 = !DISubrange(count: 3)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "dbf_bt_rw_file", scope: !2, file: !3, line: 24, type: !6, isLocal: true, isDefinition: true)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "dbf_remote_db_file", scope: !2, file: !3, line: 156, type: !43, isLocal: true, isDefinition: true)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "database_file", file: !45, line: 47, size: 224, elements: !46)
!45 = !DIFile(filename: "../User/include/bredr/remote_device_db.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!46 = !{!47, !48, !52, !58, !59, !63, !67}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !44, file: !45, line: 48, baseType: !22, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !44, file: !45, line: 49, baseType: !49, size: 32, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 32)
!50 = !DISubroutineType(types: !51)
!51 = !{null, null}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !44, file: !45, line: 50, baseType: !53, size: 32, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 32)
!54 = !DISubroutineType(types: !55)
!55 = !{!13, !18, !13, !56}
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !34, line: 48, baseType: !57)
!57 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !44, file: !45, line: 51, baseType: !53, size: 32, offset: 96)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !44, file: !45, line: 52, baseType: !60, size: 32, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 32)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !13, !13}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "getlen", scope: !44, file: !45, line: 53, baseType: !64, size: 32, offset: 160)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 32)
!65 = !DISubroutineType(types: !66)
!66 = !{!13}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "get_fpos", scope: !44, file: !45, line: 54, baseType: !22, size: 32, offset: 192)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "dbf_fptr", scope: !2, file: !3, line: 29, type: !70, isLocal: true, isDefinition: true)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !34, line: 46, baseType: !71)
!71 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!72 = !{i32 2, !"Dwarf Version", i32 4}
!73 = !{i32 2, !"Debug Info Version", i32 3}
!74 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!75 = distinct !DISubprogram(name: "set_bt_vm_interface", scope: !3, file: !3, line: 31, type: !76, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !78)
!76 = !DISubroutineType(types: !77)
!77 = !{null, !56, !18}
!78 = !{!79, !80}
!79 = !DILocalVariable(name: "vm_index", arg: 1, scope: !75, file: !3, line: 31, type: !56)
!80 = !DILocalVariable(name: "interface", arg: 2, scope: !75, file: !3, line: 31, type: !18)
!81 = !DILocation(line: 31, column: 30, scope: !75)
!82 = !DILocation(line: 31, column: 46, scope: !75)
!83 = !DILocation(line: 34, column: 31, scope: !75)
!84 = !{!85, !85, i64 0}
!85 = !{!"int", !86, i64 0}
!86 = !{!"omnipotent char", !87, i64 0}
!87 = !{!"Simple C/C++ TBAA"}
!88 = !DILocation(line: 35, column: 20, scope: !75)
!89 = !{!90, !90, i64 0}
!90 = !{!"any pointer", !86, i64 0}
!91 = !DILocation(line: 37, column: 1, scope: !75)
!92 = distinct !DISubprogram(name: "open_remote_db_file_opt", scope: !3, file: !3, line: 166, type: !93, isLocal: false, isDefinition: true, scopeLine: 167, isOptimized: true, unit: !2, variables: !4)
!93 = !DISubroutineType(types: !94)
!94 = !{!95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 32)
!96 = !DILocation(line: 168, column: 5, scope: !92)
!97 = distinct !DISubprogram(name: "db_file_read", scope: !3, file: !3, line: 62, type: !54, isLocal: true, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !98)
!98 = !{!99, !100, !101, !102, !103, !104, !107, !108}
!99 = !DILocalVariable(name: "buf", arg: 1, scope: !97, file: !3, line: 62, type: !18)
!100 = !DILocalVariable(name: "len", arg: 2, scope: !97, file: !3, line: 62, type: !13)
!101 = !DILocalVariable(name: "db_id", arg: 3, scope: !97, file: !3, line: 62, type: !56)
!102 = !DILocalVariable(name: "db_len", scope: !97, file: !3, line: 64, type: !33)
!103 = !DILocalVariable(name: "db_offset", scope: !97, file: !3, line: 65, type: !33)
!104 = !DILocalVariable(name: "pos", scope: !105, file: !3, line: 79, type: !13)
!105 = distinct !DILexicalBlock(scope: !106, file: !3, line: 78, column: 33)
!106 = distinct !DILexicalBlock(scope: !97, file: !3, line: 78, column: 9)
!107 = !DILocalVariable(name: "tag_len", scope: !105, file: !3, line: 80, type: !56)
!108 = !DILocalVariable(name: "tag_id", scope: !105, file: !3, line: 81, type: !56)
!109 = !DILocation(line: 62, column: 31, scope: !97)
!110 = !DILocation(line: 62, column: 40, scope: !97)
!111 = !DILocation(line: 62, column: 49, scope: !97)
!112 = !DILocation(line: 64, column: 8, scope: !97)
!113 = !DILocation(line: 65, column: 8, scope: !97)
!114 = !DILocation(line: 66, column: 15, scope: !115)
!115 = distinct !DILexicalBlock(scope: !97, file: !3, line: 66, column: 9)
!116 = !DILocation(line: 66, column: 9, scope: !97)
!117 = !DILocation(line: 69, column: 17, scope: !97)
!118 = !DILocation(line: 69, column: 67, scope: !97)
!119 = !{!120, !86, i64 0}
!120 = !{!"", !86, i64 0, !86, i64 1}
!121 = !DILocation(line: 69, column: 45, scope: !97)
!122 = !DILocation(line: 69, column: 43, scope: !97)
!123 = !DILocation(line: 70, column: 36, scope: !97)
!124 = !{!120, !86, i64 1}
