temp.o:	file format ELF32-i386

.debug_info contents:
0x00000000: Compile Unit: length = 0x000041ae version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x000041b2)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)")
              DW_AT_language	(DW_LANG_C99)
              DW_AT_name	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
              DW_AT_GNU_pubnames	(true)
              DW_AT_low_pc	(0x0000000000000000)
              DW_AT_ranges	(0x000000f0
                 [0x00000000 - 0x0000490d)
                 [0x0000490d - 0x00005a97)
                 [0x00000000 - 0x00000008))

0x00000026:   DW_TAG_variable
                DW_AT_name	("app_info_debug_enable")
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/profile_stack_debug.h")
                DW_AT_decl_line	(190)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000037:   DW_TAG_base_type
                DW_AT_name	("int")
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_byte_size	(0x04)

0x0000003e:   DW_TAG_variable
                DW_AT_name	("gatt_client_global_info")
                DW_AT_type	(cu + 0x004f "gatt_client_info_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(81)
                DW_AT_location	(DW_OP_addr 0x0)

0x0000004f:   DW_TAG_typedef
                DW_AT_type	(cu + 0x005a "structure ")
                DW_AT_name	("gatt_client_info_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(79)

0x0000005a:   DW_TAG_structure_type
                DW_AT_byte_size	(0x18)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(73)

0x0000005e:     DW_TAG_member
                  DW_AT_name	("connections")
                  DW_AT_type	(cu + 0x009b "btstack_linked_list_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(74)
                  DW_AT_data_member_location	(0x00)

0x0000006a:     DW_TAG_member
                  DW_AT_name	("value_listeners")
                  DW_AT_type	(cu + 0x009b "btstack_linked_list_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(75)
                  DW_AT_data_member_location	(0x04)

0x00000076:     DW_TAG_member
                  DW_AT_name	("hci_event_callback_registration")
                  DW_AT_type	(cu + 0x00d0 "btstack_packet_callback_registration_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(76)
                  DW_AT_data_member_location	(0x08)

0x00000082:     DW_TAG_member
                  DW_AT_name	("packer_handler")
                  DW_AT_type	(cu + 0x0103 "btstack_packet_handler_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(77)
                  DW_AT_data_member_location	(0x10)

0x0000008e:     DW_TAG_member
                  DW_AT_name	("pts_suppress_mtu_exchange")
                  DW_AT_type	(cu + 0x0129 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(78)
                  DW_AT_data_member_location	(0x14)

0x0000009a:     NULL

0x0000009b:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00a6 "btstack_linked_item_t*")
                DW_AT_name	("btstack_linked_list_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(58)

0x000000a6:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x00ab "btstack_linked_item_t")

0x000000ab:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00b6 "btstack_linked_item")
                DW_AT_name	("btstack_linked_item_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(55)

0x000000b6:   DW_TAG_structure_type
                DW_AT_name	("btstack_linked_item")
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(53)

0x000000be:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(cu + 0x00cb "btstack_linked_item*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                  DW_AT_decl_line	(54)
                  DW_AT_data_member_location	(0x00)

0x000000ca:     NULL

0x000000cb:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x00b6 "btstack_linked_item")

0x000000d0:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00db "structure ")
                DW_AT_name	("btstack_packet_callback_registration_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(64)

0x000000db:   DW_TAG_structure_type
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(61)

0x000000df:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x00f8 "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                  DW_AT_decl_line	(62)
                  DW_AT_data_member_location	(0x00)

0x000000eb:     DW_TAG_member
                  DW_AT_name	("callback")
                  DW_AT_type	(cu + 0x0103 "btstack_packet_handler_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                  DW_AT_decl_line	(63)
                  DW_AT_data_member_location	(0x04)

0x000000f7:     NULL

0x000000f8:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00ab "btstack_linked_item_t")
                DW_AT_name	("linked_item_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(100)

0x00000103:   DW_TAG_typedef
                DW_AT_type	(cu + 0x010e "subroutine *")
                DW_AT_name	("btstack_packet_handler_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(58)

0x0000010e:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0113 "subroutine ")

0x00000113:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x00000114:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0129 "uint8_t")

0x00000119:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x0000011e:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x014d "uint8_t*")

0x00000123:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x00000128:     NULL

0x00000129:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0134 "unsigned char")
                DW_AT_name	("uint8_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(44)

0x00000134:   DW_TAG_base_type
                DW_AT_name	("unsigned char")
                DW_AT_encoding	(DW_ATE_unsigned_char)
                DW_AT_byte_size	(0x01)

0x0000013b:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0146 "unsigned short")
                DW_AT_name	("uint16_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(46)

0x00000146:   DW_TAG_base_type
                DW_AT_name	("unsigned short")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x02)

0x0000014d:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0129 "uint8_t")

0x00000152:   DW_TAG_variable
                DW_AT_name	("characteristic_value_event_header_size")
                DW_AT_type	(cu + 0x015f "const int")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(826)
                DW_AT_const_value	(8)

0x0000015f:   DW_TAG_const_type
                DW_AT_type	(cu + 0x0037 "int")

0x00000164:   DW_TAG_variable
                DW_AT_name	("long_characteristic_value_event_header_size")
                DW_AT_type	(cu + 0x015f "const int")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(841)
                DW_AT_const_value	(10)

0x00000171:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                DW_AT_decl_line	(49)

0x00000175:     DW_TAG_enumerator
                  DW_AT_name	("P_READY")
                  DW_AT_const_value	(0)

0x0000017b:     DW_TAG_enumerator
                  DW_AT_name	("P_W2_SEND_SERVICE_QUERY")
                  DW_AT_const_value	(1)

0x00000181:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_SERVICE_QUERY_RESULT")
                  DW_AT_const_value	(2)

0x00000187:     DW_TAG_enumerator
                  DW_AT_name	("P_W2_SEND_SERVICE_WITH_UUID_QUERY")
                  DW_AT_const_value	(3)

0x0000018d:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_SERVICE_WITH_UUID_RESULT")
                  DW_AT_const_value	(4)

0x00000193:     DW_TAG_enumerator
                  DW_AT_name	("P_W2_SEND_ALL_CHARACTERISTICS_OF_SERVICE_QUERY")
                  DW_AT_const_value	(5)

0x00000199:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_ALL_CHARACTERISTICS_OF_SERVICE_QUERY_RESULT")
                  DW_AT_const_value	(6)

0x0000019f:     DW_TAG_enumerator
                  DW_AT_name	("P_W2_SEND_CHARACTERISTIC_WITH_UUID_QUERY")
                  DW_AT_const_value	(7)

0x000001a5:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_CHARACTERISTIC_WITH_UUID_QUERY_RESULT")
                  DW_AT_const_value	(8)

0x000001ab:     DW_TAG_enumerator
                  DW_AT_name	("P_W2_SEND_ALL_CHARACTERISTIC_DESCRIPTORS_QUERY")
                  DW_AT_const_value	(9)

0x000001b1:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_ALL_CHARACTERISTIC_DESCRIPTORS_QUERY_RESULT")
                  DW_AT_const_value	(10)

0x000001b7:     DW_TAG_enumerator
                  DW_AT_name	("P_W2_SEND_INCLUDED_SERVICE_QUERY")
                  DW_AT_const_value	(11)

0x000001bd:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_INCLUDED_SERVICE_QUERY_RESULT")
                  DW_AT_const_value	(12)

0x000001c3:     DW_TAG_enumerator
                  DW_AT_name	("P_W2_SEND_INCLUDED_SERVICE_WITH_UUID_QUERY")
                  DW_AT_const_value	(13)

0x000001c9:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_INCLUDED_SERVICE_UUID_WITH_QUERY_RESULT")
                  DW_AT_const_value	(14)

0x000001cf:     DW_TAG_enumerator
                  DW_AT_name	("P_W2_SEND_READ_CHARACTERISTIC_VALUE_QUERY")
                  DW_AT_const_value	(15)

0x000001d5:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_READ_CHARACTERISTIC_VALUE_RESULT")
                  DW_AT_const_value	(16)

0x000001db:     DW_TAG_enumerator
                  DW_AT_name	("P_W2_SEND_READ_BLOB_QUERY")
                  DW_AT_const_value	(17)

0x000001e1:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_READ_BLOB_RESULT")
                  DW_AT_const_value	(18)

0x000001e7:     DW_TAG_enumerator
                  DW_AT_name	("P_W2_SEND_READ_BY_TYPE_REQUEST")
                  DW_AT_const_value	(19)

0x000001ed:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_READ_BY_TYPE_RESPONSE")
                  DW_AT_const_value	(20)

0x000001f3:     DW_TAG_enumerator
                  DW_AT_name	("P_W2_SEND_READ_MULTIPLE_REQUEST")
                  DW_AT_const_value	(21)

0x000001f9:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_READ_MULTIPLE_RESPONSE")
                  DW_AT_const_value	(22)

0x000001ff:     DW_TAG_enumerator
                  DW_AT_name	("P_W2_SEND_WRITE_CHARACTERISTIC_VALUE")
                  DW_AT_const_value	(23)

0x00000205:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_WRITE_CHARACTERISTIC_VALUE_RESULT")
                  DW_AT_const_value	(24)

0x0000020b:     DW_TAG_enumerator
                  DW_AT_name	("P_W2_PREPARE_WRITE")
                  DW_AT_const_value	(25)

0x00000211:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_PREPARE_WRITE_RESULT")
                  DW_AT_const_value	(26)

0x00000217:     DW_TAG_enumerator
                  DW_AT_name	("P_W2_PREPARE_RELIABLE_WRITE")
                  DW_AT_const_value	(27)

0x0000021d:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_PREPARE_RELIABLE_WRITE_RESULT")
                  DW_AT_const_value	(28)

0x00000223:     DW_TAG_enumerator
                  DW_AT_name	("P_W2_EXECUTE_PREPARED_WRITE")
                  DW_AT_const_value	(29)

0x00000229:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_EXECUTE_PREPARED_WRITE_RESULT")
                  DW_AT_const_value	(30)

0x0000022f:     DW_TAG_enumerator
                  DW_AT_name	("P_W2_CANCEL_PREPARED_WRITE")
                  DW_AT_const_value	(31)

0x00000235:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_CANCEL_PREPARED_WRITE_RESULT")
                  DW_AT_const_value	(32)

0x0000023b:     DW_TAG_enumerator
                  DW_AT_name	("P_W2_CANCEL_PREPARED_WRITE_DATA_MISMATCH")
                  DW_AT_const_value	(33)

0x00000241:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_CANCEL_PREPARED_WRITE_DATA_MISMATCH_RESULT")
                  DW_AT_const_value	(34)

0x00000247:     DW_TAG_enumerator
                  DW_AT_name	("P_W2_SEND_READ_CLIENT_CHARACTERISTIC_CONFIGURATION_QUERY")
                  DW_AT_const_value	(35)

0x0000024d:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_READ_CLIENT_CHARACTERISTIC_CONFIGURATION_QUERY_RESULT")
                  DW_AT_const_value	(36)

0x00000253:     DW_TAG_enumerator
                  DW_AT_name	("P_W2_WRITE_CLIENT_CHARACTERISTIC_CONFIGURATION")
                  DW_AT_const_value	(37)

0x00000259:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_CLIENT_CHARACTERISTIC_CONFIGURATION_RESULT")
                  DW_AT_const_value	(38)

0x0000025f:     DW_TAG_enumerator
                  DW_AT_name	("P_W2_SEND_READ_CHARACTERISTIC_DESCRIPTOR_QUERY")
                  DW_AT_const_value	(39)

0x00000265:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_READ_CHARACTERISTIC_DESCRIPTOR_RESULT")
                  DW_AT_const_value	(40)

0x0000026b:     DW_TAG_enumerator
                  DW_AT_name	("P_W2_SEND_READ_BLOB_CHARACTERISTIC_DESCRIPTOR_QUERY")
                  DW_AT_const_value	(41)

0x00000271:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_READ_BLOB_CHARACTERISTIC_DESCRIPTOR_RESULT")
                  DW_AT_const_value	(42)

0x00000277:     DW_TAG_enumerator
                  DW_AT_name	("P_W2_SEND_WRITE_CHARACTERISTIC_DESCRIPTOR")
                  DW_AT_const_value	(43)

0x0000027d:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_WRITE_CHARACTERISTIC_DESCRIPTOR_RESULT")
                  DW_AT_const_value	(44)

0x00000283:     DW_TAG_enumerator
                  DW_AT_name	("P_W2_PREPARE_WRITE_CHARACTERISTIC_DESCRIPTOR")
                  DW_AT_const_value	(45)

0x00000289:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_PREPARE_WRITE_CHARACTERISTIC_DESCRIPTOR_RESULT")
                  DW_AT_const_value	(46)

0x0000028f:     DW_TAG_enumerator
                  DW_AT_name	("P_W2_EXECUTE_PREPARED_WRITE_CHARACTERISTIC_DESCRIPTOR")
                  DW_AT_const_value	(47)

0x00000295:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_EXECUTE_PREPARED_WRITE_CHARACTERISTIC_DESCRIPTOR_RESULT")
                  DW_AT_const_value	(48)

0x0000029b:     DW_TAG_enumerator
                  DW_AT_name	("P_W2_PREPARE_WRITE_SINGLE")
                  DW_AT_const_value	(49)

0x000002a1:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_PREPARE_WRITE_SINGLE_RESULT")
                  DW_AT_const_value	(50)

0x000002a7:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_CMAC_READY")
                  DW_AT_const_value	(51)

0x000002ad:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_CMAC_RESULT")
                  DW_AT_const_value	(52)

0x000002b3:     DW_TAG_enumerator
                  DW_AT_name	("P_W2_SEND_SIGNED_WRITE")
                  DW_AT_const_value	(53)

0x000002b9:     DW_TAG_enumerator
                  DW_AT_name	("P_W4_SEND_SINGED_WRITE_DONE")
                  DW_AT_const_value	(54)

0x000002bf:     NULL

0x000002c0:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                DW_AT_decl_line	(127)

0x000002c4:     DW_TAG_enumerator
                  DW_AT_name	("SEND_MTU_EXCHANGE")
                  DW_AT_const_value	(0)

0x000002ca:     DW_TAG_enumerator
                  DW_AT_name	("SENT_MTU_EXCHANGE")
                  DW_AT_const_value	(1)

0x000002d0:     DW_TAG_enumerator
                  DW_AT_name	("MTU_EXCHANGED")
                  DW_AT_const_value	(2)

0x000002d6:     DW_TAG_enumerator
                  DW_AT_name	("SEND_MTU_EXCHANGED_RSP")
                  DW_AT_const_value	(3)

0x000002dc:     NULL

0x000002dd:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                DW_AT_decl_line	(134)

0x000002e1:     DW_TAG_enumerator
                  DW_AT_name	("SEND_RSP_NULL")
                  DW_AT_const_value	(0)

0x000002e7:     DW_TAG_enumerator
                  DW_AT_name	("SEND_RSP_ERROR")
                  DW_AT_const_value	(1)

0x000002ed:     NULL

0x000002ee:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(1342)

0x000002f3:     DW_TAG_enumerator
                  DW_AT_name	("BLE_PERIPHERAL_OK")
                  DW_AT_const_value	(160)

0x000002fa:     DW_TAG_enumerator
                  DW_AT_name	("BLE_PERIPHERAL_IN_WRONG_STATE")
                  DW_AT_const_value	(161)

0x00000301:     DW_TAG_enumerator
                  DW_AT_name	("BLE_PERIPHERAL_DIFFERENT_CONTEXT_FOR_ADDRESS_ALREADY_EXISTS")
                  DW_AT_const_value	(162)

0x00000308:     DW_TAG_enumerator
                  DW_AT_name	("BLE_PERIPHERAL_NOT_CONNECTED")
                  DW_AT_const_value	(163)

0x0000030f:     DW_TAG_enumerator
                  DW_AT_name	("BLE_VALUE_TOO_LONG")
                  DW_AT_const_value	(164)

0x00000316:     DW_TAG_enumerator
                  DW_AT_name	("BLE_PERIPHERAL_BUSY")
                  DW_AT_const_value	(165)

0x0000031d:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CHARACTERISTIC_NOTIFICATION_NOT_SUPPORTED")
                  DW_AT_const_value	(166)

0x00000324:     DW_TAG_enumerator
                  DW_AT_name	("BLE_CHARACTERISTIC_INDICATION_NOT_SUPPORTED")
                  DW_AT_const_value	(167)

0x0000032b:     NULL

0x0000032c:   DW_TAG_typedef
                DW_AT_type	(cu + 0x02ee "enumeration ")
                DW_AT_name	("le_command_status_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(1351)

0x00000338:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x00f8 "linked_item_t")

0x0000033d:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0342 "gatt_client_notification_t")

0x00000342:   DW_TAG_typedef
                DW_AT_type	(cu + 0x034d "gatt_client_notification")
                DW_AT_name	("gatt_client_notification_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                DW_AT_decl_line	(198)

0x0000034d:   DW_TAG_structure_type
                DW_AT_name	("gatt_client_notification")
                DW_AT_byte_size	(0x0c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                DW_AT_decl_line	(193)

0x00000355:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x00f8 "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(194)
                  DW_AT_data_member_location	(0x00)

0x00000361:     DW_TAG_member
                  DW_AT_name	("callback")
                  DW_AT_type	(cu + 0x0103 "btstack_packet_handler_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(195)
                  DW_AT_data_member_location	(0x04)

0x0000036d:     DW_TAG_member
                  DW_AT_name	("con_handle")
                  DW_AT_type	(cu + 0x0386 "hci_con_handle_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(196)
                  DW_AT_data_member_location	(0x08)

0x00000379:     DW_TAG_member
                  DW_AT_name	("attribute_handle")
                  DW_AT_type	(cu + 0x013b "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(197)
                  DW_AT_data_member_location	(0x0a)

0x00000385:     NULL

0x00000386:   DW_TAG_typedef
                DW_AT_type	(cu + 0x013b "uint16_t")
                DW_AT_name	("hci_con_handle_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h")
                DW_AT_decl_line	(9)

0x00000391:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0396 "gatt_client_t")

0x00000396:   DW_TAG_typedef
                DW_AT_type	(cu + 0x03a1 "gatt_client")
                DW_AT_name	("gatt_client_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                DW_AT_decl_line	(191)

0x000003a1:   DW_TAG_structure_type
                DW_AT_name	("gatt_client")
                DW_AT_byte_size	(0x80)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                DW_AT_decl_line	(140)

0x000003a9:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x00f8 "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(141)
                  DW_AT_data_member_location	(0x00)

0x000003b5:     DW_TAG_member
                  DW_AT_name	("gatt_client_state")
                  DW_AT_type	(cu + 0x052a "gatt_client_state_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(143)
                  DW_AT_data_member_location	(0x04)

0x000003c1:     DW_TAG_member
                  DW_AT_name	("callback")
                  DW_AT_type	(cu + 0x0103 "btstack_packet_handler_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(146)
                  DW_AT_data_member_location	(0x08)

0x000003cd:     DW_TAG_member
                  DW_AT_name	("con_handle")
                  DW_AT_type	(cu + 0x0386 "hci_con_handle_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(148)
                  DW_AT_data_member_location	(0x0c)

0x000003d9:     DW_TAG_member
                  DW_AT_name	("address_type")
                  DW_AT_type	(cu + 0x0129 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(150)
                  DW_AT_data_member_location	(0x0e)

0x000003e5:     DW_TAG_member
                  DW_AT_name	("address")
                  DW_AT_type	(cu + 0x0535 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(151)
                  DW_AT_data_member_location	(0x0f)

0x000003f1:     DW_TAG_member
                  DW_AT_name	("mtu")
                  DW_AT_type	(cu + 0x013b "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(152)
                  DW_AT_data_member_location	(0x16)

0x000003fd:     DW_TAG_member
                  DW_AT_name	("mtu_state")
                  DW_AT_type	(cu + 0x0553 "gatt_client_mtu_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(153)
                  DW_AT_data_member_location	(0x18)

0x00000409:     DW_TAG_member
                  DW_AT_name	("uuid16")
                  DW_AT_type	(cu + 0x013b "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(155)
                  DW_AT_data_member_location	(0x1c)

0x00000415:     DW_TAG_member
                  DW_AT_name	("uuid128")
                  DW_AT_type	(cu + 0x055e "uint8_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(156)
                  DW_AT_data_member_location	(0x1e)

0x00000421:     DW_TAG_member
                  DW_AT_name	("start_group_handle")
                  DW_AT_type	(cu + 0x013b "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(158)
                  DW_AT_data_member_location	(0x2e)

0x0000042d:     DW_TAG_member
                  DW_AT_name	("end_group_handle")
                  DW_AT_type	(cu + 0x013b "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(159)
                  DW_AT_data_member_location	(0x30)

0x00000439:     DW_TAG_member
                  DW_AT_name	("query_start_handle")
                  DW_AT_type	(cu + 0x013b "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(161)
                  DW_AT_data_member_location	(0x32)

0x00000445:     DW_TAG_member
                  DW_AT_name	("query_end_handle")
                  DW_AT_type	(cu + 0x013b "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(162)
                  DW_AT_data_member_location	(0x34)

0x00000451:     DW_TAG_member
                  DW_AT_name	("characteristic_properties")
                  DW_AT_type	(cu + 0x0129 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(164)
                  DW_AT_data_member_location	(0x36)

0x0000045d:     DW_TAG_member
                  DW_AT_name	("characteristic_start_handle")
                  DW_AT_type	(cu + 0x013b "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(165)
                  DW_AT_data_member_location	(0x38)

0x00000469:     DW_TAG_member
                  DW_AT_name	("attribute_handle")
                  DW_AT_type	(cu + 0x013b "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(167)
                  DW_AT_data_member_location	(0x3a)

0x00000475:     DW_TAG_member
                  DW_AT_name	("attribute_offset")
                  DW_AT_type	(cu + 0x013b "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(168)
                  DW_AT_data_member_location	(0x3c)

0x00000481:     DW_TAG_member
                  DW_AT_name	("attribute_length")
                  DW_AT_type	(cu + 0x013b "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(169)
                  DW_AT_data_member_location	(0x3e)

0x0000048d:     DW_TAG_member
                  DW_AT_name	("attribute_value")
                  DW_AT_type	(cu + 0x014d "uint8_t*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(170)
                  DW_AT_data_member_location	(0x40)

0x00000499:     DW_TAG_member
                  DW_AT_name	("read_multiple_handle_count")
                  DW_AT_type	(cu + 0x013b "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(173)
                  DW_AT_data_member_location	(0x44)

0x000004a5:     DW_TAG_member
                  DW_AT_name	("read_multiple_handles")
                  DW_AT_type	(cu + 0x056a "uint16_t*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(174)
                  DW_AT_data_member_location	(0x48)

0x000004b1:     DW_TAG_member
                  DW_AT_name	("client_characteristic_configuration_handle")
                  DW_AT_type	(cu + 0x013b "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(176)
                  DW_AT_data_member_location	(0x4c)

0x000004bd:     DW_TAG_member
                  DW_AT_name	("client_characteristic_configuration_value")
                  DW_AT_type	(cu + 0x056f "uint8_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(177)
                  DW_AT_data_member_location	(0x4e)

0x000004c9:     DW_TAG_member
                  DW_AT_name	("filter_with_uuid")
                  DW_AT_type	(cu + 0x0129 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(179)
                  DW_AT_data_member_location	(0x50)

0x000004d5:     DW_TAG_member
                  DW_AT_name	("send_confirmation")
                  DW_AT_type	(cu + 0x0129 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(180)
                  DW_AT_data_member_location	(0x51)

0x000004e1:     DW_TAG_member
                  DW_AT_name	("le_device_index")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(182)
                  DW_AT_data_member_location	(0x54)

0x000004ed:     DW_TAG_member
                  DW_AT_name	("cmac")
                  DW_AT_type	(cu + 0x057b "uint8_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(183)
                  DW_AT_data_member_location	(0x58)

0x000004f9:     DW_TAG_member
                  DW_AT_name	("gc_timeout")
                  DW_AT_type	(cu + 0x0587 "btstack_timer_source_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(185)
                  DW_AT_data_member_location	(0x60)

0x00000505:     DW_TAG_member
                  DW_AT_name	("rsp_state")
                  DW_AT_type	(cu + 0x063a "gatt_client_rsp_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(188)
                  DW_AT_data_member_location	(0x74)

0x00000511:     DW_TAG_member
                  DW_AT_name	("send_packet_buffer")
                  DW_AT_type	(cu + 0x0645 "uint8_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(189)
                  DW_AT_data_member_location	(0x78)

0x0000051d:     DW_TAG_member
                  DW_AT_name	("send_packet_len")
                  DW_AT_type	(cu + 0x0129 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                  DW_AT_decl_line	(190)
                  DW_AT_data_member_location	(0x7f)

0x00000529:     NULL

0x0000052a:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0171 "enumeration ")
                DW_AT_name	("gatt_client_state_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                DW_AT_decl_line	(124)

0x00000535:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0540 "uint8_t[]")
                DW_AT_name	("bd_addr_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h")
                DW_AT_decl_line	(7)

0x00000540:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0129 "uint8_t")

0x00000545:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x054c "sizetype")
                  DW_AT_count	(0x06)

0x0000054b:     NULL

0x0000054c:   DW_TAG_base_type
                DW_AT_name	("sizetype")
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_unsigned)

0x00000553:   DW_TAG_typedef
                DW_AT_type	(cu + 0x02c0 "enumeration ")
                DW_AT_name	("gatt_client_mtu_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                DW_AT_decl_line	(132)

0x0000055e:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0129 "uint8_t")

0x00000563:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x054c "sizetype")
                  DW_AT_count	(0x10)

0x00000569:     NULL

0x0000056a:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x013b "uint16_t")

0x0000056f:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0129 "uint8_t")

0x00000574:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x054c "sizetype")
                  DW_AT_count	(0x02)

0x0000057a:     NULL

0x0000057b:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0129 "uint8_t")

0x00000580:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x054c "sizetype")
                  DW_AT_count	(0x08)

0x00000586:     NULL

0x00000587:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0592 "btstack_timer_source")
                DW_AT_name	("btstack_timer_source_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                DW_AT_decl_line	(19)

0x00000592:   DW_TAG_structure_type
                DW_AT_name	("btstack_timer_source")
                DW_AT_byte_size	(0x14)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                DW_AT_decl_line	(7)

0x0000059a:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x00ab "btstack_linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(8)
                  DW_AT_data_member_location	(0x00)

0x000005a6:     DW_TAG_member
                  DW_AT_name	("timeout")
                  DW_AT_type	(cu + 0x0616 "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(10)
                  DW_AT_data_member_location	(0x04)

0x000005b2:     DW_TAG_member
                  DW_AT_name	("timeout_interval")
                  DW_AT_type	(cu + 0x0616 "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(11)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x10)
                  DW_AT_bit_offset	(0x10)
                  DW_AT_data_member_location	(0x08)

0x000005c1:     DW_TAG_member
                  DW_AT_name	("timer_type")
                  DW_AT_type	(cu + 0x0616 "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(12)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x0c)
                  DW_AT_data_member_location	(0x08)

0x000005d0:     DW_TAG_member
                  DW_AT_name	("timer_tick_overflow")
                  DW_AT_type	(cu + 0x0616 "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(13)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x0b)
                  DW_AT_data_member_location	(0x08)

0x000005df:     DW_TAG_member
                  DW_AT_name	("loop_flag")
                  DW_AT_type	(cu + 0x0616 "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(14)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x0a)
                  DW_AT_data_member_location	(0x08)

0x000005ee:     DW_TAG_member
                  DW_AT_name	("loop_times")
                  DW_AT_type	(cu + 0x0616 "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(15)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x0a)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x08)

0x000005fd:     DW_TAG_member
                  DW_AT_name	("process")
                  DW_AT_type	(cu + 0x0628 "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(17)
                  DW_AT_data_member_location	(0x0c)

0x00000609:     DW_TAG_member
                  DW_AT_name	("context")
                  DW_AT_type	(cu + 0x0639 "*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(18)
                  DW_AT_data_member_location	(0x10)

0x00000615:     NULL

0x00000616:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0621 "unsigned int")
                DW_AT_name	("uint32_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(48)

0x00000621:   DW_TAG_base_type
                DW_AT_name	("unsigned int")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x04)

0x00000628:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x062d "subroutine ")

0x0000062d:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x0000062e:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0634 "btstack_timer_source*")

0x00000633:     NULL

0x00000634:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0592 "btstack_timer_source")

0x00000639:   DW_TAG_pointer_type

0x0000063a:   DW_TAG_typedef
                DW_AT_type	(cu + 0x02dd "enumeration ")
                DW_AT_name	("gatt_client_rsp_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gatt_client.h")
                DW_AT_decl_line	(137)

0x00000645:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0129 "uint8_t")

0x0000064a:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x054c "sizetype")
                  DW_AT_count	(0x07)

0x00000650:     NULL

0x00000651:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000000)
                DW_AT_high_pc	(0x0000000000000024)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("gatt_client_register_packet_handler")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(94)
                DW_AT_prototyped	(true)
                DW_AT_external	(true)

0x00000662:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000000
                     0x0000000000000000 - 0x0000000000000011: DW_OP_reg0 EAX
                     0x0000000000000011 - 0x0000000000000024: DW_OP_breg5 EBP-4)
                  DW_AT_name	("handler")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(94)
                  DW_AT_type	(cu + 0x0103 "btstack_packet_handler_t")

0x00000671:     NULL

0x00000672:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000024)
                DW_AT_high_pc	(0x0000000000000053)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("gatt_client_request_can_send_now_event")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(138)
                DW_AT_prototyped	(true)
                DW_AT_external	(true)

0x00000683:     DW_TAG_formal_parameter
                  DW_AT_location	(0x0000001f
                     0x0000000000000024 - 0x0000000000000039: DW_OP_reg0 EAX
                     0x0000000000000039 - 0x0000000000000053: DW_OP_breg5 EBP-2)
                  DW_AT_name	("con_handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(138)
                  DW_AT_type	(cu + 0x0386 "hci_con_handle_t")

0x00000692:     NULL

0x00000693:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000053)
                DW_AT_high_pc	(0x00000000000000a7)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("gatt_client_init")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(154)
                DW_AT_prototyped	(true)
                DW_AT_external	(true)

0x000006a4:   DW_TAG_subprogram
                DW_AT_name	("get_gatt_client_context_for_handle")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(201)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0391 "gatt_client_t*")
                DW_AT_inline	(DW_INL_inlined)

0x000006b0:     DW_TAG_formal_parameter
                  DW_AT_name	("handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(201)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x000006bb:     DW_TAG_variable
                  DW_AT_name	("it")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(203)
                  DW_AT_type	(cu + 0x00a6 "btstack_linked_item_t*")

0x000006c6:     DW_TAG_lexical_block

0x000006c7:       DW_TAG_variable
                    DW_AT_name	("peripheral")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                    DW_AT_decl_line	(205)
                    DW_AT_type	(cu + 0x0391 "gatt_client_t*")

0x000006d2:       NULL

0x000006d3:     NULL

0x000006d4:   DW_TAG_subprogram
                DW_AT_low_pc	(0x00000000000000a7)
                DW_AT_high_pc	(0x00000000000001ad)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("gatt_client_hci_event_packet_handler")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(1272)
                DW_AT_prototyped	(true)

0x000006e6:     DW_TAG_formal_parameter
                  DW_AT_location	(0x0000003e
                     0x00000000000000a7 - 0x00000000000000c3: DW_OP_reg1 ECX)
                  DW_AT_name	("packet_type")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(1272)
                  DW_AT_type	(cu + 0x0129 "uint8_t")

0x000006f6:     DW_TAG_formal_parameter
                  DW_AT_name	("channel")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(1272)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x00000702:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000051
                     0x00000000000000a7 - 0x00000000000000cb: DW_OP_reg0 EAX
                     0x00000000000000cb - 0x00000000000001ad: DW_OP_breg5 EBP-4)
                  DW_AT_name	("packet")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(1272)
                  DW_AT_type	(cu + 0x014d "uint8_t*")

0x00000712:     DW_TAG_formal_parameter
                  DW_AT_name	("size")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(1272)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x0000071e:     DW_TAG_lexical_block
                  DW_AT_low_pc	(0x00000000000000e6)
                  DW_AT_high_pc	(0x000000000000019e)

0x00000727:       DW_TAG_variable
                    DW_AT_location	(0x00000070
                       0x0000000000000121 - 0x000000000000012e: DW_OP_reg0 EAX
                       0x000000000000012e - 0x00000000000001ad: DW_OP_breg5 EBP-14)
                    DW_AT_name	("con_handle")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                    DW_AT_decl_line	(1289)
                    DW_AT_type	(cu + 0x0386 "hci_con_handle_t")

0x00000737:       DW_TAG_variable
                    DW_AT_name	("peripheral")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                    DW_AT_decl_line	(1290)
                    DW_AT_type	(cu + 0x0391 "gatt_client_t*")

0x00000743:       DW_TAG_inlined_subroutine
                    DW_AT_abstract_origin	(cu + 0x06a4 "get_gatt_client_context_for_handle")
                    DW_AT_low_pc	(0x0000000000000127)
                    DW_AT_high_pc	(0x000000000000016f)
                    DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                    DW_AT_call_line	(1290)

0x00000753:         DW_TAG_formal_parameter
                      DW_AT_location	(0x0000008f
                         0x0000000000000121 - 0x000000000000012e: DW_OP_reg0 EAX
                         0x000000000000012e - 0x00000000000001ad: DW_OP_breg5 EBP-14)
                      DW_AT_abstract_origin	(cu + 0x06b0 "handle")

0x0000075c:         DW_TAG_variable
                      DW_AT_location	(0x000000ae
                         0x0000000000000127 - 0x0000000000000131: DW_OP_reg1 ECX
                         0x0000000000000131 - 0x0000000000000147: DW_OP_breg5 EBP-20
                         0x0000000000000147 - 0x000000000000014d: DW_OP_reg1 ECX
                         0x000000000000014d - 0x0000000000000153: DW_OP_breg5 EBP-24
                         0x0000000000000153 - 0x00000000000001ad: DW_OP_breg5 EBP-20)
                      DW_AT_abstract_origin	(cu + 0x06bb "it")

0x00000765:         NULL

0x00000766:       NULL

0x00000767:     NULL

0x00000768:   DW_TAG_subprogram
                DW_AT_name	("gatt_client_emit_can_send_now_event")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(100)
                DW_AT_prototyped	(true)
                DW_AT_inline	(DW_INL_inlined)

0x00000770:     DW_TAG_variable
                  DW_AT_name	("event")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(105)
                  DW_AT_type	(cu + 0x056f "uint8_t[]")

0x0000077b:     NULL

0x0000077c:   DW_TAG_subprogram
                DW_AT_name	("report_gatt_notification")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(862)
                DW_AT_prototyped	(true)
                DW_AT_inline	(DW_INL_inlined)

0x00000785:     DW_TAG_formal_parameter
                  DW_AT_name	("con_handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(862)
                  DW_AT_type	(cu + 0x0386 "hci_con_handle_t")

0x00000791:     DW_TAG_formal_parameter
                  DW_AT_name	("value_handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(862)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x0000079d:     DW_TAG_formal_parameter
                  DW_AT_name	("value")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(862)
                  DW_AT_type	(cu + 0x014d "uint8_t*")

0x000007a9:     DW_TAG_formal_parameter
                  DW_AT_name	("length")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(862)
                  DW_AT_type	(cu + 0x0037 "int")

0x000007b5:     DW_TAG_variable
                  DW_AT_name	("packet")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(864)
                  DW_AT_type	(cu + 0x014d "uint8_t*")

0x000007c1:     NULL

0x000007c2:   DW_TAG_subprogram
                DW_AT_name	("report_gatt_services")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(731)
                DW_AT_prototyped	(true)
                DW_AT_inline	(DW_INL_inlined)

0x000007cb:     DW_TAG_formal_parameter
                  DW_AT_name	("peripheral")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(731)
                  DW_AT_type	(cu + 0x0391 "gatt_client_t*")

0x000007d7:     DW_TAG_formal_parameter
                  DW_AT_name	("packet")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(731)
                  DW_AT_type	(cu + 0x014d "uint8_t*")

0x000007e3:     DW_TAG_formal_parameter
                  DW_AT_name	("size")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(731)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x000007ef:     DW_TAG_variable
                  DW_AT_name	("attr_length")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(733)
                  DW_AT_type	(cu + 0x0129 "uint8_t")

0x000007fb:     DW_TAG_variable
                  DW_AT_name	("i")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(736)
                  DW_AT_type	(cu + 0x0037 "int")

0x00000807:     DW_TAG_variable
                  DW_AT_name	("uuid_length")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(734)
                  DW_AT_type	(cu + 0x0129 "uint8_t")

0x00000813:     DW_TAG_lexical_block

0x00000814:       DW_TAG_variable
                    DW_AT_name	("uuid128")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                    DW_AT_decl_line	(740)
                    DW_AT_type	(cu + 0x055e "uint8_t[]")

0x00000820:       DW_TAG_variable
                    DW_AT_name	("start_group_handle")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                    DW_AT_decl_line	(738)
                    DW_AT_type	(cu + 0x013b "uint16_t")

0x0000082c:       DW_TAG_variable
                    DW_AT_name	("end_group_handle")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                    DW_AT_decl_line	(739)
                    DW_AT_type	(cu + 0x013b "uint16_t")

0x00000838:       DW_TAG_variable
                    DW_AT_name	("uuid16")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                    DW_AT_decl_line	(741)
                    DW_AT_type	(cu + 0x013b "uint16_t")

0x00000844:       NULL

0x00000845:     NULL

0x00000846:   DW_TAG_subprogram
                DW_AT_name	("get_last_result_handle_from_service_list")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(595)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x013b "uint16_t")
                DW_AT_inline	(DW_INL_inlined)

0x00000853:     DW_TAG_formal_parameter
                  DW_AT_name	("packet")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(595)
                  DW_AT_type	(cu + 0x014d "uint8_t*")

0x0000085f:     DW_TAG_formal_parameter
                  DW_AT_name	("size")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(595)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x0000086b:     DW_TAG_variable
                  DW_AT_name	("attr_length")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(597)
                  DW_AT_type	(cu + 0x0129 "uint8_t")

0x00000877:     NULL

0x00000878:   DW_TAG_subprogram
                DW_AT_name	("trigger_next_service_query")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(948)
                DW_AT_prototyped	(true)
                DW_AT_inline	(DW_INL_inlined)

0x00000881:     DW_TAG_formal_parameter
                  DW_AT_name	("peripheral")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(948)
                  DW_AT_type	(cu + 0x0391 "gatt_client_t*")

0x0000088d:     DW_TAG_formal_parameter
                  DW_AT_name	("last_result_handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(948)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x00000899:     NULL

0x0000089a:   DW_TAG_subprogram
                DW_AT_name	("report_gatt_indication")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(869)
                DW_AT_prototyped	(true)
                DW_AT_inline	(DW_INL_inlined)

0x000008a3:     DW_TAG_formal_parameter
                  DW_AT_name	("con_handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(869)
                  DW_AT_type	(cu + 0x0386 "hci_con_handle_t")

0x000008af:     DW_TAG_formal_parameter
                  DW_AT_name	("value_handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(869)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x000008bb:     DW_TAG_formal_parameter
                  DW_AT_name	("value")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(869)
                  DW_AT_type	(cu + 0x014d "uint8_t*")

0x000008c7:     DW_TAG_formal_parameter
                  DW_AT_name	("length")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(869)
                  DW_AT_type	(cu + 0x0037 "int")

0x000008d3:     DW_TAG_variable
                  DW_AT_name	("packet")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(871)
                  DW_AT_type	(cu + 0x014d "uint8_t*")

0x000008df:     NULL

0x000008e0:   DW_TAG_subprogram
                DW_AT_name	("get_last_result_handle_from_characteristics_list")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(601)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x013b "uint16_t")
                DW_AT_inline	(DW_INL_inlined)

0x000008ed:     DW_TAG_formal_parameter
                  DW_AT_name	("packet")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(601)
                  DW_AT_type	(cu + 0x014d "uint8_t*")

0x000008f9:     DW_TAG_formal_parameter
                  DW_AT_name	("size")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(601)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x00000905:     DW_TAG_variable
                  DW_AT_name	("attr_length")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(603)
                  DW_AT_type	(cu + 0x0129 "uint8_t")

0x00000911:     NULL

0x00000912:   DW_TAG_subprogram
                DW_AT_name	("is_query_done")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(926)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_inline	(DW_INL_inlined)

0x0000091f:     DW_TAG_formal_parameter
                  DW_AT_name	("peripheral")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(926)
                  DW_AT_type	(cu + 0x0391 "gatt_client_t*")

0x0000092b:     DW_TAG_formal_parameter
                  DW_AT_name	("last_result_handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(926)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x00000937:     NULL

0x00000938:   DW_TAG_subprogram
                DW_AT_name	("trigger_next_characteristic_query")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(958)
                DW_AT_prototyped	(true)
                DW_AT_inline	(DW_INL_inlined)

0x00000941:     DW_TAG_formal_parameter
                  DW_AT_name	("peripheral")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(958)
                  DW_AT_type	(cu + 0x0391 "gatt_client_t*")

0x0000094d:     DW_TAG_formal_parameter
                  DW_AT_name	("last_result_handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(958)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x00000959:     NULL

0x0000095a:   DW_TAG_subprogram
                DW_AT_name	("get_last_result_handle_from_included_services_list")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(607)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x013b "uint16_t")
                DW_AT_inline	(DW_INL_inlined)

0x00000967:     DW_TAG_formal_parameter
                  DW_AT_name	("packet")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(607)
                  DW_AT_type	(cu + 0x014d "uint8_t*")

0x00000973:     DW_TAG_formal_parameter
                  DW_AT_name	("size")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(607)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x0000097f:     DW_TAG_variable
                  DW_AT_name	("attr_length")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(609)
                  DW_AT_type	(cu + 0x0129 "uint8_t")

0x0000098b:     NULL

0x0000098c:   DW_TAG_subprogram
                DW_AT_name	("report_gatt_included_service_uuid16")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(810)
                DW_AT_prototyped	(true)
                DW_AT_inline	(DW_INL_inlined)

0x00000995:     DW_TAG_formal_parameter
                  DW_AT_name	("peripheral")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(810)
                  DW_AT_type	(cu + 0x0391 "gatt_client_t*")

0x000009a1:     DW_TAG_formal_parameter
                  DW_AT_name	("include_handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(810)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x000009ad:     DW_TAG_formal_parameter
                  DW_AT_name	("uuid16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(810)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x000009b9:     DW_TAG_variable
                  DW_AT_name	("normalized_uuid128")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(812)
                  DW_AT_type	(cu + 0x055e "uint8_t[]")

0x000009c5:     NULL

0x000009c6:   DW_TAG_subprogram
                DW_AT_name	("trigger_next_included_service_query")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(943)
                DW_AT_prototyped	(true)
                DW_AT_inline	(DW_INL_inlined)

0x000009cf:     DW_TAG_formal_parameter
                  DW_AT_name	("peripheral")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(943)
                  DW_AT_type	(cu + 0x0391 "gatt_client_t*")

0x000009db:     DW_TAG_formal_parameter
                  DW_AT_name	("last_result_handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(943)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x000009e7:     NULL

0x000009e8:   DW_TAG_subprogram
                DW_AT_name	("trigger_next_read_by_type_query")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(972)
                DW_AT_prototyped	(true)
                DW_AT_inline	(DW_INL_inlined)

0x000009f1:     DW_TAG_formal_parameter
                  DW_AT_name	("peripheral")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(972)
                  DW_AT_type	(cu + 0x0391 "gatt_client_t*")

0x000009fd:     DW_TAG_formal_parameter
                  DW_AT_name	("last_result_handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(972)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x00000a09:     NULL

0x00000a0a:   DW_TAG_subprogram
                DW_AT_name	("report_gatt_included_service_uuid128")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(818)
                DW_AT_prototyped	(true)
                DW_AT_inline	(DW_INL_inlined)

0x00000a13:     DW_TAG_formal_parameter
                  DW_AT_name	("peripheral")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(818)
                  DW_AT_type	(cu + 0x0391 "gatt_client_t*")

0x00000a1f:     DW_TAG_formal_parameter
                  DW_AT_name	("include_handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(818)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x00000a2b:     DW_TAG_formal_parameter
                  DW_AT_name	("uuid128")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(818)
                  DW_AT_type	(cu + 0x014d "uint8_t*")

0x00000a37:     NULL

0x00000a38:   DW_TAG_subprogram
                DW_AT_name	("gatt_client_handle_transaction_complete")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(613)
                DW_AT_prototyped	(true)
                DW_AT_inline	(DW_INL_inlined)

0x00000a41:     DW_TAG_formal_parameter
                  DW_AT_name	("peripheral")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(613)
                  DW_AT_type	(cu + 0x0391 "gatt_client_t*")

0x00000a4d:     NULL

0x00000a4e:   DW_TAG_subprogram
                DW_AT_name	("report_gatt_characteristic_descriptor")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(892)
                DW_AT_prototyped	(true)
                DW_AT_inline	(DW_INL_inlined)

0x00000a57:     DW_TAG_formal_parameter
                  DW_AT_name	("peripheral")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(892)
                  DW_AT_type	(cu + 0x0391 "gatt_client_t*")

0x00000a63:     DW_TAG_formal_parameter
                  DW_AT_name	("descriptor_handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(892)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x00000a6f:     DW_TAG_formal_parameter
                  DW_AT_name	("value")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(892)
                  DW_AT_type	(cu + 0x014d "uint8_t*")

0x00000a7b:     DW_TAG_formal_parameter
                  DW_AT_name	("value_length")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(892)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x00000a87:     DW_TAG_formal_parameter
                  DW_AT_name	("value_offset")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(892)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x00000a93:     DW_TAG_variable
                  DW_AT_name	("packet")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(895)
                  DW_AT_type	(cu + 0x014d "uint8_t*")

0x00000a9f:     NULL

0x00000aa0:   DW_TAG_subprogram
                DW_AT_name	("emit_event_new")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(619)
                DW_AT_prototyped	(true)
                DW_AT_inline	(DW_INL_inlined)

0x00000aa9:     DW_TAG_formal_parameter
                  DW_AT_name	("callback")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(619)
                  DW_AT_type	(cu + 0x0103 "btstack_packet_handler_t")

0x00000ab5:     DW_TAG_formal_parameter
                  DW_AT_name	("packet")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(619)
                  DW_AT_type	(cu + 0x014d "uint8_t*")

0x00000ac1:     DW_TAG_formal_parameter
                  DW_AT_name	("size")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(619)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x00000acd:     NULL

0x00000ace:   DW_TAG_subprogram
                DW_AT_name	("trigger_next_service_by_uuid_query")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(953)
                DW_AT_prototyped	(true)
                DW_AT_inline	(DW_INL_inlined)

0x00000ad7:     DW_TAG_formal_parameter
                  DW_AT_name	("peripheral")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(953)
                  DW_AT_type	(cu + 0x0391 "gatt_client_t*")

0x00000ae3:     DW_TAG_formal_parameter
                  DW_AT_name	("last_result_handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(953)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x00000aef:     NULL

0x00000af0:   DW_TAG_subprogram
                DW_AT_name	("report_gatt_all_characteristic_descriptors")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(908)
                DW_AT_prototyped	(true)
                DW_AT_inline	(DW_INL_inlined)

0x00000af9:     DW_TAG_formal_parameter
                  DW_AT_name	("peripheral")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(908)
                  DW_AT_type	(cu + 0x0391 "gatt_client_t*")

0x00000b05:     DW_TAG_formal_parameter
                  DW_AT_name	("packet")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(908)
                  DW_AT_type	(cu + 0x014d "uint8_t*")

0x00000b11:     DW_TAG_formal_parameter
                  DW_AT_name	("size")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(908)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x00000b1d:     DW_TAG_formal_parameter
                  DW_AT_name	("pair_size")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(908)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x00000b29:     DW_TAG_variable
                  DW_AT_name	("i")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(910)
                  DW_AT_type	(cu + 0x0037 "int")

0x00000b35:     DW_TAG_lexical_block

0x00000b36:       DW_TAG_variable
                    DW_AT_name	("uuid128")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                    DW_AT_decl_line	(913)
                    DW_AT_type	(cu + 0x055e "uint8_t[]")

0x00000b42:       DW_TAG_variable
                    DW_AT_name	("descriptor_handle")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                    DW_AT_decl_line	(912)
                    DW_AT_type	(cu + 0x013b "uint16_t")

0x00000b4e:       DW_TAG_variable
                    DW_AT_name	("uuid16")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                    DW_AT_decl_line	(914)
                    DW_AT_type	(cu + 0x013b "uint16_t")

0x00000b5a:       NULL

0x00000b5b:     NULL

0x00000b5c:   DW_TAG_subprogram
                DW_AT_name	("emit_gatt_all_characteristic_descriptors_result_event")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(716)
                DW_AT_prototyped	(true)
                DW_AT_inline	(DW_INL_inlined)

0x00000b65:     DW_TAG_formal_parameter
                  DW_AT_name	("peripheral")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(717)
                  DW_AT_type	(cu + 0x0391 "gatt_client_t*")

0x00000b71:     DW_TAG_formal_parameter
                  DW_AT_name	("descriptor_handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(717)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x00000b7d:     DW_TAG_formal_parameter
                  DW_AT_name	("uuid128")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(717)
                  DW_AT_type	(cu + 0x014d "uint8_t*")

0x00000b89:     DW_TAG_variable
                  DW_AT_name	("packet")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(720)
                  DW_AT_type	(cu + 0x0b96 "uint8_t[]")

0x00000b95:     NULL

0x00000b96:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0129 "uint8_t")

0x00000b9b:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x054c "sizetype")
                  DW_AT_count	(0x16)

0x00000ba1:     NULL

0x00000ba2:   DW_TAG_subprogram
                DW_AT_name	("trigger_next_characteristic_descriptor_query")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(967)
                DW_AT_prototyped	(true)
                DW_AT_inline	(DW_INL_inlined)

0x00000bab:     DW_TAG_formal_parameter
                  DW_AT_name	("peripheral")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(967)
                  DW_AT_type	(cu + 0x0391 "gatt_client_t*")

0x00000bb7:     DW_TAG_formal_parameter
                  DW_AT_name	("last_result_handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(967)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x00000bc3:     NULL

0x00000bc4:   DW_TAG_subprogram
                DW_AT_name	("report_gatt_long_characteristic_value_blob")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(883)
                DW_AT_prototyped	(true)
                DW_AT_inline	(DW_INL_inlined)

0x00000bcd:     DW_TAG_formal_parameter
                  DW_AT_name	("peripheral")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(883)
                  DW_AT_type	(cu + 0x0391 "gatt_client_t*")

0x00000bd9:     DW_TAG_formal_parameter
                  DW_AT_name	("attribute_handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(883)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x00000be5:     DW_TAG_formal_parameter
                  DW_AT_name	("blob")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(883)
                  DW_AT_type	(cu + 0x014d "uint8_t*")

0x00000bf1:     DW_TAG_formal_parameter
                  DW_AT_name	("blob_length")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(883)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x00000bfd:     DW_TAG_formal_parameter
                  DW_AT_name	("value_offset")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(883)
                  DW_AT_type	(cu + 0x0037 "int")

0x00000c09:     DW_TAG_variable
                  DW_AT_name	("packet")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(885)
                  DW_AT_type	(cu + 0x014d "uint8_t*")

0x00000c15:     NULL

0x00000c16:   DW_TAG_subprogram
                DW_AT_name	("trigger_next_blob_query")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(989)
                DW_AT_prototyped	(true)
                DW_AT_inline	(DW_INL_inlined)

0x00000c1f:     DW_TAG_formal_parameter
                  DW_AT_name	("peripheral")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(989)
                  DW_AT_type	(cu + 0x0391 "gatt_client_t*")

0x00000c2b:     DW_TAG_formal_parameter
                  DW_AT_name	("next_query_state")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(989)
                  DW_AT_type	(cu + 0x052a "gatt_client_state_t")

0x00000c37:     DW_TAG_formal_parameter
                  DW_AT_name	("received_blob_length")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(989)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x00000c43:     DW_TAG_variable
                  DW_AT_name	("max_blob_length")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(992)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x00000c4f:     NULL

0x00000c50:   DW_TAG_subprogram
                DW_AT_name	("report_gatt_long_characteristic_descriptor")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(899)
                DW_AT_prototyped	(true)
                DW_AT_inline	(DW_INL_inlined)

0x00000c59:     DW_TAG_formal_parameter
                  DW_AT_name	("peripheral")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(899)
                  DW_AT_type	(cu + 0x0391 "gatt_client_t*")

0x00000c65:     DW_TAG_formal_parameter
                  DW_AT_name	("descriptor_handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(899)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x00000c71:     DW_TAG_formal_parameter
                  DW_AT_name	("blob")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(899)
                  DW_AT_type	(cu + 0x014d "uint8_t*")

0x00000c7d:     DW_TAG_formal_parameter
                  DW_AT_name	("blob_length")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(899)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x00000c89:     DW_TAG_formal_parameter
                  DW_AT_name	("value_offset")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(899)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x00000c95:     DW_TAG_variable
                  DW_AT_name	("packet")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(901)
                  DW_AT_type	(cu + 0x014d "uint8_t*")

0x00000ca1:     NULL

0x00000ca2:   DW_TAG_subprogram
                DW_AT_name	("trigger_next_prepare_write_query")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(977)
                DW_AT_prototyped	(true)
                DW_AT_inline	(DW_INL_inlined)

0x00000cab:     DW_TAG_formal_parameter
                  DW_AT_name	("peripheral")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(977)
                  DW_AT_type	(cu + 0x0391 "gatt_client_t*")

0x00000cb7:     DW_TAG_formal_parameter
                  DW_AT_name	("next_query_state")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(977)
                  DW_AT_type	(cu + 0x052a "gatt_client_state_t")

0x00000cc3:     DW_TAG_formal_parameter
                  DW_AT_name	("done_state")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(977)
                  DW_AT_type	(cu + 0x052a "gatt_client_state_t")

0x00000ccf:     DW_TAG_variable
                  DW_AT_name	("next_blob_length")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(980)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x00000cdb:     NULL

0x00000cdc:   DW_TAG_subprogram
                DW_AT_name	("gatt_client_send_rsp_error")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(1307)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_inline	(DW_INL_inlined)

0x00000ce9:     DW_TAG_formal_parameter
                  DW_AT_name	("peripheral")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(1307)
                  DW_AT_type	(cu + 0x0391 "gatt_client_t*")

0x00000cf5:     DW_TAG_formal_parameter
                  DW_AT_name	("opcode")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(1307)
                  DW_AT_type	(cu + 0x0129 "uint8_t")

0x00000d01:     DW_TAG_formal_parameter
                  DW_AT_name	("att_handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(1307)
                  DW_AT_type	(cu + 0x013b "uint16_t")

0x00000d0d:     DW_TAG_formal_parameter
                  DW_AT_name	("error_code")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                  DW_AT_decl_line	(1307)
                  DW_AT_type	(cu + 0x0129 "uint8_t")

0x00000d19:     NULL

0x00000d1a:   DW_TAG_subprogram
                DW_AT_low_pc	(0x00000000000001ad)
                DW_AT_high_pc	(0x0000000000001d2a)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("gatt_client_att_packet_handler")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BLE/gatt_client.c")
                DW_AT_decl_line	(1322)
                DW_AT_prototyped	(true)

0x00000d2c:     DW_TAG_formal_parameter
                  DW_AT_location	(0x000000f0
                     0x00000000000001ad - 0x00000000000001dc: DW_OP_reg3 EBX
                     0x00000000000001dc - 0x0000000000001d2a: DW_OP_breg5 EBP-79)
                  DW_AT_name	("packet_type")
