temp.o:	file format ELF32-i386

.debug_info contents:
0x00000000: Compile Unit: length = 0x00003170 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x00003174)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)")
              DW_AT_language	(DW_LANG_C99)
              DW_AT_name	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/hci_transport/hci_vendor.c")
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
              DW_AT_GNU_pubnames	(true)
              DW_AT_low_pc	(0x0000000000000000)
              DW_AT_ranges	(0x00000078
                 [0x00000000 - 0x00002a86)
                 [0x00002a86 - 0x00002b97)
                 [0x00002b97 - 0x00003c8d)
                 [0x00003c8d - 0x00005087)
                 [0x00000000 - 0x0000001c)
                 [0x0000001c - 0x00000043)
                 [0x00000043 - 0x0000004c))

0x00000026:   DW_TAG_variable
                DW_AT_name	("app_info_debug_enable")
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/profile_stack_debug.h")
                DW_AT_decl_line	(190)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000037:   DW_TAG_base_type
                DW_AT_name	("int")
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_byte_size	(0x04)

0x0000003e:   DW_TAG_variable
                DW_AT_name	("hci_le_event_mask")
                DW_AT_type	(cu + 0x004f "const u8[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/hci_transport/hci_vendor.c")
                DW_AT_decl_line	(46)
                DW_AT_location	(DW_OP_addr 0x0)

0x0000004f:   DW_TAG_array_type
                DW_AT_type	(cu + 0x005b "const u8")

0x00000054:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0072 "sizetype")
                  DW_AT_count	(0x08)

0x0000005a:     NULL

0x0000005b:   DW_TAG_const_type
                DW_AT_type	(cu + 0x0060 "u8")

0x00000060:   DW_TAG_typedef
                DW_AT_type	(cu + 0x006b "unsigned char")
                DW_AT_name	("u8")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(44)

0x0000006b:   DW_TAG_base_type
                DW_AT_name	("unsigned char")
                DW_AT_encoding	(DW_ATE_unsigned_char)
                DW_AT_byte_size	(0x01)

0x00000072:   DW_TAG_base_type
                DW_AT_name	("sizetype")
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_unsigned)

0x00000079:   DW_TAG_variable
                DW_AT_name	("hci_le_mac_addr")
                DW_AT_type	(cu + 0x008a "const bd_addr_t")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/hci_transport/hci_vendor.c")
                DW_AT_decl_line	(57)
                DW_AT_location	(DW_OP_addr 0x0)

0x0000008a:   DW_TAG_const_type
                DW_AT_type	(cu + 0x008f "bd_addr_t")

0x0000008f:   DW_TAG_typedef
                DW_AT_type	(cu + 0x009a "uint8_t[]")
                DW_AT_name	("bd_addr_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h")
                DW_AT_decl_line	(7)

0x0000009a:   DW_TAG_array_type
                DW_AT_type	(cu + 0x00a6 "uint8_t")

0x0000009f:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0072 "sizetype")
                  DW_AT_count	(0x06)

0x000000a5:     NULL

0x000000a6:   DW_TAG_typedef
                DW_AT_type	(cu + 0x006b "unsigned char")
                DW_AT_name	("uint8_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(44)

0x000000b1:   DW_TAG_variable
                DW_AT_name	("hci_reset")
                DW_AT_type	(cu + 0x00c2 "const hci_cmd_t")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/hci_transport/hci_vendor.c")
                DW_AT_decl_line	(63)
                DW_AT_location	(DW_OP_addr 0x0)

0x000000c2:   DW_TAG_const_type
                DW_AT_type	(cu + 0x00c7 "hci_cmd_t")

0x000000c7:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00d3 "structure ")
                DW_AT_name	("hci_cmd_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/bluetooth.h")
                DW_AT_decl_line	(508)

0x000000d3:   DW_TAG_structure_type
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/bluetooth.h")
                DW_AT_decl_line	(505)

0x000000d8:     DW_TAG_member
                  DW_AT_name	("opcode")
                  DW_AT_type	(cu + 0x00f3 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/bluetooth.h")
                  DW_AT_decl_line	(506)
                  DW_AT_data_member_location	(0x00)

0x000000e5:     DW_TAG_member
                  DW_AT_name	("format")
                  DW_AT_type	(cu + 0x0105 "const char*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/bluetooth.h")
                  DW_AT_decl_line	(507)
                  DW_AT_data_member_location	(0x04)

0x000000f2:     NULL

0x000000f3:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00fe "unsigned short")
                DW_AT_name	("uint16_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(46)

0x000000fe:   DW_TAG_base_type
                DW_AT_name	("unsigned short")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x02)

0x00000105:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x010a "const char")

0x0000010a:   DW_TAG_const_type
                DW_AT_type	(cu + 0x010f "char")

0x0000010f:   DW_TAG_base_type
                DW_AT_name	("char")
                DW_AT_encoding	(DW_ATE_signed_char)
                DW_AT_byte_size	(0x01)

0x00000116:   DW_TAG_variable
                DW_AT_name	("le_event_mask")
                DW_AT_type	(cu + 0x004f "const u8[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/hci_transport/hci_vendor.c")
                DW_AT_decl_line	(69)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000127:   DW_TAG_variable
                DW_AT_name	("mac_addr")
                DW_AT_type	(cu + 0x0138 "const u8[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/hci_transport/hci_vendor.c")
                DW_AT_decl_line	(72)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000138:   DW_TAG_array_type
                DW_AT_type	(cu + 0x005b "const u8")

0x0000013d:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0072 "sizetype")
                  DW_AT_count	(0x06)

0x00000143:     NULL

0x00000144:   DW_TAG_variable
                DW_AT_name	("inquiry_result")
                DW_AT_type	(cu + 0x0155 "inquiry_result_t*")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/hci_transport/hci_vendor.c")
                DW_AT_decl_line	(92)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000155:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x015a "inquiry_result_t")

0x0000015a:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0165 "__inquiry_result_t")
                DW_AT_name	("inquiry_result_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/hci_transport/hci_vendor.c")
                DW_AT_decl_line	(89)

0x00000165:   DW_TAG_structure_type
                DW_AT_name	("__inquiry_result_t")
                DW_AT_byte_size	(0x0f)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/hci_transport/hci_vendor.c")
                DW_AT_decl_line	(80)

0x0000016d:     DW_TAG_member
                  DW_AT_name	("priv_version")
                  DW_AT_type	(cu + 0x01c2 "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/hci_transport/hci_vendor.c")
                  DW_AT_decl_line	(83)
                  DW_AT_data_member_location	(0x00)

0x00000179:     DW_TAG_member
                  DW_AT_name	("priv_version_len")
                  DW_AT_type	(cu + 0x0060 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/hci_transport/hci_vendor.c")
                  DW_AT_decl_line	(84)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x03)
                  DW_AT_bit_offset	(0x05)
                  DW_AT_data_member_location	(0x08)

0x00000188:     DW_TAG_member
                  DW_AT_name	("user_flag")
                  DW_AT_type	(cu + 0x0060 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/hci_transport/hci_vendor.c")
                  DW_AT_decl_line	(85)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x08)

0x00000197:     DW_TAG_member
                  DW_AT_name	("dev_match")
                  DW_AT_type	(cu + 0x0060 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/hci_transport/hci_vendor.c")
                  DW_AT_decl_line	(86)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x03)
                  DW_AT_data_member_location	(0x08)

0x000001a6:     DW_TAG_member
                  DW_AT_name	("reserve")
                  DW_AT_type	(cu + 0x0060 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/hci_transport/hci_vendor.c")
                  DW_AT_decl_line	(87)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x03)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x08)

0x000001b5:     DW_TAG_member
                  DW_AT_name	("remote_addr")
                  DW_AT_type	(cu + 0x01ce "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/hci_transport/hci_vendor.c")
                  DW_AT_decl_line	(88)
                  DW_AT_data_member_location	(0x09)

0x000001c1:     NULL

0x000001c2:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0060 "u8")

0x000001c7:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0072 "sizetype")
                  DW_AT_count	(0x08)

0x000001cd:     NULL

0x000001ce:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0060 "u8")

0x000001d3:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0072 "sizetype")
                  DW_AT_count	(0x06)

0x000001d9:     NULL

0x000001da:   DW_TAG_variable
                DW_AT_name	("hci_bt_mode")
                DW_AT_type	(cu + 0x0060 "u8")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/hci_transport/hci_vendor.c")
                DW_AT_decl_line	(94)
                DW_AT_location	(DW_OP_addr 0x0)

0x000001eb:   DW_TAG_variable
                DW_AT_name	("g_le_tws_search_aa")
                DW_AT_type	(cu + 0x01fd "u32")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/hci_transport/hci_vendor.c")
                DW_AT_decl_line	(1366)
                DW_AT_location	(DW_OP_addr 0x0)

0x000001fd:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0208 "unsigned int")
                DW_AT_name	("u32")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(48)

0x00000208:   DW_TAG_base_type
                DW_AT_name	("unsigned int")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x04)

0x0000020f:   DW_TAG_variable
                DW_AT_name	("g_le_tws_pair_aa")
                DW_AT_type	(cu + 0x01fd "u32")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/hci_transport/hci_vendor.c")
                DW_AT_decl_line	(1367)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000221:   DW_TAG_variable
                DW_AT_name	("g_le_tws_connect_aa")
                DW_AT_type	(cu + 0x01fd "u32")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/hci_transport/hci_vendor.c")
                DW_AT_decl_line	(1368)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000233:   DW_TAG_variable
                DW_AT_name	("code_buf")
                DW_AT_type	(cu + 0x01ce "u8[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/hci_transport/hci_vendor.c")
                DW_AT_decl_line	(1370)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000245:   DW_TAG_variable
                DW_AT_name	("le_hci_stack")
                DW_AT_type	(cu + 0x0256 "le_hci_stack_t")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/hci_transport/hci_vendor.c")
                DW_AT_decl_line	(77)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000256:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0262 "__le_hci_stack")
                DW_AT_name	("le_hci_stack_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(618)

0x00000262:   DW_TAG_structure_type
                DW_AT_name	("__le_hci_stack")
                DW_AT_byte_size	(0x022c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(607)

0x0000026c:     DW_TAG_member
                  DW_AT_name	("le_hci_connection")
                  DW_AT_type	(cu + 0x02e8 "linked_list_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(608)
                  DW_AT_data_member_location	(0x00)

0x00000279:     DW_TAG_member
                  DW_AT_name	("le_hci_event_handlers")
                  DW_AT_type	(cu + 0x02e8 "linked_list_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(609)
                  DW_AT_data_member_location	(0x04)

0x00000286:     DW_TAG_member
                  DW_AT_name	("hci_packet_buffer")
                  DW_AT_type	(cu + 0x031d "uint8_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(611)
                  DW_AT_data_member_location	(0x08)

0x00000293:     DW_TAG_member
                  DW_AT_name	("hci_packet_buffer_reserved")
                  DW_AT_type	(cu + 0x00a6 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(612)
                  DW_AT_data_member_location	(0x0215)

0x000002a1:     DW_TAG_member
                  DW_AT_name	("acl_fragmentation_pos")
                  DW_AT_type	(cu + 0x00f3 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(613)
                  DW_AT_data_member_location	(0x0216)

0x000002af:     DW_TAG_member
                  DW_AT_name	("acl_fragmentation_total_size")
                  DW_AT_type	(cu + 0x00f3 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(614)
                  DW_AT_data_member_location	(0x0218)

0x000002bd:     DW_TAG_member
                  DW_AT_name	("le_acl_packets_total_num")
                  DW_AT_type	(cu + 0x00a6 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(615)
                  DW_AT_data_member_location	(0x021a)

0x000002cb:     DW_TAG_member
                  DW_AT_name	("le_data_packets_length")
                  DW_AT_type	(cu + 0x00f3 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(616)
                  DW_AT_data_member_location	(0x021c)

0x000002d9:     DW_TAG_member
                  DW_AT_name	("le_connection_parameter_range")
                  DW_AT_type	(cu + 0x032a "le_connection_parameter_range_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(617)
                  DW_AT_data_member_location	(0x021e)

0x000002e7:     NULL

0x000002e8:   DW_TAG_typedef
                DW_AT_type	(cu + 0x02f3 "btstack_linked_item_t*")
                DW_AT_name	("linked_list_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(101)

0x000002f3:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x02f8 "btstack_linked_item_t")

0x000002f8:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0303 "btstack_linked_item")
                DW_AT_name	("btstack_linked_item_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(55)

0x00000303:   DW_TAG_structure_type
                DW_AT_name	("btstack_linked_item")
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(53)

0x0000030b:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(cu + 0x0318 "btstack_linked_item*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                  DW_AT_decl_line	(54)
                  DW_AT_data_member_location	(0x00)

0x00000317:     NULL

0x00000318:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0303 "btstack_linked_item")

0x0000031d:   DW_TAG_array_type
                DW_AT_type	(cu + 0x00a6 "uint8_t")

0x00000322:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0072 "sizetype")
                  DW_AT_count	(0x020d)

0x00000329:     NULL

0x0000032a:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0335 "le_connection_parameter_range")
                DW_AT_name	("le_connection_parameter_range_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gap.h")
                DW_AT_decl_line	(110)

0x00000335:   DW_TAG_structure_type
                DW_AT_name	("le_connection_parameter_range")
                DW_AT_byte_size	(0x0c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gap.h")
                DW_AT_decl_line	(103)

0x0000033d:     DW_TAG_member
                  DW_AT_name	("le_conn_interval_min")
                  DW_AT_type	(cu + 0x00f3 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gap.h")
                  DW_AT_decl_line	(104)
                  DW_AT_data_member_location	(0x00)

0x00000349:     DW_TAG_member
                  DW_AT_name	("le_conn_interval_max")
                  DW_AT_type	(cu + 0x00f3 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gap.h")
                  DW_AT_decl_line	(105)
                  DW_AT_data_member_location	(0x02)

0x00000355:     DW_TAG_member
                  DW_AT_name	("le_conn_latency_min")
                  DW_AT_type	(cu + 0x00f3 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gap.h")
                  DW_AT_decl_line	(106)
                  DW_AT_data_member_location	(0x04)

0x00000361:     DW_TAG_member
                  DW_AT_name	("le_conn_latency_max")
                  DW_AT_type	(cu + 0x00f3 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gap.h")
                  DW_AT_decl_line	(107)
                  DW_AT_data_member_location	(0x06)

0x0000036d:     DW_TAG_member
                  DW_AT_name	("le_supervision_timeout_min")
                  DW_AT_type	(cu + 0x00f3 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gap.h")
                  DW_AT_decl_line	(108)
                  DW_AT_data_member_location	(0x08)

0x00000379:     DW_TAG_member
                  DW_AT_name	("le_supervision_timeout_max")
                  DW_AT_type	(cu + 0x00f3 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gap.h")
                  DW_AT_decl_line	(109)
                  DW_AT_data_member_location	(0x0a)

0x00000385:     NULL

0x00000386:   DW_TAG_variable
                DW_AT_name	("_inquiry_result")
                DW_AT_type	(cu + 0x015a "inquiry_result_t")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/hci_transport/hci_vendor.c")
                DW_AT_decl_line	(91)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000397:   DW_TAG_variable
                DW_AT_name	("inquiry_spp_device")
                DW_AT_type	(cu + 0x0060 "u8")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/hci_transport/hci_vendor.c")
                DW_AT_decl_line	(95)
                DW_AT_location	(DW_OP_addr 0xf)

0x000003a8:   DW_TAG_variable
                DW_AT_name	("hci_event_callback_registration")
                DW_AT_type	(cu + 0x03b9 "btstack_packet_callback_registration_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/hci_transport/hci_vendor.c")
                DW_AT_decl_line	(97)
                DW_AT_location	(DW_OP_addr 0x23c)

0x000003b9:   DW_TAG_typedef
                DW_AT_type	(cu + 0x03c4 "structure ")
                DW_AT_name	("btstack_packet_callback_registration_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(64)

0x000003c4:   DW_TAG_structure_type
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(61)

0x000003c8:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x03e1 "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                  DW_AT_decl_line	(62)
                  DW_AT_data_member_location	(0x00)

0x000003d4:     DW_TAG_member
                  DW_AT_name	("callback")
                  DW_AT_type	(cu + 0x03ec "btstack_packet_handler_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                  DW_AT_decl_line	(63)
                  DW_AT_data_member_location	(0x04)

0x000003e0:     NULL

0x000003e1:   DW_TAG_typedef
                DW_AT_type	(cu + 0x02f8 "btstack_linked_item_t")
                DW_AT_name	("linked_item_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(100)

0x000003ec:   DW_TAG_typedef
                DW_AT_type	(cu + 0x03f7 "subroutine *")
                DW_AT_name	("btstack_packet_handler_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(58)

0x000003f7:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x03fc "subroutine ")

0x000003fc:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x000003fd:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x00a6 "uint8_t")

0x00000402:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x00f3 "uint16_t")

0x00000407:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0412 "uint8_t*")

0x0000040c:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x00f3 "uint16_t")

0x00000411:     NULL

0x00000412:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x00a6 "uint8_t")

0x00000417:   DW_TAG_variable
                DW_AT_name	("hci_scan_control")
                DW_AT_type	(cu + 0x0060 "u8")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/hci_transport/hci_vendor.c")
                DW_AT_decl_line	(1558)
                DW_AT_location	(DW_OP_addr 0x1a)

0x00000429:   DW_TAG_variable
                DW_AT_name	("hci_packet_type_sizes")
                DW_AT_type	(cu + 0x0435 "const u16[]")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/hci_transport/hci_vendor.c")
                DW_AT_decl_line	(1646)

0x00000435:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0441 "const u16")

0x0000043a:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0072 "sizetype")
                  DW_AT_count	(0x10)

0x00000440:     NULL

0x00000441:   DW_TAG_const_type
                DW_AT_type	(cu + 0x0446 "u16")

0x00000446:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00fe "unsigned short")
                DW_AT_name	("u16")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(46)

0x00000451:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(1469)

0x00000456:     DW_TAG_enumerator
                  DW_AT_name	("BD_ADDR_TYPE_LE_PUBLIC")
                  DW_AT_const_value	(0)

0x0000045c:     DW_TAG_enumerator
                  DW_AT_name	("BD_ADDR_TYPE_LE_RANDOM")
                  DW_AT_const_value	(1)

0x00000462:     DW_TAG_enumerator
                  DW_AT_name	("BD_ADDR_TYPE_SCO")
                  DW_AT_const_value	(254)

0x00000469:     DW_TAG_enumerator
                  DW_AT_name	("BD_ADDR_TYPE_CLASSIC")
                  DW_AT_const_value	(255)

0x00000470:     DW_TAG_enumerator
                  DW_AT_name	("BD_ADDR_TYPE_UNKNOWN")
                  DW_AT_const_value	(254)

0x00000477:     NULL

0x00000478:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(246)

0x0000047c:     DW_TAG_enumerator
                  DW_AT_name	("CON_PARAMETER_UPDATE_NONE")
                  DW_AT_const_value	(0)

0x00000482:     DW_TAG_enumerator
                  DW_AT_name	("CON_PARAMETER_UPDATE_SEND_REQUEST")
                  DW_AT_const_value	(1)

0x00000488:     DW_TAG_enumerator
                  DW_AT_name	("CON_PARAMETER_UPDATE_SEND_RESPONSE")
                  DW_AT_const_value	(2)

0x0000048e:     DW_TAG_enumerator
                  DW_AT_name	("CON_PARAMETER_UPDATE_CHANGE_HCI_CON_PARAMETERS")
                  DW_AT_const_value	(3)

0x00000494:     DW_TAG_enumerator
                  DW_AT_name	("CON_PARAMETER_UPDATE_DENY")
                  DW_AT_const_value	(4)

0x0000049a:     NULL

0x0000049b:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(295)

0x000004a0:     DW_TAG_enumerator
                  DW_AT_name	("SM_GENERAL_IDLE")
                  DW_AT_const_value	(0)

0x000004a6:     DW_TAG_enumerator
                  DW_AT_name	("SM_GENERAL_SEND_PAIRING_FAILED")
                  DW_AT_const_value	(1)

0x000004ac:     DW_TAG_enumerator
                  DW_AT_name	("SM_GENERAL_TIMEOUT")
                  DW_AT_const_value	(2)

0x000004b2:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH1_W4_USER_RESPONSE")
                  DW_AT_const_value	(3)

0x000004b8:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_GET_RANDOM_TK")
                  DW_AT_const_value	(4)

0x000004be:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_W4_RANDOM_TK")
                  DW_AT_const_value	(5)

0x000004c4:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_GET_RANDOM_A")
                  DW_AT_const_value	(6)

0x000004ca:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_W4_RANDOM_A")
                  DW_AT_const_value	(7)

0x000004d0:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_GET_RANDOM_B")
                  DW_AT_const_value	(8)

0x000004d6:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_W4_RANDOM_B")
                  DW_AT_const_value	(9)

0x000004dc:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_GET_ENC_A")
                  DW_AT_const_value	(10)

0x000004e2:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_W4_ENC_A")
                  DW_AT_const_value	(11)

0x000004e8:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_GET_ENC_B")
                  DW_AT_const_value	(12)

0x000004ee:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_W4_ENC_B")
                  DW_AT_const_value	(13)

0x000004f4:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_GET_ENC_C")
                  DW_AT_const_value	(14)

0x000004fa:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_W4_ENC_C")
                  DW_AT_const_value	(15)

0x00000500:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_GET_ENC_D")
                  DW_AT_const_value	(16)

0x00000506:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_W4_ENC_D")
                  DW_AT_const_value	(17)

0x0000050c:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_SEND_PAIRING_CONFIRM")
                  DW_AT_const_value	(18)

0x00000512:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_SEND_PAIRING_RANDOM")
                  DW_AT_const_value	(19)

0x00000518:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_CALC_STK")
                  DW_AT_const_value	(20)

0x0000051e:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_W4_STK")
                  DW_AT_const_value	(21)

0x00000524:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_W4_CONNECTION_ENCRYPTED")
                  DW_AT_const_value	(22)

0x0000052a:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_GET_RANDOM")
                  DW_AT_const_value	(23)

0x00000530:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_W4_RANDOM")
                  DW_AT_const_value	(24)

0x00000536:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_GET_DIV")
                  DW_AT_const_value	(25)

0x0000053c:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_W4_DIV")
                  DW_AT_const_value	(26)

0x00000542:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_Y_GET_ENC")
                  DW_AT_const_value	(27)

0x00000548:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_Y_W4_ENC")
                  DW_AT_const_value	(28)

0x0000054e:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_LTK_GET_ENC")
                  DW_AT_const_value	(29)

0x00000554:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_LTK_W4_ENC")
                  DW_AT_const_value	(30)

0x0000055a:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_CSRK_GET_ENC")
                  DW_AT_const_value	(31)

0x00000560:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_CSRK_W4_ENC")
                  DW_AT_const_value	(32)

0x00000566:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_DISTRIBUTE_KEYS")
                  DW_AT_const_value	(33)

0x0000056c:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_RECEIVE_KEYS")
                  DW_AT_const_value	(34)

0x00000572:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_IDLE")
                  DW_AT_const_value	(35)

0x00000578:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_SEND_SECURITY_REQUEST")
                  DW_AT_const_value	(36)

0x0000057e:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH0_RECEIVED_LTK_REQUEST")
                  DW_AT_const_value	(37)

0x00000584:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH0_RECEIVED_LTK_W4_IRK")
                  DW_AT_const_value	(38)

0x0000058a:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH0_SEND_LTK_REQUESTED_NEGATIVE_REPLY")
                  DW_AT_const_value	(39)

0x00000590:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH1_W4_PAIRING_REQUEST")
                  DW_AT_const_value	(40)

0x00000596:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH1_PAIRING_REQUEST_RECEIVED")
                  DW_AT_const_value	(41)

0x0000059c:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH1_SEND_PAIRING_RESPONSE")
                  DW_AT_const_value	(42)

0x000005a2:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH1_W4_PAIRING_CONFIRM")
                  DW_AT_const_value	(43)

0x000005a8:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH2_W4_PAIRING_RANDOM")
                  DW_AT_const_value	(44)

0x000005ae:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH2_W4_LTK_REQUEST")
                  DW_AT_const_value	(45)

0x000005b4:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH2_SEND_LTK_REPLY")
                  DW_AT_const_value	(46)

0x000005ba:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH4_Y_GET_ENC")
                  DW_AT_const_value	(47)

0x000005c0:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH4_Y_W4_ENC")
                  DW_AT_const_value	(48)

0x000005c6:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH4_LTK_GET_ENC")
                  DW_AT_const_value	(49)

0x000005cc:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH4_LTK_W4_ENC")
                  DW_AT_const_value	(50)

0x000005d2:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH4_SEND_LTK_REPLY")
                  DW_AT_const_value	(51)

0x000005d8:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_CONNECTED")
                  DW_AT_const_value	(52)

0x000005de:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_PH0_HAS_LTK")
                  DW_AT_const_value	(53)

0x000005e4:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_PH0_SEND_START_ENCRYPTION")
                  DW_AT_const_value	(54)

0x000005ea:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_PH0_W4_CONNECTION_ENCRYPTED")
                  DW_AT_const_value	(55)

0x000005f0:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_PH1_W2_SEND_PAIRING_REQUEST")
                  DW_AT_const_value	(56)

0x000005f6:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_PH1_SEND_PAIRING_REQUEST")
                  DW_AT_const_value	(57)

0x000005fc:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_PH1_W4_PAIRING_RESPONSE")
                  DW_AT_const_value	(58)

0x00000602:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_PH2_W4_PAIRING_CONFIRM")
                  DW_AT_const_value	(59)

0x00000608:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_PH2_W4_PAIRING_RANDOM")
                  DW_AT_const_value	(60)

0x0000060e:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_PH3_SEND_START_ENCRYPTION")
                  DW_AT_const_value	(61)

0x00000614:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_RECEIVED_LTK_REQUEST")
                  DW_AT_const_value	(62)

0x0000061a:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_SEND_PUBLIC_KEY_COMMAND")
                  DW_AT_const_value	(63)

0x00000620:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_PUBLIC_KEY_COMMAND")
                  DW_AT_const_value	(64)

0x00000627:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_GET_RANDOM_A")
                  DW_AT_const_value	(65)

0x0000062e:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_GET_RANDOM_A")
                  DW_AT_const_value	(66)

0x00000635:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_GET_RANDOM_B")
                  DW_AT_const_value	(67)

0x0000063c:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_GET_RANDOM_B")
                  DW_AT_const_value	(68)

0x00000643:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CMAC_FOR_CONFIRMATION")
                  DW_AT_const_value	(69)

0x0000064a:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CMAC_FOR_CONFIRMATION")
                  DW_AT_const_value	(70)

0x00000651:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_SEND_CONFIRMATION")
                  DW_AT_const_value	(71)

0x00000658:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CMAC_FOR_CHECK_CONFIRMATION")
                  DW_AT_const_value	(72)

0x0000065f:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CMAC_FOR_CHECK_CONFIRMATION")
                  DW_AT_const_value	(73)

0x00000666:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CONFIRMATION")
                  DW_AT_const_value	(74)

0x0000066d:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_SEND_PAIRING_RANDOM")
                  DW_AT_const_value	(75)

0x00000674:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_PAIRING_RANDOM")
                  DW_AT_const_value	(76)

0x0000067b:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CALCULATE_G2")
                  DW_AT_const_value	(77)

0x00000682:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CALCULATE_G2")
                  DW_AT_const_value	(78)

0x00000689:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CALCULATE_DHKEY")
                  DW_AT_const_value	(79)

0x00000690:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CALCULATE_F5_SALT")
                  DW_AT_const_value	(80)

0x00000697:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CALCULATE_F5_SALT")
                  DW_AT_const_value	(81)

0x0000069e:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CALCULATE_F5_MACKEY")
                  DW_AT_const_value	(82)

0x000006a5:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CALCULATE_F5_MACKEY")
                  DW_AT_const_value	(83)

0x000006ac:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CALCULATE_F5_LTK")
                  DW_AT_const_value	(84)

0x000006b3:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CALCULATE_F5_LTK")
                  DW_AT_const_value	(85)

0x000006ba:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CALCULATE_F6_FOR_DHKEY_CHECK")
                  DW_AT_const_value	(86)

0x000006c1:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CALCULATE_F6_FOR_DHKEY_CHECK")
                  DW_AT_const_value	(87)

0x000006c8:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CALCULATE_F6_TO_VERIFY_DHKEY_CHECK")
                  DW_AT_const_value	(88)

0x000006cf:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CALCULATE_F6_TO_VERIFY_DHKEY_CHECK")
                  DW_AT_const_value	(89)

0x000006d6:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_USER_RESPONSE")
                  DW_AT_const_value	(90)

0x000006dd:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_SEND_DHKEY_CHECK_COMMAND")
                  DW_AT_const_value	(91)

0x000006e4:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_DHKEY_CHECK_COMMAND")
                  DW_AT_const_value	(92)

0x000006eb:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_LTK_REQUEST_SC")
                  DW_AT_const_value	(93)

0x000006f2:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CALCULATE_H6_ILK")
                  DW_AT_const_value	(94)

0x000006f9:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CALCULATE_H6_ILK")
                  DW_AT_const_value	(95)

0x00000700:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CALCULATE_H6_BR_EDR_LINK_KEY")
                  DW_AT_const_value	(96)

0x00000707:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CALCULATE_H6_BR_EDR_LINK_KEY")
                  DW_AT_const_value	(97)

0x0000070e:     NULL

0x0000070f:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(436)

0x00000714:     DW_TAG_enumerator
                  DW_AT_name	("IRK_LOOKUP_IDLE")
                  DW_AT_const_value	(0)

0x0000071a:     DW_TAG_enumerator
                  DW_AT_name	("IRK_LOOKUP_W4_READY")
                  DW_AT_const_value	(1)

0x00000720:     DW_TAG_enumerator
                  DW_AT_name	("IRK_LOOKUP_STARTED")
                  DW_AT_const_value	(2)

0x00000726:     DW_TAG_enumerator
                  DW_AT_name	("IRK_LOOKUP_SUCCEEDED")
                  DW_AT_const_value	(3)

0x0000072c:     DW_TAG_enumerator
                  DW_AT_name	("IRK_LOOKUP_FAILED")
                  DW_AT_const_value	(4)

0x00000732:     NULL

0x00000733:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(445)

0x00000738:     DW_TAG_enumerator
                  DW_AT_name	("AUTHORIZATION_UNKNOWN")
                  DW_AT_const_value	(0)

0x0000073e:     DW_TAG_enumerator
                  DW_AT_name	("AUTHORIZATION_PENDING")
                  DW_AT_const_value	(1)

0x00000744:     DW_TAG_enumerator
                  DW_AT_name	("AUTHORIZATION_DECLINED")
                  DW_AT_const_value	(2)

0x0000074a:     DW_TAG_enumerator
                  DW_AT_name	("AUTHORIZATION_GRANTED")
                  DW_AT_const_value	(3)

0x00000750:     NULL

0x00000751:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                DW_AT_decl_line	(157)

0x00000755:     DW_TAG_enumerator
                  DW_AT_name	("ATT_SERVER_IDLE")
                  DW_AT_const_value	(0)

0x0000075b:     DW_TAG_enumerator
                  DW_AT_name	("ATT_SERVER_REQUEST_RECEIVED")
                  DW_AT_const_value	(1)

0x00000761:     DW_TAG_enumerator
                  DW_AT_name	("ATT_SERVER_W4_SIGNED_WRITE_VALIDATION")
                  DW_AT_const_value	(2)

0x00000767:     DW_TAG_enumerator
                  DW_AT_name	("ATT_SERVER_REQUEST_RECEIVED_AND_VALIDATED")
                  DW_AT_const_value	(3)

0x0000076d:     NULL

0x0000076e:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/bt_config.h")
                DW_AT_decl_line	(11)

0x00000772:     DW_TAG_enumerator
                  DW_AT_name	("ACTIVE_MODE")
                  DW_AT_const_value	(0)

0x00000778:     DW_TAG_enumerator
                  DW_AT_name	("HOLD_MODE")
                  DW_AT_const_value	(1)

0x0000077e:     DW_TAG_enumerator
                  DW_AT_name	("SNIFF_MODE")
                  DW_AT_const_value	(2)

0x00000784:     NULL

0x00000785:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                DW_AT_decl_line	(299)

0x0000078a:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_POWER_ON")
                  DW_AT_const_value	(1)

0x00000790:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_POWER_OFF")
                  DW_AT_const_value	(2)

0x00000796:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_INIT_OK")
                  DW_AT_const_value	(3)

0x0000079c:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_EXIT_OK")
                  DW_AT_const_value	(4)

0x000007a2:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_START_CONNECTED")
                  DW_AT_const_value	(5)

0x000007a8:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_FIRST_CONNECTED")
                  DW_AT_const_value	(6)

0x000007ae:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_SECOND_CONNECTED")
                  DW_AT_const_value	(7)

0x000007b4:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_ENCRY_COMPLETE")
                  DW_AT_const_value	(8)

0x000007ba:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_FIRST_DISCONNECT")
                  DW_AT_const_value	(9)

0x000007c0:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_SECOND_DISCONNECT")
                  DW_AT_const_value	(10)

0x000007c6:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_PHONE_INCOME")
                  DW_AT_const_value	(11)

0x000007cc:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_PHONE_NUMBER")
                  DW_AT_const_value	(12)

0x000007d2:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_PHONE_MANUFACTURER")
                  DW_AT_const_value	(13)

0x000007d8:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_PHONE_OUT")
                  DW_AT_const_value	(14)

0x000007de:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_PHONE_ACTIVE")
                  DW_AT_const_value	(15)

0x000007e4:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_PHONE_HANGUP")
                  DW_AT_const_value	(16)

0x000007ea:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_BEGIN_AUTO_CON")
                  DW_AT_const_value	(17)

0x000007f0:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_MUSIC_SOUND_COME")
                  DW_AT_const_value	(18)

0x000007f6:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_MUSIC_SOUND_GO")
                  DW_AT_const_value	(19)

0x000007fc:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_RESUME")
                  DW_AT_const_value	(20)

0x00000802:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_RESUME_BTSTACK")
                  DW_AT_const_value	(21)

0x00000808:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_SUSPEND")
                  DW_AT_const_value	(22)

0x0000080e:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_LAST_CALL_TYPE_CHANGE")
                  DW_AT_const_value	(23)

0x00000814:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_CALL_VOL_CHANGE")
                  DW_AT_const_value	(24)

0x0000081a:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_SCO_STATUS_CHANGE")
                  DW_AT_const_value	(25)

0x00000820:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_CONNECT_WITHOUT_LINKKEY")
                  DW_AT_const_value	(26)

0x00000826:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_PHONE_BATTERY_CHANGE")
                  DW_AT_const_value	(27)

0x0000082c:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_RECONNECT_LINKKEY_LOST")
                  DW_AT_const_value	(28)

0x00000832:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_RECONN_OR_CONN")
                  DW_AT_const_value	(29)

0x00000838:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_BT_TEST_BOX_CMD")
                  DW_AT_const_value	(30)

0x0000083e:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_BT_TWS_CONNECT_CMD")
                  DW_AT_const_value	(31)

0x00000844:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_SNIFF_STATE_UPDATE")
                  DW_AT_const_value	(32)

0x0000084a:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_TONE_BY_FILE_NAME")
                  DW_AT_const_value	(33)

0x00000850:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_PHONE_DATE_AND_TIME")
                  DW_AT_const_value	(34)

0x00000856:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_INBAND_RINGTONE")
                  DW_AT_const_value	(35)

0x0000085c:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_VOICE_RECOGNITION")
                  DW_AT_const_value	(36)

0x00000862:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_AVRCP_INCOME_OPID")
                  DW_AT_const_value	(37)

0x00000868:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_HFP_SERVICE_LEVEL_CONNECTION_OK")
                  DW_AT_const_value	(38)

0x0000086e:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_CONN_A2DP_CH")
                  DW_AT_const_value	(39)

0x00000874:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_CONN_HFP_CH")
                  DW_AT_const_value	(40)

0x0000087a:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_INQUIRY_TIMEOUT")
                  DW_AT_const_value	(41)

0x00000880:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_INITING")
                  DW_AT_const_value	(42)

0x00000886:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_WAITINT_CONN")
                  DW_AT_const_value	(43)

0x0000088c:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_AUTO_CONNECTINT")
                  DW_AT_const_value	(44)

0x00000892:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_CONNECTING")
                  DW_AT_const_value	(45)

0x00000898:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_TAKEING_PHONE")
                  DW_AT_const_value	(46)

0x0000089e:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_PLAYING_MUSIC")
                  DW_AT_const_value	(47)

0x000008a4:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_A2DP_MEDIA_START")
                  DW_AT_const_value	(48)

0x000008aa:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_A2DP_MEDIA_STOP")
                  DW_AT_const_value	(49)

0x000008b0:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_BROADCAST_STATE")
                  DW_AT_const_value	(50)

0x000008b6:     DW_TAG_enumerator
                  DW_AT_name	("BT_STATUS_TRIM_OVER")
                  DW_AT_const_value	(51)

0x000008bc:     NULL

0x000008bd:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/bredr/multi_bd.h")
                DW_AT_decl_line	(6)

0x000008c1:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_SCO_REQ")
                  DW_AT_const_value	(1)

0x000008c7:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_SCO_CONNECTED")
                  DW_AT_const_value	(2)

0x000008cd:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_SCO_DISCONN")
                  DW_AT_const_value	(3)

0x000008d3:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_A2DP_ACTIVE")
                  DW_AT_const_value	(4)

0x000008d9:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_A2DP_STOP")
                  DW_AT_const_value	(5)

0x000008df:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_CALL_INCOMING")
                  DW_AT_const_value	(6)

0x000008e5:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_CALL_OUTGOING")
                  DW_AT_const_value	(7)

0x000008eb:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_CALL_HANGUP")
                  DW_AT_const_value	(8)

0x000008f1:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_SET_WORK_TIME")
                  DW_AT_const_value	(9)

0x000008f7:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_CLR_WORK_TIME")
                  DW_AT_const_value	(10)

0x000008fd:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_SCAN_STATUS")
                  DW_AT_const_value	(11)

0x00000903:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_SIRI_ACTIVE")
                  DW_AT_const_value	(12)

0x00000909:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_SIRI_STOP")
                  DW_AT_const_value	(13)

0x0000090f:     DW_TAG_enumerator
                  DW_AT_name	("MULTI_BD_A2DP_CONN_CH")
                  DW_AT_const_value	(14)

0x00000915:     NULL

0x00000916:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                DW_AT_decl_line	(631)

0x0000091b:     DW_TAG_enumerator
                  DW_AT_name	("REMOTE_DEV_UNKNOWN")
                  DW_AT_const_value	(0)

0x00000921:     DW_TAG_enumerator
                  DW_AT_name	("REMOTE_DEV_ANDROID")
                  DW_AT_const_value	(1)

0x00000927:     DW_TAG_enumerator
                  DW_AT_name	("REMOTE_DEV_IOS")
                  DW_AT_const_value	(2)

0x0000092d:     DW_TAG_enumerator
                  DW_AT_name	("REMOTE_DEV_XIAOMI")
                  DW_AT_const_value	(3)

0x00000933:     NULL

0x00000934:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(1480)

0x00000939:     DW_TAG_enumerator
                  DW_AT_name	("HCI_POWER_OFF")
                  DW_AT_const_value	(0)

0x0000093f:     DW_TAG_enumerator
                  DW_AT_name	("HCI_POWER_ON")
                  DW_AT_const_value	(1)

0x00000945:     NULL

0x00000946:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(1489)

0x0000094b:     DW_TAG_enumerator
                  DW_AT_name	("HCI_STATE_OFF")
                  DW_AT_const_value	(0)

0x00000951:     DW_TAG_enumerator
                  DW_AT_name	("HCI_STATE_INITIALIZING")
                  DW_AT_const_value	(1)

0x00000957:     DW_TAG_enumerator
                  DW_AT_name	("HCI_STATE_WORKING")
                  DW_AT_const_value	(2)

0x0000095d:     DW_TAG_enumerator
                  DW_AT_name	("HCI_STATE_HALTING")
                  DW_AT_const_value	(3)

0x00000963:     DW_TAG_enumerator
                  DW_AT_name	("HCI_STATE_SLEEPING")
                  DW_AT_const_value	(4)

0x00000969:     DW_TAG_enumerator
                  DW_AT_name	("HCI_STATE_FALLING_ASLEEP")
                  DW_AT_const_value	(5)

0x0000096f:     NULL

0x00000970:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gap.h")
                DW_AT_decl_line	(112)

0x00000974:     DW_TAG_enumerator
                  DW_AT_name	("GAP_RANDOM_ADDRESS_TYPE_OFF")
                  DW_AT_const_value	(0)

0x0000097a:     DW_TAG_enumerator
                  DW_AT_name	("GAP_RANDOM_ADDRESS_TYPE_STATIC")
                  DW_AT_const_value	(1)

0x00000980:     DW_TAG_enumerator
                  DW_AT_name	("GAP_RANDOM_ADDRESS_NON_RESOLVABLE")
                  DW_AT_const_value	(2)

0x00000986:     DW_TAG_enumerator
                  DW_AT_name	("GAP_RANDOM_ADDRESS_RESOLVABLE")
                  DW_AT_const_value	(3)

0x0000098c:     NULL

0x0000098d:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/utils.h")
                DW_AT_decl_line	(75)

0x00000991:     DW_TAG_enumerator
                  DW_AT_name	("COMBINATION_KEY")
                  DW_AT_const_value	(0)

0x00000997:     DW_TAG_enumerator
                  DW_AT_name	("LOCAL_UNIT_KEY")
                  DW_AT_const_value	(1)

0x0000099d:     DW_TAG_enumerator
                  DW_AT_name	("REMOTE_UNIT_KEY")
                  DW_AT_const_value	(2)

0x000009a3:     DW_TAG_enumerator
                  DW_AT_name	("DEBUG_COMBINATION_KEY")
                  DW_AT_const_value	(3)

0x000009a9:     DW_TAG_enumerator
                  DW_AT_name	("UNAUTHENTICATED_COMBINATION_KEY_GENERATED_FROM_P192")
                  DW_AT_const_value	(4)

0x000009af:     DW_TAG_enumerator
                  DW_AT_name	("AUTHENTICATED_COMBINATION_KEY_GENERATED_FROM_P192")
                  DW_AT_const_value	(5)

0x000009b5:     DW_TAG_enumerator
                  DW_AT_name	("CHANGED_COMBINATION_KEY")
                  DW_AT_const_value	(6)

0x000009bb:     DW_TAG_enumerator
                  DW_AT_name	("UNAUTHENTICATED_COMBINATION_KEY_GENERATED_FROM_P256")
                  DW_AT_const_value	(7)

0x000009c1:     DW_TAG_enumerator
                  DW_AT_name	("AUTHENTICATED_COMBINATION_KEY_GENERATED_FROM_P256")
                  DW_AT_const_value	(8)

0x000009c7:     NULL

0x000009c8:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                DW_AT_decl_line	(12)

0x000009cc:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_START_CONNECTION")
                  DW_AT_const_value	(0)

0x000009d2:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_START_CONNEC_VIA_ADDR")
                  DW_AT_const_value	(1)

0x000009d8:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_START_CONNEC_VIA_ADDR_MANUALLY")
                  DW_AT_const_value	(2)

0x000009de:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_START_CONNEC_SPP_VIA_ADDR")
                  DW_AT_const_value	(3)

0x000009e4:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_DISCONNECTION_HCI")
                  DW_AT_const_value	(4)

0x000009ea:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_CONNECTION_CANCEL")
                  DW_AT_const_value	(5)

0x000009f0:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_READ_REMOTE_NAME")
                  DW_AT_const_value	(6)

0x000009f6:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_PAUSE_MUSIC")
                  DW_AT_const_value	(7)

0x000009fc:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SCO_LINK")
                  DW_AT_const_value	(8)

0x00000a02:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_CONN_SCO")
                  DW_AT_const_value	(9)

0x00000a08:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_DISCONN_SCO")
                  DW_AT_const_value	(10)

0x00000a0e:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_DISCONN_SDP_MASTER")
                  DW_AT_const_value	(11)

0x00000a14:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_WRITE_SCAN_DISABLE")
                  DW_AT_const_value	(12)

0x00000a1a:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_WRITE_SCAN_ENABLE")
                  DW_AT_const_value	(13)

0x00000a20:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_WRITE_CONN_DISABLE")
                  DW_AT_const_value	(14)

0x00000a26:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_WRITE_CONN_ENABLE")
                  DW_AT_const_value	(15)

0x00000a2c:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SEARCH_DEVICE")
                  DW_AT_const_value	(16)

0x00000a32:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_INQUIRY_CANCEL")
                  DW_AT_const_value	(17)

0x00000a38:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_PAGE_CANCEL")
                  DW_AT_const_value	(18)

0x00000a3e:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SNIFF_IN")
                  DW_AT_const_value	(19)

0x00000a44:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SNIFF_EXIT")
                  DW_AT_const_value	(20)

0x00000a4a:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_ALL_SNIFF_EXIT")
                  DW_AT_const_value	(21)

0x00000a50:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CMD_BEGIN")
                  DW_AT_const_value	(22)

0x00000a56:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CALL_VOLUME_UP")
                  DW_AT_const_value	(23)

0x00000a5c:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CALL_VOLUME_DOWN")
                  DW_AT_const_value	(24)

0x00000a62:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CALL_SET_VOLUME")
                  DW_AT_const_value	(25)

0x00000a68:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CALL_GET_VOLUME")
                  DW_AT_const_value	(26)

0x00000a6e:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CALL_ANSWER")
                  DW_AT_const_value	(27)

0x00000a74:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CALL_HANGUP")
                  DW_AT_const_value	(28)

0x00000a7a:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CALL_LAST_NO")
                  DW_AT_const_value	(29)

0x00000a80:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CALL_CURRENT")
                  DW_AT_const_value	(30)

0x00000a86:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_DTMF_TONES")
                  DW_AT_const_value	(31)

0x00000a8c:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_DIAL_NUMBER")
                  DW_AT_const_value	(32)

0x00000a92:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SEND_BATTERY")
                  DW_AT_const_value	(33)

0x00000a98:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_GET_SIRI_STATUS")
                  DW_AT_const_value	(34)

0x00000a9e:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_GET_SIRI_OPEN")
                  DW_AT_const_value	(35)

0x00000aa4:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_GET_SIRI_CLOSE")
                  DW_AT_const_value	(36)

0x00000aaa:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_GET_PHONE_DATE_TIME")
                  DW_AT_const_value	(37)

0x00000ab0:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CMD_SEND_BIA")
                  DW_AT_const_value	(38)

0x00000ab6:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CMD_GET_MANUFACTURER")
                  DW_AT_const_value	(39)

0x00000abc:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CMD_UPDATE_BATTARY")
                  DW_AT_const_value	(40)

0x00000ac2:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_THREE_WAY_ANSWER1")
                  DW_AT_const_value	(41)

0x00000ac8:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_THREE_WAY_ANSWER2")
                  DW_AT_const_value	(42)

0x00000ace:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_THREE_WAY_ANSWER1X")
                  DW_AT_const_value	(43)

0x00000ad4:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_THREE_WAY_ANSWER2X")
                  DW_AT_const_value	(44)

0x00000ada:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_THREE_WAY_ANSWER3")
                  DW_AT_const_value	(45)

0x00000ae0:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_THREE_WAY_REJECT")
                  DW_AT_const_value	(46)

0x00000ae6:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_DISCONNECT")
                  DW_AT_const_value	(47)

0x00000aec:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HFP_CMD_END")
                  DW_AT_const_value	(48)

0x00000af2:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_CMD_BEGIN")
                  DW_AT_const_value	(49)

0x00000af8:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_PLAY")
                  DW_AT_const_value	(50)

0x00000afe:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_PAUSE")
                  DW_AT_const_value	(51)

0x00000b04:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_STOP")
                  DW_AT_const_value	(52)

0x00000b0a:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_NEXT")
                  DW_AT_const_value	(53)

0x00000b10:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_PREV")
                  DW_AT_const_value	(54)

0x00000b16:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_FORWARD")
                  DW_AT_const_value	(55)

0x00000b1c:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_REWIND")
                  DW_AT_const_value	(56)

0x00000b22:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_REPEAT_MODE")
                  DW_AT_const_value	(57)

0x00000b28:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_SHUFFLE_MODE")
                  DW_AT_const_value	(58)

0x00000b2e:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_GET_PLAY_TIME")
                  DW_AT_const_value	(59)

0x00000b34:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_SEND_VOL")
                  DW_AT_const_value	(60)

0x00000b3a:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_DISCONNECT")
                  DW_AT_const_value	(61)

0x00000b40:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_CONN")
                  DW_AT_const_value	(62)

0x00000b46:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_CMD_END")
                  DW_AT_const_value	(63)

0x00000b4c:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_A2DP_CMD_BEGIN")
                  DW_AT_const_value	(64)

0x00000b53:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AUTO_CONN_A2DP")
                  DW_AT_const_value	(65)

0x00000b5a:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_CONN_A2DP")
                  DW_AT_const_value	(66)

0x00000b61:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_DISCONN_A2DP")
                  DW_AT_const_value	(67)

0x00000b68:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_A2DP_CMD_START")
                  DW_AT_const_value	(68)

0x00000b6f:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_A2DP_CMD_CLOSE")
                  DW_AT_const_value	(69)

0x00000b76:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_A2DP_CMD_SUSPEND")
                  DW_AT_const_value	(70)

0x00000b7d:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_A2DP_CMD_GET_CONFIGURATION")
                  DW_AT_const_value	(71)

0x00000b84:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_A2DP_CMD_ABORT")
                  DW_AT_const_value	(72)

0x00000b8b:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_A2DP_CMD_END")
                  DW_AT_const_value	(73)

0x00000b92:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_POWER_OFF")
                  DW_AT_const_value	(74)

0x00000b99:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_POWER_ON")
                  DW_AT_const_value	(75)

0x00000ba0:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_CMD_BEGIN")
                  DW_AT_const_value	(76)

0x00000ba7:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_CONN")
                  DW_AT_const_value	(77)

0x00000bae:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_ANDROID")
                  DW_AT_const_value	(78)

0x00000bb5:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_IOS")
                  DW_AT_const_value	(79)

0x00000bbc:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_BOTH")
                  DW_AT_const_value	(80)

0x00000bc3:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_DISCONNECT")
                  DW_AT_const_value	(81)

0x00000bca:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_HOME")
                  DW_AT_const_value	(82)

0x00000bd1:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_RETURN")
                  DW_AT_const_value	(83)

0x00000bd8:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_LEFTARROW")
                  DW_AT_const_value	(84)

0x00000bdf:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_RIGHTARROW")
                  DW_AT_const_value	(85)

0x00000be6:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_VOL_UP")
                  DW_AT_const_value	(86)

0x00000bed:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_VOL_DOWN")
                  DW_AT_const_value	(87)

0x00000bf4:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_SEND_DATA")
                  DW_AT_const_value	(88)

0x00000bfb:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HID_CMD_END")
                  DW_AT_const_value	(89)

0x00000c02:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_CMD_BEGIN")
                  DW_AT_const_value	(90)

0x00000c09:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SYNC_TRAIN")
                  DW_AT_const_value	(91)

0x00000c10:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SYNC_TRAIN_SCAN")
                  DW_AT_const_value	(92)

0x00000c17:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_MONITOR")
                  DW_AT_const_value	(93)

0x00000c1e:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_CONNEC_VIA_ADDR")
                  DW_AT_const_value	(94)

0x00000c25:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_COTROL_CDM")
                  DW_AT_const_value	(95)

0x00000c2c:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_CLEAR_INFO")
                  DW_AT_const_value	(96)

0x00000c33:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_DISCONNECTION_HCI")
                  DW_AT_const_value	(97)

0x00000c3a:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_START_CONNECTION")
                  DW_AT_const_value	(98)

0x00000c41:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_SYNC_CDM")
                  DW_AT_const_value	(99)

0x00000c48:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_SYNC_SBC_CDM")
                  DW_AT_const_value	(100)

0x00000c4f:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_RESTART_SBC_CDM")
                  DW_AT_const_value	(101)

0x00000c56:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SYNC_TRAIN_CANCEL")
                  DW_AT_const_value	(102)

0x00000c5d:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SYNC_TRAIN_SCAN_CANCEL")
                  DW_AT_const_value	(103)

0x00000c64:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_SYNC_CDM_FUN")
                  DW_AT_const_value	(104)

0x00000c6b:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_LINEIN_START")
                  DW_AT_const_value	(105)

0x00000c72:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_LINEIN_CLOSE")
                  DW_AT_const_value	(106)

0x00000c79:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TWS_CMD_END")
                  DW_AT_const_value	(107)

0x00000c80:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SPP_CMD_BEGIN")
                  DW_AT_const_value	(108)

0x00000c87:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SPP_SEND_DATA")
                  DW_AT_const_value	(109)

0x00000c8e:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SPP_TRY_SEND_DATA")
                  DW_AT_const_value	(110)

0x00000c95:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SPP_UPDATA_DATA")
                  DW_AT_const_value	(111)

0x00000c9c:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SPP_DISCONNECT")
                  DW_AT_const_value	(112)

0x00000ca3:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SPP_CMD_END")
                  DW_AT_const_value	(113)

0x00000caa:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_PBG_CMD_BEGIN")
                  DW_AT_const_value	(114)

0x00000cb1:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_PBG_SEND_DATA")
                  DW_AT_const_value	(115)

0x00000cb8:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_PBG_TRY_SEND_DATA")
                  DW_AT_const_value	(116)

0x00000cbf:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_PBG_CMD_END")
                  DW_AT_const_value	(117)

0x00000cc6:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_ADT_CMD_BEGIN")
                  DW_AT_const_value	(118)

0x00000ccd:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_ADT_CONNECT")
                  DW_AT_const_value	(119)

0x00000cd4:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_ADT_KEY_MIC_OPEN")
                  DW_AT_const_value	(120)

0x00000cdb:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_ADT_SEND_DATA")
                  DW_AT_const_value	(121)

0x00000ce2:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_ADT_TRY_SEND_DATA")
                  DW_AT_const_value	(122)

0x00000ce9:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_ADT_CMD_END")
                  DW_AT_const_value	(123)

0x00000cf0:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_PBAP_CMD_BEGIN")
                  DW_AT_const_value	(124)

0x00000cf7:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_PBAP_READ_PART")
                  DW_AT_const_value	(125)

0x00000cfe:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_PBAP_READ_ALL")
                  DW_AT_const_value	(126)

0x00000d05:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_PBAP_STOP_READING")
                  DW_AT_const_value	(127)

0x00000d0c:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_PBAP_CMD_END")
                  DW_AT_const_value	(128)

0x00000d13:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_DEL_ALL_REMOTE_INFO")
                  DW_AT_const_value	(129)

0x00000d1a:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_TEST_KEY")
                  DW_AT_const_value	(130)

0x00000d21:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_SEND_USER_INFO")
                  DW_AT_const_value	(131)

0x00000d28:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_KEYPRESS")
                  DW_AT_const_value	(132)

0x00000d2f:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_PAIR")
                  DW_AT_const_value	(133)

0x00000d36:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AFH_CHANNEL")
                  DW_AT_const_value	(134)

0x00000d3d:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HALF_SEC_LOOP_CREATE")
                  DW_AT_const_value	(135)

0x00000d44:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_HALF_SEC_LOOP_DEL")
                  DW_AT_const_value	(136)

0x00000d4b:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_CMD_SYNC_VOL_INC")
                  DW_AT_const_value	(137)

0x00000d52:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_CMD_SYNC_VOL_DEC")
                  DW_AT_const_value	(138)

0x00000d59:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_CMD_CHANGE_PROFILE_MODE")
                  DW_AT_const_value	(139)

0x00000d60:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_CMD_RESERVE_INDEX4")
                  DW_AT_const_value	(140)

0x00000d67:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_CMD_RESUME_STACK")
                  DW_AT_const_value	(141)

0x00000d6e:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_AVCTP_OPID_GET_MUSIC_INFO")
                  DW_AT_const_value	(142)

0x00000d75:     DW_TAG_enumerator
                  DW_AT_name	("USER_CTRL_LAST")
                  DW_AT_const_value	(143)

0x00000d7c:     NULL

0x00000d7d:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0d82 "le_hci_connection_t")

0x00000d82:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0d8e "__le_hci_connection")
                DW_AT_name	("le_hci_connection_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(605)

0x00000d8e:   DW_TAG_structure_type
                DW_AT_name	("__le_hci_connection")
                DW_AT_byte_size	(0x04c8)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(571)

0x00000d98:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x03e1 "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(572)
                  DW_AT_data_member_location	(0x00)

0x00000da5:     DW_TAG_member
                  DW_AT_name	("address")
                  DW_AT_type	(cu + 0x008f "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(574)
                  DW_AT_data_member_location	(0x04)

0x00000db2:     DW_TAG_member
                  DW_AT_name	("con_handle")
                  DW_AT_type	(cu + 0x0ea4 "hci_con_handle_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(576)
                  DW_AT_data_member_location	(0x0a)

0x00000dbf:     DW_TAG_member
                  DW_AT_name	("address_type")
                  DW_AT_type	(cu + 0x0eaf "bd_addr_type_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(578)
                  DW_AT_data_member_location	(0x0c)

0x00000dcc:     DW_TAG_member
                  DW_AT_name	("role")
                  DW_AT_type	(cu + 0x00a6 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(581)
                  DW_AT_data_member_location	(0x10)

0x00000dd9:     DW_TAG_member
                  DW_AT_name	("le_con_parameter_update_state")
                  DW_AT_type	(cu + 0x0ebb "le_con_parameter_update_state_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(584)
                  DW_AT_data_member_location	(0x14)

0x00000de6:     DW_TAG_member
                  DW_AT_name	("le_con_param_update_identifier")
                  DW_AT_type	(cu + 0x00a6 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(585)
                  DW_AT_data_member_location	(0x18)

0x00000df3:     DW_TAG_member
                  DW_AT_name	("le_conn_interval_min")
                  DW_AT_type	(cu + 0x00f3 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(586)
                  DW_AT_data_member_location	(0x1a)

0x00000e00:     DW_TAG_member
                  DW_AT_name	("le_conn_interval_max")
                  DW_AT_type	(cu + 0x00f3 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(587)
                  DW_AT_data_member_location	(0x1c)

0x00000e0d:     DW_TAG_member
                  DW_AT_name	("le_conn_latency")
                  DW_AT_type	(cu + 0x00f3 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(588)
                  DW_AT_data_member_location	(0x1e)

0x00000e1a:     DW_TAG_member
                  DW_AT_name	("le_supervision_timeout")
                  DW_AT_type	(cu + 0x00f3 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(589)
                  DW_AT_data_member_location	(0x20)

0x00000e27:     DW_TAG_member
                  DW_AT_name	("sm_connection")
                  DW_AT_type	(cu + 0x0ec6 "sm_connection_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(592)
                  DW_AT_data_member_location	(0x24)

0x00000e34:     DW_TAG_member
                  DW_AT_name	("att_server")
                  DW_AT_type	(cu + 0x100e "att_server_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(595)
                  DW_AT_data_member_location	(0x5c)

0x00000e41:     DW_TAG_member
                  DW_AT_name	("acl_recombination_buffer")
                  DW_AT_type	(cu + 0x1225 "uint8_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(597)
                  DW_AT_data_member_location	(0x02a0)

0x00000e4f:     DW_TAG_member
                  DW_AT_name	("acl_recombination_pos")
                  DW_AT_type	(cu + 0x00f3 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(598)
                  DW_AT_data_member_location	(0x04b2)

0x00000e5d:     DW_TAG_member
                  DW_AT_name	("acl_recombination_length")
                  DW_AT_type	(cu + 0x00f3 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(599)
                  DW_AT_data_member_location	(0x04b4)

0x00000e6b:     DW_TAG_member
                  DW_AT_name	("num_acl_packets_sent")
                  DW_AT_type	(cu + 0x00a6 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(600)
                  DW_AT_data_member_location	(0x04b6)

0x00000e79:     DW_TAG_member
                  DW_AT_name	("own_id_address")
                  DW_AT_type	(cu + 0x008f "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(602)
                  DW_AT_data_member_location	(0x04b7)

0x00000e87:     DW_TAG_member
                  DW_AT_name	("own_address")
                  DW_AT_type	(cu + 0x008f "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(603)
                  DW_AT_data_member_location	(0x04bd)

0x00000e95:     DW_TAG_member
                  DW_AT_name	("own_address_type")
                  DW_AT_type	(cu + 0x0eaf "bd_addr_type_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(604)
                  DW_AT_data_member_location	(0x04c4)

0x00000ea3:     NULL

0x00000ea4:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00f3 "uint16_t")
                DW_AT_name	("hci_con_handle_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h")
                DW_AT_decl_line	(9)

0x00000eaf:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0451 "enumeration ")
                DW_AT_name	("bd_addr_type_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(1475)

0x00000ebb:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0478 "enumeration ")
                DW_AT_name	("le_con_parameter_update_state_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(252)

0x00000ec6:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0ed2 "sm_connection")
                DW_AT_name	("sm_connection_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(475)

0x00000ed2:   DW_TAG_structure_type
                DW_AT_name	("sm_connection")
                DW_AT_byte_size	(0x38)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(456)

0x00000edb:     DW_TAG_member
                  DW_AT_name	("sm_handle")
                  DW_AT_type	(cu + 0x0ea4 "hci_con_handle_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(457)
                  DW_AT_data_member_location	(0x00)

0x00000ee8:     DW_TAG_member
                  DW_AT_name	("sm_role")
                  DW_AT_type	(cu + 0x00a6 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(458)
                  DW_AT_data_member_location	(0x02)

0x00000ef5:     DW_TAG_member
                  DW_AT_name	("sm_security_request_received")
                  DW_AT_type	(cu + 0x00a6 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(459)
                  DW_AT_data_member_location	(0x03)

0x00000f02:     DW_TAG_member
                  DW_AT_name	("sm_bonding_requested")
                  DW_AT_type	(cu + 0x00a6 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(460)
                  DW_AT_data_member_location	(0x04)

0x00000f0f:     DW_TAG_member
                  DW_AT_name	("sm_peer_addr_type")
                  DW_AT_type	(cu + 0x00a6 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(461)
                  DW_AT_data_member_location	(0x05)

0x00000f1c:     DW_TAG_member
                  DW_AT_name	("sm_peer_address")
                  DW_AT_type	(cu + 0x008f "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(462)
                  DW_AT_data_member_location	(0x06)

0x00000f29:     DW_TAG_member
                  DW_AT_name	("sm_engine_state")
                  DW_AT_type	(cu + 0x0fc6 "security_manager_state_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(463)
                  DW_AT_data_member_location	(0x0c)

0x00000f36:     DW_TAG_member
                  DW_AT_name	("sm_irk_lookup_state")
                  DW_AT_type	(cu + 0x0fd2 "irk_lookup_state_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(464)
                  DW_AT_data_member_location	(0x10)

0x00000f43:     DW_TAG_member
                  DW_AT_name	("sm_connection_encrypted")
                  DW_AT_type	(cu + 0x00a6 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(465)
                  DW_AT_data_member_location	(0x14)

0x00000f50:     DW_TAG_member
                  DW_AT_name	("sm_connection_authenticated")
                  DW_AT_type	(cu + 0x00a6 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(466)
                  DW_AT_data_member_location	(0x15)

0x00000f5d:     DW_TAG_member
                  DW_AT_name	("sm_actual_encryption_key_size")
                  DW_AT_type	(cu + 0x00a6 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(467)
                  DW_AT_data_member_location	(0x16)

0x00000f6a:     DW_TAG_member
                  DW_AT_name	("sm_m_preq")
                  DW_AT_type	(cu + 0x0fde "sm_pairing_packet_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(468)
                  DW_AT_data_member_location	(0x17)

0x00000f77:     DW_TAG_member
                  DW_AT_name	("sm_connection_authorization_state")
                  DW_AT_type	(cu + 0x0ff6 "authorization_state_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(469)
                  DW_AT_data_member_location	(0x20)

0x00000f84:     DW_TAG_member
                  DW_AT_name	("sm_local_ediv")
                  DW_AT_type	(cu + 0x00f3 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(470)
                  DW_AT_data_member_location	(0x24)

0x00000f91:     DW_TAG_member
                  DW_AT_name	("sm_local_rand")
                  DW_AT_type	(cu + 0x1002 "uint8_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(471)
                  DW_AT_data_member_location	(0x26)

0x00000f9e:     DW_TAG_member
                  DW_AT_name	("sm_disconn_reason")
                  DW_AT_type	(cu + 0x00a6 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(472)
                  DW_AT_data_member_location	(0x2e)

0x00000fab:     DW_TAG_member
                  DW_AT_name	("sm_le_db_index")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(473)
                  DW_AT_data_member_location	(0x30)

0x00000fb8:     DW_TAG_member
                  DW_AT_name	("sm_timeout_id")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(474)
                  DW_AT_data_member_location	(0x34)

0x00000fc5:     NULL

0x00000fc6:   DW_TAG_typedef
                DW_AT_type	(cu + 0x049b "enumeration ")
                DW_AT_name	("security_manager_state_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(433)

