; ModuleID = 'hci_vendor.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/hci_transport/hci_vendor.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.hci_cmd_t = type { i16, i8* }
%struct.__inquiry_result_t = type { [8 x i8], i8, [6 x i8] }
%struct._stack_config = type <{ i32, i16, i16, i16, i16, i16, i8, i8, i8, i32, i8, i8, i8, i8, [6 x i8], i8 }>
%struct.__le_hci_stack = type { %struct.btstack_linked_item*, %struct.btstack_linked_item*, [525 x i8], i8, i16, i16, i8, i16, %struct.le_connection_parameter_range }
%struct.btstack_linked_item = type { %struct.btstack_linked_item* }
%struct.le_connection_parameter_range = type { i16, i16, i16, i16, i16, i16 }
%struct.user_interface_handler = type { void (i8*, i32, i32)*, void (i8, i8*, i8*)*, void (i8*, i32)*, i32 ()*, void (i8, i16, i8*, i16)*, void (i8*, i32, i32, i8)*, i32 ()*, void (i32)*, void (i8, i32, i8*, i16)*, i32 (i8*, i8, i8)*, void ()*, void (i8)*, i8 (i8*, i8, i8*, i32, i8)*, void (i8, i16, i8*, i16)*, i32 ()* }
%struct.btstack_packet_callback_registration_t = type { %struct.btstack_linked_item, void (i8, i16, i8*, i16)* }
%struct.__le_hci_connection = type { %struct.btstack_linked_item, [6 x i8], i16, i32, i8, i32, i8, i16, i16, i16, i16, %struct.sm_connection, %struct.att_server_t, [529 x i8], i16, i16, i8, [6 x i8], [6 x i8], i32 }

!331 = !DIEnumerator(name: "USER_CTRL_POWER_OFF", value: 74)
!332 = !DIEnumerator(name: "USER_CTRL_POWER_ON", value: 75)
!333 = !DIEnumerator(name: "USER_CTRL_HID_CMD_BEGIN", value: 76)
!334 = !DIEnumerator(name: "USER_CTRL_HID_CONN", value: 77)
!335 = !DIEnumerator(name: "USER_CTRL_HID_ANDROID", value: 78)
!336 = !DIEnumerator(name: "USER_CTRL_HID_IOS", value: 79)
!337 = !DIEnumerator(name: "USER_CTRL_HID_BOTH", value: 80)
!338 = !DIEnumerator(name: "USER_CTRL_HID_DISCONNECT", value: 81)
!339 = !DIEnumerator(name: "USER_CTRL_HID_HOME", value: 82)
!340 = !DIEnumerator(name: "USER_CTRL_HID_RETURN", value: 83)
!341 = !DIEnumerator(name: "USER_CTRL_HID_LEFTARROW", value: 84)
!342 = !DIEnumerator(name: "USER_CTRL_HID_RIGHTARROW", value: 85)
!343 = !DIEnumerator(name: "USER_CTRL_HID_VOL_UP", value: 86)
!344 = !DIEnumerator(name: "USER_CTRL_HID_VOL_DOWN", value: 87)
!345 = !DIEnumerator(name: "USER_CTRL_HID_SEND_DATA", value: 88)
!346 = !DIEnumerator(name: "USER_CTRL_HID_CMD_END", value: 89)
!347 = !DIEnumerator(name: "USER_CTRL_TWS_CMD_BEGIN", value: 90)
!348 = !DIEnumerator(name: "USER_CTRL_SYNC_TRAIN", value: 91)
!349 = !DIEnumerator(name: "USER_CTRL_SYNC_TRAIN_SCAN", value: 92)
!350 = !DIEnumerator(name: "USER_CTRL_MONITOR", value: 93)
!351 = !DIEnumerator(name: "USER_CTRL_TWS_CONNEC_VIA_ADDR", value: 94)
!352 = !DIEnumerator(name: "USER_CTRL_TWS_COTROL_CDM", value: 95)
!353 = !DIEnumerator(name: "USER_CTRL_TWS_CLEAR_INFO", value: 96)
!354 = !DIEnumerator(name: "USER_CTRL_TWS_DISCONNECTION_HCI", value: 97)
!355 = !DIEnumerator(name: "USER_CTRL_TWS_START_CONNECTION", value: 98)
!356 = !DIEnumerator(name: "USER_CTRL_TWS_SYNC_CDM", value: 99)
!357 = !DIEnumerator(name: "USER_CTRL_TWS_SYNC_SBC_CDM", value: 100)
!358 = !DIEnumerator(name: "USER_CTRL_TWS_RESTART_SBC_CDM", value: 101)
!359 = !DIEnumerator(name: "USER_CTRL_SYNC_TRAIN_CANCEL", value: 102)
!360 = !DIEnumerator(name: "USER_CTRL_SYNC_TRAIN_SCAN_CANCEL", value: 103)
!361 = !DIEnumerator(name: "USER_CTRL_TWS_SYNC_CDM_FUN", value: 104)
!362 = !DIEnumerator(name: "USER_CTRL_TWS_LINEIN_START", value: 105)
!363 = !DIEnumerator(name: "USER_CTRL_TWS_LINEIN_CLOSE", value: 106)
!364 = !DIEnumerator(name: "USER_CTRL_TWS_CMD_END", value: 107)
!365 = !DIEnumerator(name: "USER_CTRL_SPP_CMD_BEGIN", value: 108)
!366 = !DIEnumerator(name: "USER_CTRL_SPP_SEND_DATA", value: 109)
!367 = !DIEnumerator(name: "USER_CTRL_SPP_TRY_SEND_DATA", value: 110)
!368 = !DIEnumerator(name: "USER_CTRL_SPP_UPDATA_DATA", value: 111)
!369 = !DIEnumerator(name: "USER_CTRL_SPP_DISCONNECT", value: 112)
!370 = !DIEnumerator(name: "USER_CTRL_SPP_CMD_END", value: 113)
!371 = !DIEnumerator(name: "USER_CTRL_PBG_CMD_BEGIN", value: 114)
!372 = !DIEnumerator(name: "USER_CTRL_PBG_SEND_DATA", value: 115)
!373 = !DIEnumerator(name: "USER_CTRL_PBG_TRY_SEND_DATA", value: 116)
!374 = !DIEnumerator(name: "USER_CTRL_PBG_CMD_END", value: 117)
!375 = !DIEnumerator(name: "USER_CTRL_ADT_CMD_BEGIN", value: 118)
!376 = !DIEnumerator(name: "USER_CTRL_ADT_CONNECT", value: 119)
!377 = !DIEnumerator(name: "USER_CTRL_ADT_KEY_MIC_OPEN", value: 120)
!378 = !DIEnumerator(name: "USER_CTRL_ADT_SEND_DATA", value: 121)
!379 = !DIEnumerator(name: "USER_CTRL_ADT_TRY_SEND_DATA", value: 122)
!380 = !DIEnumerator(name: "USER_CTRL_ADT_CMD_END", value: 123)
!381 = !DIEnumerator(name: "USER_CTRL_PBAP_CMD_BEGIN", value: 124)
!382 = !DIEnumerator(name: "USER_CTRL_PBAP_READ_PART", value: 125)
!383 = !DIEnumerator(name: "USER_CTRL_PBAP_READ_ALL", value: 126)
!384 = !DIEnumerator(name: "USER_CTRL_PBAP_STOP_READING", value: 127)
!385 = !DIEnumerator(name: "USER_CTRL_PBAP_CMD_END", value: 128)
!386 = !DIEnumerator(name: "USER_CTRL_DEL_ALL_REMOTE_INFO", value: 129)
!387 = !DIEnumerator(name: "USER_CTRL_TEST_KEY", value: 130)
!388 = !DIEnumerator(name: "USER_CTRL_SEND_USER_INFO", value: 131)
!389 = !DIEnumerator(name: "USER_CTRL_KEYPRESS", value: 132)
!390 = !DIEnumerator(name: "USER_CTRL_PAIR", value: 133)
!391 = !DIEnumerator(name: "USER_CTRL_AFH_CHANNEL", value: 134)
!392 = !DIEnumerator(name: "USER_CTRL_HALF_SEC_LOOP_CREATE", value: 135)
!393 = !DIEnumerator(name: "USER_CTRL_HALF_SEC_LOOP_DEL", value: 136)
!394 = !DIEnumerator(name: "USER_CTRL_CMD_SYNC_VOL_INC", value: 137)
!395 = !DIEnumerator(name: "USER_CTRL_CMD_SYNC_VOL_DEC", value: 138)
!396 = !DIEnumerator(name: "USER_CTRL_CMD_CHANGE_PROFILE_MODE", value: 139)
!397 = !DIEnumerator(name: "USER_CTRL_CMD_RESERVE_INDEX4", value: 140)
!398 = !DIEnumerator(name: "USER_CTRL_CMD_RESUME_STACK", value: 141)
!399 = !DIEnumerator(name: "USER_CTRL_AVCTP_OPID_GET_MUSIC_INFO", value: 142)
!400 = !DIEnumerator(name: "USER_CTRL_LAST", value: 143)
!401 = !{!402, !425, !539, !540, !541, !428, !546, !557, !558, !556, !488, !559}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "le_hci_connection_t", file: !14, line: 605, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__le_hci_connection", file: !14, line: 571, size: 9792, elements: !405)
!405 = !{!406, !414, !423, !427, !429, !430, !432, !433, !434, !435, !436, !437, !470, !529, !533, !534, !535, !536, !537, !538}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !404, file: !14, line: 572, baseType: !407, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_item_t", file: !408, line: 100, baseType: !409)
!408 = !DIFile(filename: "../btcommon/btstack_linked_list.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_linked_item_t", file: !408, line: 55, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btstack_linked_item", file: !408, line: 53, size: 32, elements: !411)
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !410, file: !408, line: 54, baseType: !413, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !404, file: !14, line: 574, baseType: !415, size: 48, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_addr_t", file: !416, line: 7, baseType: !417)
!416 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 48, elements: !421)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !419, line: 44, baseType: !420)
!419 = !DIFile(filename: "../btcommon/typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!420 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!421 = !{!422}
!422 = !DISubrange(count: 6)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "con_handle", scope: !404, file: !14, line: 576, baseType: !424, size: 16, offset: 80)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "hci_con_handle_t", file: !416, line: 9, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !419, line: 46, baseType: !426)
!426 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "address_type", scope: !404, file: !14, line: 578, baseType: !428, size: 32, offset: 96)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_addr_type_t", file: !6, line: 1475, baseType: !5)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "role", scope: !404, file: !14, line: 581, baseType: !418, size: 8, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "le_con_parameter_update_state", scope: !404, file: !14, line: 584, baseType: !431, size: 32, offset: 160)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "le_con_parameter_update_state_t", file: !14, line: 252, baseType: !13)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "le_con_param_update_identifier", scope: !404, file: !14, line: 585, baseType: !418, size: 8, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "le_conn_interval_min", scope: !404, file: !14, line: 586, baseType: !425, size: 16, offset: 208)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "le_conn_interval_max", scope: !404, file: !14, line: 587, baseType: !425, size: 16, offset: 224)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "le_conn_latency", scope: !404, file: !14, line: 588, baseType: !425, size: 16, offset: 240)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "le_supervision_timeout", scope: !404, file: !14, line: 589, baseType: !425, size: 16, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "sm_connection", scope: !404, file: !14, line: 592, baseType: !438, size: 448, offset: 288)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "sm_connection_t", file: !14, line: 475, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sm_connection", file: !14, line: 456, size: 448, elements: !440)
!440 = !{!441, !442, !443, !444, !445, !446, !447, !449, !451, !452, !453, !454, !459, !461, !462, !466, !467, !469}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "sm_handle", scope: !439, file: !14, line: 457, baseType: !424, size: 16)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sm_role", scope: !439, file: !14, line: 458, baseType: !418, size: 8, offset: 16)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "sm_security_request_received", scope: !439, file: !14, line: 459, baseType: !418, size: 8, offset: 24)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "sm_bonding_requested", scope: !439, file: !14, line: 460, baseType: !418, size: 8, offset: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "sm_peer_addr_type", scope: !439, file: !14, line: 461, baseType: !418, size: 8, offset: 40)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "sm_peer_address", scope: !439, file: !14, line: 462, baseType: !415, size: 48, offset: 48)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "sm_engine_state", scope: !439, file: !14, line: 463, baseType: !448, size: 32, offset: 96)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "security_manager_state_t", file: !14, line: 433, baseType: !21)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "sm_irk_lookup_state", scope: !439, file: !14, line: 464, baseType: !450, size: 32, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "irk_lookup_state_t", file: !14, line: 442, baseType: !121)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "sm_connection_encrypted", scope: !439, file: !14, line: 465, baseType: !418, size: 8, offset: 160)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "sm_connection_authenticated", scope: !439, file: !14, line: 466, baseType: !418, size: 8, offset: 168)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sm_actual_encryption_key_size", scope: !439, file: !14, line: 467, baseType: !418, size: 8, offset: 176)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "sm_m_preq", scope: !439, file: !14, line: 468, baseType: !455, size: 56, offset: 184)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "sm_pairing_packet_t", file: !14, line: 452, baseType: !456)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 56, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 7)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "sm_connection_authorization_state", scope: !439, file: !14, line: 469, baseType: !460, size: 32, offset: 256)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "authorization_state_t", file: !14, line: 450, baseType: !128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "sm_local_ediv", scope: !439, file: !14, line: 470, baseType: !425, size: 16, offset: 288)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "sm_local_rand", scope: !439, file: !14, line: 471, baseType: !463, size: 64, offset: 304)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 64, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 8)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "sm_disconn_reason", scope: !439, file: !14, line: 472, baseType: !418, size: 8, offset: 368)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "sm_le_db_index", scope: !439, file: !14, line: 473, baseType: !468, size: 32, offset: 384)
!468 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "sm_timeout_id", scope: !439, file: !14, line: 474, baseType: !468, size: 32, offset: 416)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "att_server", scope: !404, file: !14, line: 595, baseType: !471, size: 4640, offset: 736)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_server_t", file: !135, line: 187, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !135, line: 164, size: 4640, elements: !473)
!473 = !{!474, !476, !477, !478, !479, !480, !481, !502, !513, !514, !518, !519, !520, !521, !522, !523}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !472, file: !135, line: 165, baseType: !475, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_server_state_t", file: !135, line: 162, baseType: !134)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "peer_addr_type", scope: !472, file: !135, line: 167, baseType: !418, size: 8, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "peer_address", scope: !472, file: !135, line: 168, baseType: !415, size: 48, offset: 40)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ir_le_device_db_index", scope: !472, file: !135, line: 170, baseType: !468, size: 32, offset: 96)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ir_lookup_active", scope: !472, file: !135, line: 171, baseType: !468, size: 32, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "value_indication_handle", scope: !472, file: !135, line: 173, baseType: !468, size: 32, offset: 160)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "value_indication_timer", scope: !472, file: !135, line: 174, baseType: !482, size: 160, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_timer_source_t", file: !483, line: 19, baseType: !484)
!483 = !DIFile(filename: "../btcommon/btstack_sys_timer.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btstack_timer_source", file: !483, line: 7, size: 160, elements: !485)
!485 = !{!486, !487, !490, !491, !492, !493, !494, !495, !500}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !484, file: !483, line: 8, baseType: !409, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !484, file: !483, line: 10, baseType: !488, size: 32, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !419, line: 48, baseType: !489)
!489 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_interval", scope: !484, file: !483, line: 11, baseType: !488, size: 16, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "timer_type", scope: !484, file: !483, line: 12, baseType: !488, size: 4, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "timer_tick_overflow", scope: !484, file: !483, line: 13, baseType: !488, size: 1, offset: 84, flags: DIFlagBitField, extraData: i64 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "loop_flag", scope: !484, file: !483, line: 14, baseType: !488, size: 1, offset: 85, flags: DIFlagBitField, extraData: i64 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "loop_times", scope: !484, file: !483, line: 15, baseType: !488, size: 10, offset: 86, flags: DIFlagBitField, extraData: i64 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !484, file: !483, line: 17, baseType: !496, size: 32, offset: 96)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 32)
!497 = !DISubroutineType(types: !498)
!498 = !{null, !499}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !484, file: !483, line: 18, baseType: !501, size: 32, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !472, file: !135, line: 176, baseType: !503, size: 80, offset: 352)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_connection_t", file: !504, line: 41, baseType: !505)
!504 = !DIFile(filename: "../btstack/Protocol/include/ble/att_db.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "att_connection", file: !504, line: 34, size: 80, elements: !506)
!506 = !{!507, !508, !509, !510, !511, !512}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "con_handle", scope: !505, file: !504, line: 35, baseType: !424, size: 16)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !505, file: !504, line: 36, baseType: !425, size: 16, offset: 16)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "max_mtu", scope: !505, file: !504, line: 37, baseType: !425, size: 16, offset: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "encryption_key_size", scope: !505, file: !504, line: 38, baseType: !418, size: 8, offset: 48)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !505, file: !504, line: 39, baseType: !418, size: 8, offset: 56)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "authorized", scope: !505, file: !504, line: 40, baseType: !418, size: 8, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "request_size", scope: !472, file: !135, line: 178, baseType: !425, size: 16, offset: 432)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "request_buffer", scope: !472, file: !135, line: 179, baseType: !515, size: 4136, offset: 448)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 4136, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 517)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "flow_hold_flag", scope: !472, file: !135, line: 181, baseType: !418, size: 1, offset: 4584, flags: DIFlagBitField, extraData: i64 4584)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mtu_request_flag", scope: !472, file: !135, line: 182, baseType: !418, size: 1, offset: 4585, flags: DIFlagBitField, extraData: i64 4584)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "check_remote_tag", scope: !472, file: !135, line: 183, baseType: !418, size: 3, offset: 4586, flags: DIFlagBitField, extraData: i64 4584)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "request_busy", scope: !472, file: !135, line: 184, baseType: !418, size: 1, offset: 4589, flags: DIFlagBitField, extraData: i64 4584)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "reserverd", scope: !472, file: !135, line: 185, baseType: !418, size: 2, offset: 4590, flags: DIFlagBitField, extraData: i64 4584)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "result_callback", scope: !472, file: !135, line: 186, baseType: !524, size: 32, offset: 4608)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 32)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !527, !528}
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !419, line: 46, baseType: !426)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !419, line: 44, baseType: !420)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "acl_recombination_buffer", scope: !404, file: !14, line: 597, baseType: !530, size: 4232, offset: 5376)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 4232, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 529)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "acl_recombination_pos", scope: !404, file: !14, line: 598, baseType: !425, size: 16, offset: 9616)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "acl_recombination_length", scope: !404, file: !14, line: 599, baseType: !425, size: 16, offset: 9632)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "num_acl_packets_sent", scope: !404, file: !14, line: 600, baseType: !418, size: 8, offset: 9648)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "own_id_address", scope: !404, file: !14, line: 602, baseType: !415, size: 48, offset: 9656)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "own_address", scope: !404, file: !14, line: 603, baseType: !415, size: 48, offset: 9704)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "own_address_type", scope: !404, file: !14, line: 604, baseType: !428, size: 32, offset: 9760)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "link_key_t", file: !244, line: 73, baseType: !543)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 128, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 16)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_packet_callback_registration_t", file: !6, line: 64, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 61, size: 64, elements: !549)
!549 = !{!550, !551}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !548, file: !6, line: 62, baseType: !407, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !548, file: !6, line: 63, baseType: !552, size: 32, offset: 32)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_packet_handler_t", file: !6, line: 58, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 32)
!554 = !DISubroutineType(types: !555)
!555 = !{null, !418, !425, !556, !425}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 32)
!560 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!561 = !{!0, !562, !566, !569, !580, !582, !585, !599, !601, !604, !606, !608, !610, !637, !639, !641, !643, !645}
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "hci_le_event_mask", scope: !2, file: !3, line: 46, type: !564, isLocal: false, isDefinition: true)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 64, elements: !464)
!565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !528)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "hci_le_mac_addr", scope: !2, file: !3, line: 57, type: !568, isLocal: false, isDefinition: true)
!568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !415)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "hci_reset", scope: !2, file: !3, line: 63, type: !571, isLocal: false, isDefinition: true)
!571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "hci_cmd_t", file: !573, line: 508, baseType: !574)
!573 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/bluetooth.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !573, line: 505, size: 64, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !574, file: !573, line: 506, baseType: !425, size: 16)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !574, file: !573, line: 507, baseType: !578, size: 32, offset: 32)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !560)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "le_event_mask", scope: !2, file: !3, line: 69, type: !564, isLocal: false, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "mac_addr", scope: !2, file: !3, line: 72, type: !584, isLocal: false, isDefinition: true)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 48, elements: !421)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "inquiry_result", scope: !2, file: !3, line: 92, type: !587, isLocal: false, isDefinition: true)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry_result_t", file: !3, line: 89, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__inquiry_result_t", file: !3, line: 80, size: 120, elements: !590)
!590 = !{!591, !593, !594, !595, !596, !597}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "priv_version", scope: !589, file: !3, line: 83, baseType: !592, size: 64)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 64, elements: !464)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "priv_version_len", scope: !589, file: !3, line: 84, baseType: !528, size: 3, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "user_flag", scope: !589, file: !3, line: 85, baseType: !528, size: 1, offset: 67, flags: DIFlagBitField, extraData: i64 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "dev_match", scope: !589, file: !3, line: 86, baseType: !528, size: 1, offset: 68, flags: DIFlagBitField, extraData: i64 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "reserve", scope: !589, file: !3, line: 87, baseType: !528, size: 3, offset: 69, flags: DIFlagBitField, extraData: i64 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "remote_addr", scope: !589, file: !3, line: 88, baseType: !598, size: 48, offset: 72)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 48, elements: !421)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "hci_bt_mode", scope: !2, file: !3, line: 94, type: !528, isLocal: false, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "g_le_tws_search_aa", scope: !2, file: !3, line: 1366, type: !603, isLocal: false, isDefinition: true)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !419, line: 48, baseType: !489)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "g_le_tws_pair_aa", scope: !2, file: !3, line: 1367, type: !603, isLocal: false, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "g_le_tws_connect_aa", scope: !2, file: !3, line: 1368, type: !603, isLocal: false, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "code_buf", scope: !2, file: !3, line: 1370, type: !598, isLocal: false, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "le_hci_stack", scope: !2, file: !3, line: 77, type: !612, isLocal: false, isDefinition: true)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "le_hci_stack_t", file: !14, line: 618, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__le_hci_stack", file: !14, line: 607, size: 4448, elements: !614)
!614 = !{!615, !617, !618, !622, !623, !624, !625, !626, !627}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "le_hci_connection", scope: !613, file: !14, line: 608, baseType: !616, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_list_t", file: !408, line: 101, baseType: !558)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "le_hci_event_handlers", scope: !613, file: !14, line: 609, baseType: !616, size: 32, offset: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "hci_packet_buffer", scope: !613, file: !14, line: 611, baseType: !619, size: 4200, offset: 64)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 4200, elements: !620)
!620 = !{!621}
!621 = !DISubrange(count: 525)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "hci_packet_buffer_reserved", scope: !613, file: !14, line: 612, baseType: !418, size: 8, offset: 4264)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "acl_fragmentation_pos", scope: !613, file: !14, line: 613, baseType: !425, size: 16, offset: 4272)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "acl_fragmentation_total_size", scope: !613, file: !14, line: 614, baseType: !425, size: 16, offset: 4288)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "le_acl_packets_total_num", scope: !613, file: !14, line: 615, baseType: !418, size: 8, offset: 4304)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "le_data_packets_length", scope: !613, file: !14, line: 616, baseType: !425, size: 16, offset: 4320)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "le_connection_parameter_range", scope: !613, file: !14, line: 617, baseType: !628, size: 96, offset: 4336)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "le_connection_parameter_range_t", file: !237, line: 110, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "le_connection_parameter_range", file: !237, line: 103, size: 96, elements: !630)
!630 = !{!631, !632, !633, !634, !635, !636}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "le_conn_interval_min", scope: !629, file: !237, line: 104, baseType: !425, size: 16)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "le_conn_interval_max", scope: !629, file: !237, line: 105, baseType: !425, size: 16, offset: 16)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "le_conn_latency_min", scope: !629, file: !237, line: 106, baseType: !425, size: 16, offset: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "le_conn_latency_max", scope: !629, file: !237, line: 107, baseType: !425, size: 16, offset: 48)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "le_supervision_timeout_min", scope: !629, file: !237, line: 108, baseType: !425, size: 16, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "le_supervision_timeout_max", scope: !629, file: !237, line: 109, baseType: !425, size: 16, offset: 80)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(name: "_inquiry_result", scope: !2, file: !3, line: 91, type: !588, isLocal: false, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(name: "inquiry_spp_device", scope: !2, file: !3, line: 95, type: !528, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "hci_event_callback_registration", scope: !2, file: !3, line: 97, type: !547, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "hci_scan_control", scope: !2, file: !3, line: 1558, type: !528, isLocal: true, isDefinition: true)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "hci_packet_type_sizes", scope: !2, file: !3, line: 1646, type: !647, isLocal: true, isDefinition: true)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !648, size: 256, elements: !544)
!648 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !527)
!649 = !DIFile(filename: "../btcommon/profile_stack_debug.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!650 = !{i32 2, !"Dwarf Version", i32 4}
!651 = !{i32 2, !"Debug Info Version", i32 3}
!652 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!653 = distinct !DISubprogram(name: "set_start_search_spp_device", scope: !3, file: !3, line: 111, type: !654, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !656)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !528}
!656 = !{!657}
!657 = !DILocalVariable(name: "spp", arg: 1, scope: !653, file: !3, line: 111, type: !528)
!658 = !DILocation(line: 111, column: 37, scope: !653)
!659 = !DILocation(line: 113, column: 24, scope: !653)
!660 = !{!661, !661, i64 0}
!661 = !{!"omnipotent char", !662, i64 0}
!662 = !{!"Simple C/C++ TBAA"}
!663 = !DILocation(line: 114, column: 1, scope: !653)
!664 = distinct !DISubprogram(name: "connection_address_for_handle", scope: !3, file: !3, line: 116, type: !665, isLocal: false, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !667)
!665 = !DISubroutineType(types: !666)
!666 = !{!540, !424}
!667 = !{!668}
!668 = !DILocalVariable(name: "con_handle", arg: 1, scope: !664, file: !3, line: 116, type: !424)
!669 = !DILocation(line: 116, column: 52, scope: !664)
!670 = !DILocation(line: 118, column: 48, scope: !664)
!671 = !DILocation(line: 118, column: 12, scope: !664)
!672 = !DILocation(line: 118, column: 5, scope: !664)
!673 = distinct !DISubprogram(name: "connection_handler_for_address", scope: !3, file: !3, line: 121, type: !674, isLocal: false, isDefinition: true, scopeLine: 122, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !676)
!674 = !DISubroutineType(types: !675)
!675 = !{!603, !556, !528}
!676 = !{!677, !678}
!677 = !DILocalVariable(name: "address", arg: 1, scope: !673, file: !3, line: 121, type: !556)
!678 = !DILocalVariable(name: "linktype", arg: 2, scope: !673, file: !3, line: 121, type: !528)
!679 = !DILocation(line: 121, column: 46, scope: !673)
!680 = !DILocation(line: 121, column: 58, scope: !673)
!681 = !DILocation(line: 123, column: 57, scope: !673)
!682 = !DILocation(line: 123, column: 12, scope: !673)
!683 = !DILocation(line: 123, column: 5, scope: !673)
!684 = distinct !DISubprogram(name: "hci_number_outgoing_packets", scope: !3, file: !3, line: 126, type: !685, isLocal: false, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !687)
!685 = !DISubroutineType(types: !686)
!686 = !{!528, !424}
!687 = !{!688}
!688 = !DILocalVariable(name: "handle", arg: 1, scope: !684, file: !3, line: 126, type: !424)
!689 = !DILocation(line: 126, column: 49, scope: !684)
!690 = !DILocation(line: 128, column: 5, scope: !684)
!691 = distinct !DISubprogram(name: "bt_get_mac_addr", scope: !3, file: !3, line: 131, type: !692, isLocal: false, isDefinition: true, scopeLine: 132, isOptimized: true, unit: !2, variables: !695)
!692 = !DISubroutineType(types: !693)
!693 = !{!694}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 32)
!695 = !{}
!696 = !DILocation(line: 133, column: 5, scope: !691)
!697 = distinct !DISubprogram(name: "bt_get_local_name", scope: !3, file: !3, line: 136, type: !698, isLocal: false, isDefinition: true, scopeLine: 137, isOptimized: true, unit: !2, variables: !695)
!698 = !DISubroutineType(types: !699)
!699 = !{!578}
!700 = !DILocation(line: 138, column: 5, scope: !697)
!701 = distinct !DISubprogram(name: "bt_get_hid_name", scope: !3, file: !3, line: 140, type: !698, isLocal: false, isDefinition: true, scopeLine: 141, isOptimized: true, unit: !2, variables: !695)
!702 = !DILocation(line: 143, column: 5, scope: !701)
!703 = distinct !DISubprogram(name: "bt_get_emitter_pin_code", scope: !3, file: !3, line: 146, type: !704, isLocal: false, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !706)
!704 = !DISubroutineType(types: !705)
!705 = !{!578, !528}
!706 = !{!707}
!707 = !DILocalVariable(name: "flag", arg: 1, scope: !703, file: !3, line: 146, type: !528)
!708 = !DILocation(line: 146, column: 62, scope: !703)
!709 = !DILocation(line: 148, column: 14, scope: !710)
!710 = distinct !DILexicalBlock(scope: !703, file: !3, line: 148, column: 9)
!711 = !DILocation(line: 149, column: 9, scope: !712)
!712 = distinct !DILexicalBlock(scope: !710, file: !3, line: 148, column: 20)
!713 = !DILocation(line: 152, column: 1, scope: !703)
!714 = distinct !DISubprogram(name: "bt_get_pin_code", scope: !3, file: !3, line: 153, type: !698, isLocal: false, isDefinition: true, scopeLine: 154, isOptimized: true, unit: !2, variables: !695)
!715 = !DILocation(line: 155, column: 5, scope: !714)
!716 = distinct !DISubprogram(name: "get_remote_dev_info_index", scope: !3, file: !3, line: 158, type: !717, isLocal: false, isDefinition: true, scopeLine: 159, isOptimized: true, unit: !2, variables: !695)
!717 = !DISubroutineType(types: !718)
!718 = !{!528}
!719 = !DILocation(line: 160, column: 12, scope: !716)
!720 = !{!721, !721, i64 0}
!721 = !{!"any pointer", !661, i64 0}
!722 = !DILocation(line: 160, column: 32, scope: !716)
!723 = !DILocation(line: 160, column: 69, scope: !716)
!724 = !DILocation(line: 160, column: 47, scope: !716)
!725 = !DILocation(line: 160, column: 5, scope: !716)
!726 = distinct !DISubprogram(name: "hci_emit_state", scope: !3, file: !3, line: 163, type: !727, isLocal: false, isDefinition: true, scopeLine: 164, isOptimized: true, unit: !2, variables: !729)
!727 = !DISubroutineType(types: !728)
!728 = !{null}
!729 = !{!730}
!730 = !DILocalVariable(name: "event", scope: !726, file: !3, line: 165, type: !731)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 24, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 3)
!734 = !DILocation(line: 171, column: 1, scope: !726)
!735 = distinct !DISubprogram(name: "hci_emit_nr_connections_delete", scope: !3, file: !3, line: 211, type: !736, isLocal: false, isDefinition: true, scopeLine: 212, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !738)
!736 = !DISubroutineType(types: !737)
!737 = !{null, !528, !528, !556}
!738 = !{!739, !740, !741, !742}
!739 = !DILocalVariable(name: "reason", arg: 1, scope: !735, file: !3, line: 211, type: !528)
!740 = !DILocalVariable(name: "link_type", arg: 2, scope: !735, file: !3, line: 211, type: !528)
!741 = !DILocalVariable(name: "address", arg: 3, scope: !735, file: !3, line: 211, type: !556)
!742 = !DILocalVariable(name: "event", scope: !735, file: !3, line: 213, type: !743)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 80, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 10)
!746 = !DILocation(line: 211, column: 40, scope: !735)
!747 = !DILocation(line: 211, column: 51, scope: !735)
!748 = !DILocation(line: 211, column: 72, scope: !735)
!749 = !DILocation(line: 213, column: 5, scope: !735)
!750 = !DILocation(line: 213, column: 8, scope: !735)
!751 = !DILocation(line: 215, column: 14, scope: !735)
!752 = !DILocation(line: 216, column: 5, scope: !735)
!753 = !DILocation(line: 216, column: 14, scope: !735)
!754 = !DILocation(line: 217, column: 5, scope: !735)
!755 = !DILocation(line: 217, column: 14, scope: !735)
!756 = !DILocation(line: 218, column: 5, scope: !735)
!757 = !DILocation(line: 218, column: 14, scope: !735)
!758 = !DILocation(line: 219, column: 19, scope: !735)
!759 = !DILocation(line: 219, column: 5, scope: !735)
!760 = !DILocation(line: 220, column: 5, scope: !735)
!761 = !DILocation(line: 221, column: 1, scope: !735)
!762 = distinct !DISubprogram(name: "hci_emit_btstack_version", scope: !3, file: !3, line: 224, type: !727, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !763)
!763 = !{!764}
!764 = !DILocalVariable(name: "event", scope: !762, file: !3, line: 226, type: !598)
!765 = !DILocation(line: 226, column: 5, scope: !762)
!766 = !DILocation(line: 226, column: 8, scope: !762)
!767 = !DILocation(line: 229, column: 14, scope: !762)
!768 = !DILocation(line: 230, column: 5, scope: !762)
!769 = !DILocation(line: 230, column: 14, scope: !762)
!770 = !DILocation(line: 231, column: 5, scope: !762)
!771 = !DILocation(line: 231, column: 14, scope: !762)
!772 = !DILocation(line: 232, column: 5, scope: !762)
!773 = !DILocation(line: 232, column: 14, scope: !762)
!774 = !DILocation(line: 233, column: 5, scope: !762)
!775 = !DILocation(line: 234, column: 5, scope: !762)
!776 = !DILocation(line: 235, column: 1, scope: !762)
!777 = distinct !DISubprogram(name: "hci_emit_remote_name_cached", scope: !3, file: !3, line: 238, type: !778, isLocal: false, isDefinition: true, scopeLine: 239, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !785)
!778 = !DISubroutineType(types: !779)
!779 = !{null, !539, !780}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_name_t", file: !244, line: 96, baseType: !782)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 1992, elements: !783)
!783 = !{!784}
!784 = !DISubrange(count: 249)
!785 = !{!786, !787, !788}
!786 = !DILocalVariable(name: "addr", arg: 1, scope: !777, file: !3, line: 238, type: !539)
!787 = !DILocalVariable(name: "name", arg: 2, scope: !777, file: !3, line: 238, type: !780)
!788 = !DILocalVariable(name: "event", scope: !777, file: !3, line: 240, type: !789)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 2064, elements: !790)
!790 = !{!791}
!791 = !DISubrange(count: 258)
!792 = !DILocation(line: 238, column: 45, scope: !777)
!793 = !DILocation(line: 238, column: 66, scope: !777)
!794 = !DILocation(line: 240, column: 5, scope: !777)
!795 = !DILocation(line: 240, column: 8, scope: !777)
!796 = !DILocation(line: 241, column: 14, scope: !777)
!797 = !DILocation(line: 242, column: 5, scope: !777)
!798 = !DILocation(line: 242, column: 14, scope: !777)
!799 = !DILocation(line: 243, column: 5, scope: !777)
!800 = !DILocation(line: 243, column: 14, scope: !777)
!801 = !DILocation(line: 244, column: 19, scope: !777)
!802 = !DILocation(line: 244, column: 29, scope: !777)
!803 = !DILocation(line: 244, column: 5, scope: !777)
!804 = !DILocation(line: 245, column: 13, scope: !777)
!805 = !DILocation(line: 245, column: 5, scope: !777)
!806 = !DILocation(line: 247, column: 5, scope: !777)
!807 = !DILocation(line: 247, column: 20, scope: !777)
!808 = !DILocation(line: 249, column: 5, scope: !777)
!809 = !DILocation(line: 250, column: 1, scope: !777)
!810 = distinct !DISubprogram(name: "le_hci_connection_for_bd_addr_and_type", scope: !3, file: !3, line: 307, type: !811, isLocal: false, isDefinition: true, scopeLine: 308, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !813)
!811 = !DISubroutineType(types: !812)
!812 = !{!402, !556, !428}
!813 = !{!814, !815, !816, !823}
!814 = !DILocalVariable(name: "addr", arg: 1, scope: !810, file: !3, line: 307, type: !556)
!815 = !DILocalVariable(name: "addr_type", arg: 2, scope: !810, file: !3, line: 307, type: !428)
!816 = !DILocalVariable(name: "it", scope: !810, file: !3, line: 309, type: !817)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_linked_list_iterator_t", file: !408, line: 65, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !408, line: 61, size: 96, elements: !819)
!819 = !{!820, !821, !822}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "advance_on_next", scope: !818, file: !408, line: 62, baseType: !468, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !818, file: !408, line: 63, baseType: !558, size: 32, offset: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !818, file: !408, line: 64, baseType: !558, size: 32, offset: 64)
!823 = !DILocalVariable(name: "connection", scope: !824, file: !3, line: 312, type: !402)
!824 = distinct !DILexicalBlock(scope: !810, file: !3, line: 311, column: 56)
!825 = !DILocation(line: 307, column: 72, scope: !810)
!826 = !DILocation(line: 307, column: 93, scope: !810)
!827 = !DILocation(line: 309, column: 5, scope: !810)
!828 = !DILocation(line: 309, column: 36, scope: !810)
!829 = !DILocation(line: 310, column: 5, scope: !810)
!830 = !DILocation(line: 311, column: 5, scope: !810)
!831 = !DILocation(line: 311, column: 12, scope: !832)
!832 = !DILexicalBlockFile(scope: !810, file: !3, discriminator: 1)
!833 = !DILocation(line: 311, column: 5, scope: !832)
!834 = !DILocation(line: 312, column: 67, scope: !824)
!835 = !DILocation(line: 313, column: 25, scope: !836)
!836 = distinct !DILexicalBlock(scope: !824, file: !3, line: 313, column: 13)
!837 = !{!838, !661, i64 12}
!838 = !{!"__le_hci_connection", !839, i64 0, !661, i64 4, !840, i64 10, !661, i64 12, !661, i64 16, !661, i64 20, !661, i64 24, !840, i64 26, !840, i64 28, !840, i64 30, !840, i64 32, !841, i64 36, !843, i64 92, !661, i64 672, !840, i64 1202, !840, i64 1204, !661, i64 1206, !661, i64 1207, !661, i64 1213, !661, i64 1220}
!839 = !{!"btstack_linked_item", !721, i64 0}
!840 = !{!"short", !661, i64 0}
!841 = !{!"sm_connection", !840, i64 0, !661, i64 2, !661, i64 3, !661, i64 4, !661, i64 5, !661, i64 6, !661, i64 12, !661, i64 16, !661, i64 20, !661, i64 21, !661, i64 22, !661, i64 23, !661, i64 32, !840, i64 36, !661, i64 38, !661, i64 46, !842, i64 48, !842, i64 52}
!842 = !{!"int", !661, i64 0}
!843 = !{!"", !661, i64 0, !661, i64 4, !661, i64 5, !842, i64 12, !842, i64 16, !842, i64 20, !844, i64 24, !845, i64 44, !840, i64 54, !661, i64 56, !661, i64 573, !661, i64 573, !661, i64 573, !661, i64 573, !661, i64 573, !721, i64 576}
!844 = !{!"btstack_timer_source", !839, i64 0, !842, i64 4, !842, i64 8, !842, i64 10, !842, i64 10, !842, i64 10, !842, i64 10, !721, i64 12, !721, i64 16}
!845 = !{!"att_connection", !840, i64 0, !840, i64 2, !840, i64 4, !661, i64 6, !661, i64 7, !661, i64 8}
!846 = !DILocation(line: 313, column: 38, scope: !836)
!847 = !DILocation(line: 313, column: 13, scope: !824)
!848 = distinct !{!848, !830, !849}
!849 = !DILocation(line: 320, column: 5, scope: !810)
!850 = !DILocation(line: 316, column: 38, scope: !851)
!851 = distinct !DILexicalBlock(scope: !824, file: !3, line: 316, column: 13)
!852 = !DILocation(line: 316, column: 26, scope: !851)
!853 = !DILocation(line: 316, column: 13, scope: !851)
!854 = !DILocation(line: 316, column: 50, scope: !851)
!855 = !DILocation(line: 312, column: 43, scope: !824)
!856 = !DILocation(line: 322, column: 1, scope: !810)
!857 = distinct !DISubprogram(name: "read_remote_name_handle", scope: !3, file: !3, line: 357, type: !858, isLocal: false, isDefinition: true, scopeLine: 358, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !860)
!858 = !DISubroutineType(types: !859)
!859 = !{null, !578}
!860 = !{!861}
!861 = !DILocalVariable(name: "name", arg: 1, scope: !857, file: !3, line: 357, type: !578)
!862 = !DILocation(line: 357, column: 42, scope: !857)
!863 = !DILocation(line: 361, column: 5, scope: !857)
!864 = !DILocation(line: 362, column: 1, scope: !857)
!865 = distinct !DISubprogram(name: "get_last_device_connect_linkkey", scope: !3, file: !3, line: 367, type: !866, isLocal: false, isDefinition: true, scopeLine: 368, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !869)
!866 = !DISubroutineType(types: !867)
!867 = !{!540, !868}
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 32)
!869 = !{!870}
!870 = !DILocalVariable(name: "len", arg: 1, scope: !865, file: !3, line: 367, type: !868)
!871 = !DILocation(line: 367, column: 42, scope: !865)
!872 = !DILocation(line: 369, column: 10, scope: !865)
!873 = !{!840, !840, i64 0}
!874 = !DILocation(line: 370, column: 5, scope: !865)
!875 = distinct !DISubprogram(name: "hci_event_handler", scope: !3, file: !3, line: 373, type: !876, isLocal: false, isDefinition: true, scopeLine: 374, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !878)
!876 = !DISubroutineType(types: !877)
!877 = !{null, !540}
!878 = !{!879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !892, !894, !900, !901, !908, !910, !911, !914}
!879 = !DILocalVariable(name: "packet", arg: 1, scope: !875, file: !3, line: 373, type: !540)
!880 = !DILocalVariable(name: "addr", scope: !875, file: !3, line: 375, type: !540)
!881 = !DILocalVariable(name: "link_type", scope: !875, file: !3, line: 376, type: !528)
!882 = !DILocalVariable(name: "dev_type", scope: !875, file: !3, line: 377, type: !528)
!883 = !DILocalVariable(name: "handle", scope: !875, file: !3, line: 378, type: !527)
!884 = !DILocalVariable(name: "i", scope: !875, file: !3, line: 379, type: !468)
!885 = !DILocalVariable(name: "num_packets", scope: !875, file: !3, line: 380, type: !527)
!886 = !DILocalVariable(name: "temp_addr_buf", scope: !875, file: !3, line: 381, type: !598)
!887 = !DILocalVariable(name: "addr_type", scope: !875, file: !3, line: 382, type: !428)
!888 = !DILocalVariable(name: "status", scope: !875, file: !3, line: 383, type: !528)
!889 = !DILocalVariable(name: "conn", scope: !875, file: !3, line: 384, type: !402)
!890 = !DILocalVariable(name: "g", scope: !891, file: !3, line: 481, type: !603)
!891 = distinct !DILexicalBlock(scope: !875, file: !3, line: 391, column: 24)
!892 = !DILocalVariable(name: "offset", scope: !893, file: !3, line: 519, type: !468)
!893 = distinct !DILexicalBlock(scope: !891, file: !3, line: 518, column: 49)
!894 = !DILocalVariable(name: "num_packets", scope: !895, file: !3, line: 531, type: !425)
!895 = distinct !DILexicalBlock(scope: !896, file: !3, line: 523, column: 45)
!896 = distinct !DILexicalBlock(scope: !897, file: !3, line: 523, column: 13)
!897 = distinct !DILexicalBlock(scope: !898, file: !3, line: 523, column: 13)
!898 = distinct !DILexicalBlock(scope: !899, file: !3, line: 522, column: 54)
!899 = distinct !DILexicalBlock(scope: !893, file: !3, line: 522, column: 13)
!900 = !DILocalVariable(name: "conn", scope: !895, file: !3, line: 534, type: !402)
!901 = !DILocalVariable(name: "dev_type", scope: !902, file: !3, line: 610, type: !528)
!902 = distinct !DILexicalBlock(scope: !903, file: !3, line: 608, column: 58)
!903 = distinct !DILexicalBlock(scope: !904, file: !3, line: 608, column: 21)
!904 = distinct !DILexicalBlock(scope: !905, file: !3, line: 606, column: 46)
!905 = distinct !DILexicalBlock(scope: !906, file: !3, line: 606, column: 17)
!906 = distinct !DILexicalBlock(scope: !907, file: !3, line: 605, column: 25)
!907 = distinct !DILexicalBlock(scope: !891, file: !3, line: 605, column: 13)
!908 = !DILocalVariable(name: "link_key", scope: !909, file: !3, line: 677, type: !542)
!909 = distinct !DILexicalBlock(scope: !891, file: !3, line: 676, column: 9)
!910 = !DILocalVariable(name: "get_link_key_res", scope: !909, file: !3, line: 678, type: !468)
!911 = !DILocalVariable(name: "pin_code", scope: !912, file: !3, line: 718, type: !913)
!912 = distinct !DILexicalBlock(scope: !891, file: !3, line: 717, column: 9)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 128, elements: !544)
!914 = !DILocalVariable(name: "reason", scope: !891, file: !3, line: 768, type: !528)
!915 = !DILocalVariable(name: "event", scope: !916, file: !3, line: 334, type: !931)
!916 = distinct !DISubprogram(name: "le_handle_advertisement_report", scope: !3, file: !3, line: 325, type: !917, isLocal: true, isDefinition: true, scopeLine: 326, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !919)
!917 = !DISubroutineType(types: !918)
!918 = !{null, !556, !425}
!919 = !{!920, !921, !922, !923, !924, !915, !925, !929, !930}
!920 = !DILocalVariable(name: "packet", arg: 1, scope: !916, file: !3, line: 325, type: !556)
!921 = !DILocalVariable(name: "size", arg: 2, scope: !916, file: !3, line: 325, type: !425)
!922 = !DILocalVariable(name: "offset", scope: !916, file: !3, line: 328, type: !468)
!923 = !DILocalVariable(name: "num_reports", scope: !916, file: !3, line: 329, type: !468)
!924 = !DILocalVariable(name: "i", scope: !916, file: !3, line: 332, type: !468)
!925 = !DILocalVariable(name: "data_length", scope: !926, file: !3, line: 336, type: !418)
!926 = distinct !DILexicalBlock(scope: !927, file: !3, line: 335, column: 56)
!927 = distinct !DILexicalBlock(scope: !928, file: !3, line: 335, column: 5)
!928 = distinct !DILexicalBlock(scope: !916, file: !3, line: 335, column: 5)
!929 = !DILocalVariable(name: "event_size", scope: !926, file: !3, line: 337, type: !418)
!930 = !DILocalVariable(name: "pos", scope: !926, file: !3, line: 338, type: !468)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 344, elements: !932)
!932 = !{!933}
!933 = !DISubrange(count: 43)
!934 = !DILocation(line: 334, column: 13, scope: !916, inlinedAt: !935)
!935 = distinct !DILocation(line: 828, column: 17, scope: !936)
!936 = distinct !DILexicalBlock(scope: !937, file: !3, line: 821, column: 32)
!937 = distinct !DILexicalBlock(scope: !938, file: !3, line: 820, column: 54)
!938 = distinct !DILexicalBlock(scope: !891, file: !3, line: 820, column: 13)
!939 = !DILocalVariable(name: "remote_name", scope: !940, file: !3, line: 2332, type: !954)
!940 = distinct !DISubprogram(name: "hci_event_extended_inquiry_result1", scope: !3, file: !3, line: 2323, type: !941, isLocal: true, isDefinition: true, scopeLine: 2324, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !943)
!941 = !DISubroutineType(types: !942)
!942 = !{null, !540, !468}
!943 = !{!944, !945, !946, !947, !948, !949, !950, !951, !952, !939, !953}
!944 = !DILocalVariable(name: "packet", arg: 1, scope: !940, file: !3, line: 2323, type: !540)
!945 = !DILocalVariable(name: "len", arg: 2, scope: !940, file: !3, line: 2323, type: !468)
!946 = !DILocalVariable(name: "p", scope: !940, file: !3, line: 2325, type: !540)
!947 = !DILocalVariable(name: "name_cmp_flag", scope: !940, file: !3, line: 2326, type: !528)
!948 = !DILocalVariable(name: "dev_class", scope: !940, file: !3, line: 2327, type: !603)
!949 = !DILocalVariable(name: "res", scope: !940, file: !3, line: 2328, type: !528)
!950 = !DILocalVariable(name: "rssi", scope: !940, file: !3, line: 2329, type: !560)
!951 = !DILocalVariable(name: "dev_class_full", scope: !940, file: !3, line: 2330, type: !603)
!952 = !DILocalVariable(name: "remote_name_len", scope: !940, file: !3, line: 2331, type: !527)
!953 = !DILocalVariable(name: "callback_flag", scope: !940, file: !3, line: 2388, type: !528)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 256, elements: !955)
!955 = !{!956}
!956 = !DISubrange(count: 32)
!957 = !DILocation(line: 2332, column: 8, scope: !940, inlinedAt: !958)
!958 = distinct !DILocation(line: 598, column: 17, scope: !959)
!959 = distinct !DILexicalBlock(scope: !960, file: !3, line: 597, column: 38)
!960 = distinct !DILexicalBlock(scope: !961, file: !3, line: 597, column: 17)
!961 = distinct !DILexicalBlock(scope: !962, file: !3, line: 596, column: 55)
!962 = distinct !DILexicalBlock(scope: !891, file: !3, line: 596, column: 13)
!963 = !DILocation(line: 373, column: 28, scope: !875)
!964 = !DILocation(line: 375, column: 9, scope: !875)
!965 = !DILocation(line: 377, column: 8, scope: !875)
!966 = !DILocation(line: 378, column: 9, scope: !875)
!967 = !DILocation(line: 391, column: 13, scope: !875)
!968 = !DILocation(line: 391, column: 5, scope: !875)
!969 = !DILocation(line: 415, column: 18, scope: !891)
!970 = !DILocation(line: 416, column: 52, scope: !891)
!971 = !DILocation(line: 416, column: 16, scope: !891)
!972 = !DILocation(line: 417, column: 13, scope: !973)
!973 = distinct !DILexicalBlock(scope: !891, file: !3, line: 417, column: 13)
!974 = !DILocation(line: 417, column: 13, scope: !891)
!975 = !DILocation(line: 418, column: 13, scope: !976)
!976 = distinct !DILexicalBlock(scope: !977, file: !3, line: 418, column: 13)
!977 = distinct !DILexicalBlock(scope: !973, file: !3, line: 417, column: 38)
!978 = !DILocation(line: 418, column: 13, scope: !977)
!979 = !DILocation(line: 418, column: 13, scope: !980)
!980 = !DILexicalBlockFile(scope: !976, file: !3, discriminator: 1)
!981 = !DILocation(line: 419, column: 13, scope: !982)
!982 = distinct !DILexicalBlock(scope: !977, file: !3, line: 419, column: 13)
!983 = !DILocation(line: 419, column: 13, scope: !977)
!984 = !DILocation(line: 419, column: 13, scope: !985)
!985 = !DILexicalBlockFile(scope: !982, file: !3, discriminator: 1)
!986 = !DILocation(line: 420, column: 25, scope: !977)
!987 = !DILocation(line: 421, column: 103, scope: !977)
!988 = !DILocation(line: 421, column: 13, scope: !977)
!989 = !DILocation(line: 424, column: 9, scope: !977)
!990 = !DILocation(line: 425, column: 13, scope: !991)
!991 = distinct !DILexicalBlock(scope: !992, file: !3, line: 425, column: 13)
!992 = distinct !DILexicalBlock(scope: !993, file: !3, line: 424, column: 46)
!993 = distinct !DILexicalBlock(scope: !973, file: !3, line: 424, column: 20)
!994 = !DILocation(line: 425, column: 13, scope: !992)
!995 = !DILocation(line: 425, column: 13, scope: !996)
!996 = !DILexicalBlockFile(scope: !991, file: !3, discriminator: 1)
!997 = !DILocation(line: 426, column: 13, scope: !998)
!998 = distinct !DILexicalBlock(scope: !992, file: !3, line: 426, column: 13)
!999 = !DILocation(line: 426, column: 13, scope: !992)
!1000 = !DILocation(line: 426, column: 13, scope: !1001)
!1001 = !DILexicalBlockFile(scope: !998, file: !3, discriminator: 1)
!1002 = !DILocation(line: 427, column: 25, scope: !992)
!1003 = !DILocation(line: 428, column: 103, scope: !992)
!1004 = !DILocation(line: 428, column: 13, scope: !992)
!1005 = !DILocation(line: 431, column: 9, scope: !992)
!1006 = !DILocation(line: 434, column: 9, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !891, file: !3, line: 434, column: 9)
!1008 = !DILocation(line: 434, column: 9, scope: !891)
!1009 = !DILocation(line: 434, column: 9, scope: !1010)
!1010 = !DILexicalBlockFile(scope: !1007, file: !3, discriminator: 1)
!1011 = !DILocation(line: 435, column: 13, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !891, file: !3, line: 435, column: 13)
!1013 = !DILocation(line: 435, column: 23, scope: !1012)
!1014 = !DILocation(line: 435, column: 13, scope: !891)
!1015 = !DILocation(line: 436, column: 13, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 435, column: 29)
!1017 = !DILocation(line: 437, column: 9, scope: !1016)
!1018 = !DILocation(line: 439, column: 56, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 437, column: 16)
!1020 = !DILocation(line: 439, column: 20, scope: !1019)
!1021 = !DILocation(line: 441, column: 17, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 441, column: 17)
!1023 = !{!842, !842, i64 0}
!1024 = !DILocation(line: 441, column: 17, scope: !1019)
!1025 = !DILocation(line: 442, column: 33, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 441, column: 41)
!1027 = !DILocation(line: 160, column: 12, scope: !716, inlinedAt: !1028)
!1028 = distinct !DILocation(line: 442, column: 52, scope: !1026)
!1029 = !DILocation(line: 160, column: 32, scope: !716, inlinedAt: !1028)
!1030 = !DILocation(line: 160, column: 69, scope: !716, inlinedAt: !1028)
!1031 = !DILocation(line: 160, column: 47, scope: !716, inlinedAt: !1028)
!1032 = !DILocation(line: 442, column: 17, scope: !1033)
!1033 = !DILexicalBlockFile(scope: !1026, file: !3, discriminator: 1)
!1034 = !DILocation(line: 443, column: 13, scope: !1026)
!1035 = !DILocation(line: 445, column: 17, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 445, column: 17)
!1037 = !DILocation(line: 445, column: 27, scope: !1036)
!1038 = !DILocation(line: 445, column: 17, scope: !1019)
!1039 = !DILocation(line: 448, column: 17, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1036, file: !3, line: 447, column: 20)
!1041 = !DILocation(line: 454, column: 18, scope: !891)
!1042 = !DILocation(line: 456, column: 22, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !891, file: !3, line: 456, column: 13)
!1044 = !DILocation(line: 456, column: 20, scope: !1043)
!1045 = !DILocation(line: 456, column: 13, scope: !891)
!1046 = !DILocation(line: 457, column: 60, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1043, file: !3, line: 456, column: 45)
!1048 = !DILocation(line: 457, column: 80, scope: !1047)
!1049 = !{!1050, !840, i64 4}
!1050 = !{!"_stack_config", !842, i64 0, !840, i64 4, !840, i64 6, !840, i64 8, !840, i64 10, !840, i64 12, !661, i64 14, !661, i64 15, !661, i64 16, !661, i64 17, !661, i64 17, !661, i64 17, !661, i64 17, !661, i64 18, !661, i64 18, !661, i64 18, !661, i64 18, !661, i64 18, !661, i64 18, !661, i64 18, !661, i64 18, !661, i64 19, !661, i64 19, !661, i64 19, !661, i64 19, !661, i64 19, !661, i64 19, !661, i64 19, !661, i64 19, !661, i64 20, !661, i64 20, !661, i64 20, !661, i64 21, !661, i64 22, !661, i64 23, !661, i64 24, !661, i64 25, !661, i64 31, !661, i64 31}
!1051 = !DILocation(line: 457, column: 13, scope: !1047)
!1052 = !DILocation(line: 458, column: 9, scope: !1047)
!1053 = !DILocation(line: 464, column: 9, scope: !891)
!1054 = !DILocation(line: 466, column: 16, scope: !1055)
!1055 = !DILexicalBlockFile(scope: !891, file: !3, discriminator: 1)
!1056 = !DILocation(line: 466, column: 9, scope: !1055)
!1057 = !DILocation(line: 467, column: 13, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !891, file: !3, line: 466, column: 45)
!1059 = distinct !{!1059, !1060, !1061}
!1060 = !DILocation(line: 466, column: 9, scope: !891)
!1061 = !DILocation(line: 468, column: 9, scope: !891)
!1062 = !DILocation(line: 470, column: 9, scope: !891)
!1063 = !DILocation(line: 472, column: 17, scope: !891)
!1064 = !DILocation(line: 474, column: 51, scope: !891)
!1065 = !DILocation(line: 474, column: 71, scope: !891)
!1066 = !DILocation(line: 475, column: 65, scope: !891)
!1067 = !DILocation(line: 475, column: 110, scope: !891)
!1068 = !DILocation(line: 474, column: 9, scope: !891)
!1069 = !DILocation(line: 476, column: 9, scope: !891)
!1070 = !DILocation(line: 480, column: 17, scope: !891)
!1071 = !DILocation(line: 481, column: 18, scope: !891)
!1072 = !DILocation(line: 481, column: 13, scope: !891)
!1073 = !DILocation(line: 483, column: 69, scope: !891)
!1074 = !DILocation(line: 483, column: 9, scope: !891)
!1075 = !DILocation(line: 484, column: 9, scope: !891)
!1076 = !DILocation(line: 488, column: 17, scope: !891)
!1077 = !DILocation(line: 489, column: 9, scope: !891)
!1078 = !DILocation(line: 490, column: 9, scope: !891)
!1079 = !DILocation(line: 494, column: 17, scope: !891)
!1080 = !DILocation(line: 495, column: 80, scope: !891)
!1081 = !DILocation(line: 495, column: 9, scope: !891)
!1082 = !DILocation(line: 496, column: 9, scope: !891)
!1083 = !DILocation(line: 500, column: 17, scope: !891)
!1084 = !DILocation(line: 121, column: 46, scope: !673, inlinedAt: !1085)
!1085 = distinct !DILocation(line: 501, column: 18, scope: !891)
!1086 = !DILocation(line: 121, column: 58, scope: !673, inlinedAt: !1085)
!1087 = !DILocation(line: 123, column: 12, scope: !673, inlinedAt: !1085)
!1088 = !DILocation(line: 502, column: 13, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !891, file: !3, line: 502, column: 13)
!1090 = !DILocation(line: 502, column: 13, scope: !891)
!1091 = !DILocation(line: 503, column: 13, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1089, file: !3, line: 502, column: 24)
!1093 = !DILocation(line: 505, column: 9, scope: !1092)
!1094 = !DILocation(line: 510, column: 13, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !891, file: !3, line: 510, column: 13)
!1096 = !DILocation(line: 510, column: 13, scope: !891)
!1097 = !DILocation(line: 511, column: 39, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1095, file: !3, line: 510, column: 54)
!1099 = !DILocation(line: 511, column: 49, scope: !1098)
!1100 = !DILocation(line: 511, column: 13, scope: !1098)
!1101 = !DILocation(line: 512, column: 9, scope: !1098)
!1102 = !DILocation(line: 519, column: 13, scope: !893)
!1103 = !DILocation(line: 522, column: 13, scope: !899)
!1104 = !DILocation(line: 522, column: 13, scope: !893)
!1105 = !DILocation(line: 379, column: 9, scope: !875)
!1106 = !DILocation(line: 523, column: 29, scope: !1107)
!1107 = !DILexicalBlockFile(scope: !896, file: !3, discriminator: 1)
!1108 = !DILocation(line: 523, column: 27, scope: !1107)
!1109 = !DILocation(line: 523, column: 13, scope: !1110)
!1110 = !DILexicalBlockFile(scope: !897, file: !3, discriminator: 1)
!1111 = !DILocation(line: 524, column: 26, scope: !895)
!1112 = !DILocation(line: 526, column: 30, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !895, file: !3, line: 526, column: 21)
!1114 = !DILocation(line: 526, column: 28, scope: !1113)
!1115 = !DILocation(line: 526, column: 21, scope: !895)
!1116 = !DILocation(line: 530, column: 24, scope: !895)
!1117 = !DILocation(line: 531, column: 40, scope: !895)
!1118 = !DILocation(line: 531, column: 26, scope: !895)
!1119 = !DILocation(line: 532, column: 24, scope: !895)
!1120 = !DILocation(line: 534, column: 45, scope: !895)
!1121 = !DILocation(line: 534, column: 38, scope: !895)
!1122 = !DILocation(line: 535, column: 22, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !895, file: !3, line: 535, column: 21)
!1124 = !DILocation(line: 535, column: 21, scope: !895)
!1125 = !DILocation(line: 539, column: 27, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !895, file: !3, line: 539, column: 21)
!1127 = !{!838, !661, i64 1206}
!1128 = !DILocation(line: 539, column: 21, scope: !1126)
!1129 = !DILocation(line: 539, column: 51, scope: !1126)
!1130 = !DILocation(line: 539, column: 48, scope: !1126)
!1131 = !DILocation(line: 541, column: 48, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1126, file: !3, line: 539, column: 64)
!1133 = !DILocation(line: 539, column: 21, scope: !895)
!1134 = !DILocation(line: 545, column: 13, scope: !896)
!1135 = !DILocation(line: 523, column: 41, scope: !1136)
!1136 = !DILexicalBlockFile(scope: !896, file: !3, discriminator: 2)
!1137 = distinct !{!1137, !1138, !1139}
!1138 = !DILocation(line: 523, column: 13, scope: !897)
!1139 = !DILocation(line: 545, column: 13, scope: !897)
!1140 = !DILocation(line: 552, column: 17, scope: !891)
!1141 = !DILocation(line: 554, column: 9, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !891, file: !3, line: 554, column: 9)
!1143 = !DILocation(line: 554, column: 9, scope: !891)
!1144 = !DILocation(line: 554, column: 9, scope: !1145)
!1145 = !DILexicalBlockFile(scope: !1142, file: !3, discriminator: 1)
!1146 = !DILocation(line: 556, column: 14, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !891, file: !3, line: 556, column: 13)
!1148 = !DILocation(line: 556, column: 44, scope: !1147)
!1149 = !DILocation(line: 557, column: 17, scope: !1150)
!1150 = distinct !DILexicalBlock(scope: !1151, file: !3, line: 557, column: 17)
!1151 = distinct !DILexicalBlock(scope: !1147, file: !3, line: 556, column: 78)
!1152 = !DILocation(line: 557, column: 17, scope: !1151)
!1153 = !DILocation(line: 561, column: 13, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !891, file: !3, line: 561, column: 13)
!1155 = !DILocation(line: 561, column: 13, scope: !891)
!1156 = !DILocation(line: 563, column: 17, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1158, file: !3, line: 563, column: 17)
!1158 = distinct !DILexicalBlock(scope: !1154, file: !3, line: 561, column: 42)
!1159 = !DILocation(line: 563, column: 37, scope: !1157)
!1160 = !DILocation(line: 563, column: 17, scope: !1158)
!1161 = !DILocation(line: 564, column: 17, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1157, file: !3, line: 563, column: 53)
!1163 = !DILocation(line: 565, column: 13, scope: !1162)
!1164 = !DILocation(line: 566, column: 17, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1157, file: !3, line: 565, column: 20)
!1166 = !DILocation(line: 569, column: 13, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1168, file: !3, line: 568, column: 49)
!1168 = distinct !DILexicalBlock(scope: !1154, file: !3, line: 568, column: 20)
!1169 = !DILocation(line: 570, column: 9, scope: !1167)
!1170 = !DILocation(line: 571, column: 13, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1172, file: !3, line: 570, column: 50)
!1172 = distinct !DILexicalBlock(scope: !1168, file: !3, line: 570, column: 20)
!1173 = !DILocation(line: 573, column: 9, scope: !1171)
!1174 = !DILocation(line: 575, column: 13, scope: !1175)
!1175 = distinct !DILexicalBlock(scope: !1172, file: !3, line: 573, column: 16)
!1176 = !DILocation(line: 579, column: 13, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !891, file: !3, line: 579, column: 13)
!1178 = !DILocation(line: 579, column: 13, scope: !891)
!1179 = !DILocation(line: 580, column: 13, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1181, file: !3, line: 580, column: 13)
!1181 = distinct !DILexicalBlock(scope: !1177, file: !3, line: 579, column: 55)
!1182 = !DILocation(line: 580, column: 13, scope: !1181)
!1183 = !DILocation(line: 580, column: 13, scope: !1184)
!1184 = !DILexicalBlockFile(scope: !1180, file: !3, discriminator: 1)
!1185 = !DILocation(line: 583, column: 73, scope: !1181)
!1186 = !DILocation(line: 584, column: 37, scope: !1181)
!1187 = !DILocation(line: 584, column: 53, scope: !1181)
!1188 = !DILocation(line: 583, column: 13, scope: !1181)
!1189 = !DILocation(line: 586, column: 17, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !1181, file: !3, line: 586, column: 17)
!1191 = !DILocation(line: 586, column: 27, scope: !1190)
!1192 = !DILocation(line: 586, column: 17, scope: !1181)
!1193 = !DILocation(line: 587, column: 34, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1190, file: !3, line: 586, column: 33)
!1195 = !DILocalVariable(name: "remote_info", arg: 1, scope: !1196, file: !3, line: 2468, type: !587)
!1196 = distinct !DISubprogram(name: "inquiry_complete", scope: !3, file: !3, line: 2468, type: !1197, isLocal: true, isDefinition: true, scopeLine: 2469, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1199)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{null, !587}
!1199 = !{!1195}
!1200 = !DILocation(line: 2468, column: 48, scope: !1196, inlinedAt: !1201)
!1201 = distinct !DILocation(line: 587, column: 17, scope: !1194)
!1202 = !DILocation(line: 2470, column: 22, scope: !1203, inlinedAt: !1201)
!1203 = distinct !DILexicalBlock(scope: !1196, file: !3, line: 2470, column: 9)
!1204 = !DILocation(line: 2470, column: 9, scope: !1203, inlinedAt: !1201)
!1205 = !DILocation(line: 2470, column: 9, scope: !1196, inlinedAt: !1201)
!1206 = !DILocation(line: 2471, column: 32, scope: !1207, inlinedAt: !1201)
!1207 = distinct !DILexicalBlock(scope: !1203, file: !3, line: 2470, column: 33)
!1208 = !DILocation(line: 2474, column: 9, scope: !1207, inlinedAt: !1201)
!1209 = !DILocation(line: 2476, column: 13, scope: !1210, inlinedAt: !1201)
!1210 = distinct !DILexicalBlock(scope: !1207, file: !3, line: 2476, column: 13)
!1211 = !DILocation(line: 2476, column: 13, scope: !1207, inlinedAt: !1201)
!1212 = !DILocation(line: 2477, column: 32, scope: !1213, inlinedAt: !1201)
!1213 = distinct !DILexicalBlock(scope: !1210, file: !3, line: 2476, column: 33)
!1214 = !DILocation(line: 2478, column: 75, scope: !1213, inlinedAt: !1201)
!1215 = !DILocation(line: 2478, column: 13, scope: !1213, inlinedAt: !1201)
!1216 = !DILocation(line: 2479, column: 9, scope: !1213, inlinedAt: !1201)
!1217 = !DILocation(line: 2480, column: 71, scope: !1218, inlinedAt: !1201)
!1218 = distinct !DILexicalBlock(scope: !1210, file: !3, line: 2479, column: 16)
!1219 = !DILocation(line: 2480, column: 13, scope: !1218, inlinedAt: !1201)
!1220 = !DILocation(line: 596, column: 13, scope: !962)
!1221 = !DILocation(line: 597, column: 17, scope: !960)
!1222 = !DILocation(line: 596, column: 13, scope: !891)
!1223 = !DILocation(line: 598, column: 64, scope: !959)
!1224 = !DILocation(line: 2323, column: 64, scope: !940, inlinedAt: !958)
!1225 = !DILocation(line: 2325, column: 14, scope: !940, inlinedAt: !958)
!1226 = !DILocation(line: 2325, column: 9, scope: !940, inlinedAt: !958)
!1227 = !DILocation(line: 2326, column: 8, scope: !940, inlinedAt: !958)
!1228 = !DILocation(line: 2327, column: 9, scope: !940, inlinedAt: !958)
!1229 = !DILocation(line: 2328, column: 8, scope: !940, inlinedAt: !958)
!1230 = !DILocation(line: 2329, column: 17, scope: !940, inlinedAt: !958)
!1231 = !DILocation(line: 2329, column: 10, scope: !940, inlinedAt: !958)
!1232 = !DILocation(line: 2330, column: 9, scope: !940, inlinedAt: !958)
!1233 = !DILocation(line: 2332, column: 5, scope: !940, inlinedAt: !958)
!1234 = !DILocation(line: 2337, column: 9, scope: !1235, inlinedAt: !958)
!1235 = distinct !DILexicalBlock(scope: !940, file: !3, line: 2337, column: 9)
!1236 = !DILocation(line: 2337, column: 25, scope: !1235, inlinedAt: !958)
!1237 = !DILocation(line: 2337, column: 9, scope: !940, inlinedAt: !958)
!1238 = !DILocation(line: 2341, column: 9, scope: !940, inlinedAt: !958)
!1239 = !DILocation(line: 2342, column: 5, scope: !940, inlinedAt: !958)
!1240 = !DILocation(line: 2343, column: 18, scope: !940, inlinedAt: !958)
!1241 = !DILocation(line: 2343, column: 48, scope: !940, inlinedAt: !958)
!1242 = !DILocation(line: 2343, column: 5, scope: !940, inlinedAt: !958)
!1243 = !DILocation(line: 2346, column: 22, scope: !940, inlinedAt: !958)
!1244 = !DILocation(line: 2347, column: 32, scope: !940, inlinedAt: !958)
!1245 = !DILocation(line: 2350, column: 35, scope: !1246, inlinedAt: !958)
!1246 = distinct !DILexicalBlock(scope: !940, file: !3, line: 2350, column: 9)
!1247 = !DILocation(line: 2357, column: 9, scope: !1248, inlinedAt: !958)
!1248 = distinct !DILexicalBlock(scope: !1249, file: !3, line: 2357, column: 9)
!1249 = distinct !DILexicalBlock(scope: !1246, file: !3, line: 2355, column: 36)
!1250 = !DILocation(line: 2357, column: 9, scope: !1249, inlinedAt: !958)
!1251 = !DILocation(line: 2357, column: 9, scope: !1252, inlinedAt: !958)
!1252 = !DILexicalBlockFile(scope: !1248, file: !3, discriminator: 1)
!1253 = !DILocation(line: 2363, column: 13, scope: !1254, inlinedAt: !958)
!1254 = distinct !DILexicalBlock(scope: !940, file: !3, line: 2363, column: 9)
!1255 = !DILocation(line: 2363, column: 9, scope: !940, inlinedAt: !958)
!1256 = !DILocation(line: 2388, column: 8, scope: !940, inlinedAt: !958)
!1257 = !DILocation(line: 2390, column: 16, scope: !1258, inlinedAt: !958)
!1258 = !DILexicalBlockFile(scope: !940, file: !3, discriminator: 1)
!1259 = !DILocation(line: 2390, column: 5, scope: !1258, inlinedAt: !958)
!1260 = !DILocation(line: 2391, column: 13, scope: !1261, inlinedAt: !958)
!1261 = distinct !DILexicalBlock(scope: !1262, file: !3, line: 2391, column: 13)
!1262 = distinct !DILexicalBlock(scope: !940, file: !3, line: 2390, column: 21)
!1263 = !DILocation(line: 2391, column: 18, scope: !1261, inlinedAt: !958)
!1264 = !DILocation(line: 2391, column: 13, scope: !1262, inlinedAt: !958)
!1265 = !DILocation(line: 2398, column: 14, scope: !1266, inlinedAt: !958)
!1266 = distinct !DILexicalBlock(scope: !1262, file: !3, line: 2398, column: 13)
!1267 = !DILocation(line: 2398, column: 28, scope: !1266, inlinedAt: !958)
!1268 = !DILocation(line: 2399, column: 32, scope: !1269, inlinedAt: !958)
!1269 = distinct !DILexicalBlock(scope: !1266, file: !3, line: 2398, column: 47)
!1270 = !DILocation(line: 2399, column: 37, scope: !1269, inlinedAt: !958)
!1271 = !DILocation(line: 2331, column: 9, scope: !940, inlinedAt: !958)
!1272 = !DILocation(line: 2400, column: 17, scope: !1269, inlinedAt: !958)
!1273 = !DILocation(line: 2407, column: 42, scope: !1269, inlinedAt: !958)
!1274 = !DILocation(line: 2407, column: 48, scope: !1269, inlinedAt: !958)
!1275 = !DILocation(line: 2407, column: 13, scope: !1269, inlinedAt: !958)
!1276 = !DILocation(line: 2409, column: 17, scope: !1277, inlinedAt: !958)
!1277 = distinct !DILexicalBlock(scope: !1269, file: !3, line: 2409, column: 17)
!1278 = !DILocation(line: 2409, column: 33, scope: !1277, inlinedAt: !958)
!1279 = !{!1280, !721, i64 48}
!1280 = !{!"user_interface_handler", !721, i64 0, !721, i64 4, !721, i64 8, !721, i64 12, !721, i64 16, !721, i64 20, !721, i64 24, !721, i64 28, !721, i64 32, !721, i64 36, !721, i64 40, !721, i64 44, !721, i64 48, !721, i64 52, !721, i64 56}
!1281 = !DILocation(line: 2409, column: 17, scope: !1269, inlinedAt: !958)
!1282 = !DILocation(line: 2410, column: 75, scope: !1283, inlinedAt: !958)
!1283 = distinct !DILexicalBlock(scope: !1277, file: !3, line: 2409, column: 49)
!1284 = !DILocation(line: 2411, column: 54, scope: !1283, inlinedAt: !958)
!1285 = !DILocation(line: 2410, column: 23, scope: !1283, inlinedAt: !958)
!1286 = !DILocation(line: 2413, column: 25, scope: !1287, inlinedAt: !958)
!1287 = distinct !DILexicalBlock(scope: !1283, file: !3, line: 2413, column: 21)
!1288 = !DILocation(line: 2413, column: 21, scope: !1283, inlinedAt: !958)
!1289 = !DILocation(line: 2414, column: 21, scope: !1290, inlinedAt: !958)
!1290 = distinct !DILexicalBlock(scope: !1287, file: !3, line: 2413, column: 34)
!1291 = !DILocation(line: 2415, column: 21, scope: !1290, inlinedAt: !958)
!1292 = !DILocation(line: 2415, column: 37, scope: !1290, inlinedAt: !958)
!1293 = !DILocation(line: 2415, column: 47, scope: !1290, inlinedAt: !958)
!1294 = !DILocation(line: 2416, column: 35, scope: !1290, inlinedAt: !958)
!1295 = !DILocation(line: 2416, column: 21, scope: !1290, inlinedAt: !958)
!1296 = !DILocation(line: 1617, column: 5, scope: !1297, inlinedAt: !1298)
!1297 = distinct !DISubprogram(name: "hci_cancel_inquiry", scope: !3, file: !3, line: 1615, type: !727, isLocal: false, isDefinition: true, scopeLine: 1616, isOptimized: true, unit: !2, variables: !695)
!1298 = distinct !DILocation(line: 2417, column: 21, scope: !1290, inlinedAt: !958)
!1299 = !DILocation(line: 2418, column: 21, scope: !1290, inlinedAt: !958)
!1300 = !DILocation(line: 2447, column: 16, scope: !1262, inlinedAt: !958)
!1301 = !DILocation(line: 2447, column: 21, scope: !1262, inlinedAt: !958)
!1302 = !DILocation(line: 2447, column: 13, scope: !1262, inlinedAt: !958)
!1303 = !DILocation(line: 2448, column: 11, scope: !1262, inlinedAt: !958)
!1304 = distinct !{!1304, !1305, !1306}
!1305 = !DILocation(line: 2390, column: 5, scope: !940)
!1306 = !DILocation(line: 2449, column: 5, scope: !940)
!1307 = !DILocation(line: 2452, column: 9, scope: !1308, inlinedAt: !958)
!1308 = distinct !DILexicalBlock(scope: !940, file: !3, line: 2452, column: 9)
!1309 = !DILocation(line: 2452, column: 9, scope: !940, inlinedAt: !958)
!1310 = !DILocation(line: 2453, column: 15, scope: !1311, inlinedAt: !958)
!1311 = distinct !DILexicalBlock(scope: !1308, file: !3, line: 2452, column: 24)
!1312 = !DILocation(line: 2453, column: 31, scope: !1311, inlinedAt: !958)
!1313 = !DILocation(line: 2453, column: 55, scope: !1311, inlinedAt: !958)
!1314 = !DILocation(line: 2454, column: 17, scope: !1315, inlinedAt: !958)
!1315 = distinct !DILexicalBlock(scope: !1311, file: !3, line: 2454, column: 13)
!1316 = !DILocation(line: 2454, column: 13, scope: !1311, inlinedAt: !958)
!1317 = !DILocation(line: 2455, column: 13, scope: !1318, inlinedAt: !958)
!1318 = distinct !DILexicalBlock(scope: !1315, file: !3, line: 2454, column: 26)
!1319 = !DILocation(line: 2455, column: 29, scope: !1318, inlinedAt: !958)
!1320 = !DILocation(line: 2455, column: 39, scope: !1318, inlinedAt: !958)
!1321 = !DILocation(line: 1617, column: 5, scope: !1297, inlinedAt: !1322)
!1322 = distinct !DILocation(line: 2456, column: 13, scope: !1318, inlinedAt: !958)
!1323 = !DILocation(line: 2457, column: 27, scope: !1318, inlinedAt: !958)
!1324 = !DILocation(line: 2457, column: 13, scope: !1318, inlinedAt: !958)
!1325 = !DILocation(line: 2458, column: 13, scope: !1318, inlinedAt: !958)
!1326 = !DILocation(line: 2467, column: 1, scope: !940, inlinedAt: !958)
!1327 = !DILocation(line: 599, column: 13, scope: !959)
!1328 = !DILocation(line: 603, column: 17, scope: !891)
!1329 = !DILocation(line: 605, column: 14, scope: !907)
!1330 = !DILocation(line: 605, column: 13, scope: !891)
!1331 = !DILocation(line: 606, column: 17, scope: !905)
!1332 = !DILocation(line: 606, column: 28, scope: !905)
!1333 = !DILocation(line: 606, column: 17, scope: !906)
!1334 = !DILocation(line: 607, column: 38, scope: !904)
!1335 = !DILocation(line: 160, column: 12, scope: !716, inlinedAt: !1336)
!1336 = distinct !DILocation(line: 607, column: 57, scope: !904)
!1337 = !DILocation(line: 160, column: 32, scope: !716, inlinedAt: !1336)
!1338 = !DILocation(line: 160, column: 69, scope: !716, inlinedAt: !1336)
!1339 = !DILocation(line: 160, column: 47, scope: !716, inlinedAt: !1336)
!1340 = !DILocation(line: 607, column: 17, scope: !1341)
!1341 = !DILexicalBlockFile(scope: !904, file: !3, discriminator: 1)
!1342 = !DILocation(line: 608, column: 22, scope: !903)
!1343 = !DILocation(line: 608, column: 42, scope: !903)
!1344 = !DILocation(line: 608, column: 21, scope: !904)
!1345 = !DILocation(line: 610, column: 24, scope: !902)
!1346 = !DILocation(line: 611, column: 32, scope: !902)
!1347 = !DILocation(line: 612, column: 21, scope: !902)
!1348 = !DILocation(line: 614, column: 34, scope: !1349)
!1349 = distinct !DILexicalBlock(scope: !902, file: !3, line: 614, column: 25)
!1350 = !DILocation(line: 614, column: 25, scope: !902)
!1351 = !DILocation(line: 616, column: 25, scope: !1352)
!1352 = distinct !DILexicalBlock(scope: !1349, file: !3, line: 614, column: 57)
!1353 = !DILocation(line: 617, column: 21, scope: !1352)
!1354 = !DILocation(line: 633, column: 33, scope: !1355)
!1355 = distinct !DILexicalBlock(scope: !1356, file: !3, line: 632, column: 36)
!1356 = distinct !DILexicalBlock(scope: !1357, file: !3, line: 632, column: 17)
!1357 = distinct !DILexicalBlock(scope: !907, file: !3, line: 630, column: 16)
!1358 = !DILocation(line: 160, column: 12, scope: !716, inlinedAt: !1359)
!1359 = distinct !DILocation(line: 633, column: 52, scope: !1355)
!1360 = !DILocation(line: 160, column: 32, scope: !716, inlinedAt: !1359)
!1361 = !DILocation(line: 160, column: 69, scope: !716, inlinedAt: !1359)
!1362 = !DILocation(line: 160, column: 47, scope: !716, inlinedAt: !1359)
!1363 = !DILocation(line: 633, column: 17, scope: !1364)
!1364 = !DILexicalBlockFile(scope: !1355, file: !3, discriminator: 1)
!1365 = !DILocation(line: 634, column: 13, scope: !1355)
!1366 = !DILocation(line: 670, column: 17, scope: !891)
!1367 = !DILocation(line: 677, column: 13, scope: !909)
!1368 = !DILocation(line: 677, column: 24, scope: !909)
!1369 = !DILocation(line: 678, column: 17, scope: !909)
!1370 = !DILocation(line: 681, column: 45, scope: !909)
!1371 = !DILocation(line: 160, column: 12, scope: !716, inlinedAt: !1372)
!1372 = distinct !DILocation(line: 681, column: 75, scope: !909)
!1373 = !DILocation(line: 160, column: 32, scope: !716, inlinedAt: !1372)
!1374 = !DILocation(line: 160, column: 69, scope: !716, inlinedAt: !1372)
!1375 = !DILocation(line: 160, column: 47, scope: !716, inlinedAt: !1372)
!1376 = !DILocation(line: 681, column: 32, scope: !1377)
!1377 = !DILexicalBlockFile(scope: !909, file: !3, discriminator: 1)
!1378 = !DILocation(line: 160, column: 12, scope: !716, inlinedAt: !1379)
!1379 = distinct !DILocation(line: 683, column: 102, scope: !909)
!1380 = !DILocation(line: 160, column: 32, scope: !716, inlinedAt: !1379)
!1381 = !DILocation(line: 160, column: 69, scope: !716, inlinedAt: !1379)
!1382 = !DILocation(line: 160, column: 47, scope: !716, inlinedAt: !1379)
!1383 = !DILocation(line: 683, column: 62, scope: !1377)
!1384 = !DILocation(line: 683, column: 62, scope: !909)
!1385 = !DILocation(line: 683, column: 13, scope: !909)
!1386 = !DILocation(line: 683, column: 33, scope: !909)
!1387 = !DILocation(line: 683, column: 60, scope: !909)
!1388 = !{!1050, !840, i64 12}
!1389 = !DILocation(line: 687, column: 17, scope: !1390)
!1390 = distinct !DILexicalBlock(scope: !909, file: !3, line: 687, column: 17)
!1391 = !DILocation(line: 687, column: 17, scope: !909)
!1392 = !DILocation(line: 689, column: 17, scope: !1393)
!1393 = distinct !DILexicalBlock(scope: !1390, file: !3, line: 687, column: 35)
!1394 = !DILocation(line: 690, column: 17, scope: !1393)
!1395 = !DILocation(line: 691, column: 13, scope: !1393)
!1396 = !DILocation(line: 692, column: 17, scope: !1397)
!1397 = distinct !DILexicalBlock(scope: !1390, file: !3, line: 691, column: 20)
!1398 = !DILocation(line: 694, column: 9, scope: !891)
!1399 = !DILocation(line: 695, column: 9, scope: !891)
!1400 = !DILocation(line: 699, column: 17, scope: !891)
!1401 = !DILocation(line: 701, column: 22, scope: !891)
!1402 = !DILocation(line: 701, column: 57, scope: !891)
!1403 = !DILocation(line: 701, column: 41, scope: !891)
!1404 = !DILocation(line: 160, column: 12, scope: !716, inlinedAt: !1405)
!1405 = distinct !DILocation(line: 701, column: 71, scope: !891)
!1406 = !DILocation(line: 160, column: 32, scope: !716, inlinedAt: !1405)
!1407 = !DILocation(line: 160, column: 69, scope: !716, inlinedAt: !1405)
!1408 = !DILocation(line: 160, column: 47, scope: !716, inlinedAt: !1405)
!1409 = !DILocation(line: 701, column: 9, scope: !1055)
!1410 = !DILocation(line: 702, column: 9, scope: !891)
!1411 = !DILocation(line: 703, column: 9, scope: !891)
!1412 = !DILocation(line: 706, column: 9, scope: !1413)
!1413 = distinct !DILexicalBlock(scope: !891, file: !3, line: 706, column: 9)
!1414 = !DILocation(line: 706, column: 9, scope: !891)
!1415 = !DILocation(line: 706, column: 9, scope: !1416)
!1416 = !DILexicalBlockFile(scope: !1413, file: !3, discriminator: 1)
!1417 = !DILocation(line: 708, column: 69, scope: !891)
!1418 = !DILocation(line: 708, column: 9, scope: !891)
!1419 = !DILocation(line: 710, column: 16, scope: !1055)
!1420 = !DILocation(line: 710, column: 9, scope: !1055)
!1421 = !DILocation(line: 711, column: 13, scope: !1422)
!1422 = distinct !DILexicalBlock(scope: !891, file: !3, line: 710, column: 45)
!1423 = distinct !{!1423, !1424, !1425}
!1424 = !DILocation(line: 710, column: 9, scope: !891)
!1425 = !DILocation(line: 712, column: 9, scope: !891)
!1426 = !DILocation(line: 715, column: 17, scope: !891)
!1427 = !DILocation(line: 716, column: 25, scope: !891)
!1428 = !DILocation(line: 160, column: 12, scope: !716, inlinedAt: !1429)
!1429 = distinct !DILocation(line: 716, column: 44, scope: !891)
!1430 = !DILocation(line: 160, column: 32, scope: !716, inlinedAt: !1429)
!1431 = !DILocation(line: 160, column: 69, scope: !716, inlinedAt: !1429)
!1432 = !DILocation(line: 160, column: 47, scope: !716, inlinedAt: !1429)
!1433 = !DILocation(line: 716, column: 9, scope: !1055)
!1434 = !DILocation(line: 718, column: 13, scope: !912)
!1435 = !DILocation(line: 718, column: 16, scope: !912)
!1436 = !DILocation(line: 720, column: 17, scope: !1437)
!1437 = distinct !DILexicalBlock(scope: !912, file: !3, line: 720, column: 17)
!1438 = !DILocation(line: 719, column: 13, scope: !912)
!1439 = !DILocation(line: 720, column: 37, scope: !1437)
!1440 = !DILocation(line: 720, column: 17, scope: !912)
!1441 = !DILocation(line: 721, column: 34, scope: !1442)
!1442 = distinct !DILexicalBlock(scope: !1437, file: !3, line: 720, column: 53)
!1443 = !DILocation(line: 722, column: 13, scope: !1442)
!1444 = !DILocation(line: 723, column: 34, scope: !1445)
!1445 = distinct !DILexicalBlock(scope: !1437, file: !3, line: 722, column: 20)
!1446 = !DILocation(line: 725, column: 13, scope: !912)
!1447 = !DILocation(line: 726, column: 9, scope: !891)
!1448 = !DILocation(line: 727, column: 9, scope: !891)
!1449 = !DILocation(line: 729, column: 13, scope: !1450)
!1450 = distinct !DILexicalBlock(scope: !891, file: !3, line: 729, column: 13)
!1451 = !DILocation(line: 729, column: 29, scope: !1450)
!1452 = !{!1280, !721, i64 4}
!1453 = !DILocation(line: 729, column: 13, scope: !891)
!1454 = !DILocation(line: 730, column: 53, scope: !1455)
!1455 = distinct !DILexicalBlock(scope: !1450, file: !3, line: 729, column: 54)
!1456 = !DILocation(line: 730, column: 65, scope: !1455)
!1457 = !DILocation(line: 730, column: 77, scope: !1455)
!1458 = !DILocation(line: 730, column: 13, scope: !1455)
!1459 = !DILocation(line: 731, column: 9, scope: !1455)
!1460 = !DILocation(line: 735, column: 13, scope: !1461)
!1461 = distinct !DILexicalBlock(scope: !891, file: !3, line: 735, column: 13)
!1462 = !DILocation(line: 736, column: 17, scope: !1463)
!1463 = distinct !DILexicalBlock(scope: !1464, file: !3, line: 736, column: 17)
!1464 = distinct !DILexicalBlock(scope: !1461, file: !3, line: 735, column: 55)
!1465 = !DILocation(line: 735, column: 13, scope: !891)
!1466 = !DILocation(line: 737, column: 49, scope: !1467)
!1467 = distinct !DILexicalBlock(scope: !1463, file: !3, line: 736, column: 38)
!1468 = !DILocation(line: 737, column: 54, scope: !1467)
!1469 = !DILocation(line: 737, column: 17, scope: !1467)
!1470 = !DILocation(line: 738, column: 13, scope: !1467)
!1471 = !DILocation(line: 743, column: 13, scope: !1472)
!1472 = distinct !DILexicalBlock(scope: !891, file: !3, line: 743, column: 13)
!1473 = !DILocation(line: 744, column: 17, scope: !1474)
!1474 = distinct !DILexicalBlock(scope: !1475, file: !3, line: 744, column: 17)
!1475 = distinct !DILexicalBlock(scope: !1472, file: !3, line: 743, column: 55)
!1476 = !DILocation(line: 743, column: 13, scope: !891)
!1477 = !DILocation(line: 745, column: 49, scope: !1478)
!1478 = distinct !DILexicalBlock(scope: !1474, file: !3, line: 744, column: 38)
!1479 = !DILocation(line: 745, column: 54, scope: !1478)
!1480 = !DILocation(line: 745, column: 17, scope: !1478)
!1481 = !DILocation(line: 746, column: 13, scope: !1478)
!1482 = !DILocation(line: 767, column: 9, scope: !1483)
!1483 = distinct !DILexicalBlock(scope: !891, file: !3, line: 767, column: 9)
!1484 = !DILocation(line: 767, column: 9, scope: !891)
!1485 = !DILocation(line: 767, column: 9, scope: !1486)
!1486 = !DILexicalBlockFile(scope: !1483, file: !3, discriminator: 1)
!1487 = !DILocation(line: 768, column: 21, scope: !891)
!1488 = !DILocation(line: 768, column: 12, scope: !891)
!1489 = !DILocation(line: 769, column: 21, scope: !891)
!1490 = !DILocation(line: 376, column: 8, scope: !875)
!1491 = !DILocation(line: 770, column: 17, scope: !891)
!1492 = !DILocation(line: 771, column: 18, scope: !891)
!1493 = !DILocation(line: 774, column: 13, scope: !1494)
!1494 = distinct !DILexicalBlock(scope: !891, file: !3, line: 774, column: 13)
!1495 = !DILocation(line: 774, column: 22, scope: !1494)
!1496 = !DILocation(line: 774, column: 20, scope: !1494)
!1497 = !DILocation(line: 774, column: 13, scope: !891)
!1498 = !DILocation(line: 775, column: 13, scope: !1499)
!1499 = distinct !DILexicalBlock(scope: !1500, file: !3, line: 775, column: 13)
!1500 = distinct !DILexicalBlock(scope: !1494, file: !3, line: 774, column: 45)
!1501 = !DILocation(line: 775, column: 13, scope: !1500)
!1502 = !DILocation(line: 775, column: 13, scope: !1503)
!1503 = !DILexicalBlockFile(scope: !1499, file: !3, discriminator: 1)
!1504 = !DILocation(line: 776, column: 46, scope: !1505)
!1505 = distinct !DILexicalBlock(scope: !1500, file: !3, line: 776, column: 17)
!1506 = !DILocation(line: 777, column: 17, scope: !1507)
!1507 = distinct !DILexicalBlock(scope: !1505, file: !3, line: 776, column: 80)
!1508 = !DILocation(line: 778, column: 13, scope: !1507)
!1509 = !DILocation(line: 779, column: 18, scope: !1510)
!1510 = distinct !DILexicalBlock(scope: !1500, file: !3, line: 779, column: 17)
!1511 = !DILocation(line: 779, column: 17, scope: !1500)
!1512 = !DILocation(line: 781, column: 17, scope: !1513)
!1513 = distinct !DILexicalBlock(scope: !1514, file: !3, line: 781, column: 17)
!1514 = distinct !DILexicalBlock(scope: !1510, file: !3, line: 779, column: 29)
!1515 = !DILocation(line: 781, column: 17, scope: !1514)
!1516 = !DILocation(line: 781, column: 17, scope: !1517)
!1517 = !DILexicalBlockFile(scope: !1513, file: !3, discriminator: 1)
!1518 = !DILocation(line: 784, column: 17, scope: !1514)
!1519 = !DILocation(line: 785, column: 13, scope: !1514)
!1520 = !DILocation(line: 787, column: 17, scope: !1521)
!1521 = distinct !DILexicalBlock(scope: !1522, file: !3, line: 787, column: 17)
!1522 = distinct !DILexicalBlock(scope: !1494, file: !3, line: 786, column: 16)
!1523 = !DILocation(line: 787, column: 17, scope: !1522)
!1524 = !DILocation(line: 792, column: 17, scope: !1525)
!1525 = distinct !DILexicalBlock(scope: !1522, file: !3, line: 792, column: 17)
!1526 = !DILocation(line: 792, column: 17, scope: !1522)
!1527 = !DILocation(line: 793, column: 17, scope: !1528)
!1528 = distinct !DILexicalBlock(scope: !1529, file: !3, line: 793, column: 17)
!1529 = distinct !DILexicalBlock(scope: !1525, file: !3, line: 792, column: 58)
!1530 = !DILocation(line: 793, column: 17, scope: !1529)
!1531 = !DILocation(line: 793, column: 17, scope: !1532)
!1532 = !DILexicalBlockFile(scope: !1528, file: !3, discriminator: 1)
!1533 = !DILocation(line: 795, column: 34, scope: !1534)
!1534 = distinct !DILexicalBlock(scope: !1529, file: !3, line: 795, column: 21)
!1535 = !{!1536, !840, i64 536}
!1536 = !{!"__le_hci_stack", !721, i64 0, !721, i64 4, !661, i64 8, !661, i64 533, !840, i64 534, !840, i64 536, !661, i64 538, !840, i64 540, !1537, i64 542}
!1537 = !{!"le_connection_parameter_range", !840, i64 0, !840, i64 2, !840, i64 4, !840, i64 6, !840, i64 8, !840, i64 10}
!1538 = !DILocation(line: 795, column: 63, scope: !1534)
!1539 = !DILocation(line: 795, column: 21, scope: !1529)
!1540 = !DILocation(line: 797, column: 56, scope: !1541)
!1541 = distinct !DILexicalBlock(scope: !1534, file: !3, line: 795, column: 68)
!1542 = !DILocation(line: 799, column: 17, scope: !1541)
!1543 = !DILocation(line: 801, column: 43, scope: !1529)
!1544 = !DILocation(line: 801, column: 53, scope: !1529)
!1545 = !DILocation(line: 801, column: 17, scope: !1529)
!1546 = !DILocalVariable(name: "handle", arg: 1, scope: !1547, file: !3, line: 269, type: !527)
!1547 = distinct !DISubprogram(name: "le_hci_shutdown_connection", scope: !3, file: !3, line: 269, type: !1548, isLocal: true, isDefinition: true, scopeLine: 270, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1550)
!1548 = !DISubroutineType(types: !1549)
!1549 = !{null, !527}
!1550 = !{!1546, !1551, !1553}
!1551 = !DILocalVariable(name: "it", scope: !1547, file: !3, line: 271, type: !1552)
!1552 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_list_iterator_t", file: !408, line: 102, baseType: !817)
!1553 = !DILocalVariable(name: "item", scope: !1554, file: !3, line: 274, type: !402)
!1554 = distinct !DILexicalBlock(scope: !1547, file: !3, line: 273, column: 48)
!1555 = !DILocation(line: 269, column: 44, scope: !1547, inlinedAt: !1556)
!1556 = distinct !DILocation(line: 802, column: 17, scope: !1529)
!1557 = !DILocation(line: 271, column: 5, scope: !1547, inlinedAt: !1556)
!1558 = !DILocation(line: 271, column: 28, scope: !1547, inlinedAt: !1556)
!1559 = !DILocation(line: 272, column: 5, scope: !1547, inlinedAt: !1556)
!1560 = !DILocation(line: 273, column: 12, scope: !1561, inlinedAt: !1556)
!1561 = !DILexicalBlockFile(scope: !1547, file: !3, discriminator: 1)
!1562 = !DILocation(line: 273, column: 5, scope: !1561, inlinedAt: !1556)
!1563 = !DILocation(line: 274, column: 61, scope: !1554, inlinedAt: !1556)
!1564 = !DILocation(line: 274, column: 37, scope: !1554, inlinedAt: !1556)
!1565 = !DILocation(line: 274, column: 30, scope: !1554, inlinedAt: !1556)
!1566 = !DILocation(line: 275, column: 19, scope: !1567, inlinedAt: !1556)
!1567 = distinct !DILexicalBlock(scope: !1554, file: !3, line: 275, column: 13)
!1568 = !{!838, !840, i64 10}
!1569 = !DILocation(line: 275, column: 30, scope: !1567, inlinedAt: !1556)
!1570 = !DILocation(line: 275, column: 13, scope: !1554, inlinedAt: !1556)
!1571 = !DILocation(line: 276, column: 13, scope: !1572, inlinedAt: !1556)
!1572 = distinct !DILexicalBlock(scope: !1567, file: !3, line: 275, column: 41)
!1573 = !DILocation(line: 277, column: 51, scope: !1572, inlinedAt: !1556)
!1574 = !DILocation(line: 277, column: 13, scope: !1572, inlinedAt: !1556)
!1575 = !DILocation(line: 278, column: 9, scope: !1572, inlinedAt: !1556)
!1576 = distinct !{!1576, !1577, !1578}
!1577 = !DILocation(line: 273, column: 5, scope: !1547)
!1578 = !DILocation(line: 279, column: 5, scope: !1547)
!1579 = !DILocation(line: 280, column: 1, scope: !1547, inlinedAt: !1556)
!1580 = !DILocation(line: 803, column: 17, scope: !1529)
!1581 = !DILocation(line: 820, column: 13, scope: !938)
!1582 = !DILocation(line: 820, column: 13, scope: !891)
!1583 = !DILocation(line: 821, column: 21, scope: !937)
!1584 = !DILocation(line: 821, column: 13, scope: !937)
!1585 = !DILocation(line: 828, column: 56, scope: !936)
!1586 = !DILocation(line: 828, column: 66, scope: !936)
!1587 = !DILocation(line: 325, column: 53, scope: !916, inlinedAt: !935)
!1588 = !DILocation(line: 325, column: 70, scope: !916, inlinedAt: !935)
!1589 = !DILocation(line: 328, column: 9, scope: !916, inlinedAt: !935)
!1590 = !DILocation(line: 329, column: 23, scope: !916, inlinedAt: !935)
!1591 = !DILocation(line: 329, column: 9, scope: !916, inlinedAt: !935)
!1592 = !DILocation(line: 334, column: 5, scope: !916, inlinedAt: !935)
!1593 = !DILocation(line: 332, column: 9, scope: !916, inlinedAt: !935)
!1594 = !DILocation(line: 335, column: 19, scope: !1595, inlinedAt: !935)
!1595 = !DILexicalBlockFile(scope: !927, file: !3, discriminator: 1)
!1596 = !DILocation(line: 335, column: 45, scope: !1597, inlinedAt: !935)
!1597 = !DILexicalBlockFile(scope: !927, file: !3, discriminator: 2)
!1598 = !DILocation(line: 335, column: 43, scope: !1597, inlinedAt: !935)
!1599 = !DILocation(line: 335, column: 33, scope: !1595, inlinedAt: !935)
!1600 = !DILocation(line: 336, column: 57, scope: !926, inlinedAt: !935)
!1601 = !DILocation(line: 336, column: 43, scope: !926, inlinedAt: !935)
!1602 = !DILocation(line: 336, column: 31, scope: !926, inlinedAt: !935)
!1603 = !DILocation(line: 337, column: 35, scope: !926, inlinedAt: !935)
