; ModuleID = 'hfp_profile.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/hfp_profile.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.hfp_stack_t = type { i8, %struct.__HFP_PARSE_STA, [248 x i8], [24 x i8], [1 x %struct.hfp_con] }
%struct.__HFP_PARSE_STA = type <{ i8, i16 }>
%struct.hfp_con = type { %struct.hfp_con_core_data_t, %struct.btstack_linked_item* }
%struct.hfp_con_core_data_t = type { [6 x i8], i16, i32, i16, i8, i8, [3 x i8], i8, [3 x i8], [8 x %struct.__INDICATOR], [8 x %struct.__INDICATOR] }
%struct.__INDICATOR = type <{ i8*, i8, i8, i8 }>
%struct.btstack_linked_item = type { %struct.btstack_linked_item* }
%struct.bt_sleep = type { i32 (...)*, i32 (...)*, i32 (...)* }
%struct.user_interface_handler = type { void (i8*, i32, i32)*, void (i8, i8*, i8*)*, void (i8*, i32)*, i32 ()*, void (i8, i16, i8*, i16)*, void (i8*, i32, i32, i8)*, i32 ()*, void (i32)*, void (i8, i32, i8*, i16)*, i32 (i8*, i8, i8)*, void ()*, void (i8)*, i8 (i8*, i8, i8*, i32, i8)*, void (i8, i16, i8*, i16)*, i32 ()* }
%struct.hci_cmd_t = type { i16, i8* }
%struct.info = type { i8, i8 }
%struct._stack_config = type <{ i32, i16, i16, i16, i16, i16, i8, i8, i8, i32, i8, i8, i8, i8, [6 x i8], i8 }>
%struct.resend_t = type { %struct.btstack_linked_item, i16, [0 x i8] }
%struct.hfp_ioctrl_str = type { [6 x i8], i32, i8, %union.anon }

!157 = !DIEnumerator(name: "BT_STATUS_PHONE_OUT", value: 14)
!158 = !DIEnumerator(name: "BT_STATUS_PHONE_ACTIVE", value: 15)
!159 = !DIEnumerator(name: "BT_STATUS_PHONE_HANGUP", value: 16)
!160 = !DIEnumerator(name: "BT_STATUS_BEGIN_AUTO_CON", value: 17)
!161 = !DIEnumerator(name: "BT_STATUS_MUSIC_SOUND_COME", value: 18)
!162 = !DIEnumerator(name: "BT_STATUS_MUSIC_SOUND_GO", value: 19)
!163 = !DIEnumerator(name: "BT_STATUS_RESUME", value: 20)
!164 = !DIEnumerator(name: "BT_STATUS_RESUME_BTSTACK", value: 21)
!165 = !DIEnumerator(name: "BT_STATUS_SUSPEND", value: 22)
!166 = !DIEnumerator(name: "BT_STATUS_LAST_CALL_TYPE_CHANGE", value: 23)
!167 = !DIEnumerator(name: "BT_STATUS_CALL_VOL_CHANGE", value: 24)
!168 = !DIEnumerator(name: "BT_STATUS_SCO_STATUS_CHANGE", value: 25)
!169 = !DIEnumerator(name: "BT_STATUS_CONNECT_WITHOUT_LINKKEY", value: 26)
!170 = !DIEnumerator(name: "BT_STATUS_PHONE_BATTERY_CHANGE", value: 27)
!171 = !DIEnumerator(name: "BT_STATUS_RECONNECT_LINKKEY_LOST", value: 28)
!172 = !DIEnumerator(name: "BT_STATUS_RECONN_OR_CONN", value: 29)
!173 = !DIEnumerator(name: "BT_STATUS_BT_TEST_BOX_CMD", value: 30)
!174 = !DIEnumerator(name: "BT_STATUS_BT_TWS_CONNECT_CMD", value: 31)
!175 = !DIEnumerator(name: "BT_STATUS_SNIFF_STATE_UPDATE", value: 32)
!176 = !DIEnumerator(name: "BT_STATUS_TONE_BY_FILE_NAME", value: 33)
!177 = !DIEnumerator(name: "BT_STATUS_PHONE_DATE_AND_TIME", value: 34)
!178 = !DIEnumerator(name: "BT_STATUS_INBAND_RINGTONE", value: 35)
!179 = !DIEnumerator(name: "BT_STATUS_VOICE_RECOGNITION", value: 36)
!180 = !DIEnumerator(name: "BT_STATUS_AVRCP_INCOME_OPID", value: 37)
!181 = !DIEnumerator(name: "BT_STATUS_HFP_SERVICE_LEVEL_CONNECTION_OK", value: 38)
!182 = !DIEnumerator(name: "BT_STATUS_CONN_A2DP_CH", value: 39)
!183 = !DIEnumerator(name: "BT_STATUS_CONN_HFP_CH", value: 40)
!184 = !DIEnumerator(name: "BT_STATUS_INQUIRY_TIMEOUT", value: 41)
!185 = !DIEnumerator(name: "BT_STATUS_INITING", value: 42)
!186 = !DIEnumerator(name: "BT_STATUS_WAITINT_CONN", value: 43)
!187 = !DIEnumerator(name: "BT_STATUS_AUTO_CONNECTINT", value: 44)
!188 = !DIEnumerator(name: "BT_STATUS_CONNECTING", value: 45)
!189 = !DIEnumerator(name: "BT_STATUS_TAKEING_PHONE", value: 46)
!190 = !DIEnumerator(name: "BT_STATUS_PLAYING_MUSIC", value: 47)
!191 = !DIEnumerator(name: "BT_STATUS_A2DP_MEDIA_START", value: 48)
!192 = !DIEnumerator(name: "BT_STATUS_A2DP_MEDIA_STOP", value: 49)
!193 = !DIEnumerator(name: "BT_STATUS_BROADCAST_STATE", value: 50)
!194 = !DIEnumerator(name: "BT_STATUS_TRIM_OVER", value: 51)
!195 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !142, line: 631, size: 32, elements: !196)
!196 = !{!197, !198, !199, !200}
!197 = !DIEnumerator(name: "REMOTE_DEV_UNKNOWN", value: 0)
!198 = !DIEnumerator(name: "REMOTE_DEV_ANDROID", value: 1)
!199 = !DIEnumerator(name: "REMOTE_DEV_IOS", value: 2)
!200 = !DIEnumerator(name: "REMOTE_DEV_XIAOMI", value: 3)
!201 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !23, line: 172, size: 32, elements: !202)
!202 = !{!203, !204, !205, !206, !207, !208, !209, !210}
!203 = !DIEnumerator(name: "HFP_IND_SERVICE", value: 0)
!204 = !DIEnumerator(name: "HFP_IND_CALL", value: 1)
!205 = !DIEnumerator(name: "HFP_IND_CALLSETUP", value: 2)
!206 = !DIEnumerator(name: "HFP_IND_CALL_SETUP", value: 3)
!207 = !DIEnumerator(name: "HFP_IND_CALLHELD", value: 4)
!208 = !DIEnumerator(name: "HFP_IND_SIGNAL", value: 5)
!209 = !DIEnumerator(name: "HFP_IND_ROAM", value: 6)
!210 = !DIEnumerator(name: "HFP_IND_BATTCHG", value: 7)
!211 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !23, line: 187, size: 32, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIEnumerator(name: "HFP_HF_INDICATORS_ENHANCED_SAFETY", value: 1)
!214 = !DIEnumerator(name: "HFP_HF_INDICATORS_BATTERY_LEVEL", value: 2)
!215 = !DIEnumerator(name: "HFP_HF_INDICATORS_MAX", value: 3)
!216 = !{!217, !220, !221, !226, !234, !248, !249}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !219)
!219 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !222, line: 26, baseType: !223)
!222 = !DIFile(filename: "/opt/q32s/include/sys/_stdint.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !224, line: 43, baseType: !225)
!224 = !DIFile(filename: "/opt/q32s/include/machine/_default_types.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!225 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_item_t", file: !228, line: 100, baseType: !229)
!228 = !DIFile(filename: "../btcommon/btstack_linked_list.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_linked_item_t", file: !228, line: 55, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btstack_linked_item", file: !228, line: 53, size: 32, elements: !231)
!231 = !{!232}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !230, file: !228, line: 54, baseType: !233, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "resend_t", file: !100, line: 74, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 70, size: 64, elements: !237)
!237 = !{!238, !239, !242}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !236, file: !100, line: 71, baseType: !227, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !236, file: !100, line: 72, baseType: !240, size: 16, offset: 32)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !241, line: 13, baseType: !225)
!241 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!242 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !236, file: !100, line: 73, baseType: !243, offset: 48)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, elements: !246)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !241, line: 11, baseType: !245)
!245 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!246 = !{!247}
!247 = !DISubrange(count: 0)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !241, line: 15, baseType: !250)
!250 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!251 = !{!0, !252, !254, !256, !269, !344, !363, !372, !378, !383, !389}
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "hfp_more_feature_hf_indicators", scope: !2, file: !3, line: 19, type: !244, isLocal: false, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "enhanced_voice_recognition_activation", scope: !2, file: !3, line: 20, type: !244, isLocal: false, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "bt_suspend_hfp_resumehfp_release", scope: !2, file: !3, line: 2040, type: !258, isLocal: false, isDefinition: true)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bt_sleep", file: !260, line: 313, size: 96, elements: !261)
!260 = !DIFile(filename: "../btstack/Host/include/common/bt_config.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!261 = !{!262, !267, !268}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "suspend", scope: !259, file: !260, line: 314, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 32)
!264 = !DISubroutineType(types: !265)
!265 = !{!266, null}
!266 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "resume", scope: !259, file: !260, line: 315, baseType: !263, size: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !259, file: !260, line: 316, baseType: !263, size: 32, offset: 64)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "hfp_stack", scope: !2, file: !3, line: 23, type: !271, isLocal: true, isDefinition: true)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "hfp_stack_t", file: !23, line: 303, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 294, size: 3328, elements: !274)
!274 = !{!275, !276, !277, !278, !285, !289, !293}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "hfp_init_number", scope: !273, file: !23, line: 295, baseType: !244, size: 5, flags: DIFlagBitField, extraData: i64 0)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "hfp_background", scope: !273, file: !23, line: 296, baseType: !244, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "reserve1", scope: !273, file: !23, line: 297, baseType: !244, size: 2, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "hfp_parse_sta", scope: !273, file: !23, line: 298, baseType: !279, size: 24, offset: 8)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "HFP_PARSE_STA", file: !23, line: 248, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__HFP_PARSE_STA", file: !23, line: 240, size: 24, elements: !281)
!281 = !{!282, !283, !284}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "parse_atcmd_type", scope: !280, file: !23, line: 242, baseType: !244, size: 7, flags: DIFlagBitField, extraData: i64 0)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "atcmd_cr_type", scope: !280, file: !23, line: 244, baseType: !244, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "received_data_len", scope: !280, file: !23, line: 246, baseType: !240, size: 16, offset: 8)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "parse_atcmd_buf", scope: !273, file: !23, line: 299, baseType: !286, size: 1984, offset: 32)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 1984, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 248)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "phone_number", scope: !273, file: !23, line: 301, baseType: !290, size: 192, offset: 2016)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 192, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 24)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !273, file: !23, line: 302, baseType: !294, size: 1120, offset: 2208)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 1120, elements: !342)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "hfp_con_t", file: !23, line: 292, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hfp_con", file: !23, line: 283, size: 1120, elements: !297)
!297 = !{!298, !339}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "hfp_core_data", scope: !296, file: !23, line: 284, baseType: !299, size: 1088)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "hfp_con_core_data_t", file: !23, line: 281, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 257, size: 1088, elements: !301)
!301 = !{!302, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !327, !338}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !300, file: !23, line: 259, baseType: !303, size: 48)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_addr_t", file: !304, line: 7, baseType: !305)
!304 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !306, size: 48, elements: !308)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !222, line: 20, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !224, line: 29, baseType: !245)
!308 = !{!309}
!309 = !DISubrange(count: 6)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_channel_id", scope: !300, file: !23, line: 260, baseType: !240, size: 16, offset: 48)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "support_featurn_ag", scope: !300, file: !23, line: 262, baseType: !249, size: 32, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !300, file: !23, line: 264, baseType: !240, size: 16, offset: 96)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "hfp_init_battery_value", scope: !300, file: !23, line: 265, baseType: !244, size: 8, offset: 112)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "send_key_flag", scope: !300, file: !23, line: 266, baseType: !244, size: 8, offset: 120)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "hfp_speak_gain", scope: !300, file: !23, line: 268, baseType: !244, size: 4, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "hfp_mic_gain", scope: !300, file: !23, line: 269, baseType: !244, size: 4, offset: 132, flags: DIFlagBitField, extraData: i64 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "phone_call_status", scope: !300, file: !23, line: 270, baseType: !244, size: 4, offset: 136, flags: DIFlagBitField, extraData: i64 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "second_call_status", scope: !300, file: !23, line: 271, baseType: !244, size: 4, offset: 140, flags: DIFlagBitField, extraData: i64 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "hfp_init_step", scope: !300, file: !23, line: 273, baseType: !244, size: 5, offset: 144, flags: DIFlagBitField, extraData: i64 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "inused", scope: !300, file: !23, line: 274, baseType: !244, size: 1, offset: 149, flags: DIFlagBitField, extraData: i64 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "hfp_cmd_send_failed", scope: !300, file: !23, line: 275, baseType: !244, size: 1, offset: 150, flags: DIFlagBitField, extraData: i64 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ios_siri_status", scope: !300, file: !23, line: 276, baseType: !244, size: 3, offset: 152, flags: DIFlagBitField, extraData: i64 152)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "hf_indications", scope: !300, file: !23, line: 278, baseType: !324, size: 24, offset: 160)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 24, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 3)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "indicators", scope: !300, file: !23, line: 279, baseType: !328, size: 448, offset: 184)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 448, elements: !336)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "INDICATOR", file: !23, line: 255, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__INDICATOR", file: !23, line: 250, size: 56, elements: !331)
!331 = !{!332, !333, !334, !335}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !330, file: !23, line: 251, baseType: !248, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "desc_index", scope: !330, file: !23, line: 252, baseType: !244, size: 8, offset: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "strlen", scope: !330, file: !23, line: 253, baseType: !244, size: 8, offset: 40)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !330, file: !23, line: 254, baseType: !244, size: 8, offset: 48)
!336 = !{!337}
!337 = !DISubrange(count: 8)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "prev_inds", scope: !300, file: !23, line: 280, baseType: !328, size: 448, offset: 632)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "fail_item", scope: !296, file: !23, line: 287, baseType: !340, size: 32, offset: 1088)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_list_t", file: !228, line: 101, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!342 = !{!343}
!343 = !DISubrange(count: 1)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "cmds", scope: !346, file: !3, line: 788, type: !217, isLocal: true, isDefinition: true)
!346 = distinct !DISubprogram(name: "parse_atcmd_cmd_or_rsp_type", scope: !3, file: !3, line: 712, type: !347, isLocal: true, isDefinition: true, scopeLine: 713, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !350)
!347 = !DISubroutineType(types: !348)
!348 = !{!349, !240, !217, !240}
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !241, line: 11, baseType: !245)
!350 = !{!351, !352, !353, !354, !356, !357, !358, !360}
!351 = !DILocalVariable(name: "channel", arg: 1, scope: !346, file: !3, line: 712, type: !240)
!352 = !DILocalVariable(name: "packet", arg: 2, scope: !346, file: !3, line: 712, type: !217)
!353 = !DILocalVariable(name: "size", arg: 3, scope: !346, file: !3, line: 712, type: !240)
!354 = !DILocalVariable(name: "conn", scope: !346, file: !3, line: 714, type: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!356 = !DILocalVariable(name: "cmd_ptr", scope: !346, file: !3, line: 808, type: !217)
!357 = !DILocalVariable(name: "atcmd_ty", scope: !346, file: !3, line: 809, type: !249)
!358 = !DILocalVariable(name: "i", scope: !359, file: !3, line: 810, type: !249)
!359 = distinct !DILexicalBlock(scope: !346, file: !3, line: 810, column: 5)
!360 = !DILocalVariable(name: "size", scope: !361, file: !3, line: 811, type: !249)
!361 = distinct !DILexicalBlock(scope: !362, file: !3, line: 810, column: 64)
!362 = distinct !DILexicalBlock(scope: !359, file: !3, line: 810, column: 5)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "infos", scope: !346, file: !3, line: 800, type: !365, isLocal: true, isDefinition: true)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 304, elements: !370)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "info", scope: !346, file: !3, line: 794, size: 16, elements: !367)
!367 = !{!368, !369}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !366, file: !3, line: 795, baseType: !244, size: 8)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !366, file: !3, line: 796, baseType: !244, size: 8, offset: 8)
!370 = !{!371}
!371 = !DISubrange(count: 19)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "hfp_ind_str_buf", scope: !2, file: !3, line: 31, type: !374, isLocal: true, isDefinition: true)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 960, elements: !376)
!375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!376 = !{!337, !377}
!377 = !DISubrange(count: 15)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "hfp_function_cmd", scope: !2, file: !3, line: 193, type: !380, isLocal: true, isDefinition: true)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 3344, elements: !381)
!381 = !{!371, !382}
!382 = !DISubrange(count: 22)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "hfp_SLC_init_cmd", scope: !2, file: !3, line: 590, type: !385, isLocal: true, isDefinition: true)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 1296, elements: !386)
!386 = !{!387, !388}
!387 = !DISubrange(count: 9)
!388 = !DISubrange(count: 18)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "hfp_param_set_buf", scope: !2, file: !3, line: 601, type: !391, isLocal: true, isDefinition: true)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 2016, elements: !392)
!392 = !{!387, !393}
!393 = !DISubrange(count: 28)
!394 = !DIFile(filename: "../btcommon/profile_stack_debug.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!395 = !{i32 2, !"Dwarf Version", i32 4}
!396 = !{i32 2, !"Debug Info Version", i32 3}
!397 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!398 = distinct !DISubprogram(name: "hfp_check_conn_for_rfcomm_id", scope: !3, file: !3, line: 82, type: !399, isLocal: false, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !401)
!399 = !DISubroutineType(types: !400)
!400 = !{!244, !240}
!401 = !{!402, !403}
!402 = !DILocalVariable(name: "rfcomm_id", arg: 1, scope: !398, file: !3, line: 82, type: !240)
!403 = !DILocalVariable(name: "conn", scope: !398, file: !3, line: 84, type: !355)
!404 = !DILocation(line: 82, column: 37, scope: !398)
!405 = !DILocation(line: 84, column: 16, scope: !398)
!406 = !DILocation(line: 85, column: 5, scope: !407)
!407 = distinct !DILexicalBlock(scope: !398, file: !3, line: 85, column: 5)
!408 = !DILocation(line: 85, column: 5, scope: !409)
!409 = !DILexicalBlockFile(scope: !407, file: !3, discriminator: 1)
!410 = !DILocation(line: 86, column: 33, scope: !411)
!411 = distinct !DILexicalBlock(scope: !412, file: !3, line: 86, column: 13)
!412 = distinct !DILexicalBlock(scope: !413, file: !3, line: 85, column: 34)
!413 = distinct !DILexicalBlock(scope: !407, file: !3, line: 85, column: 5)
!414 = !{!415, !419, i64 6}
!415 = !{!"hfp_con", !416, i64 0, !421, i64 136}
!416 = !{!"", !417, i64 0, !419, i64 6, !420, i64 8, !419, i64 12, !417, i64 14, !417, i64 15, !417, i64 16, !417, i64 16, !417, i64 17, !417, i64 17, !417, i64 18, !417, i64 18, !417, i64 18, !417, i64 19, !417, i64 20, !417, i64 23, !417, i64 79}
!417 = !{!"omnipotent char", !418, i64 0}
!418 = !{!"Simple C/C++ TBAA"}
!419 = !{!"short", !417, i64 0}
!420 = !{!"int", !417, i64 0}
!421 = !{!"any pointer", !417, i64 0}
!422 = !DILocation(line: 86, column: 51, scope: !411)
!423 = !DILocation(line: 86, column: 64, scope: !411)
!424 = !DILocation(line: 86, column: 87, scope: !425)
!425 = !DILexicalBlockFile(scope: !411, file: !3, discriminator: 1)
!426 = !DILocation(line: 86, column: 67, scope: !425)
!427 = !DILocation(line: 86, column: 13, scope: !428)
!428 = !DILexicalBlockFile(scope: !412, file: !3, discriminator: 1)
!429 = !DILocation(line: 85, column: 5, scope: !430)
!430 = !DILexicalBlockFile(scope: !413, file: !3, discriminator: 2)
!431 = !DILocation(line: 85, column: 5, scope: !432)
!432 = !DILexicalBlockFile(scope: !413, file: !3, discriminator: 1)
!433 = distinct !{!433, !406, !434}
!434 = !DILocation(line: 89, column: 5, scope: !407)
!435 = !DILocation(line: 91, column: 1, scope: !398)
!436 = distinct !DISubprogram(name: "siri_update_multi_bd_status", scope: !3, file: !3, line: 115, type: !437, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !439)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !244, !248}
!439 = !{!440, !441}
!440 = !DILocalVariable(name: "siri_status", arg: 1, scope: !436, file: !3, line: 115, type: !244)
!441 = !DILocalVariable(name: "addr", arg: 2, scope: !436, file: !3, line: 115, type: !248)
!442 = !DILocation(line: 115, column: 37, scope: !436)
!443 = !DILocation(line: 115, column: 54, scope: !436)
!444 = !DILocation(line: 117, column: 9, scope: !445)
!445 = distinct !DILexicalBlock(scope: !436, file: !3, line: 117, column: 9)
!446 = !DILocation(line: 117, column: 9, scope: !436)
!447 = !DILocation(line: 118, column: 9, scope: !448)
!448 = distinct !DILexicalBlock(scope: !445, file: !3, line: 117, column: 22)
!449 = !DILocation(line: 119, column: 5, scope: !448)
!450 = !DILocation(line: 120, column: 9, scope: !451)
!451 = distinct !DILexicalBlock(scope: !445, file: !3, line: 119, column: 12)
!452 = !DILocation(line: 122, column: 1, scope: !436)
!453 = distinct !DISubprogram(name: "phone_date_and_time_feedback", scope: !3, file: !3, line: 1436, type: !454, isLocal: false, isDefinition: true, scopeLine: 1437, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !456)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !248, !240}
!456 = !{!457, !458}
!457 = !DILocalVariable(name: "data", arg: 1, scope: !453, file: !3, line: 1436, type: !248)
!458 = !DILocalVariable(name: "len", arg: 2, scope: !453, file: !3, line: 1436, type: !240)
!459 = !DILocation(line: 1436, column: 61, scope: !453)
!460 = !DILocation(line: 1436, column: 71, scope: !453)
!461 = !DILocation(line: 1438, column: 19, scope: !453)
!462 = !DILocation(line: 1438, column: 5, scope: !453)
!463 = !DILocation(line: 1439, column: 5, scope: !453)
!464 = !DILocation(line: 1440, column: 1, scope: !453)
!465 = distinct !DISubprogram(name: "at_cmd_analysis_by_user", scope: !3, file: !3, line: 1639, type: !466, isLocal: false, isDefinition: true, scopeLine: 1640, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !468)
!466 = !DISubroutineType(types: !467)
!467 = !{!266, !248, !240}
!468 = !{!469, !470}
!469 = !DILocalVariable(name: "packet", arg: 1, scope: !465, file: !3, line: 1639, type: !248)
!470 = !DILocalVariable(name: "size", arg: 2, scope: !465, file: !3, line: 1639, type: !240)
!471 = !DILocation(line: 1639, column: 33, scope: !465)
!472 = !DILocation(line: 1639, column: 45, scope: !465)
!473 = !DILocation(line: 1642, column: 5, scope: !465)
!474 = distinct !DISubprogram(name: "hfp_profile_init", scope: !3, file: !3, line: 2043, type: !475, isLocal: false, isDefinition: true, scopeLine: 2044, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !477)
!475 = !DISubroutineType(types: !476)
!476 = !{null, !271, !244}
!477 = !{!478, !479}
!478 = !DILocalVariable(name: "stack", arg: 1, scope: !474, file: !3, line: 2043, type: !271)
!479 = !DILocalVariable(name: "display_battery", arg: 2, scope: !474, file: !3, line: 2043, type: !244)
!480 = !DILocation(line: 2043, column: 36, scope: !474)
!481 = !DILocation(line: 2043, column: 46, scope: !474)
!482 = !DILocation(line: 2045, column: 15, scope: !474)
!483 = !{!421, !421, i64 0}
!484 = !DILocation(line: 2047, column: 5, scope: !474)
!485 = !DILocation(line: 2048, column: 5, scope: !474)
!486 = !DILocation(line: 2050, column: 9, scope: !487)
!487 = distinct !DILexicalBlock(scope: !474, file: !3, line: 2050, column: 9)
!488 = !DILocation(line: 2050, column: 9, scope: !474)
!489 = !DILocation(line: 2058, column: 30, scope: !474)
!490 = !DILocation(line: 2058, column: 48, scope: !474)
!491 = !{!492, !419, i64 2}
!492 = !{!"", !417, i64 0, !417, i64 0, !417, i64 0, !493, i64 1, !417, i64 4, !417, i64 252, !417, i64 276}
!493 = !{!"__HFP_PARSE_STA", !417, i64 0, !417, i64 0, !419, i64 1}
!494 = !DILocation(line: 2061, column: 30, scope: !474)
!495 = !DILocation(line: 2061, column: 47, scope: !474)
!496 = !DILocation(line: 2062, column: 1, scope: !474)
!497 = distinct !DISubprogram(name: "hfp_packet_handler", scope: !3, file: !3, line: 1938, type: !498, isLocal: true, isDefinition: true, scopeLine: 1939, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !500)
!498 = !DISubroutineType(types: !499)
!499 = !{null, !244, !240, !248, !240}
!500 = !{!501, !502, !503, !504, !505}
!501 = !DILocalVariable(name: "packet_type", arg: 1, scope: !497, file: !3, line: 1938, type: !244)
!502 = !DILocalVariable(name: "channel", arg: 2, scope: !497, file: !3, line: 1938, type: !240)
!503 = !DILocalVariable(name: "packet", arg: 3, scope: !497, file: !3, line: 1938, type: !248)
!504 = !DILocalVariable(name: "size", arg: 4, scope: !497, file: !3, line: 1938, type: !240)
!505 = !DILocalVariable(name: "conn", scope: !497, file: !3, line: 1942, type: !355)
!506 = !DILocalVariable(name: "addr", scope: !507, file: !3, line: 1847, type: !303)
!507 = distinct !DISubprogram(name: "hfp_incoming_connection", scope: !3, file: !3, line: 1845, type: !508, isLocal: true, isDefinition: true, scopeLine: 1846, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !510)
!508 = !DISubroutineType(types: !509)
!509 = !{null, !240, !248, !240}
!510 = !{!511, !512, !513, !506, !514}
!511 = !DILocalVariable(name: "channel", arg: 1, scope: !507, file: !3, line: 1845, type: !240)
!512 = !DILocalVariable(name: "packet", arg: 2, scope: !507, file: !3, line: 1845, type: !248)
!513 = !DILocalVariable(name: "size", arg: 3, scope: !507, file: !3, line: 1845, type: !240)
!514 = !DILocalVariable(name: "conn", scope: !507, file: !3, line: 1848, type: !355)
!515 = !DILocation(line: 1847, column: 15, scope: !507, inlinedAt: !516)
!516 = distinct !DILocation(line: 1949, column: 13, scope: !517)
!517 = distinct !DILexicalBlock(scope: !518, file: !3, line: 1945, column: 28)
!518 = distinct !DILexicalBlock(scope: !497, file: !3, line: 1943, column: 26)
!519 = !DILocation(line: 1938, column: 35, scope: !497)
!520 = !DILocation(line: 1938, column: 52, scope: !497)
!521 = !DILocation(line: 1938, column: 65, scope: !497)
!522 = !DILocation(line: 1938, column: 77, scope: !497)
!523 = !DILocation(line: 1943, column: 5, scope: !497)
!524 = !DILocation(line: 1945, column: 17, scope: !518)
!525 = !{!417, !417, i64 0}
!526 = !DILocation(line: 1945, column: 9, scope: !518)
!527 = !DILocation(line: 1845, column: 66, scope: !507, inlinedAt: !516)
!528 = !DILocation(line: 1847, column: 5, scope: !507, inlinedAt: !516)
!529 = !DILocation(line: 1850, column: 31, scope: !507, inlinedAt: !516)
!530 = !DILocation(line: 1850, column: 5, scope: !507, inlinedAt: !516)
!531 = !DILocation(line: 1852, column: 12, scope: !507, inlinedAt: !516)
!532 = !DILocation(line: 1848, column: 16, scope: !507, inlinedAt: !516)
!533 = !DILocation(line: 1853, column: 10, scope: !534, inlinedAt: !516)
!534 = distinct !DILexicalBlock(scope: !507, file: !3, line: 1853, column: 9)
!535 = !DILocation(line: 1853, column: 9, scope: !507, inlinedAt: !516)
!536 = !DILocation(line: 1854, column: 16, scope: !537, inlinedAt: !516)
!537 = distinct !DILexicalBlock(scope: !534, file: !3, line: 1853, column: 16)
!538 = !DILocation(line: 1856, column: 9, scope: !539, inlinedAt: !516)
!539 = distinct !DILexicalBlock(scope: !507, file: !3, line: 1856, column: 9)
!540 = !DILocation(line: 1856, column: 9, scope: !507, inlinedAt: !516)
!541 = !DILocation(line: 1857, column: 29, scope: !542, inlinedAt: !516)
!542 = distinct !DILexicalBlock(scope: !539, file: !3, line: 1856, column: 15)
!543 = !DILocation(line: 1857, column: 37, scope: !542, inlinedAt: !516)
!544 = !{!415, !419, i64 12}
!545 = !DILocation(line: 1858, column: 49, scope: !542, inlinedAt: !516)
!546 = !DILocation(line: 1858, column: 29, scope: !542, inlinedAt: !516)
!547 = !DILocation(line: 1858, column: 47, scope: !542, inlinedAt: !516)
!548 = !DILocation(line: 1859, column: 9, scope: !542, inlinedAt: !516)
!549 = !DILocation(line: 1860, column: 5, scope: !542, inlinedAt: !516)
!550 = !DILocation(line: 1861, column: 1, scope: !507, inlinedAt: !516)
!551 = !DILocation(line: 1950, column: 13, scope: !517)
!552 = !DILocation(line: 1954, column: 30, scope: !517)
!553 = !DILocation(line: 1954, column: 13, scope: !517)
!554 = !DILocation(line: 1955, column: 13, scope: !517)
!555 = !DILocalVariable(name: "channel", arg: 1, scope: !556, file: !3, line: 93, type: !240)
!556 = distinct !DISubprogram(name: "__hfp_conn_for_channel", scope: !3, file: !3, line: 93, type: !557, isLocal: true, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !559)
!557 = !DISubroutineType(types: !558)
!558 = !{!355, !240}
!559 = !{!555, !560}
!560 = !DILocalVariable(name: "conn", scope: !556, file: !3, line: 95, type: !355)
!561 = !DILocation(line: 93, column: 46, scope: !556, inlinedAt: !562)
!562 = distinct !DILocation(line: 1960, column: 20, scope: !517)
!563 = !DILocation(line: 96, column: 5, scope: !564, inlinedAt: !562)
!564 = distinct !DILexicalBlock(scope: !556, file: !3, line: 96, column: 5)
!565 = !DILocation(line: 96, column: 5, scope: !566, inlinedAt: !562)
!566 = !DILexicalBlockFile(scope: !564, file: !3, discriminator: 1)
!567 = !DILocation(line: 97, column: 33, scope: !568, inlinedAt: !562)
!568 = distinct !DILexicalBlock(scope: !569, file: !3, line: 97, column: 13)
!569 = distinct !DILexicalBlock(scope: !570, file: !3, line: 96, column: 34)
!570 = distinct !DILexicalBlock(scope: !564, file: !3, line: 96, column: 5)
!571 = !DILocation(line: 97, column: 41, scope: !568, inlinedAt: !562)
!572 = !DILocation(line: 97, column: 52, scope: !568, inlinedAt: !562)
!573 = !DILocation(line: 97, column: 75, scope: !574, inlinedAt: !562)
!574 = !DILexicalBlockFile(scope: !568, file: !3, discriminator: 1)
!575 = !DILocation(line: 97, column: 55, scope: !574, inlinedAt: !562)
!576 = !DILocation(line: 97, column: 13, scope: !577, inlinedAt: !562)
!577 = !DILexicalBlockFile(scope: !569, file: !3, discriminator: 1)
!578 = !DILocation(line: 96, column: 5, scope: !579, inlinedAt: !562)
!579 = !DILexicalBlockFile(scope: !570, file: !3, discriminator: 2)
!580 = !DILocation(line: 95, column: 16, scope: !556, inlinedAt: !562)
!581 = !DILocation(line: 96, column: 5, scope: !582, inlinedAt: !562)
!582 = !DILexicalBlockFile(scope: !570, file: !3, discriminator: 1)
!583 = distinct !{!583, !584, !585}
!584 = !DILocation(line: 96, column: 5, scope: !564)
!585 = !DILocation(line: 100, column: 5, scope: !564)
!586 = !DILocation(line: 1942, column: 16, scope: !497)
!587 = !DILocation(line: 1961, column: 13, scope: !517)
!588 = !DILocation(line: 1962, column: 13, scope: !517)
!589 = !DILocalVariable(name: "channel", arg: 1, scope: !590, file: !3, line: 1895, type: !240)
!590 = distinct !DISubprogram(name: "hfp_event_credits", scope: !3, file: !3, line: 1895, type: !591, isLocal: true, isDefinition: true, scopeLine: 1896, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !593)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !240}
!593 = !{!589, !594, !595, !596, !597}
!594 = !DILocalVariable(name: "err", scope: !590, file: !3, line: 1897, type: !266)
!595 = !DILocalVariable(name: "resend", scope: !590, file: !3, line: 1898, type: !234)
!596 = !DILocalVariable(name: "it", scope: !590, file: !3, line: 1899, type: !226)
!597 = !DILocalVariable(name: "conn", scope: !590, file: !3, line: 1900, type: !355)
!598 = !DILocation(line: 1895, column: 35, scope: !590, inlinedAt: !599)
!599 = distinct !DILocation(line: 1966, column: 13, scope: !517)
!600 = !DILocation(line: 1897, column: 9, scope: !590, inlinedAt: !599)
!601 = !DILocation(line: 1898, column: 15, scope: !590, inlinedAt: !599)
!602 = !DILocation(line: 93, column: 46, scope: !556, inlinedAt: !603)
!603 = distinct !DILocation(line: 1900, column: 23, scope: !590, inlinedAt: !599)
!604 = !DILocation(line: 96, column: 5, scope: !564, inlinedAt: !603)
!605 = !DILocation(line: 96, column: 5, scope: !566, inlinedAt: !603)
!606 = !DILocation(line: 97, column: 33, scope: !568, inlinedAt: !603)
!607 = !DILocation(line: 97, column: 41, scope: !568, inlinedAt: !603)
!608 = !DILocation(line: 97, column: 52, scope: !568, inlinedAt: !603)
!609 = !DILocation(line: 97, column: 75, scope: !574, inlinedAt: !603)
!610 = !DILocation(line: 97, column: 55, scope: !574, inlinedAt: !603)
!611 = !DILocation(line: 97, column: 13, scope: !577, inlinedAt: !603)
!612 = !DILocation(line: 96, column: 5, scope: !579, inlinedAt: !603)
!613 = !DILocation(line: 95, column: 16, scope: !556, inlinedAt: !603)
!614 = !DILocation(line: 96, column: 5, scope: !582, inlinedAt: !603)
!615 = !DILocation(line: 1900, column: 16, scope: !590, inlinedAt: !599)
!616 = !DILocation(line: 1903, column: 42, scope: !617, inlinedAt: !599)
!617 = distinct !DILexicalBlock(scope: !618, file: !3, line: 1903, column: 9)
!618 = distinct !DILexicalBlock(scope: !619, file: !3, line: 1901, column: 15)
!619 = distinct !DILexicalBlock(scope: !590, file: !3, line: 1901, column: 9)
!620 = !{!415, !421, i64 136}
!621 = !DILocation(line: 1899, column: 20, scope: !590, inlinedAt: !599)
!622 = !DILocation(line: 1903, column: 9, scope: !623, inlinedAt: !599)
!623 = !DILexicalBlockFile(scope: !617, file: !3, discriminator: 1)
!624 = !DILocation(line: 1904, column: 22, scope: !625, inlinedAt: !599)
!625 = distinct !DILexicalBlock(scope: !626, file: !3, line: 1903, column: 73)
!626 = distinct !DILexicalBlock(scope: !617, file: !3, line: 1903, column: 9)
!627 = !DILocation(line: 1906, column: 64, scope: !625, inlinedAt: !599)
!628 = !DILocation(line: 1906, column: 97, scope: !625, inlinedAt: !599)
!629 = !DILocation(line: 1906, column: 119, scope: !625, inlinedAt: !599)
!630 = !{!631, !419, i64 4}
!631 = !{!"", !632, i64 0, !419, i64 4, !417, i64 6}
!632 = !{!"btstack_linked_item", !421, i64 0}
!633 = !DILocalVariable(name: "rfcom_cid", arg: 1, scope: !634, file: !3, line: 135, type: !240)
!634 = distinct !DISubprogram(name: "atcmd_try_send_no_backup", scope: !3, file: !3, line: 135, type: !635, isLocal: true, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !637)
!635 = !DISubroutineType(types: !636)
!636 = !{!266, !240, !217, !240}
!637 = !{!633, !638, !639, !640}
!638 = !DILocalVariable(name: "buf", arg: 2, scope: !634, file: !3, line: 135, type: !217)
!639 = !DILocalVariable(name: "len", arg: 3, scope: !634, file: !3, line: 135, type: !240)
!640 = !DILocalVariable(name: "err", scope: !634, file: !3, line: 137, type: !266)
!641 = !DILocation(line: 135, column: 41, scope: !634, inlinedAt: !642)
!642 = distinct !DILocation(line: 1906, column: 19, scope: !625, inlinedAt: !599)
!643 = !DILocation(line: 135, column: 64, scope: !634, inlinedAt: !642)
!644 = !DILocation(line: 135, column: 73, scope: !634, inlinedAt: !642)
!645 = !DILocation(line: 137, column: 9, scope: !634, inlinedAt: !642)
!646 = !DILocation(line: 138, column: 11, scope: !634, inlinedAt: !642)
!647 = !DILocation(line: 1907, column: 21, scope: !648, inlinedAt: !599)
!648 = distinct !DILexicalBlock(scope: !625, file: !3, line: 1907, column: 17)
!649 = !DILocation(line: 1907, column: 17, scope: !625, inlinedAt: !599)
!650 = !DILocation(line: 1909, column: 17, scope: !651, inlinedAt: !599)
!651 = distinct !DILexicalBlock(scope: !648, file: !3, line: 1907, column: 27)
!652 = !DILocation(line: 1910, column: 22, scope: !651, inlinedAt: !599)
!653 = !DILocation(line: 1910, column: 17, scope: !651, inlinedAt: !599)
!654 = !DILocation(line: 1911, column: 13, scope: !651, inlinedAt: !599)
!655 = !DILocation(line: 1915, column: 33, scope: !656, inlinedAt: !599)
!656 = distinct !DILexicalBlock(scope: !618, file: !3, line: 1915, column: 13)
!657 = !DILocation(line: 1915, column: 13, scope: !656, inlinedAt: !599)
!658 = !DILocation(line: 1915, column: 51, scope: !656, inlinedAt: !599)
!659 = !DILocation(line: 1915, column: 75, scope: !660, inlinedAt: !599)
!660 = !DILexicalBlockFile(scope: !656, file: !3, discriminator: 1)
!661 = !DILocation(line: 1915, column: 89, scope: !660, inlinedAt: !599)
!662 = !DILocation(line: 1915, column: 118, scope: !663, inlinedAt: !599)
!663 = !DILexicalBlockFile(scope: !656, file: !3, discriminator: 2)
!664 = !DILocation(line: 1915, column: 138, scope: !663, inlinedAt: !599)
!665 = !DILocation(line: 1915, column: 94, scope: !660, inlinedAt: !599)
!666 = !DILocation(line: 1916, column: 13, scope: !667, inlinedAt: !599)
!667 = distinct !DILexicalBlock(scope: !656, file: !3, line: 1915, column: 145)
!668 = !DILocation(line: 1917, column: 9, scope: !667, inlinedAt: !599)
!669 = !DILocation(line: 1975, column: 13, scope: !517)
!670 = !DILocation(line: 1976, column: 13, scope: !517)
!671 = !DILocation(line: 93, column: 46, scope: !556, inlinedAt: !672)
!672 = distinct !DILocation(line: 1987, column: 16, scope: !518)
!673 = !DILocation(line: 96, column: 5, scope: !564, inlinedAt: !672)
!674 = !DILocation(line: 96, column: 5, scope: !566, inlinedAt: !672)
!675 = !DILocation(line: 97, column: 33, scope: !568, inlinedAt: !672)
!676 = !DILocation(line: 97, column: 41, scope: !568, inlinedAt: !672)
!677 = !DILocation(line: 97, column: 52, scope: !568, inlinedAt: !672)
!678 = !DILocation(line: 97, column: 75, scope: !574, inlinedAt: !672)
!679 = !DILocation(line: 97, column: 55, scope: !574, inlinedAt: !672)
!680 = !DILocation(line: 97, column: 13, scope: !577, inlinedAt: !672)
!681 = !DILocation(line: 96, column: 5, scope: !579, inlinedAt: !672)
!682 = !DILocation(line: 95, column: 16, scope: !556, inlinedAt: !672)
!683 = !DILocation(line: 96, column: 5, scope: !582, inlinedAt: !672)
!684 = !DILocation(line: 1990, column: 13, scope: !685)
!685 = distinct !DILexicalBlock(scope: !686, file: !3, line: 1990, column: 13)
!686 = distinct !DILexicalBlock(scope: !687, file: !3, line: 1989, column: 20)
!687 = distinct !DILexicalBlock(scope: !518, file: !3, line: 1989, column: 13)
!688 = !DILocation(line: 1990, column: 13, scope: !686)
!689 = !DILocation(line: 1990, column: 13, scope: !690)
!690 = !DILexicalBlockFile(scope: !685, file: !3, discriminator: 1)
!691 = !DILocation(line: 1991, column: 29, scope: !686)
!692 = !DILocation(line: 1991, column: 13, scope: !686)
!693 = !DILocation(line: 1993, column: 13, scope: !686)
!694 = !DILocation(line: 1995, column: 13, scope: !695)
!695 = distinct !DILexicalBlock(scope: !518, file: !3, line: 1995, column: 13)
!696 = !DILocation(line: 1995, column: 13, scope: !518)
!697 = !DILocation(line: 1996, column: 13, scope: !698)
!698 = distinct !DILexicalBlock(scope: !695, file: !3, line: 1995, column: 59)
!699 = !DILocation(line: 1997, column: 9, scope: !698)
!700 = !DILocation(line: 2005, column: 1, scope: !497)
!701 = distinct !DISubprogram(name: "hfp_send_cmd_io_ctrl", scope: !3, file: !3, line: 2078, type: !702, isLocal: false, isDefinition: true, scopeLine: 2079, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !724)
!702 = !DISubroutineType(types: !703)
!703 = !{!266, !704}
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "hfp_ioctrl_str", file: !23, line: 315, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 305, size: 384, elements: !707)
!707 = !{!708, !709, !711, !712}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !706, file: !23, line: 306, baseType: !303, size: 48)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !706, file: !23, line: 307, baseType: !710, size: 32, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "HFP_PHONE_CTL_TYPE", file: !23, line: 170, baseType: !55)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !706, file: !23, line: 308, baseType: !244, size: 8, offset: 96)
!712 = !DIDerivedType(tag: DW_TAG_member, scope: !706, file: !23, line: 309, baseType: !713, size: 256, offset: 128)
!713 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !706, file: !23, line: 309, size: 256, elements: !714)
!714 = !{!715, !717, !719, !723}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "gain_mode", scope: !713, file: !23, line: 310, baseType: !716, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "HFP_GAIN_CTL_MODE", file: !23, line: 129, baseType: !84)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "three_way_ctrl", scope: !713, file: !23, line: 311, baseType: !718, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "HFP_THREE_WAY_CALL_FLAG", file: !23, line: 140, baseType: !90)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "phone_num", scope: !713, file: !23, line: 312, baseType: !720, size: 240)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 240, elements: !721)
!721 = !{!722}
!722 = !DISubrange(count: 30)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !713, file: !23, line: 313, baseType: !248, size: 32)
!724 = !{!725, !726, !727}
!725 = !DILocalVariable(name: "io_str", arg: 1, scope: !701, file: !3, line: 2078, type: !704)
!726 = !DILocalVariable(name: "error", scope: !701, file: !3, line: 2080, type: !266)
!727 = !DILocalVariable(name: "conn", scope: !728, file: !3, line: 2090, type: !355)
!728 = distinct !DILexicalBlock(scope: !729, file: !3, line: 2089, column: 27)
!729 = distinct !DILexicalBlock(scope: !730, file: !3, line: 2088, column: 31)
!730 = distinct !DILexicalBlock(scope: !731, file: !3, line: 2087, column: 12)
!731 = distinct !DILexicalBlock(scope: !701, file: !3, line: 2085, column: 9)
!732 = !DILocalVariable(name: "cmdbuf", scope: !733, file: !3, line: 404, type: !743)
!733 = distinct !DISubprogram(name: "user_hfp_send_dial_cmd", scope: !3, file: !3, line: 401, type: !734, isLocal: true, isDefinition: true, scopeLine: 402, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !737)
!734 = !DISubroutineType(types: !735)
!735 = !{!266, !736, !248, !244}
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!737 = !{!738, !739, !740, !741, !732, !742}
!738 = !DILocalVariable(name: "addr", arg: 1, scope: !733, file: !3, line: 401, type: !736)
!739 = !DILocalVariable(name: "phone_num", arg: 2, scope: !733, file: !3, line: 401, type: !248)
!740 = !DILocalVariable(name: "len", arg: 3, scope: !733, file: !3, line: 401, type: !244)
!741 = !DILocalVariable(name: "i", scope: !733, file: !3, line: 403, type: !266)
!742 = !DILocalVariable(name: "conn", scope: !733, file: !3, line: 405, type: !355)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 280, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 35)
!746 = !DILocation(line: 404, column: 10, scope: !733, inlinedAt: !747)
!747 = distinct !DILocation(line: 2114, column: 21, scope: !729)
!748 = !DILocalVariable(name: "cmdbuf", scope: !749, file: !3, line: 431, type: !756)
!749 = distinct !DISubprogram(name: "hfp_send_DTMF_tone", scope: !3, file: !3, line: 428, type: !750, isLocal: true, isDefinition: true, scopeLine: 429, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !752)
!750 = !DISubroutineType(types: !751)
!751 = !{!266, !736, !219}
!752 = !{!753, !754, !748, !755}
!753 = !DILocalVariable(name: "addr", arg: 1, scope: !749, file: !3, line: 428, type: !736)
!754 = !DILocalVariable(name: "tone", arg: 2, scope: !749, file: !3, line: 428, type: !219)
!755 = !DILocalVariable(name: "conn", scope: !749, file: !3, line: 432, type: !355)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 80, elements: !757)
!757 = !{!758}
!758 = !DISubrange(count: 10)
!759 = !DILocation(line: 431, column: 10, scope: !749, inlinedAt: !760)
!760 = distinct !DILocation(line: 2110, column: 25, scope: !761)
