; ModuleID = 'hid.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/hid.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.bt_sleep = type { i32 (...)*, i32 (...)*, i32 (...)* }
%struct.hid_handl = type { %struct.hid_core_data_t, %struct.run_loop }
%struct.hid_core_data_t = type { [1 x %struct.hid_conn], %struct.hid_keyboard_cmd, %struct._HID_AC_CMD }
%struct.hid_conn = type { [10 x i8], [6 x i8], i8, i8, i8, i16, i16, i16 }
%struct.hid_keyboard_cmd = type { i8, i8, i16, i16 }
%struct._HID_AC_CMD = type <{ i8, i32 }>
%struct.run_loop = type { %struct.btstack_linked_item, void (%struct.run_loop*)*, i8* }
%struct.btstack_linked_item = type { %struct.btstack_linked_item* }
%struct.user_interface_handler = type { void (i8*, i32, i32)*, void (i8, i8*, i8*)*, void (i8*, i32)*, i32 ()*, void (i8, i16, i8*, i16)*, void (i8*, i32, i32, i8)*, i32 ()*, void (i32)*, void (i8, i32, i8*, i16)*, i32 (i8*, i8, i8)*, void ()*, void (i8)*, i8 (i8*, i8, i8*, i32, i8)*, void (i8, i16, i8*, i16)*, i32 ()* }
%struct.hid_mouse_cmd = type { i8, i8, i8, i8, i8 }

@app_info_debug_enable = weak hidden local_unnamed_addr global i32 0, align 4, !dbg !0

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "app_info_debug_enable", scope: !2, file: !135, line: 190, type: !33, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !16, globals: !22)
!3 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/hid.c", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 31, size: 32, elements: !7)
!6 = !DIFile(filename: "../btstack/Profile/include/bredr/profile_common.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15}
!8 = !DIEnumerator(name: "PROFILE_CMD_OK", value: 0)
!9 = !DIEnumerator(name: "PROFILE_CMD_DEVICE_NO_FOUND", value: -1000)
!10 = !DIEnumerator(name: "PROFILE_CMD_NO_FOUND", value: -1001)
!11 = !DIEnumerator(name: "PROFILE_CMD_SEND_ERROR", value: -1002)
!12 = !DIEnumerator(name: "PROFILE_CMD_REMOTE_NOT_SUPPORT", value: -1003)
!13 = !DIEnumerator(name: "PROFILE_CMD_TRY_AGAIN_LATER", value: -1004)
!14 = !DIEnumerator(name: "PROFILE_CMD_DATA_PARSE_ERROE", value: -1005)
!15 = !DIEnumerator(name: "PROFILE_CMD_PROFILE_NOT_SUPPORT", value: -1006)
!16 = !{!17, !18}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 32)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !20, line: 11, baseType: !21)
!20 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!21 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!22 = !{!0, !23, !36, !41, !109, !111, !121, !123, !125, !130}
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "bt_suspend_hid_resumehid_release", scope: !2, file: !3, line: 815, type: !25, isLocal: false, isDefinition: true)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bt_sleep", file: !27, line: 313, size: 96, elements: !28)
!27 = !DIFile(filename: "../btstack/Host/include/common/bt_config.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!28 = !{!29, !34, !35}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "suspend", scope: !26, file: !27, line: 314, baseType: !30, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 32)
!31 = !DISubroutineType(types: !32)
!32 = !{!33, null}
!33 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "resume", scope: !26, file: !27, line: 315, baseType: !30, size: 32, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !26, file: !27, line: 316, baseType: !30, size: 32, offset: 64)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "diy_data_buf", scope: !2, file: !3, line: 25, type: !38, isLocal: true, isDefinition: true)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 240, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 30)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "hid", scope: !2, file: !3, line: 19, type: !43, isLocal: true, isDefinition: true)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_handl", file: !45, line: 141, size: 416, elements: !46)
!45 = !DIFile(filename: "../btstack/Profile/include/bredr/hid_profile.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!46 = !{!47, !92}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "hid_core_data", scope: !44, file: !45, line: 142, baseType: !48, size: 304)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "hid_core_data_t", file: !45, line: 139, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 135, size: 304, elements: !50)
!50 = !{!51, !77, !84}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !49, file: !45, line: 136, baseType: !52, size: 208)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 208, elements: !75)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_conn", file: !45, line: 120, size: 208, elements: !54)
!54 = !{!55, !59, !63, !64, !65, !66, !67, !68, !69, !70, !73, !74}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "cmdbuf", scope: !53, file: !45, line: 121, baseType: !56, size: 80)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 80, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 10)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !53, file: !45, line: 122, baseType: !60, size: 48, offset: 80)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 48, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 6)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "send_step", scope: !53, file: !45, line: 123, baseType: !19, size: 8, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "send_continue", scope: !53, file: !45, line: 124, baseType: !19, size: 8, offset: 136)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "inused", scope: !53, file: !45, line: 125, baseType: !19, size: 1, offset: 144, flags: DIFlagBitField, extraData: i64 144)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "connect_inter_channel", scope: !53, file: !45, line: 126, baseType: !19, size: 1, offset: 145, flags: DIFlagBitField, extraData: i64 144)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "hid_background", scope: !53, file: !45, line: 127, baseType: !19, size: 1, offset: 146, flags: DIFlagBitField, extraData: i64 144)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "income_con_flag", scope: !53, file: !45, line: 128, baseType: !19, size: 2, offset: 147, flags: DIFlagBitField, extraData: i64 144)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "cmdbuf_len", scope: !53, file: !45, line: 129, baseType: !19, size: 3, offset: 149, flags: DIFlagBitField, extraData: i64 144)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl_channel", scope: !53, file: !45, line: 130, baseType: !71, size: 16, offset: 160)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !20, line: 13, baseType: !72)
!72 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "inter_channel", scope: !53, file: !45, line: 131, baseType: !71, size: 16, offset: 176)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pending_channel", scope: !53, file: !45, line: 132, baseType: !71, size: 16, offset: 192)
!75 = !{!76}
!76 = !DISubrange(count: 1)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "hid_kb_cmd", scope: !49, file: !45, line: 137, baseType: !78, size: 48, offset: 208)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_keyboard_cmd", file: !45, line: 85, size: 48, elements: !79)
!79 = !{!80, !81, !82, !83}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "HIDP_Hdr", scope: !78, file: !45, line: 87, baseType: !19, size: 8)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "report_id", scope: !78, file: !45, line: 89, baseType: !19, size: 8, offset: 8)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "key_cmd1", scope: !78, file: !45, line: 92, baseType: !71, size: 16, offset: 16)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "key_cmd2", scope: !78, file: !45, line: 93, baseType: !71, size: 16, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "hid_AC_cmd", scope: !49, file: !45, line: 138, baseType: !85, size: 40, offset: 256)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_HID_AC_CMD", file: !45, line: 101, size: 40, elements: !86)
!86 = !{!87, !88, !91}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "HIDP_Hdr", scope: !85, file: !45, line: 103, baseType: !19, size: 8)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "report_id", scope: !85, file: !45, line: 105, baseType: !89, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !20, line: 15, baseType: !90)
!90 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !85, file: !45, line: 106, baseType: !89, size: 24, offset: 16, flags: DIFlagBitField, extraData: i64 8)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !44, file: !45, line: 143, baseType: !93, size: 96, offset: 320)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "run_loop", file: !94, line: 9, size: 96, elements: !95)
!94 = !DIFile(filename: "../btcommon/run_loop.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!95 = !{!96, !103, !108}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !93, file: !94, line: 10, baseType: !97, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_linked_item_t", file: !98, line: 55, baseType: !99)
!98 = !DIFile(filename: "../btcommon/btstack_linked_list.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btstack_linked_item", file: !98, line: 53, size: 32, elements: !100)
!100 = !{!101}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !99, file: !98, line: 54, baseType: !102, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "run", scope: !93, file: !94, line: 11, baseType: !104, size: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !107}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !93, file: !94, line: 12, baseType: !17, size: 32, offset: 64)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "hid_run_loop_buy", scope: !2, file: !3, line: 27, type: !19, isLocal: true, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "ios_key_down", scope: !2, file: !3, line: 57, type: !113, isLocal: true, isDefinition: true)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_mouse_cmd", file: !45, line: 110, size: 40, elements: !115)
!115 = !{!116, !117, !118, !119, !120}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "HIDP_Hdr", scope: !114, file: !45, line: 112, baseType: !19, size: 8)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "report_id", scope: !114, file: !45, line: 114, baseType: !19, size: 8, offset: 8)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "point_x", scope: !114, file: !45, line: 115, baseType: !19, size: 8, offset: 16)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "point_y", scope: !114, file: !45, line: 116, baseType: !19, size: 8, offset: 24)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !114, file: !45, line: 117, baseType: !19, size: 8, offset: 32)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "ios_key_up", scope: !2, file: !3, line: 64, type: !113, isLocal: true, isDefinition: true)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "diy_data_len", scope: !2, file: !3, line: 26, type: !19, isLocal: true, isDefinition: true)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "hid_msg_callback", scope: !2, file: !3, line: 22, type: !127, isLocal: true, isDefinition: true)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !89, !18, !89}
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "hid_interrupt_callback", scope: !2, file: !3, line: 23, type: !132, isLocal: true, isDefinition: true)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !18, !89, !71}
!135 = !DIFile(filename: "../btcommon/profile_stack_debug.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!136 = !{i32 2, !"Dwarf Version", i32 4}
!137 = !{i32 2, !"Debug Info Version", i32 3}
!138 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!139 = distinct !DISubprogram(name: "hid_init", scope: !3, file: !3, line: 820, type: !140, isLocal: false, isDefinition: true, scopeLine: 821, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !144)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !142, !17}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "hid_stack_t", file: !45, line: 144, baseType: !44)
!144 = !{!145, !146}
!145 = !DILocalVariable(name: "hid_t", arg: 1, scope: !139, file: !3, line: 820, type: !142)
!146 = !DILocalVariable(name: "var", arg: 2, scope: !139, file: !3, line: 820, type: !17)
!147 = !DILocation(line: 820, column: 28, scope: !139)
!148 = !DILocation(line: 820, column: 41, scope: !139)
!149 = !DILocation(line: 822, column: 9, scope: !139)
!150 = !{!151, !151, i64 0}
!151 = !{!"any pointer", !152, i64 0}
!152 = !{!"omnipotent char", !153, i64 0}
!153 = !{!"Simple C/C++ TBAA"}
!154 = !DILocation(line: 823, column: 5, scope: !139)
!155 = !DILocation(line: 828, column: 5, scope: !139)
!156 = !DILocation(line: 831, column: 5, scope: !139)
!157 = !DILocation(line: 833, column: 30, scope: !139)
!158 = !DILocation(line: 833, column: 35, scope: !139)
!159 = !DILocation(line: 833, column: 5, scope: !139)
!160 = !DILocation(line: 834, column: 1, scope: !139)
!161 = distinct !DISubprogram(name: "__hid_ctrl_packet_handler", scope: !3, file: !3, line: 500, type: !162, isLocal: true, isDefinition: true, scopeLine: 502, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !164)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !19, !71, !18, !71}
!164 = !{!165, !166, !167, !168}
!165 = !DILocalVariable(name: "packet_type", arg: 1, scope: !161, file: !3, line: 500, type: !19)
!166 = !DILocalVariable(name: "channel", arg: 2, scope: !161, file: !3, line: 500, type: !71)
!167 = !DILocalVariable(name: "packet", arg: 3, scope: !161, file: !3, line: 501, type: !18)
!168 = !DILocalVariable(name: "size", arg: 4, scope: !161, file: !3, line: 501, type: !71)
!169 = !DILocation(line: 500, column: 42, scope: !161)
!170 = !DILocation(line: 500, column: 59, scope: !161)
!171 = !DILocation(line: 501, column: 43, scope: !161)
!172 = !DILocation(line: 501, column: 55, scope: !161)
!173 = !DILocation(line: 503, column: 5, scope: !161)
