temp.o:	file format ELF32-i386

.debug_info contents:
0x00000000: Compile Unit: length = 0x000010e7 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x000010eb)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)")
              DW_AT_language	(DW_LANG_C99)
              DW_AT_name	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/hid.c")
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
              DW_AT_GNU_pubnames	(true)
              DW_AT_low_pc	(0x0000000000000000)
              DW_AT_ranges	(0x00000020
                 [0x00000000 - 0x00002298)
                 [0x00002298 - 0x00002353)
                 [0x00000000 - 0x00000009))

0x00000026:   DW_TAG_variable
                DW_AT_name	("app_info_debug_enable")
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/profile_stack_debug.h")
                DW_AT_decl_line	(190)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000037:   DW_TAG_base_type
                DW_AT_name	("int")
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_byte_size	(0x04)

0x0000003e:   DW_TAG_variable
                DW_AT_name	("bt_suspend_hid_resumehid_release")
                DW_AT_type	(cu + 0x0050 "const bt_sleep")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/hid.c")
                DW_AT_decl_line	(815)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000050:   DW_TAG_const_type
                DW_AT_type	(cu + 0x0055 "bt_sleep")

0x00000055:   DW_TAG_structure_type
                DW_AT_name	("bt_sleep")
                DW_AT_byte_size	(0x0c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/bt_config.h")
                DW_AT_decl_line	(313)

0x0000005e:     DW_TAG_member
                  DW_AT_name	("suspend")
                  DW_AT_type	(cu + 0x0086 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/bt_config.h")
                  DW_AT_decl_line	(314)
                  DW_AT_data_member_location	(0x00)

0x0000006b:     DW_TAG_member
                  DW_AT_name	("resume")
                  DW_AT_type	(cu + 0x0086 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/bt_config.h")
                  DW_AT_decl_line	(315)
                  DW_AT_data_member_location	(0x04)

0x00000078:     DW_TAG_member
                  DW_AT_name	("release")
                  DW_AT_type	(cu + 0x0086 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/bt_config.h")
                  DW_AT_decl_line	(316)
                  DW_AT_data_member_location	(0x08)

0x00000085:     NULL

0x00000086:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x008b "subroutine int")

0x0000008b:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")

0x00000090:     DW_TAG_unspecified_parameters

0x00000091:     NULL

0x00000092:   DW_TAG_variable
                DW_AT_name	("diy_data_buf")
                DW_AT_type	(cu + 0x00a3 "u8[]")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/hid.c")
                DW_AT_decl_line	(25)
                DW_AT_location	(DW_OP_addr 0x0)

0x000000a3:   DW_TAG_array_type
                DW_AT_type	(cu + 0x00af "u8")

0x000000a8:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x00c1 "sizetype")
                  DW_AT_count	(0x1e)

0x000000ae:     NULL

0x000000af:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00ba "unsigned char")
                DW_AT_name	("u8")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(11)

0x000000ba:   DW_TAG_base_type
                DW_AT_name	("unsigned char")
                DW_AT_encoding	(DW_ATE_unsigned_char)
                DW_AT_byte_size	(0x01)

0x000000c1:   DW_TAG_base_type
                DW_AT_name	("sizetype")
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_unsigned)

0x000000c8:   DW_TAG_variable
                DW_AT_name	("hid")
                DW_AT_type	(cu + 0x00d9 "hid_handl*")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/hid.c")
                DW_AT_decl_line	(19)
                DW_AT_location	(DW_OP_addr 0x0)

0x000000d9:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x00de "hid_handl")

0x000000de:   DW_TAG_structure_type
                DW_AT_name	("hid_handl")
                DW_AT_byte_size	(0x34)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                DW_AT_decl_line	(141)

0x000000e6:     DW_TAG_member
                  DW_AT_name	("hid_core_data")
                  DW_AT_type	(cu + 0x00ff "hid_core_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(142)
                  DW_AT_data_member_location	(0x00)

0x000000f2:     DW_TAG_member
                  DW_AT_name	("loop")
                  DW_AT_type	(cu + 0x0296 "run_loop")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(143)
                  DW_AT_data_member_location	(0x28)

0x000000fe:     NULL

0x000000ff:   DW_TAG_typedef
                DW_AT_type	(cu + 0x010a "structure ")
                DW_AT_name	("hid_core_data_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                DW_AT_decl_line	(139)

0x0000010a:   DW_TAG_structure_type
                DW_AT_byte_size	(0x26)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                DW_AT_decl_line	(135)

0x0000010e:     DW_TAG_member
                  DW_AT_name	("conn")
                  DW_AT_type	(cu + 0x0133 "hid_conn[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(136)
                  DW_AT_data_member_location	(0x00)

0x0000011a:     DW_TAG_member
                  DW_AT_name	("hid_kb_cmd")
                  DW_AT_type	(cu + 0x0211 "hid_keyboard_cmd")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(137)
                  DW_AT_data_member_location	(0x1a)

0x00000126:     DW_TAG_member
                  DW_AT_name	("hid_AC_cmd")
                  DW_AT_type	(cu + 0x024a "_HID_AC_CMD")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(138)
                  DW_AT_data_member_location	(0x20)

0x00000132:     NULL

0x00000133:   DW_TAG_array_type
                DW_AT_type	(cu + 0x013f "hid_conn")

0x00000138:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x00c1 "sizetype")
                  DW_AT_count	(0x01)

0x0000013e:     NULL

0x0000013f:   DW_TAG_structure_type
                DW_AT_name	("hid_conn")
                DW_AT_byte_size	(0x1a)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                DW_AT_decl_line	(120)

0x00000147:     DW_TAG_member
                  DW_AT_name	("cmdbuf")
                  DW_AT_type	(cu + 0x01e7 "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(121)
                  DW_AT_data_member_location	(0x00)

0x00000153:     DW_TAG_member
                  DW_AT_name	("addr")
                  DW_AT_type	(cu + 0x01f3 "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(122)
                  DW_AT_data_member_location	(0x0a)

0x0000015f:     DW_TAG_member
                  DW_AT_name	("send_step")
                  DW_AT_type	(cu + 0x00af "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(123)
                  DW_AT_data_member_location	(0x10)

0x0000016b:     DW_TAG_member
                  DW_AT_name	("send_continue")
                  DW_AT_type	(cu + 0x00af "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(124)
                  DW_AT_data_member_location	(0x11)

0x00000177:     DW_TAG_member
                  DW_AT_name	("inused")
                  DW_AT_type	(cu + 0x00af "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(125)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x07)
                  DW_AT_data_member_location	(0x12)

0x00000186:     DW_TAG_member
                  DW_AT_name	("connect_inter_channel")
                  DW_AT_type	(cu + 0x00af "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(126)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x06)
                  DW_AT_data_member_location	(0x12)

0x00000195:     DW_TAG_member
                  DW_AT_name	("hid_background")
                  DW_AT_type	(cu + 0x00af "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(127)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x05)
                  DW_AT_data_member_location	(0x12)

0x000001a4:     DW_TAG_member
                  DW_AT_name	("income_con_flag")
                  DW_AT_type	(cu + 0x00af "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(128)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x03)
                  DW_AT_data_member_location	(0x12)

0x000001b3:     DW_TAG_member
                  DW_AT_name	("cmdbuf_len")
                  DW_AT_type	(cu + 0x00af "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(129)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x03)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x12)

0x000001c2:     DW_TAG_member
                  DW_AT_name	("ctrl_channel")
                  DW_AT_type	(cu + 0x01ff "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(130)
                  DW_AT_data_member_location	(0x14)

0x000001ce:     DW_TAG_member
                  DW_AT_name	("inter_channel")
                  DW_AT_type	(cu + 0x01ff "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(131)
                  DW_AT_data_member_location	(0x16)

0x000001da:     DW_TAG_member
                  DW_AT_name	("pending_channel")
                  DW_AT_type	(cu + 0x01ff "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(132)
                  DW_AT_data_member_location	(0x18)

0x000001e6:     NULL

0x000001e7:   DW_TAG_array_type
                DW_AT_type	(cu + 0x00af "u8")

0x000001ec:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x00c1 "sizetype")
                  DW_AT_count	(0x0a)

0x000001f2:     NULL

0x000001f3:   DW_TAG_array_type
                DW_AT_type	(cu + 0x00af "u8")

0x000001f8:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x00c1 "sizetype")
                  DW_AT_count	(0x06)

0x000001fe:     NULL

0x000001ff:   DW_TAG_typedef
                DW_AT_type	(cu + 0x020a "unsigned short")
                DW_AT_name	("u16")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(13)

0x0000020a:   DW_TAG_base_type
                DW_AT_name	("unsigned short")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x02)

0x00000211:   DW_TAG_structure_type
                DW_AT_name	("hid_keyboard_cmd")
                DW_AT_byte_size	(0x06)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                DW_AT_decl_line	(85)

0x00000219:     DW_TAG_member
                  DW_AT_name	("HIDP_Hdr")
                  DW_AT_type	(cu + 0x00af "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(87)
                  DW_AT_data_member_location	(0x00)

0x00000225:     DW_TAG_member
                  DW_AT_name	("report_id")
                  DW_AT_type	(cu + 0x00af "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(89)
                  DW_AT_data_member_location	(0x01)

0x00000231:     DW_TAG_member
                  DW_AT_name	("key_cmd1")
                  DW_AT_type	(cu + 0x01ff "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(92)
                  DW_AT_data_member_location	(0x02)

0x0000023d:     DW_TAG_member
                  DW_AT_name	("key_cmd2")
                  DW_AT_type	(cu + 0x01ff "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(93)
                  DW_AT_data_member_location	(0x04)

0x00000249:     NULL

0x0000024a:   DW_TAG_structure_type
                DW_AT_name	("_HID_AC_CMD")
                DW_AT_byte_size	(0x05)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                DW_AT_decl_line	(101)

0x00000252:     DW_TAG_member
                  DW_AT_name	("HIDP_Hdr")
                  DW_AT_type	(cu + 0x00af "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(103)
                  DW_AT_data_member_location	(0x00)

0x0000025e:     DW_TAG_member
                  DW_AT_name	("report_id")
                  DW_AT_type	(cu + 0x0284 "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(105)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x08)
                  DW_AT_bit_offset	(0x10)
                  DW_AT_data_member_location	(0x00)

0x0000026d:     DW_TAG_member
                  DW_AT_name	("data")
                  DW_AT_type	(cu + 0x0284 "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(106)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x18)
                  DW_AT_bit_offset	(0xfffffffffffffff8)
                  DW_AT_data_member_location	(0x00)

0x00000283:     NULL

0x00000284:   DW_TAG_typedef
                DW_AT_type	(cu + 0x028f "unsigned int")
                DW_AT_name	("u32")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(15)

0x0000028f:   DW_TAG_base_type
                DW_AT_name	("unsigned int")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x04)

0x00000296:   DW_TAG_structure_type
                DW_AT_name	("run_loop")
                DW_AT_byte_size	(0x0c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/run_loop.h")
                DW_AT_decl_line	(9)

0x0000029e:     DW_TAG_member
                  DW_AT_name	("entry")
                  DW_AT_type	(cu + 0x02c3 "btstack_linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/run_loop.h")
                  DW_AT_decl_line	(10)
                  DW_AT_data_member_location	(0x00)

0x000002aa:     DW_TAG_member
                  DW_AT_name	("run")
                  DW_AT_type	(cu + 0x02e8 "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/run_loop.h")
                  DW_AT_decl_line	(11)
                  DW_AT_data_member_location	(0x04)

0x000002b6:     DW_TAG_member
                  DW_AT_name	("var")
                  DW_AT_type	(cu + 0x02f9 "*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/run_loop.h")
                  DW_AT_decl_line	(12)
                  DW_AT_data_member_location	(0x08)

0x000002c2:     NULL

0x000002c3:   DW_TAG_typedef
                DW_AT_type	(cu + 0x02ce "btstack_linked_item")
                DW_AT_name	("btstack_linked_item_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(55)

0x000002ce:   DW_TAG_structure_type
                DW_AT_name	("btstack_linked_item")
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(53)

0x000002d6:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(cu + 0x02e3 "btstack_linked_item*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                  DW_AT_decl_line	(54)
                  DW_AT_data_member_location	(0x00)

0x000002e2:     NULL

0x000002e3:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x02ce "btstack_linked_item")

0x000002e8:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x02ed "subroutine ")

0x000002ed:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x000002ee:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x02f4 "run_loop*")

0x000002f3:     NULL

0x000002f4:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0296 "run_loop")

0x000002f9:   DW_TAG_pointer_type

0x000002fa:   DW_TAG_variable
                DW_AT_name	("hid_run_loop_buy")
                DW_AT_type	(cu + 0x00af "u8")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/hid.c")
                DW_AT_decl_line	(27)

0x00000305:   DW_TAG_variable
                DW_AT_name	("ios_key_down")
                DW_AT_type	(cu + 0x0316 "const hid_mouse_cmd")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/hid.c")
                DW_AT_decl_line	(57)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000316:   DW_TAG_const_type
                DW_AT_type	(cu + 0x031b "hid_mouse_cmd")

0x0000031b:   DW_TAG_structure_type
                DW_AT_name	("hid_mouse_cmd")
                DW_AT_byte_size	(0x05)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                DW_AT_decl_line	(110)

0x00000323:     DW_TAG_member
                  DW_AT_name	("HIDP_Hdr")
                  DW_AT_type	(cu + 0x00af "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(112)
                  DW_AT_data_member_location	(0x00)

0x0000032f:     DW_TAG_member
                  DW_AT_name	("report_id")
                  DW_AT_type	(cu + 0x00af "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(114)
                  DW_AT_data_member_location	(0x01)

0x0000033b:     DW_TAG_member
                  DW_AT_name	("point_x")
                  DW_AT_type	(cu + 0x00af "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(115)
                  DW_AT_data_member_location	(0x02)

0x00000347:     DW_TAG_member
                  DW_AT_name	("point_y")
                  DW_AT_type	(cu + 0x00af "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(116)
                  DW_AT_data_member_location	(0x03)

0x00000353:     DW_TAG_member
                  DW_AT_name	("button")
                  DW_AT_type	(cu + 0x00af "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hid_profile.h")
                  DW_AT_decl_line	(117)
                  DW_AT_data_member_location	(0x04)

0x0000035f:     NULL

0x00000360:   DW_TAG_variable
                DW_AT_name	("ios_key_up")
                DW_AT_type	(cu + 0x0316 "const hid_mouse_cmd")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/hid.c")
                DW_AT_decl_line	(64)
                DW_AT_location	(DW_OP_addr 0x5)

0x00000371:   DW_TAG_variable
                DW_AT_name	("diy_data_len")
                DW_AT_type	(cu + 0x00af "u8")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/hid.c")
                DW_AT_decl_line	(26)
                DW_AT_location	(DW_OP_addr 0x5)

0x00000382:   DW_TAG_variable
                DW_AT_name	("hid_msg_callback")
                DW_AT_type	(cu + 0x0393 "subroutine *")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/hid.c")
                DW_AT_decl_line	(22)
                DW_AT_location	(DW_OP_addr 0x8)

0x00000393:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0398 "subroutine ")

0x00000398:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x00000399:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0284 "u32")

0x0000039e:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x03a9 "u8*")

0x000003a3:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0284 "u32")

0x000003a8:     NULL

0x000003a9:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x00af "u8")

0x000003ae:   DW_TAG_variable
                DW_AT_name	("hid_interrupt_callback")
                DW_AT_type	(cu + 0x03bf "subroutine *")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/hid.c")
                DW_AT_decl_line	(23)
                DW_AT_location	(DW_OP_addr 0xc)

0x000003bf:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x03c4 "subroutine ")

0x000003c4:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x000003c5:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x03a9 "u8*")

0x000003ca:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0284 "u32")

0x000003cf:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x01ff "u16")

0x000003d4:     NULL

0x000003d5:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/profile_common.h")
                DW_AT_decl_line	(31)

0x000003d9:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_OK")
                  DW_AT_const_value	(0)

0x000003df:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_DEVICE_NO_FOUND")
                  DW_AT_const_value	(-1000)

0x000003e6:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_NO_FOUND")
                  DW_AT_const_value	(-1001)

0x000003ed:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_SEND_ERROR")
                  DW_AT_const_value	(-1002)

0x000003f4:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_REMOTE_NOT_SUPPORT")
                  DW_AT_const_value	(-1003)

0x000003fb:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_TRY_AGAIN_LATER")
                  DW_AT_const_value	(-1004)

0x00000402:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_DATA_PARSE_ERROE")
                  DW_AT_const_value	(-1005)

0x00000409:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_PROFILE_NOT_SUPPORT")
                  DW_AT_const_value	(-1006)

0x00000410:     NULL

0x00000411:   DW_TAG_subprogram
