temp.o:	file format ELF32-i386

.debug_info contents:
0x00000000: Compile Unit: length = 0x0000034c version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x00000350)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)")
              DW_AT_language	(DW_LANG_C99)
              DW_AT_name	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/iap_profile.c")
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
              DW_AT_GNU_pubnames	(true)
              DW_AT_low_pc	(0x0000000000000000)
              DW_AT_high_pc	(0x000000000000003e)

0x00000026:   DW_TAG_variable
                DW_AT_name	("app_info_debug_enable")
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/profile_stack_debug.h")
                DW_AT_decl_line	(190)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000037:   DW_TAG_base_type
                DW_AT_name	("int")
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_byte_size	(0x04)

0x0000003e:   DW_TAG_variable
                DW_AT_name	("bt_suspend_iap_resumeiap_release")
                DW_AT_type	(cu + 0x0050 "const bt_sleep")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/iap_profile.c")
                DW_AT_decl_line	(464)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000050:   DW_TAG_const_type
                DW_AT_type	(cu + 0x0055 "bt_sleep")

0x00000055:   DW_TAG_structure_type
                DW_AT_name	("bt_sleep")
                DW_AT_byte_size	(0x0c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/bt_config.h")
                DW_AT_decl_line	(313)

0x0000005e:     DW_TAG_member
                  DW_AT_name	("suspend")
                  DW_AT_type	(cu + 0x0086 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/bt_config.h")
                  DW_AT_decl_line	(314)
                  DW_AT_data_member_location	(0x00)

0x0000006b:     DW_TAG_member
                  DW_AT_name	("resume")
                  DW_AT_type	(cu + 0x0086 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/bt_config.h")
                  DW_AT_decl_line	(315)
                  DW_AT_data_member_location	(0x04)

0x00000078:     DW_TAG_member
                  DW_AT_name	("release")
                  DW_AT_type	(cu + 0x0086 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/bt_config.h")
                  DW_AT_decl_line	(316)
                  DW_AT_data_member_location	(0x08)

0x00000085:     NULL

0x00000086:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x008b "subroutine int")

0x0000008b:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")

0x00000090:     DW_TAG_unspecified_parameters

0x00000091:     NULL

0x00000092:   DW_TAG_variable
                DW_AT_name	("iap_handl")
                DW_AT_type	(cu + 0x009d "iap_profile_t*")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/iap_profile.c")
                DW_AT_decl_line	(19)

0x0000009d:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x00a2 "iap_profile_t")

0x000000a2:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00ad "structure ")
                DW_AT_name	("iap_profile_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/iap_profile.h")
                DW_AT_decl_line	(24)

0x000000ad:   DW_TAG_structure_type
                DW_AT_byte_size	(0x24)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/iap_profile.h")
                DW_AT_decl_line	(21)

0x000000b1:     DW_TAG_member
                  DW_AT_name	("loop")
                  DW_AT_type	(cu + 0x00ca "run_loop")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/iap_profile.h")
                  DW_AT_decl_line	(22)
                  DW_AT_data_member_location	(0x00)

0x000000bd:     DW_TAG_member
                  DW_AT_name	("conn")
                  DW_AT_type	(cu + 0x012e "iap_conn_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/iap_profile.h")
                  DW_AT_decl_line	(23)
                  DW_AT_data_member_location	(0x0c)

0x000000c9:     NULL

0x000000ca:   DW_TAG_structure_type
                DW_AT_name	("run_loop")
                DW_AT_byte_size	(0x0c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/run_loop.h")
                DW_AT_decl_line	(9)

0x000000d2:     DW_TAG_member
                  DW_AT_name	("entry")
                  DW_AT_type	(cu + 0x00f7 "btstack_linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/run_loop.h")
                  DW_AT_decl_line	(10)
                  DW_AT_data_member_location	(0x00)

0x000000de:     DW_TAG_member
                  DW_AT_name	("run")
                  DW_AT_type	(cu + 0x011c "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/run_loop.h")
                  DW_AT_decl_line	(11)
                  DW_AT_data_member_location	(0x04)

0x000000ea:     DW_TAG_member
                  DW_AT_name	("var")
                  DW_AT_type	(cu + 0x012d "*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/run_loop.h")
                  DW_AT_decl_line	(12)
                  DW_AT_data_member_location	(0x08)

0x000000f6:     NULL

0x000000f7:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0102 "btstack_linked_item")
                DW_AT_name	("btstack_linked_item_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(55)

0x00000102:   DW_TAG_structure_type
                DW_AT_name	("btstack_linked_item")
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(53)

0x0000010a:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(cu + 0x0117 "btstack_linked_item*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                  DW_AT_decl_line	(54)
                  DW_AT_data_member_location	(0x00)

0x00000116:     NULL

0x00000117:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0102 "btstack_linked_item")

0x0000011c:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0121 "subroutine ")

0x00000121:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x00000122:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0128 "run_loop*")

0x00000127:     NULL

0x00000128:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x00ca "run_loop")

0x0000012d:   DW_TAG_pointer_type

0x0000012e:   DW_TAG_array_type
                DW_AT_type	(cu + 0x013a "iap_conn_t")

0x00000133:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0211 "sizetype")
                  DW_AT_count	(0x01)

0x00000139:     NULL

0x0000013a:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0145 "structure ")
                DW_AT_name	("iap_conn_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/iap_profile.h")
                DW_AT_decl_line	(19)

0x00000145:   DW_TAG_structure_type
                DW_AT_byte_size	(0x18)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/iap_profile.h")
                DW_AT_decl_line	(11)

0x00000149:     DW_TAG_member
                  DW_AT_name	("iap_send_list")
                  DW_AT_type	(cu + 0x019e "linked_list_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/iap_profile.h")
                  DW_AT_decl_line	(12)
                  DW_AT_data_member_location	(0x00)

0x00000155:     DW_TAG_member
                  DW_AT_name	("channel")
                  DW_AT_type	(cu + 0x01ae "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/iap_profile.h")
                  DW_AT_decl_line	(13)
                  DW_AT_data_member_location	(0x04)

0x00000161:     DW_TAG_member
                  DW_AT_name	("rfcomm_cid")
                  DW_AT_type	(cu + 0x01ae "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/iap_profile.h")
                  DW_AT_decl_line	(14)
                  DW_AT_data_member_location	(0x06)

0x0000016d:     DW_TAG_member
                  DW_AT_name	("l2cap_send_cmd_handle")
                  DW_AT_type	(cu + 0x01ae "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/iap_profile.h")
                  DW_AT_decl_line	(15)
                  DW_AT_data_member_location	(0x08)

0x00000179:     DW_TAG_member
                  DW_AT_name	("rfcomm_dlci")
                  DW_AT_type	(cu + 0x01c0 "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/iap_profile.h")
                  DW_AT_decl_line	(16)
                  DW_AT_data_member_location	(0x0c)

0x00000185:     DW_TAG_member
                  DW_AT_name	("inused")
                  DW_AT_type	(cu + 0x01d2 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/iap_profile.h")
                  DW_AT_decl_line	(17)
                  DW_AT_data_member_location	(0x10)

0x00000191:     DW_TAG_member
                  DW_AT_name	("addr")
                  DW_AT_type	(cu + 0x01e4 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/iap_profile.h")
                  DW_AT_decl_line	(18)
                  DW_AT_data_member_location	(0x11)

0x0000019d:     NULL

0x0000019e:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01a9 "btstack_linked_item_t*")
                DW_AT_name	("linked_list_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(101)

0x000001a9:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x00f7 "btstack_linked_item_t")

0x000001ae:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01b9 "unsigned short")
                DW_AT_name	("u16")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(13)

0x000001b9:   DW_TAG_base_type
                DW_AT_name	("unsigned short")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x02)

0x000001c0:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01cb "unsigned int")
                DW_AT_name	("u32")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(15)

0x000001cb:   DW_TAG_base_type
                DW_AT_name	("unsigned int")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x04)

0x000001d2:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01dd "unsigned char")
                DW_AT_name	("u8")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(11)

0x000001dd:   DW_TAG_base_type
                DW_AT_name	("unsigned char")
                DW_AT_encoding	(DW_ATE_unsigned_char)
                DW_AT_byte_size	(0x01)

0x000001e4:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01ef "uint8_t[]")
                DW_AT_name	("bd_addr_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h")
                DW_AT_decl_line	(7)

0x000001ef:   DW_TAG_array_type
                DW_AT_type	(cu + 0x01fb "uint8_t")

0x000001f4:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0211 "sizetype")
                  DW_AT_count	(0x06)

0x000001fa:     NULL

0x000001fb:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0206 "__uint8_t")
                DW_AT_name	("uint8_t")
                DW_AT_decl_file	("/opt/q32s/include/sys/_stdint.h")
                DW_AT_decl_line	(20)

0x00000206:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01dd "unsigned char")
                DW_AT_name	("__uint8_t")
                DW_AT_decl_file	("/opt/q32s/include/machine/_default_types.h")
                DW_AT_decl_line	(29)

0x00000211:   DW_TAG_base_type
                DW_AT_name	("sizetype")
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_unsigned)

0x00000218:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000000)
                DW_AT_high_pc	(0x0000000000000011)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("iap_data_deal_handle_register")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/iap_profile.c")
                DW_AT_decl_line	(389)
                DW_AT_prototyped	(true)
                DW_AT_external	(true)

0x0000022a:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_reg0 EAX)
                  DW_AT_name	("handler")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/iap_profile.c")
                  DW_AT_decl_line	(389)
                  DW_AT_type	(cu + 0x032a "subroutine *")

0x00000238:     NULL

0x00000239:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000011)
                DW_AT_high_pc	(0x000000000000001d)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("iap_check_conn_for_rfcomm_id")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/iap_profile.c")
                DW_AT_decl_line	(394)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x01d2 "u8")
                DW_AT_external	(true)

0x0000024f:     DW_TAG_formal_parameter
                  DW_AT_name	("rfcomm_cid")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/iap_profile.c")
                  DW_AT_decl_line	(394)
                  DW_AT_type	(cu + 0x01ae "u16")

0x0000025b:     DW_TAG_variable
                  DW_AT_name	("conn")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/iap_profile.c")
                  DW_AT_decl_line	(396)
                  DW_AT_type	(cu + 0x034a "iap_conn_t*")

0x00000267:     NULL

0x00000268:   DW_TAG_subprogram
                DW_AT_low_pc	(0x000000000000001d)
                DW_AT_high_pc	(0x0000000000000024)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("iap_core_data_for_send")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/iap_profile.c")
                DW_AT_decl_line	(410)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)

0x0000027e:     DW_TAG_formal_parameter
                  DW_AT_name	("packet")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/iap_profile.c")
                  DW_AT_decl_line	(410)
                  DW_AT_type	(cu + 0x0345 "u8*")

0x0000028a:     DW_TAG_formal_parameter
                  DW_AT_name	("size")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/iap_profile.c")
                  DW_AT_decl_line	(410)
                  DW_AT_type	(cu + 0x01ae "u16")

0x00000296:     DW_TAG_variable
                  DW_AT_const_value	(0)
                  DW_AT_name	("len")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/iap_profile.c")
                  DW_AT_decl_line	(412)
                  DW_AT_type	(cu + 0x01d2 "u8")

0x000002a3:     NULL

0x000002a4:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000024)
                DW_AT_high_pc	(0x0000000000000029)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("iap_core_data_for_set")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/iap_profile.c")
                DW_AT_decl_line	(425)
                DW_AT_prototyped	(true)
                DW_AT_external	(true)

0x000002b6:     DW_TAG_formal_parameter
                  DW_AT_name	("packet")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/iap_profile.c")
                  DW_AT_decl_line	(425)
                  DW_AT_type	(cu + 0x0345 "u8*")

0x000002c2:     DW_TAG_formal_parameter
                  DW_AT_name	("size")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/iap_profile.c")
                  DW_AT_decl_line	(425)
                  DW_AT_type	(cu + 0x01ae "u16")

0x000002ce:     DW_TAG_variable
                  DW_AT_name	("len")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/iap_profile.c")
                  DW_AT_decl_line	(427)
                  DW_AT_type	(cu + 0x01d2 "u8")

0x000002da:     NULL

0x000002db:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000029)
                DW_AT_high_pc	(0x0000000000000030)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("iap_suspend")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/iap_profile.c")
                DW_AT_decl_line	(459)
                DW_AT_type	(cu + 0x0037 "int")

0x000002f1:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000030)
                DW_AT_high_pc	(0x0000000000000037)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("iap_resume")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/iap_profile.c")
                DW_AT_decl_line	(455)
                DW_AT_type	(cu + 0x0037 "int")

0x00000307:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000037)
                DW_AT_high_pc	(0x000000000000003e)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("iap_release")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/iap_profile.c")
                DW_AT_decl_line	(439)
                DW_AT_type	(cu + 0x0037 "int")

0x0000031d:     DW_TAG_variable
                  DW_AT_name	("conn")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/iap_profile.c")
                  DW_AT_decl_line	(444)
                  DW_AT_type	(cu + 0x034a "iap_conn_t*")

0x00000329:     NULL

0x0000032a:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x032f "subroutine ")

0x0000032f:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x00000330:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x01d2 "u8")

0x00000335:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x01ae "u16")

0x0000033a:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0345 "u8*")

0x0000033f:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x01ae "u16")

0x00000344:     NULL

0x00000345:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x01d2 "u8")

0x0000034a:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x013a "iap_conn_t")

0x0000034f:   NULL
