; ModuleID = 'l2cap.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/common/l2cap.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.l2cap_stack_t = type { void (i8*, i8, i16, i8*, i16)*, %struct.btstack_linked_item*, %struct.btstack_linked_item*, %struct.l2cap_core_data_t }
%struct.btstack_linked_item = type { %struct.btstack_linked_item* }
%struct.l2cap_core_data_t = type { [3 x %struct.l2cap_signaling_response], i32, i32, [1 x %struct.authentication_flag], i8, i16 }
%struct.l2cap_signaling_response = type { i16, i8, i8, i16, i16 }
%struct.authentication_flag = type { [6 x i8], i8, i8 }
%struct.btstack_packet_callback_registration_t = type { %struct.btstack_linked_item, void (i8, i16, i8*, i16)* }
%struct._stack_config = type <{ i32, i16, i16, i16, i16, i16, i8, i8, i8, i32, i8, i8, i8, i8, [6 x i8], i8 }>
%struct.l2cap_fixed_channel = type { void (i8, i16, i8*, i16)*, i8 }
%struct.channel_core_data_t = type { i16, i8, i8, i8, i8, [6 x i8], i16, i16, i16, i16, i16, i8, i32, %struct.retran_flow_ctl_op_t }
%struct.retran_flow_ctl_op_t = type { i8, i8, i8, i8, i8, i16, i16, i16 }
%struct.l2cap_channel_t = type { %struct.btstack_linked_item, i16, i8, i8*, void (i8, i16, i8*, i16)*, %struct.channel_core_data_t }
%struct.btstack_linked_list_iterator_t = type { i32, %struct.btstack_linked_item*, %struct.btstack_linked_item* }

!144 = !DIEnumerator(name: "SM_INITIATOR_CONNECTED", value: 52)
!145 = !DIEnumerator(name: "SM_INITIATOR_PH0_HAS_LTK", value: 53)
!146 = !DIEnumerator(name: "SM_INITIATOR_PH0_SEND_START_ENCRYPTION", value: 54)
!147 = !DIEnumerator(name: "SM_INITIATOR_PH0_W4_CONNECTION_ENCRYPTED", value: 55)
!148 = !DIEnumerator(name: "SM_INITIATOR_PH1_W2_SEND_PAIRING_REQUEST", value: 56)
!149 = !DIEnumerator(name: "SM_INITIATOR_PH1_SEND_PAIRING_REQUEST", value: 57)
!150 = !DIEnumerator(name: "SM_INITIATOR_PH1_W4_PAIRING_RESPONSE", value: 58)
!151 = !DIEnumerator(name: "SM_INITIATOR_PH2_W4_PAIRING_CONFIRM", value: 59)
!152 = !DIEnumerator(name: "SM_INITIATOR_PH2_W4_PAIRING_RANDOM", value: 60)
!153 = !DIEnumerator(name: "SM_INITIATOR_PH3_SEND_START_ENCRYPTION", value: 61)
!154 = !DIEnumerator(name: "SM_SC_RECEIVED_LTK_REQUEST", value: 62)
!155 = !DIEnumerator(name: "SM_SC_SEND_PUBLIC_KEY_COMMAND", value: 63)
!156 = !DIEnumerator(name: "SM_SC_W4_PUBLIC_KEY_COMMAND", value: 64)
!157 = !DIEnumerator(name: "SM_SC_W2_GET_RANDOM_A", value: 65)
!158 = !DIEnumerator(name: "SM_SC_W4_GET_RANDOM_A", value: 66)
!159 = !DIEnumerator(name: "SM_SC_W2_GET_RANDOM_B", value: 67)
!160 = !DIEnumerator(name: "SM_SC_W4_GET_RANDOM_B", value: 68)
!161 = !DIEnumerator(name: "SM_SC_W2_CMAC_FOR_CONFIRMATION", value: 69)
!162 = !DIEnumerator(name: "SM_SC_W4_CMAC_FOR_CONFIRMATION", value: 70)
!163 = !DIEnumerator(name: "SM_SC_SEND_CONFIRMATION", value: 71)
!164 = !DIEnumerator(name: "SM_SC_W2_CMAC_FOR_CHECK_CONFIRMATION", value: 72)
!165 = !DIEnumerator(name: "SM_SC_W4_CMAC_FOR_CHECK_CONFIRMATION", value: 73)
!166 = !DIEnumerator(name: "SM_SC_W4_CONFIRMATION", value: 74)
!167 = !DIEnumerator(name: "SM_SC_SEND_PAIRING_RANDOM", value: 75)
!168 = !DIEnumerator(name: "SM_SC_W4_PAIRING_RANDOM", value: 76)
!169 = !DIEnumerator(name: "SM_SC_W2_CALCULATE_G2", value: 77)
!170 = !DIEnumerator(name: "SM_SC_W4_CALCULATE_G2", value: 78)
!171 = !DIEnumerator(name: "SM_SC_W4_CALCULATE_DHKEY", value: 79)
!172 = !DIEnumerator(name: "SM_SC_W2_CALCULATE_F5_SALT", value: 80)
!173 = !DIEnumerator(name: "SM_SC_W4_CALCULATE_F5_SALT", value: 81)
!174 = !DIEnumerator(name: "SM_SC_W2_CALCULATE_F5_MACKEY", value: 82)
!175 = !DIEnumerator(name: "SM_SC_W4_CALCULATE_F5_MACKEY", value: 83)
!176 = !DIEnumerator(name: "SM_SC_W2_CALCULATE_F5_LTK", value: 84)
!177 = !DIEnumerator(name: "SM_SC_W4_CALCULATE_F5_LTK", value: 85)
!178 = !DIEnumerator(name: "SM_SC_W2_CALCULATE_F6_FOR_DHKEY_CHECK", value: 86)
!179 = !DIEnumerator(name: "SM_SC_W4_CALCULATE_F6_FOR_DHKEY_CHECK", value: 87)
!180 = !DIEnumerator(name: "SM_SC_W2_CALCULATE_F6_TO_VERIFY_DHKEY_CHECK", value: 88)
!181 = !DIEnumerator(name: "SM_SC_W4_CALCULATE_F6_TO_VERIFY_DHKEY_CHECK", value: 89)
!182 = !DIEnumerator(name: "SM_SC_W4_USER_RESPONSE", value: 90)
!183 = !DIEnumerator(name: "SM_SC_SEND_DHKEY_CHECK_COMMAND", value: 91)
!184 = !DIEnumerator(name: "SM_SC_W4_DHKEY_CHECK_COMMAND", value: 92)
!185 = !DIEnumerator(name: "SM_SC_W4_LTK_REQUEST_SC", value: 93)
!186 = !DIEnumerator(name: "SM_SC_W2_CALCULATE_H6_ILK", value: 94)
!187 = !DIEnumerator(name: "SM_SC_W4_CALCULATE_H6_ILK", value: 95)
!188 = !DIEnumerator(name: "SM_SC_W2_CALCULATE_H6_BR_EDR_LINK_KEY", value: 96)
!189 = !DIEnumerator(name: "SM_SC_W4_CALCULATE_H6_BR_EDR_LINK_KEY", value: 97)
!190 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !83, line: 436, size: 32, elements: !191)
!191 = !{!192, !193, !194, !195, !196}
!192 = !DIEnumerator(name: "IRK_LOOKUP_IDLE", value: 0)
!193 = !DIEnumerator(name: "IRK_LOOKUP_W4_READY", value: 1)
!194 = !DIEnumerator(name: "IRK_LOOKUP_STARTED", value: 2)
!195 = !DIEnumerator(name: "IRK_LOOKUP_SUCCEEDED", value: 3)
!196 = !DIEnumerator(name: "IRK_LOOKUP_FAILED", value: 4)
!197 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !83, line: 445, size: 32, elements: !198)
!198 = !{!199, !200, !201, !202}
!199 = !DIEnumerator(name: "AUTHORIZATION_UNKNOWN", value: 0)
!200 = !DIEnumerator(name: "AUTHORIZATION_PENDING", value: 1)
!201 = !DIEnumerator(name: "AUTHORIZATION_DECLINED", value: 2)
!202 = !DIEnumerator(name: "AUTHORIZATION_GRANTED", value: 3)
!203 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !204, line: 157, size: 32, elements: !205)
!204 = !DIFile(filename: "../btstack/Protocol/include/ble/att_server.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!205 = !{!206, !207, !208, !209}
!206 = !DIEnumerator(name: "ATT_SERVER_IDLE", value: 0)
!207 = !DIEnumerator(name: "ATT_SERVER_REQUEST_RECEIVED", value: 1)
!208 = !DIEnumerator(name: "ATT_SERVER_W4_SIGNED_WRITE_VALIDATION", value: 2)
!209 = !DIEnumerator(name: "ATT_SERVER_REQUEST_RECEIVED_AND_VALIDATED", value: 3)
!210 = !{!211, !219, !237, !282, !283, !227, !399, !408, !351}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_item_t", file: !213, line: 100, baseType: !214)
!213 = !DIFile(filename: "../btcommon/btstack_linked_list.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_linked_item_t", file: !213, line: 55, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btstack_linked_item", file: !213, line: 53, size: 32, elements: !216)
!216 = !{!217}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !215, file: !213, line: 54, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "l2cap_channel_t", file: !23, line: 222, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 204, size: 448, elements: !222)
!222 = !{!223, !224, !232, !236, !238, !246}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !221, file: !23, line: 206, baseType: !212, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !221, file: !23, line: 208, baseType: !225, size: 16, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "hci_con_handle_t", file: !226, line: 9, baseType: !227)
!226 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !228, line: 26, baseType: !229)
!228 = !DIFile(filename: "/opt/q32s/include/sys/_stdint.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !230, line: 43, baseType: !231)
!230 = !DIFile(filename: "/opt/q32s/include/machine/_default_types.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!231 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_for_can_send_now", scope: !221, file: !23, line: 211, baseType: !233, size: 8, offset: 48)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !234, line: 11, baseType: !235)
!234 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!235 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !221, file: !23, line: 215, baseType: !237, size: 32, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "packet_handler", scope: !221, file: !23, line: 218, baseType: !239, size: 32, offset: 96)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_packet_handler_t", file: !75, line: 58, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !243, !227, !245, !227}
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !228, line: 20, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !230, line: 29, baseType: !235)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "channel_core_data", scope: !221, file: !23, line: 220, baseType: !247, size: 320, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "channel_core_data_t", file: !23, line: 200, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 178, size: 320, elements: !249)
!249 = !{!250, !252, !253, !254, !255, !256, !261, !262, !263, !264, !265, !266, !267, !270}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "state_var", scope: !248, file: !23, line: 180, baseType: !251, size: 16)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !234, line: 13, baseType: !231)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !248, file: !23, line: 181, baseType: !233, size: 8, offset: 16)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "remote_sig_id", scope: !248, file: !23, line: 183, baseType: !233, size: 8, offset: 24)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "local_sig_id", scope: !248, file: !23, line: 184, baseType: !233, size: 8, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !248, file: !23, line: 186, baseType: !233, size: 8, offset: 40)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !248, file: !23, line: 188, baseType: !257, size: 48, offset: 48)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_addr_t", file: !226, line: 7, baseType: !258)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 48, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 6)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "psm", scope: !248, file: !23, line: 189, baseType: !251, size: 16, offset: 96)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "local_cid", scope: !248, file: !23, line: 191, baseType: !251, size: 16, offset: 112)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "remote_cid", scope: !248, file: !23, line: 192, baseType: !251, size: 16, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "local_mtu", scope: !248, file: !23, line: 194, baseType: !251, size: 16, offset: 144)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "remote_mtu", scope: !248, file: !23, line: 195, baseType: !251, size: 16, offset: 160)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "channel_mode", scope: !248, file: !23, line: 197, baseType: !233, size: 8, offset: 176)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "remote_extended_feature", scope: !248, file: !23, line: 198, baseType: !268, size: 32, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !234, line: 15, baseType: !269)
!269 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "retran_op", scope: !248, file: !23, line: 199, baseType: !271, size: 96, offset: 224)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "retran_flow_ctl_op_t", file: !23, line: 174, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 165, size: 96, elements: !273)
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "retransmission_flow_ctl", scope: !272, file: !23, line: 166, baseType: !233, size: 8)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !272, file: !23, line: 167, baseType: !233, size: 8, offset: 8)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !272, file: !23, line: 168, baseType: !233, size: 8, offset: 16)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window", scope: !272, file: !23, line: 169, baseType: !233, size: 8, offset: 24)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "max_transmit", scope: !272, file: !23, line: 170, baseType: !233, size: 8, offset: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "retransmission_timeout", scope: !272, file: !23, line: 171, baseType: !251, size: 16, offset: 48)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "monitor_timeout", scope: !272, file: !23, line: 172, baseType: !251, size: 16, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "max_pdu", scope: !272, file: !23, line: 173, baseType: !251, size: 16, offset: 80)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "le_hci_connection_t", file: !83, line: 605, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__le_hci_connection", file: !83, line: 571, size: 9792, elements: !286)
!286 = !{!287, !288, !289, !290, !292, !293, !295, !296, !297, !298, !299, !300, !333, !389, !393, !394, !395, !396, !397, !398}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !285, file: !83, line: 572, baseType: !212, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !285, file: !83, line: 574, baseType: !257, size: 48, offset: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "con_handle", scope: !285, file: !83, line: 576, baseType: !225, size: 16, offset: 80)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "address_type", scope: !285, file: !83, line: 578, baseType: !291, size: 32, offset: 96)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_addr_type_t", file: !75, line: 1475, baseType: !74)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "role", scope: !285, file: !83, line: 581, baseType: !243, size: 8, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "le_con_parameter_update_state", scope: !285, file: !83, line: 584, baseType: !294, size: 32, offset: 160)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "le_con_parameter_update_state_t", file: !83, line: 252, baseType: !82)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "le_con_param_update_identifier", scope: !285, file: !83, line: 585, baseType: !243, size: 8, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "le_conn_interval_min", scope: !285, file: !83, line: 586, baseType: !227, size: 16, offset: 208)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "le_conn_interval_max", scope: !285, file: !83, line: 587, baseType: !227, size: 16, offset: 224)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "le_conn_latency", scope: !285, file: !83, line: 588, baseType: !227, size: 16, offset: 240)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "le_supervision_timeout", scope: !285, file: !83, line: 589, baseType: !227, size: 16, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "sm_connection", scope: !285, file: !83, line: 592, baseType: !301, size: 448, offset: 288)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "sm_connection_t", file: !83, line: 475, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sm_connection", file: !83, line: 456, size: 448, elements: !303)
!303 = !{!304, !305, !306, !307, !308, !309, !310, !312, !314, !315, !316, !317, !322, !324, !325, !329, !330, !332}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "sm_handle", scope: !302, file: !83, line: 457, baseType: !225, size: 16)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "sm_role", scope: !302, file: !83, line: 458, baseType: !243, size: 8, offset: 16)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "sm_security_request_received", scope: !302, file: !83, line: 459, baseType: !243, size: 8, offset: 24)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "sm_bonding_requested", scope: !302, file: !83, line: 460, baseType: !243, size: 8, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "sm_peer_addr_type", scope: !302, file: !83, line: 461, baseType: !243, size: 8, offset: 40)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "sm_peer_address", scope: !302, file: !83, line: 462, baseType: !257, size: 48, offset: 48)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "sm_engine_state", scope: !302, file: !83, line: 463, baseType: !311, size: 32, offset: 96)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "security_manager_state_t", file: !83, line: 433, baseType: !90)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "sm_irk_lookup_state", scope: !302, file: !83, line: 464, baseType: !313, size: 32, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "irk_lookup_state_t", file: !83, line: 442, baseType: !190)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "sm_connection_encrypted", scope: !302, file: !83, line: 465, baseType: !243, size: 8, offset: 160)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "sm_connection_authenticated", scope: !302, file: !83, line: 466, baseType: !243, size: 8, offset: 168)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "sm_actual_encryption_key_size", scope: !302, file: !83, line: 467, baseType: !243, size: 8, offset: 176)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "sm_m_preq", scope: !302, file: !83, line: 468, baseType: !318, size: 56, offset: 184)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "sm_pairing_packet_t", file: !83, line: 452, baseType: !319)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 56, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 7)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "sm_connection_authorization_state", scope: !302, file: !83, line: 469, baseType: !323, size: 32, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "authorization_state_t", file: !83, line: 450, baseType: !197)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "sm_local_ediv", scope: !302, file: !83, line: 470, baseType: !227, size: 16, offset: 288)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "sm_local_rand", scope: !302, file: !83, line: 471, baseType: !326, size: 64, offset: 304)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 64, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 8)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "sm_disconn_reason", scope: !302, file: !83, line: 472, baseType: !243, size: 8, offset: 368)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "sm_le_db_index", scope: !302, file: !83, line: 473, baseType: !331, size: 32, offset: 384)
!331 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "sm_timeout_id", scope: !302, file: !83, line: 474, baseType: !331, size: 32, offset: 416)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "att_server", scope: !285, file: !83, line: 595, baseType: !334, size: 4640, offset: 736)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_server_t", file: !204, line: 187, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !204, line: 164, size: 4640, elements: !336)
!336 = !{!337, !339, !340, !341, !342, !343, !344, !364, !375, !376, !380, !381, !382, !383, !384, !385}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !335, file: !204, line: 165, baseType: !338, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_server_state_t", file: !204, line: 162, baseType: !203)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "peer_addr_type", scope: !335, file: !204, line: 167, baseType: !243, size: 8, offset: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "peer_address", scope: !335, file: !204, line: 168, baseType: !257, size: 48, offset: 40)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ir_le_device_db_index", scope: !335, file: !204, line: 170, baseType: !331, size: 32, offset: 96)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ir_lookup_active", scope: !335, file: !204, line: 171, baseType: !331, size: 32, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "value_indication_handle", scope: !335, file: !204, line: 173, baseType: !331, size: 32, offset: 160)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "value_indication_timer", scope: !335, file: !204, line: 174, baseType: !345, size: 160, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_timer_source_t", file: !346, line: 19, baseType: !347)
!346 = !DIFile(filename: "../btcommon/btstack_sys_timer.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btstack_timer_source", file: !346, line: 7, size: 160, elements: !348)
!348 = !{!349, !350, !353, !354, !355, !356, !357, !358, !363}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !347, file: !346, line: 8, baseType: !214, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !347, file: !346, line: 10, baseType: !351, size: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !228, line: 32, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !230, line: 65, baseType: !269)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_interval", scope: !347, file: !346, line: 11, baseType: !351, size: 16, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "timer_type", scope: !347, file: !346, line: 12, baseType: !351, size: 4, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "timer_tick_overflow", scope: !347, file: !346, line: 13, baseType: !351, size: 1, offset: 84, flags: DIFlagBitField, extraData: i64 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "loop_flag", scope: !347, file: !346, line: 14, baseType: !351, size: 1, offset: 85, flags: DIFlagBitField, extraData: i64 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "loop_times", scope: !347, file: !346, line: 15, baseType: !351, size: 10, offset: 86, flags: DIFlagBitField, extraData: i64 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !347, file: !346, line: 17, baseType: !359, size: 32, offset: 96)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 32)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !362}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !347, file: !346, line: 18, baseType: !237, size: 32, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !335, file: !204, line: 176, baseType: !365, size: 80, offset: 352)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_connection_t", file: !366, line: 41, baseType: !367)
!366 = !DIFile(filename: "../btstack/Protocol/include/ble/att_db.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "att_connection", file: !366, line: 34, size: 80, elements: !368)
!368 = !{!369, !370, !371, !372, !373, !374}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "con_handle", scope: !367, file: !366, line: 35, baseType: !225, size: 16)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !367, file: !366, line: 36, baseType: !227, size: 16, offset: 16)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "max_mtu", scope: !367, file: !366, line: 37, baseType: !227, size: 16, offset: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "encryption_key_size", scope: !367, file: !366, line: 38, baseType: !243, size: 8, offset: 48)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !367, file: !366, line: 39, baseType: !243, size: 8, offset: 56)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "authorized", scope: !367, file: !366, line: 40, baseType: !243, size: 8, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "request_size", scope: !335, file: !204, line: 178, baseType: !227, size: 16, offset: 432)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "request_buffer", scope: !335, file: !204, line: 179, baseType: !377, size: 4136, offset: 448)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 4136, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 517)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "flow_hold_flag", scope: !335, file: !204, line: 181, baseType: !243, size: 1, offset: 4584, flags: DIFlagBitField, extraData: i64 4584)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "mtu_request_flag", scope: !335, file: !204, line: 182, baseType: !243, size: 1, offset: 4585, flags: DIFlagBitField, extraData: i64 4584)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "check_remote_tag", scope: !335, file: !204, line: 183, baseType: !243, size: 3, offset: 4586, flags: DIFlagBitField, extraData: i64 4584)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "request_busy", scope: !335, file: !204, line: 184, baseType: !243, size: 1, offset: 4589, flags: DIFlagBitField, extraData: i64 4584)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "reserverd", scope: !335, file: !204, line: 185, baseType: !243, size: 2, offset: 4590, flags: DIFlagBitField, extraData: i64 4584)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "result_callback", scope: !335, file: !204, line: 186, baseType: !386, size: 32, offset: 4608)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 32)
!387 = !DISubroutineType(types: !388)
!388 = !{null, !251, !233}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "acl_recombination_buffer", scope: !285, file: !83, line: 597, baseType: !390, size: 4232, offset: 5376)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 4232, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 529)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "acl_recombination_pos", scope: !285, file: !83, line: 598, baseType: !227, size: 16, offset: 9616)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "acl_recombination_length", scope: !285, file: !83, line: 599, baseType: !227, size: 16, offset: 9632)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "num_acl_packets_sent", scope: !285, file: !83, line: 600, baseType: !243, size: 8, offset: 9648)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "own_id_address", scope: !285, file: !83, line: 602, baseType: !257, size: 48, offset: 9656)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "own_address", scope: !285, file: !83, line: 603, baseType: !257, size: 48, offset: 9704)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "own_address_type", scope: !285, file: !83, line: 604, baseType: !291, size: 32, offset: 9760)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "l2cap_service_t", file: !23, line: 241, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 225, size: 128, elements: !402)
!402 = !{!403, !404, !405, !406, !407}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !401, file: !23, line: 227, baseType: !212, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "psm", scope: !401, file: !23, line: 230, baseType: !251, size: 16, offset: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !401, file: !23, line: 233, baseType: !251, size: 16, offset: 48)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !401, file: !23, line: 236, baseType: !237, size: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "packet_handler", scope: !401, file: !23, line: 239, baseType: !239, size: 32, offset: 96)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "L2CAP_CHANNEL_STATE_VAR", file: !23, line: 164, baseType: !60)
!409 = !{!0, !410, !422, !429, !474, !476, !484}
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "le_con_param_update_identifier", scope: !412, file: !3, line: 2085, type: !233, isLocal: true, isDefinition: true)
!412 = distinct !DISubprogram(name: "gap_request_connection_parameter_update", scope: !3, file: !3, line: 2082, type: !413, isLocal: false, isDefinition: true, scopeLine: 2084, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !415)
!413 = !DISubroutineType(types: !414)
!414 = !{!331, !225, !227, !227, !227, !227}
!415 = !{!416, !417, !418, !419, !420, !421}
!416 = !DILocalVariable(name: "con_handle", arg: 1, scope: !412, file: !3, line: 2082, type: !225)
!417 = !DILocalVariable(name: "conn_interval_min", arg: 2, scope: !412, file: !3, line: 2082, type: !227)
!418 = !DILocalVariable(name: "conn_interval_max", arg: 3, scope: !412, file: !3, line: 2083, type: !227)
!419 = !DILocalVariable(name: "conn_latency", arg: 4, scope: !412, file: !3, line: 2083, type: !227)
!420 = !DILocalVariable(name: "supervision_timeout", arg: 5, scope: !412, file: !3, line: 2083, type: !227)
!421 = !DILocalVariable(name: "connection", scope: !412, file: !3, line: 2087, type: !283)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "hci_event_callback_registration", scope: !2, file: !3, line: 86, type: !424, isLocal: true, isDefinition: true)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_packet_callback_registration_t", file: !75, line: 64, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 61, size: 64, elements: !426)
!426 = !{!427, !428}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !425, file: !75, line: 62, baseType: !212, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !425, file: !75, line: 63, baseType: !239, size: 32, offset: 32)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "l2cap_stack", scope: !2, file: !3, line: 90, type: !431, isLocal: false, isDefinition: true)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "l2cap_stack_t", file: !23, line: 284, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 273, size: 448, elements: !434)
!434 = !{!435, !439, !442, !443}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "packet_handler", scope: !433, file: !23, line: 274, baseType: !436, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 32)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !237, !233, !251, !282, !251}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "l2cap_services", scope: !433, file: !23, line: 279, baseType: !440, size: 32, offset: 32)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_list_t", file: !213, line: 101, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "l2cap_channels", scope: !433, file: !23, line: 280, baseType: !440, size: 32, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "statck_core_data", scope: !433, file: !23, line: 282, baseType: !444, size: 352, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "l2cap_core_data_t", file: !23, line: 271, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 262, size: 352, elements: !446)
!446 = !{!447, !459, !460, !461, !472, !473}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "signaling_responses", scope: !445, file: !23, line: 264, baseType: !448, size: 192)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !449, size: 192, elements: !457)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "l2cap_signaling_response_t", file: !23, line: 251, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "l2cap_signaling_response", file: !23, line: 245, size: 64, elements: !451)
!451 = !{!452, !453, !454, !455, !456}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !450, file: !23, line: 246, baseType: !225, size: 16)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sig_id", scope: !450, file: !23, line: 247, baseType: !233, size: 8, offset: 16)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !450, file: !23, line: 248, baseType: !233, size: 8, offset: 24)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "cid", scope: !450, file: !23, line: 249, baseType: !251, size: 16, offset: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !450, file: !23, line: 250, baseType: !251, size: 16, offset: 48)
!457 = !{!458}
!458 = !DISubrange(count: 3)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "signaling_responses_pending", scope: !445, file: !23, line: 266, baseType: !331, size: 32, offset: 192)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "extended_feature", scope: !445, file: !23, line: 267, baseType: !268, size: 32, offset: 224)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "authentication_flag", scope: !445, file: !23, line: 268, baseType: !462, size: 64, offset: 256)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 64, elements: !470)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "l2cap_authentication_flag_t", file: !23, line: 258, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "authentication_flag", file: !23, line: 253, size: 64, elements: !465)
!465 = !{!466, !467, !468, !469}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !464, file: !23, line: 254, baseType: !257, size: 48)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "in_used", scope: !464, file: !23, line: 255, baseType: !233, size: 4, offset: 48, flags: DIFlagBitField, extraData: i64 48)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "remote_dev_company", scope: !464, file: !23, line: 256, baseType: !233, size: 4, offset: 52, flags: DIFlagBitField, extraData: i64 48)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "authentication_status", scope: !464, file: !23, line: 257, baseType: !233, size: 8, offset: 56)
!470 = !{!471}
!471 = !DISubrange(count: 1)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "l2cap_sig_seq_nr", scope: !445, file: !23, line: 269, baseType: !233, size: 8, offset: 320)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "l2cap_source_cid", scope: !445, file: !23, line: 270, baseType: !251, size: 16, offset: 336)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "le_l2cap_event_packet_handler", scope: !2, file: !3, line: 92, type: !239, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "l2cap_fixed_channels", scope: !2, file: !3, line: 116, type: !478, isLocal: true, isDefinition: true)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 192, elements: !457)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "l2cap_fixed_channel_t", file: !3, line: 114, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "l2cap_fixed_channel", file: !3, line: 111, size: 64, elements: !481)
!481 = !{!482, !483}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !480, file: !3, line: 112, baseType: !239, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_for_can_send_now", scope: !480, file: !3, line: 113, baseType: !243, size: 8, offset: 32)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "le_att_mtu_size", scope: !2, file: !3, line: 983, type: !251, isLocal: true, isDefinition: true)
!486 = !DIFile(filename: "../btcommon/profile_stack_debug.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!487 = !{i32 2, !"Dwarf Version", i32 4}
!488 = !{i32 2, !"Debug Info Version", i32 3}
!489 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!490 = distinct !DISubprogram(name: "l2cap_init", scope: !3, file: !3, line: 137, type: !491, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !493)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !431, !436}
!493 = !{!494, !495}
!494 = !DILocalVariable(name: "stack", arg: 1, scope: !490, file: !3, line: 137, type: !431)
!495 = !DILocalVariable(name: "handler", arg: 2, scope: !490, file: !3, line: 137, type: !436)
!496 = !DILocation(line: 137, column: 32, scope: !490)
!497 = !DILocation(line: 137, column: 46, scope: !490)
!498 = !DILocation(line: 139, column: 17, scope: !490)
!499 = !{!500, !500, i64 0}
!500 = !{!"any pointer", !501, i64 0}
!501 = !{!"omnipotent char", !502, i64 0}
!502 = !{!"Simple C/C++ TBAA"}
!503 = !DILocation(line: 141, column: 35, scope: !490)
!504 = !DILocation(line: 141, column: 52, scope: !490)
!505 = !{!506, !501, i64 52}
!506 = !{!"", !500, i64 0, !500, i64 4, !500, i64 8, !507, i64 12}
!507 = !{!"", !501, i64 0, !508, i64 24, !508, i64 28, !501, i64 32, !501, i64 40, !509, i64 42}
!508 = !{!"int", !501, i64 0}
!509 = !{!"short", !501, i64 0}
!510 = !DILocation(line: 142, column: 35, scope: !490)
!511 = !DILocation(line: 142, column: 52, scope: !490)
!512 = !{!506, !509, i64 54}
!513 = !DILocation(line: 144, column: 35, scope: !490)
!514 = !DILocation(line: 144, column: 63, scope: !490)
!515 = !{!506, !508, i64 36}
!516 = !DILocation(line: 146, column: 18, scope: !490)
!517 = !DILocation(line: 146, column: 33, scope: !490)
!518 = !{!506, !500, i64 8}
!519 = !DILocation(line: 147, column: 18, scope: !490)
!520 = !DILocation(line: 147, column: 33, scope: !490)
!521 = !{!506, !500, i64 4}
!522 = !DILocation(line: 149, column: 18, scope: !490)
!523 = !DILocation(line: 149, column: 33, scope: !490)
!524 = !{!506, !500, i64 0}
!525 = !DILocation(line: 150, column: 5, scope: !490)
!526 = !DILocation(line: 150, column: 36, scope: !490)
!527 = !DILocation(line: 150, column: 53, scope: !490)
!528 = !{!506, !508, i64 40}
!529 = !DILocation(line: 152, column: 35, scope: !490)
!530 = !DILocation(line: 159, column: 9, scope: !531)
!531 = distinct !DILexicalBlock(scope: !490, file: !3, line: 159, column: 9)
!532 = !{!508, !508, i64 0}
!533 = !DILocation(line: 159, column: 9, scope: !490)
!534 = !DILocation(line: 161, column: 50, scope: !535)
!535 = distinct !DILexicalBlock(scope: !531, file: !3, line: 159, column: 50)
!536 = !{!537, !500, i64 4}
!537 = !{!"", !538, i64 0, !500, i64 4}
!538 = !{!"btstack_linked_item", !500, i64 0}
!539 = !DILocation(line: 162, column: 9, scope: !535)
!540 = !DILocation(line: 164, column: 5, scope: !535)
!541 = !DILocation(line: 166, column: 9, scope: !542)
!542 = distinct !DILexicalBlock(scope: !490, file: !3, line: 166, column: 9)
!543 = !DILocation(line: 166, column: 9, scope: !490)
!544 = !DILocation(line: 168, column: 9, scope: !545)
!545 = distinct !DILexicalBlock(scope: !542, file: !3, line: 166, column: 51)
!546 = !DILocation(line: 169, column: 5, scope: !545)
!547 = !DILocation(line: 171, column: 5, scope: !548)
!548 = distinct !DILexicalBlock(scope: !490, file: !3, line: 171, column: 5)
!549 = !{!501, !501, i64 0}
!550 = !DILocation(line: 171, column: 5, scope: !490)
!551 = !DILocation(line: 171, column: 5, scope: !552)
!552 = !DILexicalBlockFile(scope: !548, file: !3, discriminator: 1)
!553 = !DILocation(line: 172, column: 1, scope: !490)
!554 = distinct !DISubprogram(name: "l2cap_hci_event_handler", scope: !3, file: !3, line: 1167, type: !241, isLocal: true, isDefinition: true, scopeLine: 1168, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !555)
!555 = !{!556, !557, !558, !559}
!556 = !DILocalVariable(name: "packet_type", arg: 1, scope: !554, file: !3, line: 1167, type: !243)
!557 = !DILocalVariable(name: "cid", arg: 2, scope: !554, file: !3, line: 1167, type: !227)
!558 = !DILocalVariable(name: "packet", arg: 3, scope: !554, file: !3, line: 1167, type: !245)
!559 = !DILocalVariable(name: "size", arg: 4, scope: !554, file: !3, line: 1167, type: !227)
!560 = !DILocation(line: 1167, column: 45, scope: !554)
!561 = !DILocation(line: 1167, column: 67, scope: !554)
!562 = !DILocation(line: 1167, column: 81, scope: !554)
!563 = !DILocation(line: 1167, column: 98, scope: !554)
!564 = !DILocation(line: 1170, column: 13, scope: !554)
!565 = !DILocation(line: 1170, column: 5, scope: !554)
!566 = !DILocation(line: 1174, column: 9, scope: !567)
!567 = distinct !DILexicalBlock(scope: !554, file: !3, line: 1170, column: 48)
!568 = !DILocation(line: 1176, column: 9, scope: !567)
!569 = !DILocation(line: 1178, column: 9, scope: !567)
!570 = !DILocation(line: 1181, column: 9, scope: !567)
!571 = !DILocation(line: 1182, column: 9, scope: !567)
!572 = !DILocation(line: 1204, column: 1, scope: !554)
!573 = distinct !DISubprogram(name: "le_l2cap_register_packet_handler", scope: !3, file: !3, line: 176, type: !574, isLocal: false, isDefinition: true, scopeLine: 177, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !576)
!574 = !DISubroutineType(types: !575)
!575 = !{null, !240}
!576 = !{!577}
!577 = !DILocalVariable(name: "handler", arg: 1, scope: !573, file: !3, line: 176, type: !240)
!578 = !DILocation(line: 176, column: 46, scope: !573)
!579 = !DILocation(line: 179, column: 9, scope: !580)
!580 = distinct !DILexicalBlock(scope: !573, file: !3, line: 179, column: 9)
!581 = !DILocation(line: 179, column: 9, scope: !573)
!582 = !DILocation(line: 185, column: 1, scope: !573)
!583 = distinct !DISubprogram(name: "check_l2cap_authentication_flag", scope: !3, file: !3, line: 228, type: !584, isLocal: false, isDefinition: true, scopeLine: 229, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !586)
!584 = !DISubroutineType(types: !585)
!585 = !{!233, !245, !233, !233}
!586 = !{!587, !588, !589, !590}
!587 = !DILocalVariable(name: "dev_addr", arg: 1, scope: !583, file: !3, line: 228, type: !245)
!588 = !DILocalVariable(name: "op_flag", arg: 2, scope: !583, file: !3, line: 228, type: !233)
!589 = !DILocalVariable(name: "value", arg: 3, scope: !583, file: !3, line: 228, type: !233)
!590 = !DILocalVariable(name: "i", scope: !583, file: !3, line: 230, type: !331)
!591 = !DILocation(line: 228, column: 46, scope: !583)
!592 = !DILocation(line: 228, column: 59, scope: !583)
!593 = !DILocation(line: 228, column: 71, scope: !583)
!594 = !DILocation(line: 230, column: 9, scope: !583)
!595 = !DILocation(line: 232, column: 14, scope: !596)
!596 = distinct !DILexicalBlock(scope: !597, file: !3, line: 232, column: 13)
!597 = distinct !DILexicalBlock(scope: !598, file: !3, line: 231, column: 44)
!598 = distinct !DILexicalBlock(scope: !599, file: !3, line: 231, column: 5)
!599 = distinct !DILexicalBlock(scope: !583, file: !3, line: 231, column: 5)
!600 = !DILocation(line: 233, column: 13, scope: !596)
!601 = !DILocation(line: 233, column: 71, scope: !602)
!602 = !DILexicalBlockFile(scope: !596, file: !3, discriminator: 1)
!603 = !DILocation(line: 233, column: 79, scope: !602)
!604 = !DILocation(line: 232, column: 13, scope: !605)
!605 = !DILexicalBlockFile(scope: !597, file: !3, discriminator: 1)
!606 = !DILocation(line: 235, column: 17, scope: !607)
!607 = distinct !DILexicalBlock(scope: !596, file: !3, line: 233, column: 101)
!608 = !DILocation(line: 239, column: 71, scope: !609)
!609 = distinct !DILexicalBlock(scope: !610, file: !3, line: 235, column: 56)
!610 = distinct !DILexicalBlock(scope: !607, file: !3, line: 235, column: 17)
!611 = !DILocation(line: 238, column: 90, scope: !609)
!612 = !DILocation(line: 239, column: 93, scope: !609)
!613 = !{!614, !501, i64 7}
!614 = !{!"authentication_flag", !501, i64 0, !501, i64 6, !501, i64 6, !501, i64 7}
!615 = !DILocation(line: 240, column: 13, scope: !609)
!616 = !DILocation(line: 242, column: 71, scope: !617)
!617 = distinct !DILexicalBlock(scope: !618, file: !3, line: 240, column: 61)
!618 = distinct !DILexicalBlock(scope: !610, file: !3, line: 240, column: 24)
!619 = !DILocation(line: 242, column: 93, scope: !617)
!620 = !DILocation(line: 243, column: 13, scope: !617)
!621 = !DILocation(line: 245, column: 90, scope: !622)
!622 = distinct !DILexicalBlock(scope: !623, file: !3, line: 243, column: 65)
!623 = distinct !DILexicalBlock(scope: !618, file: !3, line: 243, column: 24)
!624 = !DILocation(line: 246, column: 13, scope: !622)
!625 = !DILocation(line: 248, column: 78, scope: !626)
!626 = distinct !DILexicalBlock(scope: !627, file: !3, line: 247, column: 58)
!627 = distinct !DILexicalBlock(scope: !607, file: !3, line: 247, column: 17)
!628 = !DILocation(line: 248, column: 17, scope: !626)
!629 = !DILocation(line: 250, column: 78, scope: !630)
!630 = distinct !DILexicalBlock(scope: !627, file: !3, line: 249, column: 20)
!631 = !DILocation(line: 250, column: 17, scope: !630)
!632 = !DILocation(line: 254, column: 18, scope: !633)
!633 = distinct !DILexicalBlock(scope: !583, file: !3, line: 254, column: 9)
!634 = !DILocation(line: 255, column: 9, scope: !633)
!635 = !DILocation(line: 257, column: 71, scope: !636)
!636 = distinct !DILexicalBlock(scope: !637, file: !3, line: 257, column: 17)
!637 = distinct !DILexicalBlock(scope: !638, file: !3, line: 256, column: 48)
!638 = distinct !DILexicalBlock(scope: !639, file: !3, line: 256, column: 9)
!639 = distinct !DILexicalBlock(scope: !640, file: !3, line: 256, column: 9)
!640 = distinct !DILexicalBlock(scope: !633, file: !3, line: 255, column: 55)
!641 = !DILocation(line: 256, column: 9, scope: !642)
!642 = !DILexicalBlockFile(scope: !639, file: !3, discriminator: 1)
!643 = !DILocation(line: 257, column: 17, scope: !637)
!644 = !DILocation(line: 258, column: 17, scope: !645)
!645 = distinct !DILexicalBlock(scope: !636, file: !3, line: 257, column: 100)
!646 = !DILocation(line: 259, column: 79, scope: !645)
!647 = !DILocation(line: 260, column: 21, scope: !645)
!648 = !DILocation(line: 262, column: 96, scope: !649)
!649 = distinct !DILexicalBlock(scope: !650, file: !3, line: 260, column: 58)
!650 = distinct !DILexicalBlock(scope: !645, file: !3, line: 260, column: 21)
!651 = !DILocation(line: 263, column: 93, scope: !649)
!652 = !DILocation(line: 264, column: 17, scope: !649)
!653 = !DILocation(line: 266, column: 96, scope: !654)
!654 = distinct !DILexicalBlock(scope: !650, file: !3, line: 264, column: 24)
!655 = !DILocation(line: 267, column: 93, scope: !654)
!656 = !DILocation(line: 274, column: 1, scope: !583)
!657 = distinct !DISubprogram(name: "remote_dev_company_ioctrl", scope: !3, file: !3, line: 277, type: !584, isLocal: false, isDefinition: true, scopeLine: 278, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !658)
!658 = !{!659, !660, !661, !662}
!659 = !DILocalVariable(name: "dev_addr", arg: 1, scope: !657, file: !3, line: 277, type: !245)
!660 = !DILocalVariable(name: "op_flag", arg: 2, scope: !657, file: !3, line: 277, type: !233)
!661 = !DILocalVariable(name: "value", arg: 3, scope: !657, file: !3, line: 277, type: !233)
!662 = !DILocalVariable(name: "ret", scope: !657, file: !3, line: 279, type: !331)
!663 = !DILocation(line: 277, column: 40, scope: !657)
!664 = !DILocation(line: 277, column: 53, scope: !657)
!665 = !DILocation(line: 277, column: 65, scope: !657)
!666 = !DILocation(line: 280, column: 9, scope: !667)
!667 = distinct !DILexicalBlock(scope: !657, file: !3, line: 280, column: 9)
!668 = !DILocation(line: 285, column: 11, scope: !657)
!669 = !DILocation(line: 286, column: 59, scope: !670)
!670 = !DILexicalBlockFile(scope: !671, file: !3, discriminator: 1)
!671 = distinct !DILexicalBlock(scope: !657, file: !3, line: 286, column: 9)
!672 = !DILocation(line: 286, column: 49, scope: !671)
!673 = !DILocation(line: 287, column: 32, scope: !674)
!674 = distinct !DILexicalBlock(scope: !671, file: !3, line: 286, column: 66)
!675 = !DILocation(line: 287, column: 9, scope: !674)
!676 = !DILocation(line: 288, column: 5, scope: !674)
!677 = !DILocation(line: 289, column: 5, scope: !657)
!678 = distinct !DISubprogram(name: "check_current_sdp_company_type", scope: !3, file: !3, line: 291, type: !679, isLocal: false, isDefinition: true, scopeLine: 292, isOptimized: true, unit: !2, variables: !681)
!679 = !DISubroutineType(types: !680)
!680 = !{!233}
!681 = !{!682, !683, !684}
!682 = !DILocalVariable(name: "company", scope: !678, file: !3, line: 293, type: !233)
!683 = !DILocalVariable(name: "it", scope: !678, file: !3, line: 294, type: !211)
!684 = !DILocalVariable(name: "channel", scope: !685, file: !3, line: 298, type: !219)
!685 = distinct !DILexicalBlock(scope: !686, file: !3, line: 297, column: 9)
!686 = distinct !DILexicalBlock(scope: !687, file: !3, line: 295, column: 82)
!687 = distinct !DILexicalBlock(scope: !688, file: !3, line: 295, column: 5)
!688 = distinct !DILexicalBlock(scope: !678, file: !3, line: 295, column: 5)
!689 = !DILocation(line: 293, column: 8, scope: !678)
!690 = !DILocation(line: 295, column: 33, scope: !688)
!691 = !DILocation(line: 295, column: 46, scope: !688)
!692 = !DILocation(line: 294, column: 20, scope: !678)
!693 = !DILocation(line: 295, column: 5, scope: !694)
!694 = !DILexicalBlockFile(scope: !688, file: !3, discriminator: 1)
!695 = !DILocation(line: 299, column: 44, scope: !696)
!696 = distinct !DILexicalBlock(scope: !685, file: !3, line: 299, column: 17)
!697 = !{!698, !509, i64 28}
!698 = !{!"", !538, i64 0, !509, i64 4, !501, i64 6, !500, i64 8, !500, i64 12, !699, i64 16}
!699 = !{!"", !509, i64 0, !501, i64 2, !501, i64 3, !501, i64 4, !501, i64 5, !501, i64 6, !509, i64 12, !509, i64 14, !509, i64 16, !509, i64 18, !509, i64 20, !501, i64 22, !508, i64 24, !700, i64 28}
!700 = !{!"", !501, i64 0, !501, i64 1, !501, i64 2, !501, i64 3, !501, i64 4, !509, i64 6, !509, i64 8, !509, i64 10}
!701 = !DILocation(line: 299, column: 48, scope: !696)
!702 = !DILocation(line: 299, column: 17, scope: !685)
!703 = !DILocation(line: 299, column: 26, scope: !696)
!704 = !DILocation(line: 302, column: 49, scope: !685)
!705 = !DILocation(line: 277, column: 40, scope: !657, inlinedAt: !706)
!706 = distinct !DILocation(line: 302, column: 23, scope: !685)
!707 = !DILocation(line: 277, column: 53, scope: !657, inlinedAt: !706)
!708 = !DILocation(line: 277, column: 65, scope: !657, inlinedAt: !706)
!709 = !DILocation(line: 285, column: 11, scope: !657, inlinedAt: !706)
!710 = !DILocation(line: 295, column: 76, scope: !711)
!711 = !DILexicalBlockFile(scope: !687, file: !3, discriminator: 2)
!712 = distinct !{!712, !713, !714}
!713 = !DILocation(line: 295, column: 5, scope: !688)
!714 = !DILocation(line: 305, column: 5, scope: !688)
!715 = !DILocation(line: 307, column: 1, scope: !678)
!716 = distinct !DISubprogram(name: "l2cap_dispatch", scope: !3, file: !3, line: 309, type: !717, isLocal: false, isDefinition: true, scopeLine: 310, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !719)
!717 = !DISubroutineType(types: !718)
!718 = !{null, !219, !233, !282, !251}
!719 = !{!720, !721, !722, !723}
!720 = !DILocalVariable(name: "channel", arg: 1, scope: !716, file: !3, line: 309, type: !219)
!721 = !DILocalVariable(name: "type", arg: 2, scope: !716, file: !3, line: 309, type: !233)
!722 = !DILocalVariable(name: "data", arg: 3, scope: !716, file: !3, line: 309, type: !282)
!723 = !DILocalVariable(name: "size", arg: 4, scope: !716, file: !3, line: 309, type: !251)
!724 = !DILocation(line: 309, column: 38, scope: !716)
!725 = !DILocation(line: 309, column: 50, scope: !716)
!726 = !DILocation(line: 309, column: 60, scope: !716)
!727 = !DILocation(line: 309, column: 70, scope: !716)
!728 = !DILocation(line: 311, column: 18, scope: !729)
!729 = distinct !DILexicalBlock(scope: !716, file: !3, line: 311, column: 9)
!730 = !{!698, !500, i64 12}
!731 = !DILocation(line: 311, column: 9, scope: !729)
!732 = !DILocation(line: 314, column: 94, scope: !733)
!733 = distinct !DILexicalBlock(scope: !729, file: !3, line: 313, column: 12)
!734 = !DILocation(line: 311, column: 9, scope: !716)
!735 = !DILocation(line: 312, column: 9, scope: !736)
!736 = distinct !DILexicalBlock(scope: !729, file: !3, line: 311, column: 34)
!737 = !DILocation(line: 313, column: 5, scope: !736)
!738 = !DILocation(line: 314, column: 11, scope: !733)
!739 = !DILocation(line: 314, column: 24, scope: !733)
!740 = !DILocation(line: 314, column: 49, scope: !733)
!741 = !{!698, !500, i64 8}
!742 = !DILocation(line: 314, column: 9, scope: !733)
!743 = !DILocation(line: 316, column: 1, scope: !716)
!744 = distinct !DISubprogram(name: "l2cap_emit_credits", scope: !3, file: !3, line: 366, type: !745, isLocal: false, isDefinition: true, scopeLine: 367, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !747)
!745 = !DISubroutineType(types: !746)
!746 = !{null, !219, !233}
!747 = !{!748, !749, !750}
!748 = !DILocalVariable(name: "channel", arg: 1, scope: !744, file: !3, line: 366, type: !219)
!749 = !DILocalVariable(name: "credits", arg: 2, scope: !744, file: !3, line: 366, type: !233)
!750 = !DILocalVariable(name: "event", scope: !744, file: !3, line: 368, type: !751)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 40, elements: !752)
!752 = !{!753}
!753 = !DISubrange(count: 5)
!754 = !DILocation(line: 366, column: 42, scope: !744)
!755 = !DILocation(line: 366, column: 54, scope: !744)
!756 = !DILocation(line: 368, column: 5, scope: !744)
!757 = !DILocation(line: 368, column: 8, scope: !744)
!758 = !DILocation(line: 372, column: 14, scope: !744)
!759 = !DILocation(line: 373, column: 5, scope: !744)
!760 = !DILocation(line: 373, column: 14, scope: !744)
!761 = !DILocation(line: 374, column: 54, scope: !744)
!762 = !{!698, !509, i64 30}
!763 = !DILocation(line: 374, column: 5, scope: !744)
!764 = !DILocation(line: 375, column: 5, scope: !744)
!765 = !DILocation(line: 375, column: 14, scope: !744)
!766 = !DILocation(line: 376, column: 5, scope: !744)
!767 = !DILocation(line: 377, column: 1, scope: !744)
!768 = distinct !DISubprogram(name: "l2cap_hand_out_credits", scope: !3, file: !3, line: 380, type: !769, isLocal: false, isDefinition: true, scopeLine: 381, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !771)
!769 = !DISubroutineType(types: !770)
!770 = !{null}
!771 = !{!772, !773}
!772 = !DILocalVariable(name: "it", scope: !768, file: !3, line: 383, type: !211)
!773 = !DILocalVariable(name: "channel", scope: !774, file: !3, line: 388, type: !219)
!774 = distinct !DILexicalBlock(scope: !775, file: !3, line: 386, column: 9)
!775 = distinct !DILexicalBlock(scope: !776, file: !3, line: 384, column: 82)
!776 = distinct !DILexicalBlock(scope: !777, file: !3, line: 384, column: 5)
!777 = distinct !DILexicalBlock(scope: !768, file: !3, line: 384, column: 5)
!778 = !DILocation(line: 384, column: 33, scope: !777)
!779 = !DILocation(line: 384, column: 46, scope: !777)
!780 = !DILocation(line: 383, column: 20, scope: !768)
!781 = !DILocation(line: 384, column: 5, scope: !782)
!782 = !DILexicalBlockFile(scope: !777, file: !3, discriminator: 1)
!783 = !DILocation(line: 388, column: 40, scope: !774)
!784 = !DILocation(line: 388, column: 30, scope: !774)
!785 = !DILocation(line: 389, column: 26, scope: !786)
!786 = distinct !DILexicalBlock(scope: !774, file: !3, line: 389, column: 17)
!787 = !DILocation(line: 389, column: 44, scope: !786)
!788 = !{!698, !501, i64 18}
!789 = !DILocation(line: 389, column: 50, scope: !786)
!790 = !DILocation(line: 389, column: 17, scope: !774)
!791 = !DILocation(line: 392, column: 54, scope: !792)
!792 = distinct !DILexicalBlock(scope: !774, file: !3, line: 392, column: 17)
!793 = !{!698, !509, i64 4}
!794 = !DILocation(line: 392, column: 17, scope: !792)
!795 = !DILocation(line: 392, column: 62, scope: !792)
!796 = !DILocation(line: 392, column: 17, scope: !774)
!797 = !DILocation(line: 393, column: 17, scope: !798)
!798 = distinct !DILexicalBlock(scope: !792, file: !3, line: 392, column: 89)
!799 = !DILocation(line: 394, column: 13, scope: !798)
!800 = !DILocation(line: 384, column: 76, scope: !801)
!801 = !DILexicalBlockFile(scope: !776, file: !3, discriminator: 2)
!802 = distinct !{!802, !803, !804}
!803 = !DILocation(line: 384, column: 5, scope: !777)
!804 = !DILocation(line: 396, column: 5, scope: !777)
!805 = !DILocation(line: 397, column: 1, scope: !768)
!806 = distinct !DISubprogram(name: "l2cap_hand_out_credits_for_send", scope: !3, file: !3, line: 399, type: !769, isLocal: false, isDefinition: true, scopeLine: 400, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !807)
!807 = !{!808, !809}
!808 = !DILocalVariable(name: "it", scope: !806, file: !3, line: 402, type: !211)
!809 = !DILocalVariable(name: "channel", scope: !810, file: !3, line: 406, type: !219)
!810 = distinct !DILexicalBlock(scope: !811, file: !3, line: 405, column: 9)
!811 = distinct !DILexicalBlock(scope: !812, file: !3, line: 403, column: 82)
!812 = distinct !DILexicalBlock(scope: !813, file: !3, line: 403, column: 5)
!813 = distinct !DILexicalBlock(scope: !806, file: !3, line: 403, column: 5)
!814 = !DILocation(line: 403, column: 33, scope: !813)
!815 = !DILocation(line: 403, column: 46, scope: !813)
!816 = !DILocation(line: 402, column: 20, scope: !806)
!817 = !DILocation(line: 403, column: 5, scope: !818)
!818 = !DILexicalBlockFile(scope: !813, file: !3, discriminator: 1)
!819 = !DILocation(line: 406, column: 30, scope: !810)
!820 = !DILocation(line: 407, column: 26, scope: !821)
!821 = distinct !DILexicalBlock(scope: !810, file: !3, line: 407, column: 17)
!822 = !DILocation(line: 407, column: 44, scope: !821)
!823 = !DILocation(line: 407, column: 50, scope: !821)
!824 = !DILocation(line: 407, column: 17, scope: !810)
!825 = !DILocation(line: 406, column: 40, scope: !810)
!826 = !DILocation(line: 410, column: 13, scope: !810)
!827 = !DILocation(line: 411, column: 9, scope: !811)
!828 = !DILocation(line: 403, column: 76, scope: !829)
!829 = !DILexicalBlockFile(scope: !812, file: !3, discriminator: 2)
!830 = distinct !{!830, !831, !832}
!831 = !DILocation(line: 403, column: 5, scope: !813)
!832 = !DILocation(line: 412, column: 5, scope: !813)
!833 = !DILocation(line: 413, column: 1, scope: !806)
!834 = distinct !DISubprogram(name: "l2cap_get_local_cid_via_psm", scope: !3, file: !3, line: 452, type: !835, isLocal: false, isDefinition: true, scopeLine: 453, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !837)
!835 = !DISubroutineType(types: !836)
!836 = !{!251, !251}
!837 = !{!838, !839, !840}
!838 = !DILocalVariable(name: "psm", arg: 1, scope: !834, file: !3, line: 452, type: !251)
!839 = !DILocalVariable(name: "it", scope: !834, file: !3, line: 454, type: !211)
!840 = !DILocalVariable(name: "channel", scope: !841, file: !3, line: 457, type: !219)
!841 = distinct !DILexicalBlock(scope: !842, file: !3, line: 456, column: 82)
!842 = distinct !DILexicalBlock(scope: !843, file: !3, line: 456, column: 5)
!843 = distinct !DILexicalBlock(scope: !834, file: !3, line: 456, column: 5)
!844 = !DILocation(line: 452, column: 37, scope: !834)
!845 = !DILocation(line: 456, column: 33, scope: !843)
!846 = !DILocation(line: 456, column: 46, scope: !843)
!847 = !DILocation(line: 454, column: 20, scope: !834)
!848 = !DILocation(line: 456, column: 5, scope: !849)
!849 = !DILexicalBlockFile(scope: !843, file: !3, discriminator: 1)
!850 = !DILocation(line: 458, column: 40, scope: !851)
!851 = distinct !DILexicalBlock(scope: !841, file: !3, line: 458, column: 13)
!852 = !DILocation(line: 458, column: 44, scope: !851)
!853 = !DILocation(line: 458, column: 13, scope: !841)
!854 = !DILocation(line: 458, column: 22, scope: !851)
!855 = !DILocation(line: 459, column: 47, scope: !856)
!856 = distinct !DILexicalBlock(scope: !851, file: !3, line: 458, column: 52)
!857 = !DILocation(line: 456, column: 76, scope: !858)
!858 = !DILexicalBlockFile(scope: !842, file: !3, discriminator: 2)
!859 = distinct !{!859, !860, !861}
!860 = !DILocation(line: 456, column: 5, scope: !843)
!861 = !DILocation(line: 461, column: 5, scope: !843)
!862 = !DILocation(line: 463, column: 1, scope: !834)
!863 = distinct !DISubprogram(name: "l2cap_get_channel_for_local_cid", scope: !3, file: !3, line: 464, type: !864, isLocal: false, isDefinition: true, scopeLine: 465, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !866)
!864 = !DISubroutineType(types: !865)
!865 = !{!219, !251}
!866 = !{!867, !868, !869}
!867 = !DILocalVariable(name: "local_cid", arg: 1, scope: !863, file: !3, line: 464, type: !251)
!868 = !DILocalVariable(name: "it", scope: !863, file: !3, line: 466, type: !211)
!869 = !DILocalVariable(name: "channel", scope: !870, file: !3, line: 470, type: !219)
!870 = distinct !DILexicalBlock(scope: !871, file: !3, line: 469, column: 82)
!871 = distinct !DILexicalBlock(scope: !872, file: !3, line: 469, column: 5)
!872 = distinct !DILexicalBlock(scope: !863, file: !3, line: 469, column: 5)
!873 = !DILocation(line: 464, column: 54, scope: !863)
!874 = !DILocation(line: 468, column: 5, scope: !863)
!875 = !DILocation(line: 469, column: 33, scope: !872)
!876 = !DILocation(line: 469, column: 46, scope: !872)
!877 = !DILocation(line: 466, column: 20, scope: !863)
!878 = !DILocation(line: 469, column: 5, scope: !879)
!879 = !DILexicalBlockFile(scope: !872, file: !3, discriminator: 1)
!880 = !DILocation(line: 470, column: 26, scope: !870)
!881 = !DILocation(line: 471, column: 22, scope: !882)
!882 = distinct !DILexicalBlock(scope: !870, file: !3, line: 471, column: 13)
!883 = !DILocation(line: 471, column: 40, scope: !882)
!884 = !DILocation(line: 471, column: 50, scope: !882)
!885 = !DILocation(line: 471, column: 13, scope: !870)
!886 = !DILocation(line: 470, column: 36, scope: !870)
!887 = !DILocation(line: 472, column: 13, scope: !888)
!888 = distinct !DILexicalBlock(scope: !882, file: !3, line: 471, column: 64)
!889 = !DILocation(line: 469, column: 76, scope: !890)
!890 = !DILexicalBlockFile(scope: !871, file: !3, discriminator: 2)
!891 = distinct !{!891, !892, !893}
!892 = !DILocation(line: 469, column: 5, scope: !872)
!893 = !DILocation(line: 475, column: 5, scope: !872)
!894 = !DILocation(line: 477, column: 5, scope: !863)
!895 = !DILocation(line: 478, column: 5, scope: !863)
!896 = !DILocation(line: 479, column: 1, scope: !863)
!897 = distinct !DISubprogram(name: "l2cap_can_send_packet_now", scope: !3, file: !3, line: 481, type: !898, isLocal: false, isDefinition: true, scopeLine: 482, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !900)
!898 = !DISubroutineType(types: !899)
!899 = !{!331, !251}
!900 = !{!901, !902}
!901 = !DILocalVariable(name: "local_cid", arg: 1, scope: !897, file: !3, line: 481, type: !251)
!902 = !DILocalVariable(name: "channel", scope: !897, file: !3, line: 483, type: !219)
!903 = !DILocation(line: 481, column: 36, scope: !897)
!904 = !DILocation(line: 483, column: 32, scope: !897)
!905 = !DILocation(line: 483, column: 22, scope: !897)
!906 = !DILocation(line: 485, column: 9, scope: !907)
!907 = distinct !DILexicalBlock(scope: !908, file: !3, line: 484, column: 19)
!908 = distinct !DILexicalBlock(scope: !897, file: !3, line: 484, column: 9)
!909 = !DILocation(line: 488, column: 1, scope: !897)
!910 = distinct !DISubprogram(name: "l2cap_get_remote_mtu_for_local_cid", scope: !3, file: !3, line: 490, type: !835, isLocal: false, isDefinition: true, scopeLine: 491, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !911)
!911 = !{!912, !913}
!912 = !DILocalVariable(name: "local_cid", arg: 1, scope: !910, file: !3, line: 490, type: !251)
!913 = !DILocalVariable(name: "channel", scope: !910, file: !3, line: 492, type: !219)
!914 = !DILocation(line: 490, column: 44, scope: !910)
!915 = !DILocation(line: 492, column: 32, scope: !910)
!916 = !DILocation(line: 492, column: 22, scope: !910)
!917 = !DILocation(line: 493, column: 9, scope: !918)
!918 = distinct !DILexicalBlock(scope: !910, file: !3, line: 493, column: 9)
!919 = !DILocation(line: 493, column: 9, scope: !910)
!920 = !DILocation(line: 494, column: 43, scope: !921)
!921 = distinct !DILexicalBlock(scope: !918, file: !3, line: 493, column: 18)
!922 = !{!698, !509, i64 36}
!923 = !DILocation(line: 494, column: 9, scope: !921)
!924 = !DILocation(line: 497, column: 1, scope: !910)
!925 = distinct !DISubprogram(name: "l2cap_send_signaling_packet", scope: !3, file: !3, line: 499, type: !926, isLocal: false, isDefinition: true, scopeLine: 500, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !929)
!926 = !DISubroutineType(types: !927)
!927 = !{!331, !225, !928, !268, null}
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "L2CAP_SIGNALING_COMMANDS", file: !41, line: 71, baseType: !40)
!929 = !{!930, !931, !932, !933, !934, !940}
!930 = !DILocalVariable(name: "handle", arg: 1, scope: !925, file: !3, line: 499, type: !225)
!931 = !DILocalVariable(name: "cmd", arg: 2, scope: !925, file: !3, line: 499, type: !928)
!932 = !DILocalVariable(name: "identifier", arg: 3, scope: !925, file: !3, line: 499, type: !268)
!933 = !DILocalVariable(name: "acl_buffer", scope: !925, file: !3, line: 502, type: !282)
!934 = !DILocalVariable(name: "argptr", scope: !925, file: !3, line: 503, type: !935)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !936, line: 30, baseType: !937)
!936 = !DIFile(filename: "/opt/q32s/bin/../lib/clang/4.0.1/include/stdarg.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 503, baseType: !938)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 32)
!939 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!940 = !DILocalVariable(name: "len", scope: !925, file: !3, line: 504, type: !251)
!941 = !DILocation(line: 499, column: 50, scope: !925)
!942 = !DILocation(line: 499, column: 83, scope: !925)
!943 = !DILocation(line: 499, column: 92, scope: !925)
!944 = !DILocation(line: 503, column: 5, scope: !925)
!945 = !DILocation(line: 506, column: 5, scope: !925)
!946 = !DILocation(line: 507, column: 39, scope: !925)
!947 = !DILocation(line: 503, column: 13, scope: !925)
!948 = !DILocation(line: 507, column: 11, scope: !925)
!949 = !DILocation(line: 504, column: 9, scope: !925)
!950 = !DILocation(line: 508, column: 5, scope: !925)
!951 = !DILocation(line: 510, column: 18, scope: !925)
!952 = !DILocation(line: 502, column: 9, scope: !925)
!953 = !DILocation(line: 511, column: 5, scope: !954)
!954 = !DILexicalBlockFile(scope: !955, file: !3, discriminator: 1)
!955 = distinct !DILexicalBlock(scope: !956, file: !3, line: 511, column: 5)
!956 = distinct !DILexicalBlock(scope: !925, file: !3, line: 511, column: 5)
!957 = !DILocation(line: 511, column: 5, scope: !958)
!958 = !DILexicalBlockFile(scope: !956, file: !3, discriminator: 1)
!959 = !DILocation(line: 511, column: 5, scope: !960)
!960 = !DILexicalBlockFile(scope: !961, file: !3, discriminator: 2)
!961 = distinct !DILexicalBlock(scope: !955, file: !3, line: 511, column: 5)
!962 = !DILocation(line: 511, column: 5, scope: !963)
!963 = !DILexicalBlockFile(scope: !964, file: !3, discriminator: 3)
!964 = distinct !DILexicalBlock(scope: !965, file: !3, line: 511, column: 5)
!965 = distinct !DILexicalBlock(scope: !961, file: !3, line: 511, column: 5)
!966 = !DILocation(line: 511, column: 5, scope: !967)
!967 = !DILexicalBlockFile(scope: !964, file: !3, discriminator: 9)
!968 = !DILocation(line: 511, column: 5, scope: !969)
!969 = !DILexicalBlockFile(scope: !964, file: !3, discriminator: 10)
!970 = !DILocation(line: 511, column: 5, scope: !971)
!971 = !DILexicalBlockFile(scope: !972, file: !3, discriminator: 5)
!972 = distinct !DILexicalBlock(scope: !955, file: !3, line: 511, column: 5)
!973 = !DILocation(line: 511, column: 5, scope: !974)
!974 = !DILexicalBlockFile(scope: !975, file: !3, discriminator: 6)
!975 = distinct !DILexicalBlock(scope: !976, file: !3, line: 511, column: 5)
!976 = distinct !DILexicalBlock(scope: !972, file: !3, line: 511, column: 5)
!977 = !DILocation(line: 512, column: 5, scope: !925)
!978 = !DILocation(line: 513, column: 74, scope: !925)
!979 = !DILocation(line: 513, column: 86, scope: !925)
!980 = !DILocation(line: 513, column: 11, scope: !925)
!981 = !DILocation(line: 514, column: 5, scope: !925)
!982 = !DILocation(line: 516, column: 50, scope: !925)
!983 = !DILocation(line: 516, column: 12, scope: !925)
!984 = !DILocation(line: 517, column: 1, scope: !925)
!985 = !DILocation(line: 516, column: 5, scope: !925)
!986 = distinct !DISubprogram(name: "cpu_reset", scope: !234, file: !234, line: 145, type: !769, isLocal: true, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !987)
!987 = !{}
!988 = !DILocation(line: 148, column: 5, scope: !986)
!989 = !DILocation(line: 149, column: 1, scope: !986)
!990 = distinct !DISubprogram(name: "l2cap_send_prepared", scope: !3, file: !3, line: 585, type: !991, isLocal: false, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !993)
!991 = !DISubroutineType(types: !992)
!992 = !{!331, !282, !251, !251, !233}
!993 = !{!994, !995, !996, !997, !998, !999}
!994 = !DILocalVariable(name: "acl_buffer", arg: 1, scope: !990, file: !3, line: 585, type: !282)
!995 = !DILocalVariable(name: "local_cid", arg: 2, scope: !990, file: !3, line: 585, type: !251)
!996 = !DILocalVariable(name: "len", arg: 3, scope: !990, file: !3, line: 585, type: !251)
!997 = !DILocalVariable(name: "flag", arg: 4, scope: !990, file: !3, line: 585, type: !233)
!998 = !DILocalVariable(name: "err", scope: !990, file: !3, line: 588, type: !331)
!999 = !DILocalVariable(name: "channel", scope: !990, file: !3, line: 589, type: !219)
!1000 = !DILocation(line: 585, column: 29, scope: !990)
!1001 = !DILocation(line: 585, column: 46, scope: !990)
!1002 = !DILocation(line: 585, column: 61, scope: !990)
!1003 = !DILocation(line: 585, column: 69, scope: !990)
!1004 = !DILocation(line: 590, column: 15, scope: !990)
!1005 = !DILocation(line: 589, column: 22, scope: !990)
!1006 = !DILocation(line: 591, column: 10, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !990, file: !3, line: 591, column: 9)
!1008 = !DILocation(line: 591, column: 9, scope: !990)
!1009 = !DILocation(line: 592, column: 9, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1011, file: !3, line: 592, column: 9)
!1011 = distinct !DILexicalBlock(scope: !1007, file: !3, line: 591, column: 19)
!1012 = !DILocation(line: 592, column: 9, scope: !1011)
!1013 = !DILocation(line: 592, column: 9, scope: !1014)
!1014 = !DILexicalBlockFile(scope: !1010, file: !3, discriminator: 1)
!1015 = !DILocation(line: 596, column: 5, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !990, file: !3, line: 596, column: 5)
!1017 = !DILocation(line: 596, column: 5, scope: !990)
!1018 = !DILocation(line: 601, column: 41, scope: !990)
!1019 = !DILocation(line: 596, column: 5, scope: !1020)
!1020 = !DILexicalBlockFile(scope: !1016, file: !3, discriminator: 1)
!1021 = !DILocation(line: 601, column: 48, scope: !990)
!1022 = !DILocation(line: 601, column: 5, scope: !990)
!1023 = !DILocation(line: 603, column: 33, scope: !990)
!1024 = !DILocation(line: 603, column: 37, scope: !990)
!1025 = !DILocation(line: 603, column: 5, scope: !990)
!1026 = !DILocation(line: 605, column: 5, scope: !990)
!1027 = !DILocation(line: 607, column: 59, scope: !990)
!1028 = !{!698, !509, i64 32}
!1029 = !DILocation(line: 607, column: 5, scope: !990)
!1030 = !DILocation(line: 609, column: 53, scope: !990)
!1031 = !DILocation(line: 609, column: 11, scope: !990)
!1032 = !DILocation(line: 588, column: 9, scope: !990)
!1033 = !DILocation(line: 611, column: 5, scope: !990)
!1034 = !DILocation(line: 612, column: 1, scope: !990)
!1035 = distinct !DISubprogram(name: "l2cap_send_internal", scope: !3, file: !3, line: 616, type: !1036, isLocal: false, isDefinition: true, scopeLine: 617, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1038)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!331, !251, !282, !251, !233}
!1038 = !{!1039, !1040, !1041, !1042, !1043, !1044}
!1039 = !DILocalVariable(name: "local_cid", arg: 1, scope: !1035, file: !3, line: 616, type: !251)
!1040 = !DILocalVariable(name: "data", arg: 2, scope: !1035, file: !3, line: 616, type: !282)
!1041 = !DILocalVariable(name: "len", arg: 3, scope: !1035, file: !3, line: 616, type: !251)
!1042 = !DILocalVariable(name: "flag", arg: 4, scope: !1035, file: !3, line: 616, type: !233)
!1043 = !DILocalVariable(name: "acl_buffer", scope: !1035, file: !3, line: 619, type: !282)
!1044 = !DILocalVariable(name: "channel", scope: !1035, file: !3, line: 620, type: !219)
!1045 = !DILocation(line: 616, column: 29, scope: !1035)
!1046 = !DILocation(line: 616, column: 44, scope: !1035)
!1047 = !DILocation(line: 616, column: 54, scope: !1035)
!1048 = !DILocation(line: 616, column: 62, scope: !1035)
!1049 = !DILocation(line: 621, column: 15, scope: !1035)
!1050 = !DILocation(line: 620, column: 22, scope: !1035)
!1051 = !DILocation(line: 622, column: 10, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 622, column: 9)
!1053 = !DILocation(line: 622, column: 9, scope: !1035)
!1054 = !DILocation(line: 625, column: 53, scope: !1035)
!1055 = !DILocation(line: 625, column: 57, scope: !1035)
!1056 = !DILocation(line: 625, column: 18, scope: !1035)
!1057 = !DILocation(line: 619, column: 9, scope: !1035)
!1058 = !DILocation(line: 626, column: 5, scope: !1059)
!1059 = !DILexicalBlockFile(scope: !1060, file: !3, discriminator: 1)
!1060 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 626, column: 5)
!1061 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 626, column: 5)
!1062 = !DILocation(line: 626, column: 5, scope: !1063)
!1063 = !DILexicalBlockFile(scope: !1061, file: !3, discriminator: 1)
!1064 = !DILocation(line: 626, column: 5, scope: !1065)
!1065 = !DILexicalBlockFile(scope: !1066, file: !3, discriminator: 2)
!1066 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 626, column: 5)
!1067 = !DILocation(line: 626, column: 5, scope: !1068)
!1068 = !DILexicalBlockFile(scope: !1069, file: !3, discriminator: 3)
!1069 = distinct !DILexicalBlock(scope: !1070, file: !3, line: 626, column: 5)
!1070 = distinct !DILexicalBlock(scope: !1066, file: !3, line: 626, column: 5)
!1071 = !DILocation(line: 626, column: 5, scope: !1072)
!1072 = !DILexicalBlockFile(scope: !1069, file: !3, discriminator: 9)
!1073 = !DILocation(line: 626, column: 5, scope: !1074)
!1074 = !DILexicalBlockFile(scope: !1069, file: !3, discriminator: 10)
!1075 = !DILocation(line: 626, column: 5, scope: !1076)
!1076 = !DILexicalBlockFile(scope: !1077, file: !3, discriminator: 5)
!1077 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 626, column: 5)
!1078 = !DILocation(line: 626, column: 5, scope: !1079)
!1079 = !DILexicalBlockFile(scope: !1080, file: !3, discriminator: 6)
!1080 = distinct !DILexicalBlock(scope: !1081, file: !3, line: 626, column: 5)
!1081 = distinct !DILexicalBlock(scope: !1077, file: !3, line: 626, column: 5)
!1082 = !DILocation(line: 627, column: 36, scope: !1083)
!1083 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 627, column: 9)
!1084 = !{!698, !501, i64 38}
!1085 = !DILocation(line: 627, column: 49, scope: !1083)
!1086 = !DILocation(line: 627, column: 9, scope: !1035)
!1087 = !DILocation(line: 630, column: 17, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1083, file: !3, line: 627, column: 55)
!1089 = !DILocation(line: 630, column: 9, scope: !1088)
!1090 = !DILocation(line: 631, column: 16, scope: !1088)
!1091 = !DILocation(line: 631, column: 9, scope: !1088)
!1092 = !DILocation(line: 641, column: 1, scope: !1035)
!1093 = distinct !DISubprogram(name: "l2cap_run", scope: !3, file: !3, line: 657, type: !769, isLocal: false, isDefinition: true, scopeLine: 658, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1094)
!1094 = !{!1095, !1096, !1098, !1099, !1100, !1101, !1102, !1103, !1107, !1108, !1109, !1114, !1118, !1122, !1131}
!1095 = !DILocalVariable(name: "send_acl_packet", scope: !1093, file: !3, line: 660, type: !233)
!1096 = !DILocalVariable(name: "connect_addr", scope: !1093, file: !3, line: 661, type: !1097)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 48, elements: !259)
!1098 = !DILocalVariable(name: "handle", scope: !1093, file: !3, line: 662, type: !225)
!1099 = !DILocalVariable(name: "sig_id", scope: !1093, file: !3, line: 663, type: !233)
!1100 = !DILocalVariable(name: "infoType", scope: !1093, file: !3, line: 664, type: !251)
!1101 = !DILocalVariable(name: "result", scope: !1093, file: !3, line: 665, type: !251)
!1102 = !DILocalVariable(name: "i", scope: !1093, file: !3, line: 666, type: !331)
!1103 = !DILocalVariable(name: "config_options", scope: !1093, file: !3, line: 667, type: !1104)
!1104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 96, elements: !1105)
!1105 = !{!1106}
!1106 = !DISubrange(count: 12)
!1107 = !DILocalVariable(name: "it", scope: !1093, file: !3, line: 668, type: !211)
!1108 = !DILocalVariable(name: "next", scope: !1093, file: !3, line: 669, type: !211)
!1109 = !DILocalVariable(name: "features", scope: !1110, file: !3, line: 693, type: !268)
!1110 = distinct !DILexicalBlock(scope: !1111, file: !3, line: 692, column: 32)
!1111 = distinct !DILexicalBlock(scope: !1112, file: !3, line: 692, column: 17)
!1112 = distinct !DILexicalBlock(scope: !1113, file: !3, line: 679, column: 76)
!1113 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 672, column: 71)
!1114 = !DILocalVariable(name: "channel", scope: !1115, file: !3, line: 755, type: !219)
!1115 = distinct !DILexicalBlock(scope: !1116, file: !3, line: 754, column: 78)
!1116 = distinct !DILexicalBlock(scope: !1117, file: !3, line: 754, column: 5)
!1117 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 754, column: 5)
!1118 = !DILocalVariable(name: "flags", scope: !1119, file: !3, line: 832, type: !251)
!1119 = distinct !DILexicalBlock(scope: !1120, file: !3, line: 831, column: 95)
!1120 = distinct !DILexicalBlock(scope: !1121, file: !3, line: 831, column: 17)
!1121 = distinct !DILexicalBlock(scope: !1115, file: !3, line: 761, column: 51)
!1122 = !DILocalVariable(name: "ble_it", scope: !1123, file: !3, line: 929, type: !1125)
!1123 = distinct !DILexicalBlock(scope: !1124, file: !3, line: 926, column: 50)
!1124 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 926, column: 9)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_linked_list_iterator_t", file: !213, line: 65, baseType: !1126)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !213, line: 61, size: 96, elements: !1127)
!1127 = !{!1128, !1129, !1130}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "advance_on_next", scope: !1126, file: !213, line: 62, baseType: !331, size: 32)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1126, file: !213, line: 63, baseType: !441, size: 32, offset: 32)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !1126, file: !213, line: 64, baseType: !441, size: 32, offset: 64)
!1131 = !DILocalVariable(name: "connection", scope: !1132, file: !3, line: 936, type: !283)
!1132 = distinct !DILexicalBlock(scope: !1123, file: !3, line: 932, column: 56)
!1133 = !DILocation(line: 660, column: 8, scope: !1093)
!1134 = !DILocation(line: 661, column: 5, scope: !1093)
!1135 = !DILocation(line: 661, column: 8, scope: !1093)
!1136 = !DILocation(line: 667, column: 5, scope: !1093)
!1137 = !DILocation(line: 667, column: 9, scope: !1093)
!1138 = !DILocation(line: 672, column: 12, scope: !1139)
!1139 = !DILexicalBlockFile(scope: !1093, file: !3, discriminator: 1)
!1140 = !DILocation(line: 672, column: 42, scope: !1139)
!1141 = !DILocation(line: 672, column: 5, scope: !1139)
!1142 = !DILocation(line: 674, column: 71, scope: !1113)
!1143 = !{!1144, !509, i64 0}
!1144 = !{!"l2cap_signaling_response", !509, i64 0, !501, i64 2, !501, i64 3, !509, i64 4, !509, i64 6}
!1145 = !DILocation(line: 662, column: 22, scope: !1093)
!1146 = !DILocation(line: 675, column: 71, scope: !1113)
!1147 = !{!1144, !501, i64 2}
!1148 = !DILocation(line: 663, column: 8, scope: !1093)
!1149 = !DILocation(line: 676, column: 73, scope: !1113)
!1150 = !{!1144, !509, i64 6}
!1151 = !DILocation(line: 664, column: 9, scope: !1093)
!1152 = !DILocation(line: 665, column: 9, scope: !1093)
!1153 = !DILocation(line: 679, column: 70, scope: !1113)
!1154 = !{!1144, !501, i64 3}
!1155 = !DILocation(line: 679, column: 9, scope: !1113)
!1156 = !DILocation(line: 681, column: 13, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1112, file: !3, line: 681, column: 13)
!1158 = !DILocation(line: 681, column: 13, scope: !1112)
!1159 = !DILocation(line: 681, column: 13, scope: !1160)
!1160 = !DILexicalBlockFile(scope: !1157, file: !3, discriminator: 1)
!1161 = !DILocation(line: 682, column: 70, scope: !1112)
!1162 = !DILocation(line: 682, column: 84, scope: !1112)
!1163 = !DILocation(line: 682, column: 13, scope: !1112)
!1164 = !DILocation(line: 683, column: 13, scope: !1112)
!1165 = !DILocation(line: 691, column: 13, scope: !1166)
!1166 = distinct !DILexicalBlock(scope: !1112, file: !3, line: 691, column: 13)
!1167 = !DILocation(line: 691, column: 13, scope: !1112)
!1168 = !DILocation(line: 691, column: 13, scope: !1169)
!1169 = !DILexicalBlockFile(scope: !1166, file: !3, discriminator: 1)
!1170 = !DILocation(line: 692, column: 26, scope: !1111)
!1171 = !DILocation(line: 692, column: 17, scope: !1112)
!1172 = !DILocation(line: 693, column: 17, scope: !1110)
!1173 = !DILocation(line: 693, column: 32, scope: !1110)
!1174 = !DILocation(line: 693, column: 62, scope: !1110)
!1175 = !DILocation(line: 693, column: 21, scope: !1110)
!1176 = !DILocation(line: 695, column: 75, scope: !1110)
!1177 = !DILocation(line: 695, column: 17, scope: !1110)
!1178 = !DILocation(line: 696, column: 13, scope: !1111)
!1179 = !DILocation(line: 696, column: 13, scope: !1110)
!1180 = !DILocation(line: 698, column: 75, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1111, file: !3, line: 696, column: 20)
!1182 = !DILocation(line: 698, column: 17, scope: !1181)
!1183 = !DILocation(line: 702, column: 13, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1112, file: !3, line: 702, column: 13)
!1185 = !DILocation(line: 702, column: 13, scope: !1112)
!1186 = !DILocation(line: 702, column: 13, scope: !1187)
!1187 = !DILexicalBlockFile(scope: !1184, file: !3, discriminator: 1)
!1188 = !DILocation(line: 703, column: 65, scope: !1112)
!1189 = !DILocation(line: 703, column: 73, scope: !1112)
!1190 = !DILocation(line: 703, column: 13, scope: !1112)
!1191 = !DILocation(line: 704, column: 13, scope: !1112)
!1192 = !DILocation(line: 709, column: 17, scope: !1112)
!1193 = !DILocation(line: 710, column: 22, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1195, file: !3, line: 710, column: 21)
!1195 = distinct !DILexicalBlock(scope: !1196, file: !3, line: 709, column: 58)
!1196 = distinct !DILexicalBlock(scope: !1112, file: !3, line: 709, column: 17)
!1197 = !DILocation(line: 710, column: 21, scope: !1195)
!1198 = !DILocation(line: 715, column: 93, scope: !1195)
!1199 = !DILocation(line: 715, column: 113, scope: !1195)
!1200 = !DILocation(line: 715, column: 17, scope: !1195)
!1201 = !DILocation(line: 716, column: 13, scope: !1195)
!1202 = !DILocation(line: 721, column: 17, scope: !1112)
!1203 = !DILocation(line: 722, column: 22, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !1205, file: !3, line: 722, column: 21)
!1205 = distinct !DILexicalBlock(scope: !1206, file: !3, line: 721, column: 58)
!1206 = distinct !DILexicalBlock(scope: !1112, file: !3, line: 721, column: 17)
!1207 = !DILocation(line: 722, column: 21, scope: !1205)
!1208 = !DILocation(line: 727, column: 72, scope: !1205)
!1209 = !DILocation(line: 727, column: 80, scope: !1205)
!1210 = !DILocation(line: 727, column: 17, scope: !1205)
!1211 = !DILocation(line: 728, column: 13, scope: !1205)
!1212 = !DILocation(line: 740, column: 13, scope: !1113)
!1213 = distinct !{!1213, !1214, !1215}
!1214 = !DILocation(line: 672, column: 5, scope: !1093)
!1215 = !DILocation(line: 751, column: 5, scope: !1093)
!1216 = !DILocation(line: 746, column: 66, scope: !1113)
!1217 = !DILocation(line: 666, column: 9, scope: !1093)
!1218 = !DILocation(line: 748, column: 23, scope: !1219)
!1219 = !DILexicalBlockFile(scope: !1220, file: !3, discriminator: 1)
!1220 = distinct !DILexicalBlock(scope: !1221, file: !3, line: 748, column: 9)
!1221 = distinct !DILexicalBlock(scope: !1113, file: !3, line: 748, column: 9)
!1222 = !DILocation(line: 748, column: 9, scope: !1223)
!1223 = !DILexicalBlockFile(scope: !1221, file: !3, discriminator: 1)
!1224 = !DILocation(line: 749, column: 21, scope: !1225)
!1225 = distinct !DILexicalBlock(scope: !1220, file: !3, line: 748, column: 89)
!1226 = !DILocation(line: 749, column: 128, scope: !1225)
!1227 = !DILocation(line: 749, column: 76, scope: !1225)
!1228 = !DILocation(line: 749, column: 13, scope: !1225)
!1229 = !DILocation(line: 748, column: 55, scope: !1219)
!1230 = distinct !{!1230, !1231, !1232}
!1231 = !DILocation(line: 748, column: 9, scope: !1221)
!1232 = !DILocation(line: 750, column: 9, scope: !1221)
!1233 = !DILocation(line: 754, column: 46, scope: !1117)
!1234 = !DILocation(line: 668, column: 20, scope: !1093)
!1235 = !DILocation(line: 754, column: 5, scope: !1236)
!1236 = !DILexicalBlockFile(scope: !1117, file: !3, discriminator: 1)
!1237 = !DILocation(line: 757, column: 20, scope: !1115)
!1238 = !{!538, !500, i64 0}
!1239 = !DILocation(line: 669, column: 20, scope: !1093)
!1240 = !DILocation(line: 755, column: 26, scope: !1115)
!1241 = !DILocation(line: 761, column: 26, scope: !1115)
!1242 = !DILocation(line: 761, column: 44, scope: !1115)
!1243 = !DILocation(line: 761, column: 9, scope: !1115)
!1244 = !DILocation(line: 764, column: 13, scope: !1245)
!1245 = distinct !DILexicalBlock(scope: !1121, file: !3, line: 764, column: 13)
!1246 = !DILocation(line: 764, column: 13, scope: !1121)
!1247 = !DILocation(line: 764, column: 13, scope: !1248)
!1248 = !DILexicalBlockFile(scope: !1245, file: !3, discriminator: 1)
!1249 = !DILocation(line: 764, column: 13, scope: !1250)
!1250 = !DILexicalBlockFile(scope: !1245, file: !3, discriminator: 2)
!1251 = !DILocation(line: 766, column: 46, scope: !1121)
!1252 = !DILocation(line: 768, column: 13, scope: !1121)
!1253 = !DILocation(line: 769, column: 53, scope: !1121)
!1254 = !DILocation(line: 769, column: 13, scope: !1255)
!1255 = !DILexicalBlockFile(scope: !1121, file: !3, discriminator: 1)
!1256 = !DILocation(line: 773, column: 13, scope: !1121)
!1257 = !DILocation(line: 776, column: 13, scope: !1258)
!1258 = distinct !DILexicalBlock(scope: !1121, file: !3, line: 776, column: 13)
!1259 = !DILocation(line: 776, column: 13, scope: !1121)
!1260 = !DILocation(line: 776, column: 13, scope: !1261)
!1261 = !DILexicalBlockFile(scope: !1258, file: !3, discriminator: 1)
!1262 = !DILocation(line: 777, column: 50, scope: !1121)
!1263 = !DILocation(line: 777, column: 106, scope: !1121)
!1264 = !{!698, !501, i64 19}
!1265 = !DILocation(line: 777, column: 79, scope: !1121)
!1266 = !DILocation(line: 777, column: 154, scope: !1121)
!1267 = !{!698, !501, i64 21}
!1268 = !DILocation(line: 777, column: 127, scope: !1121)
!1269 = !DILocation(line: 777, column: 13, scope: !1121)
!1270 = !DILocation(line: 778, column: 44, scope: !1271)
!1271 = distinct !DILexicalBlock(scope: !1121, file: !3, line: 778, column: 17)
!1272 = !DILocation(line: 778, column: 51, scope: !1271)
!1273 = !DILocation(line: 778, column: 17, scope: !1121)
!1274 = !DILocation(line: 780, column: 50, scope: !1275)
!1275 = distinct !DILexicalBlock(scope: !1271, file: !3, line: 778, column: 62)
!1276 = !DILocation(line: 781, column: 13, scope: !1275)
!1277 = !DILocation(line: 783, column: 17, scope: !1278)
!1278 = distinct !DILexicalBlock(scope: !1271, file: !3, line: 781, column: 20)
!1279 = !DILocation(line: 784, column: 51, scope: !1278)
!1280 = !DILocation(line: 784, column: 17, scope: !1278)
!1281 = !DILocation(line: 789, column: 13, scope: !1282)
!1282 = distinct !DILexicalBlock(scope: !1121, file: !3, line: 789, column: 13)
!1283 = !DILocation(line: 789, column: 13, scope: !1121)
!1284 = !DILocation(line: 789, column: 13, scope: !1285)
!1285 = !DILexicalBlockFile(scope: !1282, file: !3, discriminator: 1)
!1286 = !DILocation(line: 790, column: 46, scope: !1121)
!1287 = !DILocalVariable(name: "channel", arg: 1, scope: !1288, file: !3, line: 644, type: !219)
!1288 = distinct !DISubprogram(name: "channelStateVarSetFlag", scope: !3, file: !3, line: 644, type: !1289, isLocal: true, isDefinition: true, scopeLine: 645, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1291)
!1289 = !DISubroutineType(types: !1290)
!1290 = !{null, !219, !408}
!1291 = !{!1287, !1292}
!1292 = !DILocalVariable(name: "flag", arg: 2, scope: !1288, file: !3, line: 644, type: !408)
!1293 = !DILocation(line: 644, column: 56, scope: !1288, inlinedAt: !1294)
!1294 = distinct !DILocation(line: 791, column: 13, scope: !1121)
!1295 = !DILocation(line: 644, column: 89, scope: !1288, inlinedAt: !1294)
!1296 = !DILocation(line: 646, column: 97, scope: !1288, inlinedAt: !1294)
!1297 = !{!698, !509, i64 16}
!1298 = !DILocation(line: 646, column: 107, scope: !1288, inlinedAt: !1294)
!1299 = !DILocation(line: 646, column: 42, scope: !1288, inlinedAt: !1294)
!1300 = !DILocation(line: 805, column: 50, scope: !1121)
!1301 = !DILocation(line: 805, column: 106, scope: !1121)
!1302 = !DILocation(line: 805, column: 79, scope: !1121)
!1303 = !DILocation(line: 805, column: 148, scope: !1121)
!1304 = !DILocation(line: 805, column: 121, scope: !1121)
!1305 = !DILocation(line: 805, column: 186, scope: !1121)
!1306 = !DILocation(line: 805, column: 159, scope: !1121)
!1307 = !DILocation(line: 805, column: 13, scope: !1121)
!1308 = !DILocation(line: 806, column: 13, scope: !1121)
!1309 = !DILocation(line: 811, column: 49, scope: !1310)
!1310 = distinct !DILexicalBlock(scope: !1121, file: !3, line: 811, column: 17)
!1311 = !DILocation(line: 811, column: 17, scope: !1310)
!1312 = !DILocation(line: 811, column: 115, scope: !1310)
!1313 = !DILocation(line: 812, column: 17, scope: !1310)
!1314 = !DILocation(line: 812, column: 21, scope: !1315)
!1315 = !DILexicalBlockFile(scope: !1310, file: !3, discriminator: 1)
!1316 = !DILocation(line: 812, column: 41, scope: !1315)
!1317 = !{!1318, !509, i64 8}
!1318 = !{!"_stack_config", !508, i64 0, !509, i64 4, !509, i64 6, !509, i64 8, !509, i64 10, !509, i64 12, !501, i64 14, !501, i64 15, !501, i64 16, !501, i64 17, !501, i64 17, !501, i64 17, !501, i64 17, !501, i64 18, !501, i64 18, !501, i64 18, !501, i64 18, !501, i64 18, !501, i64 18, !501, i64 18, !501, i64 18, !501, i64 19, !501, i64 19, !501, i64 19, !501, i64 19, !501, i64 19, !501, i64 19, !501, i64 19, !501, i64 19, !501, i64 20, !501, i64 20, !501, i64 20, !501, i64 21, !501, i64 22, !501, i64 23, !501, i64 24, !501, i64 25, !501, i64 31, !501, i64 31}
!1319 = !DILocation(line: 812, column: 61, scope: !1315)
!1320 = !DILocation(line: 811, column: 17, scope: !1255)
!1321 = !DILocation(line: 813, column: 17, scope: !1322)
!1322 = distinct !DILexicalBlock(scope: !1323, file: !3, line: 813, column: 17)
!1323 = distinct !DILexicalBlock(scope: !1310, file: !3, line: 812, column: 68)
!1324 = !DILocation(line: 813, column: 17, scope: !1323)
!1325 = distinct !{!1325, !1326, !1327}
!1326 = !DILocation(line: 754, column: 5, scope: !1117)
!1327 = !DILocation(line: 923, column: 5, scope: !1117)
!1328 = !DILocation(line: 813, column: 17, scope: !1329)
!1329 = !DILexicalBlockFile(scope: !1322, file: !3, discriminator: 1)
!1330 = !DILocation(line: 819, column: 48, scope: !1331)
!1331 = distinct !DILexicalBlock(scope: !1332, file: !3, line: 819, column: 21)
!1332 = distinct !DILexicalBlock(scope: !1310, file: !3, line: 818, column: 20)
!1333 = !DILocation(line: 819, column: 54, scope: !1331)
!1334 = !DILocation(line: 819, column: 21, scope: !1332)
!1335 = !DILocation(line: 822, column: 17, scope: !1336)
!1336 = distinct !DILexicalBlock(scope: !1332, file: !3, line: 822, column: 17)
!1337 = !DILocation(line: 822, column: 17, scope: !1332)
!1338 = !DILocation(line: 822, column: 17, scope: !1339)
!1339 = !DILexicalBlockFile(scope: !1336, file: !3, discriminator: 1)
!1340 = !DILocation(line: 123, column: 9, scope: !1341, inlinedAt: !1343)
!1341 = distinct !DILexicalBlock(scope: !1342, file: !3, line: 123, column: 9)
!1342 = distinct !DISubprogram(name: "l2cap_next_sig_id", scope: !3, file: !3, line: 121, type: !679, isLocal: true, isDefinition: true, scopeLine: 122, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !987)
!1343 = distinct !DILocation(line: 823, column: 59, scope: !1332)
!1344 = !DILocation(line: 123, column: 39, scope: !1341, inlinedAt: !1343)
!1345 = !DILocation(line: 123, column: 56, scope: !1341, inlinedAt: !1343)
!1346 = !DILocation(line: 126, column: 55, scope: !1347, inlinedAt: !1343)
!1347 = distinct !DILexicalBlock(scope: !1341, file: !3, line: 125, column: 12)
!1348 = !DILocation(line: 123, column: 9, scope: !1342, inlinedAt: !1343)
!1349 = !DILocation(line: 823, column: 44, scope: !1332)
!1350 = !DILocation(line: 823, column: 57, scope: !1332)
!1351 = !{!698, !501, i64 20}
!1352 = !DILocation(line: 824, column: 51, scope: !1332)
!1353 = !DILocation(line: 825, column: 54, scope: !1332)
!1354 = !DILocation(line: 825, column: 83, scope: !1332)
!1355 = !DILocation(line: 825, column: 17, scope: !1332)
!1356 = !DILocation(line: 830, column: 13, scope: !1357)
!1357 = distinct !DILexicalBlock(scope: !1121, file: !3, line: 830, column: 13)
!1358 = !DILocation(line: 830, column: 13, scope: !1121)
!1359 = !DILocation(line: 830, column: 13, scope: !1360)
!1360 = !DILexicalBlockFile(scope: !1357, file: !3, discriminator: 1)
!1361 = !DILocation(line: 831, column: 44, scope: !1120)
!1362 = !DILocation(line: 831, column: 17, scope: !1120)
!1363 = !DILocation(line: 831, column: 54, scope: !1120)
!1364 = !DILocation(line: 831, column: 17, scope: !1121)
!1365 = !DILocation(line: 832, column: 21, scope: !1119)
!1366 = !DILocalVariable(name: "channel", arg: 1, scope: !1367, file: !3, line: 649, type: !219)
!1367 = distinct !DISubprogram(name: "channelStateVarClearFlag", scope: !3, file: !3, line: 649, type: !1289, isLocal: true, isDefinition: true, scopeLine: 650, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1368)
!1368 = !{!1366, !1369}
!1369 = !DILocalVariable(name: "flag", arg: 2, scope: !1367, file: !3, line: 649, type: !408)
!1370 = !DILocation(line: 649, column: 58, scope: !1367, inlinedAt: !1371)
!1371 = distinct !DILocation(line: 833, column: 17, scope: !1119)
!1372 = !DILocation(line: 649, column: 91, scope: !1367, inlinedAt: !1371)
!1373 = !DILocation(line: 651, column: 107, scope: !1367, inlinedAt: !1371)
!1374 = !DILocation(line: 834, column: 58, scope: !1375)
!1375 = distinct !DILexicalBlock(scope: !1119, file: !3, line: 834, column: 21)
!1376 = !DILocation(line: 644, column: 56, scope: !1288, inlinedAt: !1377)
!1377 = distinct !DILocation(line: 837, column: 21, scope: !1378)
!1378 = distinct !DILexicalBlock(scope: !1375, file: !3, line: 836, column: 24)
!1379 = !DILocation(line: 644, column: 89, scope: !1288, inlinedAt: !1377)
!1380 = !DILocation(line: 834, column: 21, scope: !1119)
!1381 = !DILocation(line: 651, column: 42, scope: !1367, inlinedAt: !1371)
!1382 = !DILocation(line: 839, column: 21, scope: !1383)
!1383 = distinct !DILexicalBlock(scope: !1119, file: !3, line: 839, column: 21)
!1384 = !DILocation(line: 839, column: 58, scope: !1383)
!1385 = !DILocation(line: 839, column: 21, scope: !1119)
!1386 = !DILocation(line: 841, column: 68, scope: !1387)
!1387 = distinct !DILexicalBlock(scope: !1383, file: !3, line: 839, column: 107)
!1388 = !DILocation(line: 841, column: 78, scope: !1387)
!1389 = !{!698, !501, i64 47}
!1390 = !DILocation(line: 841, column: 39, scope: !1387)
!1391 = !DILocation(line: 842, column: 39, scope: !1387)
!1392 = !DILocation(line: 843, column: 89, scope: !1387)
!1393 = !{!698, !509, i64 52}
!1394 = !DILocation(line: 843, column: 21, scope: !1387)
!1395 = !DILocation(line: 844, column: 58, scope: !1387)
!1396 = !DILocation(line: 844, column: 113, scope: !1387)
!1397 = !DILocation(line: 844, column: 86, scope: !1387)
!1398 = !DILocation(line: 844, column: 155, scope: !1387)
!1399 = !DILocation(line: 844, column: 128, scope: !1387)
!1400 = !DILocation(line: 844, column: 21, scope: !1387)
!1401 = !DILocation(line: 845, column: 21, scope: !1402)
!1402 = distinct !DILexicalBlock(scope: !1387, file: !3, line: 845, column: 21)
!1403 = !DILocation(line: 845, column: 21, scope: !1387)
!1404 = !DILocation(line: 845, column: 21, scope: !1405)
!1405 = !DILexicalBlockFile(scope: !1402, file: !3, discriminator: 1)
!1406 = !DILocation(line: 649, column: 58, scope: !1367, inlinedAt: !1407)
!1407 = distinct !DILocation(line: 846, column: 21, scope: !1387)
!1408 = !DILocation(line: 649, column: 91, scope: !1367, inlinedAt: !1407)
!1409 = !DILocation(line: 651, column: 97, scope: !1367, inlinedAt: !1407)
!1410 = !DILocation(line: 651, column: 107, scope: !1367, inlinedAt: !1407)
!1411 = !DILocation(line: 651, column: 42, scope: !1367, inlinedAt: !1407)
!1412 = !DILocation(line: 848, column: 17, scope: !1387)
!1413 = !DILocation(line: 848, column: 65, scope: !1414)
!1414 = !DILexicalBlockFile(scope: !1415, file: !3, discriminator: 1)
!1415 = distinct !DILexicalBlock(scope: !1383, file: !3, line: 848, column: 28)
!1416 = !DILocation(line: 848, column: 28, scope: !1417)
!1417 = !DILexicalBlockFile(scope: !1383, file: !3, discriminator: 1)
!1418 = !DILocation(line: 849, column: 21, scope: !1419)
!1419 = distinct !DILexicalBlock(scope: !1420, file: !3, line: 849, column: 21)
!1420 = distinct !DILexicalBlock(scope: !1415, file: !3, line: 848, column: 110)
!1421 = !DILocation(line: 849, column: 21, scope: !1420)
!1422 = !DILocation(line: 849, column: 21, scope: !1423)
!1423 = !DILexicalBlockFile(scope: !1419, file: !3, discriminator: 1)
