temp.o:	file format ELF32-i386

.debug_info contents:
0x00000000: Compile Unit: length = 0x00002f61 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x00002f65)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)")
              DW_AT_language	(DW_LANG_C99)
              DW_AT_name	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/common/l2cap.c")
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
              DW_AT_GNU_pubnames	(true)
              DW_AT_low_pc	(0x0000000000000000)
              DW_AT_ranges	(0x000000e0
                 [0x00000000 - 0x000008b8)
                 [0x000008b8 - 0x00005a81)
                 [0x00000000 - 0x00000009)
                 [0x00000009 - 0x00000011))

0x00000026:   DW_TAG_variable
                DW_AT_name	("app_info_debug_enable")
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/profile_stack_debug.h")
                DW_AT_decl_line	(190)
                DW_AT_location	(DW_OP_addr 0x0)


                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_byte_size	(0x04)

0x0000003e:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000004781)
                DW_AT_high_pc	(0x0000000000004838)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("gap_request_connection_parameter_update")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/common/l2cap.c")
                DW_AT_decl_line	(2082)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)

0x00000054:     DW_TAG_variable
                  DW_AT_name	("le_con_param_update_identifier")
                  DW_AT_type	(cu + 0x00c7 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/common/l2cap.c")
                  DW_AT_decl_line	(2085)
                  DW_AT_location	(DW_OP_addr 0x2)

0x00000066:     DW_TAG_formal_parameter
                  DW_AT_location	(0x000016b0
                     0x0000000000004781 - 0x00000000000047f2: DW_OP_reg7 EDI)
                  DW_AT_name	("con_handle")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/common/l2cap.c")
                  DW_AT_decl_line	(2082)
                  DW_AT_type	(cu + 0x02f9 "hci_con_handle_t")

0x00000076:     DW_TAG_formal_parameter
                  DW_AT_location	(0x000016c3
                     0x0000000000004781 - 0x00000000000047b4: DW_OP_reg6 ESI
                     0x00000000000047b4 - 0x0000000000004838: DW_OP_breg5 EBP-20)
                  DW_AT_name	("conn_interval_min")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/common/l2cap.c")
                  DW_AT_decl_line	(2082)
                  DW_AT_type	(cu + 0x017e "uint16_t")

0x00000086:     DW_TAG_formal_parameter
                  DW_AT_location	(0x000016e2
                     0x0000000000004781 - 0x00000000000047b0: DW_OP_reg2 EDX
                     0x00000000000047b0 - 0x0000000000004838: DW_OP_breg5 EBP-18)
                  DW_AT_name	("conn_interval_max")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/common/l2cap.c")
                  DW_AT_decl_line	(2083)
                  DW_AT_type	(cu + 0x017e "uint16_t")

0x00000096:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00001701
                     0x0000000000004781 - 0x00000000000047ac: DW_OP_reg1 ECX
                     0x00000000000047ac - 0x0000000000004838: DW_OP_breg5 EBP-16)
                  DW_AT_name	("conn_latency")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/common/l2cap.c")
                  DW_AT_decl_line	(2083)
                  DW_AT_type	(cu + 0x017e "uint16_t")

0x000000a6:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00001720
                     0x0000000000004781 - 0x00000000000047a8: DW_OP_reg0 EAX
                     0x00000000000047a8 - 0x0000000000004838: DW_OP_breg5 EBP-14)
                  DW_AT_name	("supervision_timeout")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/common/l2cap.c")
                  DW_AT_decl_line	(2083)
                  DW_AT_type	(cu + 0x017e "uint16_t")

0x000000b6:     DW_TAG_variable
                  DW_AT_location	(0x0000173f
                     0x00000000000047be - 0x00000000000047c4: DW_OP_reg0 EAX
                     0x00000000000047c4 - 0x0000000000004838: DW_OP_breg5 EBP-24)
                  DW_AT_name	("connection")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/common/l2cap.c")
                  DW_AT_decl_line	(2087)
                  DW_AT_type	(cu + 0x0a0f "le_hci_connection_t*")

0x000000c6:     NULL

0x000000c7:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00d2 "unsigned char")
                DW_AT_name	("u8")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(11)

0x000000d2:   DW_TAG_base_type
                DW_AT_name	("unsigned char")
                DW_AT_encoding	(DW_ATE_unsigned_char)
                DW_AT_byte_size	(0x01)

0x000000d9:   DW_TAG_variable
                DW_AT_name	("hci_event_callback_registration")
                DW_AT_type	(cu + 0x00ea "btstack_packet_callback_registration_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/common/l2cap.c")
                DW_AT_decl_line	(86)
                DW_AT_location	(DW_OP_addr 0x8)

0x000000ea:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00f5 "structure ")
                DW_AT_name	("btstack_packet_callback_registration_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(64)

0x000000f5:   DW_TAG_structure_type
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(61)

0x000000f9:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x0112 "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                  DW_AT_decl_line	(62)
                  DW_AT_data_member_location	(0x00)

0x00000105:     DW_TAG_member
                  DW_AT_name	("callback")
                  DW_AT_type	(cu + 0x0142 "btstack_packet_handler_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                  DW_AT_decl_line	(63)
                  DW_AT_data_member_location	(0x04)

0x00000111:     NULL

0x00000112:   DW_TAG_typedef
                DW_AT_type	(cu + 0x011d "btstack_linked_item_t")
                DW_AT_name	("linked_item_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(100)

0x0000011d:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0128 "btstack_linked_item")
                DW_AT_name	("btstack_linked_item_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(55)

0x00000128:   DW_TAG_structure_type
                DW_AT_name	("btstack_linked_item")
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(53)

0x00000130:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(cu + 0x013d "btstack_linked_item*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                  DW_AT_decl_line	(54)
                  DW_AT_data_member_location	(0x00)

0x0000013c:     NULL

0x0000013d:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0128 "btstack_linked_item")

0x00000142:   DW_TAG_typedef
                DW_AT_type	(cu + 0x014d "subroutine *")
                DW_AT_name	("btstack_packet_handler_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(58)

0x0000014d:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0152 "subroutine ")

0x00000152:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x00000153:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0168 "uint8_t")

0x00000158:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x017e "uint16_t")

0x0000015d:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x019b "uint8_t*")

0x00000162:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x017e "uint16_t")

0x00000167:     NULL

0x00000168:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0173 "__uint8_t")
                DW_AT_name	("uint8_t")
                DW_AT_decl_file	("/opt/q32s/include/sys/_stdint.h")
                DW_AT_decl_line	(20)

0x00000173:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00d2 "unsigned char")
                DW_AT_name	("__uint8_t")
                DW_AT_decl_file	("/opt/q32s/include/machine/_default_types.h")
                DW_AT_decl_line	(29)

0x0000017e:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0189 "__uint16_t")
                DW_AT_name	("uint16_t")
                DW_AT_decl_file	("/opt/q32s/include/sys/_stdint.h")
                DW_AT_decl_line	(26)

0x00000189:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0194 "unsigned short")
                DW_AT_name	("__uint16_t")
                DW_AT_decl_file	("/opt/q32s/include/machine/_default_types.h")
                DW_AT_decl_line	(43)

0x00000194:   DW_TAG_base_type
                DW_AT_name	("unsigned short")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x02)

0x0000019b:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0168 "uint8_t")

0x000001a0:   DW_TAG_variable
                DW_AT_name	("l2cap_stack")
                DW_AT_type	(cu + 0x01b1 "l2cap_stack_t*")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/common/l2cap.c")
                DW_AT_decl_line	(90)
                DW_AT_location	(DW_OP_addr 0x0)

0x000001b1:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x01b6 "l2cap_stack_t")

0x000001b6:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01c2 "structure ")
                DW_AT_name	("l2cap_stack_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(284)

0x000001c2:   DW_TAG_structure_type
                DW_AT_byte_size	(0x38)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(273)

0x000001c7:     DW_TAG_member
                  DW_AT_name	("packet_handler")
                  DW_AT_type	(cu + 0x01fc "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(274)
                  DW_AT_data_member_location	(0x00)

0x000001d4:     DW_TAG_member
                  DW_AT_name	("l2cap_services")
                  DW_AT_type	(cu + 0x022d "linked_list_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(279)
                  DW_AT_data_member_location	(0x04)

0x000001e1:     DW_TAG_member
                  DW_AT_name	("l2cap_channels")
                  DW_AT_type	(cu + 0x022d "linked_list_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(280)
                  DW_AT_data_member_location	(0x08)

0x000001ee:     DW_TAG_member
                  DW_AT_name	("statck_core_data")
                  DW_AT_type	(cu + 0x023d "l2cap_core_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(282)
                  DW_AT_data_member_location	(0x0c)

0x000001fb:     NULL

0x000001fc:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0201 "subroutine ")

0x00000201:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x00000202:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x021c "*")

0x00000207:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x00c7 "u8")

0x0000020c:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x021d "u16")

0x00000211:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0228 "u8*")

0x00000216:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x021d "u16")

0x0000021b:     NULL

0x0000021c:   DW_TAG_pointer_type

0x0000021d:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0194 "unsigned short")
                DW_AT_name	("u16")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(13)

0x00000228:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x00c7 "u8")

0x0000022d:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0238 "btstack_linked_item_t*")
                DW_AT_name	("linked_list_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(101)

0x00000238:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x011d "btstack_linked_item_t")

0x0000023d:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0249 "structure ")
                DW_AT_name	("l2cap_core_data_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(271)

0x00000249:   DW_TAG_structure_type
                DW_AT_byte_size	(0x2c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(262)

0x0000024e:     DW_TAG_member
                  DW_AT_name	("signaling_responses")
                  DW_AT_type	(cu + 0x029d "l2cap_signaling_response_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(264)
                  DW_AT_data_member_location	(0x00)

0x0000025b:     DW_TAG_member
                  DW_AT_name	("signaling_responses_pending")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(266)
                  DW_AT_data_member_location	(0x18)

0x00000268:     DW_TAG_member
                  DW_AT_name	("extended_feature")
                  DW_AT_type	(cu + 0x030b "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(267)
                  DW_AT_data_member_location	(0x1c)

0x00000275:     DW_TAG_member
                  DW_AT_name	("authentication_flag")
                  DW_AT_type	(cu + 0x031d "l2cap_authentication_flag_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(268)
                  DW_AT_data_member_location	(0x20)

0x00000282:     DW_TAG_member
                  DW_AT_name	("l2cap_sig_seq_nr")
                  DW_AT_type	(cu + 0x00c7 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(269)
                  DW_AT_data_member_location	(0x28)

0x0000028f:     DW_TAG_member
                  DW_AT_name	("l2cap_source_cid")
                  DW_AT_type	(cu + 0x021d "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(270)
                  DW_AT_data_member_location	(0x2a)

0x0000029c:     NULL

0x0000029d:   DW_TAG_array_type
                DW_AT_type	(cu + 0x02a9 "l2cap_signaling_response_t")

0x000002a2:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0304 "sizetype")
                  DW_AT_count	(0x03)

0x000002a8:     NULL

0x000002a9:   DW_TAG_typedef
                DW_AT_type	(cu + 0x02b4 "l2cap_signaling_response")
                DW_AT_name	("l2cap_signaling_response_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(251)

0x000002b4:   DW_TAG_structure_type
                DW_AT_name	("l2cap_signaling_response")
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(245)

0x000002bc:     DW_TAG_member
                  DW_AT_name	("handle")
                  DW_AT_type	(cu + 0x02f9 "hci_con_handle_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(246)
                  DW_AT_data_member_location	(0x00)

0x000002c8:     DW_TAG_member
                  DW_AT_name	("sig_id")
                  DW_AT_type	(cu + 0x00c7 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(247)
                  DW_AT_data_member_location	(0x02)

0x000002d4:     DW_TAG_member
                  DW_AT_name	("code")
                  DW_AT_type	(cu + 0x00c7 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(248)
                  DW_AT_data_member_location	(0x03)

0x000002e0:     DW_TAG_member
                  DW_AT_name	("cid")
                  DW_AT_type	(cu + 0x021d "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(249)
                  DW_AT_data_member_location	(0x04)

0x000002ec:     DW_TAG_member
                  DW_AT_name	("data")
                  DW_AT_type	(cu + 0x021d "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(250)
                  DW_AT_data_member_location	(0x06)

0x000002f8:     NULL

0x000002f9:   DW_TAG_typedef
                DW_AT_type	(cu + 0x017e "uint16_t")
                DW_AT_name	("hci_con_handle_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h")
                DW_AT_decl_line	(9)

0x00000304:   DW_TAG_base_type
                DW_AT_name	("sizetype")
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_unsigned)

0x0000030b:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0316 "unsigned int")
                DW_AT_name	("u32")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(15)

0x00000316:   DW_TAG_base_type
                DW_AT_name	("unsigned int")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x04)

0x0000031d:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0329 "l2cap_authentication_flag_t")

0x00000322:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0304 "sizetype")
                  DW_AT_count	(0x01)

0x00000328:     NULL

0x00000329:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0335 "authentication_flag")
                DW_AT_name	("l2cap_authentication_flag_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(258)

0x00000335:   DW_TAG_structure_type
                DW_AT_name	("authentication_flag")
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(253)

0x0000033d:     DW_TAG_member
                  DW_AT_name	("addr")
                  DW_AT_type	(cu + 0x0376 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(254)
                  DW_AT_data_member_location	(0x00)

0x00000349:     DW_TAG_member
                  DW_AT_name	("in_used")
                  DW_AT_type	(cu + 0x00c7 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(255)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x06)

0x00000358:     DW_TAG_member
                  DW_AT_name	("remote_dev_company")
                  DW_AT_type	(cu + 0x00c7 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(256)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x06)

0x00000368:     DW_TAG_member
                  DW_AT_name	("authentication_status")
                  DW_AT_type	(cu + 0x00c7 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(257)
                  DW_AT_data_member_location	(0x07)

0x00000375:     NULL

0x00000376:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0381 "uint8_t[]")
                DW_AT_name	("bd_addr_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h")
                DW_AT_decl_line	(7)

0x00000381:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0168 "uint8_t")

0x00000386:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0304 "sizetype")
                  DW_AT_count	(0x06)

0x0000038c:     NULL

0x0000038d:   DW_TAG_variable
                DW_AT_name	("le_l2cap_event_packet_handler")
                DW_AT_type	(cu + 0x0142 "btstack_packet_handler_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/common/l2cap.c")
                DW_AT_decl_line	(92)
                DW_AT_location	(DW_OP_addr 0x4)

0x0000039e:   DW_TAG_variable
                DW_AT_name	("l2cap_fixed_channels")
                DW_AT_type	(cu + 0x03af "l2cap_fixed_channel_t[]")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/common/l2cap.c")
                DW_AT_decl_line	(116)
                DW_AT_location	(DW_OP_addr 0x10)

0x000003af:   DW_TAG_array_type
                DW_AT_type	(cu + 0x03bb "l2cap_fixed_channel_t")

0x000003b4:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0304 "sizetype")
                  DW_AT_count	(0x03)

0x000003ba:     NULL

0x000003bb:   DW_TAG_typedef
                DW_AT_type	(cu + 0x03c6 "l2cap_fixed_channel")
                DW_AT_name	("l2cap_fixed_channel_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/common/l2cap.c")
                DW_AT_decl_line	(114)

0x000003c6:   DW_TAG_structure_type
                DW_AT_name	("l2cap_fixed_channel")
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/common/l2cap.c")
                DW_AT_decl_line	(111)

0x000003ce:     DW_TAG_member
                  DW_AT_name	("callback")
                  DW_AT_type	(cu + 0x0142 "btstack_packet_handler_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/common/l2cap.c")
                  DW_AT_decl_line	(112)
                  DW_AT_data_member_location	(0x00)

0x000003da:     DW_TAG_member
                  DW_AT_name	("waiting_for_can_send_now")
                  DW_AT_type	(cu + 0x0168 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/common/l2cap.c")
                  DW_AT_decl_line	(113)
                  DW_AT_data_member_location	(0x04)

0x000003e6:     NULL

0x000003e7:   DW_TAG_variable
                DW_AT_name	("le_att_mtu_size")
                DW_AT_type	(cu + 0x021d "u16")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/common/l2cap.c")
                DW_AT_decl_line	(983)
                DW_AT_location	(DW_OP_addr 0x0)

0x000003f9:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/common/l2cap.c")
                DW_AT_decl_line	(75)

0x000003fd:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_NOT_AUTHENTICATION")
                  DW_AT_const_value	(32)

0x00000403:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_WAIT_AUTHENTICATION")
                  DW_AT_const_value	(33)

0x00000409:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_AUTHENTICATION_COMPLETE")
                  DW_AT_const_value	(34)

0x0000040f:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_READ_AUTHENTICATION")
                  DW_AT_const_value	(35)

0x00000415:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_SET_AUTHENTICATION")
                  DW_AT_const_value	(36)

0x0000041b:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_CLEAR_AUTHENTICATION")
                  DW_AT_const_value	(37)

0x00000421:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_SET_REMOTE_DEV_COMPANY")
                  DW_AT_const_value	(38)

0x00000427:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_GET_REMOTE_DEV_COMPANY")
                  DW_AT_const_value	(39)

0x0000042d:     NULL

0x0000042e:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                DW_AT_decl_line	(631)

0x00000433:     DW_TAG_enumerator
                  DW_AT_name	("REMOTE_DEV_UNKNOWN")
                  DW_AT_const_value	(0)

0x00000439:     DW_TAG_enumerator
                  DW_AT_name	("REMOTE_DEV_ANDROID")
                  DW_AT_const_value	(1)

0x0000043f:     DW_TAG_enumerator
                  DW_AT_name	("REMOTE_DEV_IOS")
                  DW_AT_const_value	(2)

0x00000445:     DW_TAG_enumerator
                  DW_AT_name	("REMOTE_DEV_XIAOMI")
                  DW_AT_const_value	(3)

0x0000044b:     NULL

0x0000044c:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(133)

0x00000450:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_STATE_CLOSED")
                  DW_AT_const_value	(1)

0x00000456:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_STATE_WILL_SEND_CREATE_CONNECTION")
                  DW_AT_const_value	(2)

0x0000045c:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_STATE_WAIT_CONNECTION_COMPLETE")
                  DW_AT_const_value	(3)

0x00000462:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_STATE_WAIT_CLIENT_ACCEPT_OR_REJECT")
                  DW_AT_const_value	(4)

0x00000468:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_STATE_WAIT_INFORMATION_RSP")
                  DW_AT_const_value	(5)

0x0000046e:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_STATE_WAIT_CONNECT_RSP")
                  DW_AT_const_value	(6)

0x00000474:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_STATE_CONFIG")
                  DW_AT_const_value	(7)

0x0000047a:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_STATE_OPEN")
                  DW_AT_const_value	(8)

0x00000480:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_STATE_WAIT_DISCONNECT")
                  DW_AT_const_value	(9)

0x00000486:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_STATE_WILL_SEND_CONNECTION_REQUEST")
                  DW_AT_const_value	(10)

0x0000048c:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_STATE_WILL_SEND_CONNECTION_RESPONSE_DECLINE")
                  DW_AT_const_value	(11)

0x00000492:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_STATE_WILL_SEND_CONNECTION_RESPONSE_ACCEPT")
                  DW_AT_const_value	(12)

0x00000498:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_STATE_WILL_SEND_DISCONNECT_REQUEST")
                  DW_AT_const_value	(13)

0x0000049e:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_STATE_WILL_SEND_DISCONNECT_RESPONSE")
                  DW_AT_const_value	(14)

0x000004a4:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_STATE_WILL_SEND_CONNECTION_RESPONSE_PENDING")
                  DW_AT_const_value	(15)

0x000004aa:     NULL

0x000004ab:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap_signaling.h")
                DW_AT_decl_line	(52)

0x000004af:     DW_TAG_enumerator
                  DW_AT_name	("COMMAND_REJECT")
                  DW_AT_const_value	(1)

0x000004b5:     DW_TAG_enumerator
                  DW_AT_name	("CONNECTION_REQUEST")
                  DW_AT_const_value	(2)

0x000004bb:     DW_TAG_enumerator
                  DW_AT_name	("CONNECTION_RESPONSE")
                  DW_AT_const_value	(3)

0x000004c1:     DW_TAG_enumerator
                  DW_AT_name	("CONFIGURE_REQUEST")
                  DW_AT_const_value	(4)

0x000004c7:     DW_TAG_enumerator
                  DW_AT_name	("CONFIGURE_RESPONSE")
                  DW_AT_const_value	(5)

0x000004cd:     DW_TAG_enumerator
                  DW_AT_name	("DISCONNECTION_REQUEST")
                  DW_AT_const_value	(6)

0x000004d3:     DW_TAG_enumerator
                  DW_AT_name	("DISCONNECTION_RESPONSE")
                  DW_AT_const_value	(7)

0x000004d9:     DW_TAG_enumerator
                  DW_AT_name	("ECHO_REQUEST")
                  DW_AT_const_value	(8)

0x000004df:     DW_TAG_enumerator
                  DW_AT_name	("ECHO_RESPONSE")
                  DW_AT_const_value	(9)

0x000004e5:     DW_TAG_enumerator
                  DW_AT_name	("INFORMATION_REQUEST")
                  DW_AT_const_value	(10)

0x000004eb:     DW_TAG_enumerator
                  DW_AT_name	("INFORMATION_RESPONSE")
                  DW_AT_const_value	(11)

0x000004f1:     DW_TAG_enumerator
                  DW_AT_name	("CONNECTION_PARAMETER_UPDATE_REQUEST")
                  DW_AT_const_value	(18)

0x000004f7:     DW_TAG_enumerator
                  DW_AT_name	("CONNECTION_PARAMETER_UPDATE_RESPONSE")
                  DW_AT_const_value	(19)

0x000004fd:     DW_TAG_enumerator
                  DW_AT_name	("LE_CREDIT_BASED_CONNECTION_REQUEST")
                  DW_AT_const_value	(20)

0x00000503:     DW_TAG_enumerator
                  DW_AT_name	("LE_CREDIT_BASED_CONNECTION_RESPONSE")
                  DW_AT_const_value	(21)

0x00000509:     DW_TAG_enumerator
                  DW_AT_name	("LE_FLOW_CONTROL_CREDIT")
                  DW_AT_const_value	(22)

0x0000050f:     DW_TAG_enumerator
                  DW_AT_name	("COMMAND_REJECT_LE")
                  DW_AT_const_value	(31)

0x00000515:     NULL

0x00000516:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(151)

0x0000051a:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_CHANNEL_STATE_VAR_NONE")
                  DW_AT_const_value	(0)

0x00000520:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_CHANNEL_STATE_VAR_RCVD_CONF_REQ")
                  DW_AT_const_value	(1)

0x00000526:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_CHANNEL_STATE_VAR_RCVD_CONF_RSP")
                  DW_AT_const_value	(2)

0x0000052c:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_CHANNEL_STATE_VAR_SEND_CONF_REQ")
                  DW_AT_const_value	(4)

0x00000532:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_CHANNEL_STATE_VAR_SEND_CONF_RSP")
                  DW_AT_const_value	(8)

0x00000538:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_CHANNEL_STATE_VAR_SENT_CONF_REQ")
                  DW_AT_const_value	(16)

0x0000053e:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_CHANNEL_STATE_VAR_SENT_CONF_RSP")
                  DW_AT_const_value	(32)

0x00000544:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_CHANNEL_STATE_VAR_SEND_CONF_RSP_MTU")
                  DW_AT_const_value	(64)

0x0000054b:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_CHANNEL_STATE_VAR_SEND_CONF_STREAMING_MODE")
                  DW_AT_const_value	(128)

0x00000552:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_CHANNEL_STATE_VAR_SEND_CONF_RSP_CONT")
                  DW_AT_const_value	(256)

0x00000559:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_CHANNEL_STATE_VAR_SEND_CONF_RSP_INVALID")
                  DW_AT_const_value	(512)

0x00000560:     DW_TAG_enumerator
                  DW_AT_name	("L2CAP_CHANNEL_STATE_VAR_SEND_CMD_REJ_UNKNOWN")
                  DW_AT_const_value	(1024)

0x00000567:     NULL

0x00000568:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(1469)

0x0000056d:     DW_TAG_enumerator
                  DW_AT_name	("BD_ADDR_TYPE_LE_PUBLIC")
                  DW_AT_const_value	(0)

0x00000573:     DW_TAG_enumerator
                  DW_AT_name	("BD_ADDR_TYPE_LE_RANDOM")
                  DW_AT_const_value	(1)

0x00000579:     DW_TAG_enumerator
                  DW_AT_name	("BD_ADDR_TYPE_SCO")
                  DW_AT_const_value	(254)

0x00000580:     DW_TAG_enumerator
                  DW_AT_name	("BD_ADDR_TYPE_CLASSIC")
                  DW_AT_const_value	(255)

0x00000587:     DW_TAG_enumerator
                  DW_AT_name	("BD_ADDR_TYPE_UNKNOWN")
                  DW_AT_const_value	(254)

0x0000058e:     NULL

0x0000058f:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(246)

0x00000593:     DW_TAG_enumerator
                  DW_AT_name	("CON_PARAMETER_UPDATE_NONE")
                  DW_AT_const_value	(0)

0x00000599:     DW_TAG_enumerator
                  DW_AT_name	("CON_PARAMETER_UPDATE_SEND_REQUEST")
                  DW_AT_const_value	(1)

0x0000059f:     DW_TAG_enumerator
                  DW_AT_name	("CON_PARAMETER_UPDATE_SEND_RESPONSE")
                  DW_AT_const_value	(2)

0x000005a5:     DW_TAG_enumerator
                  DW_AT_name	("CON_PARAMETER_UPDATE_CHANGE_HCI_CON_PARAMETERS")
                  DW_AT_const_value	(3)

0x000005ab:     DW_TAG_enumerator
                  DW_AT_name	("CON_PARAMETER_UPDATE_DENY")
                  DW_AT_const_value	(4)

0x000005b1:     NULL

0x000005b2:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(295)

0x000005b7:     DW_TAG_enumerator
                  DW_AT_name	("SM_GENERAL_IDLE")
                  DW_AT_const_value	(0)

0x000005bd:     DW_TAG_enumerator
                  DW_AT_name	("SM_GENERAL_SEND_PAIRING_FAILED")
                  DW_AT_const_value	(1)

0x000005c3:     DW_TAG_enumerator
                  DW_AT_name	("SM_GENERAL_TIMEOUT")
                  DW_AT_const_value	(2)

0x000005c9:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH1_W4_USER_RESPONSE")
                  DW_AT_const_value	(3)

0x000005cf:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_GET_RANDOM_TK")
                  DW_AT_const_value	(4)

0x000005d5:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_W4_RANDOM_TK")
                  DW_AT_const_value	(5)

0x000005db:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_GET_RANDOM_A")
                  DW_AT_const_value	(6)

0x000005e1:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_W4_RANDOM_A")
                  DW_AT_const_value	(7)

0x000005e7:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_GET_RANDOM_B")
                  DW_AT_const_value	(8)

0x000005ed:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_W4_RANDOM_B")
                  DW_AT_const_value	(9)

0x000005f3:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_GET_ENC_A")
                  DW_AT_const_value	(10)

0x000005f9:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_W4_ENC_A")
                  DW_AT_const_value	(11)

0x000005ff:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_GET_ENC_B")
                  DW_AT_const_value	(12)

0x00000605:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_W4_ENC_B")
                  DW_AT_const_value	(13)

0x0000060b:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_GET_ENC_C")
                  DW_AT_const_value	(14)

0x00000611:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_W4_ENC_C")
                  DW_AT_const_value	(15)

0x00000617:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_GET_ENC_D")
                  DW_AT_const_value	(16)

0x0000061d:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_W4_ENC_D")
                  DW_AT_const_value	(17)

0x00000623:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_C1_SEND_PAIRING_CONFIRM")
                  DW_AT_const_value	(18)

0x00000629:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_SEND_PAIRING_RANDOM")
                  DW_AT_const_value	(19)

0x0000062f:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_CALC_STK")
                  DW_AT_const_value	(20)

0x00000635:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_W4_STK")
                  DW_AT_const_value	(21)

0x0000063b:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH2_W4_CONNECTION_ENCRYPTED")
                  DW_AT_const_value	(22)

0x00000641:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_GET_RANDOM")
                  DW_AT_const_value	(23)

0x00000647:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_W4_RANDOM")
                  DW_AT_const_value	(24)

0x0000064d:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_GET_DIV")
                  DW_AT_const_value	(25)

0x00000653:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_W4_DIV")
                  DW_AT_const_value	(26)

0x00000659:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_Y_GET_ENC")
                  DW_AT_const_value	(27)

0x0000065f:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_Y_W4_ENC")
                  DW_AT_const_value	(28)

0x00000665:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_LTK_GET_ENC")
                  DW_AT_const_value	(29)

0x0000066b:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_LTK_W4_ENC")
                  DW_AT_const_value	(30)

0x00000671:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_CSRK_GET_ENC")
                  DW_AT_const_value	(31)

0x00000677:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_CSRK_W4_ENC")
                  DW_AT_const_value	(32)

0x0000067d:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_DISTRIBUTE_KEYS")
                  DW_AT_const_value	(33)

0x00000683:     DW_TAG_enumerator
                  DW_AT_name	("SM_PH3_RECEIVE_KEYS")
                  DW_AT_const_value	(34)

0x00000689:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_IDLE")
                  DW_AT_const_value	(35)

0x0000068f:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_SEND_SECURITY_REQUEST")
                  DW_AT_const_value	(36)

0x00000695:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH0_RECEIVED_LTK_REQUEST")
                  DW_AT_const_value	(37)

0x0000069b:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH0_RECEIVED_LTK_W4_IRK")
                  DW_AT_const_value	(38)

0x000006a1:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH0_SEND_LTK_REQUESTED_NEGATIVE_REPLY")
                  DW_AT_const_value	(39)

0x000006a7:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH1_W4_PAIRING_REQUEST")
                  DW_AT_const_value	(40)

0x000006ad:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH1_PAIRING_REQUEST_RECEIVED")
                  DW_AT_const_value	(41)

0x000006b3:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH1_SEND_PAIRING_RESPONSE")
                  DW_AT_const_value	(42)

0x000006b9:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH1_W4_PAIRING_CONFIRM")
                  DW_AT_const_value	(43)

0x000006bf:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH2_W4_PAIRING_RANDOM")
                  DW_AT_const_value	(44)

0x000006c5:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH2_W4_LTK_REQUEST")
                  DW_AT_const_value	(45)

0x000006cb:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH2_SEND_LTK_REPLY")
                  DW_AT_const_value	(46)

0x000006d1:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH4_Y_GET_ENC")
                  DW_AT_const_value	(47)

0x000006d7:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH4_Y_W4_ENC")
                  DW_AT_const_value	(48)

0x000006dd:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH4_LTK_GET_ENC")
                  DW_AT_const_value	(49)

0x000006e3:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH4_LTK_W4_ENC")
                  DW_AT_const_value	(50)

0x000006e9:     DW_TAG_enumerator
                  DW_AT_name	("SM_RESPONDER_PH4_SEND_LTK_REPLY")
                  DW_AT_const_value	(51)

0x000006ef:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_CONNECTED")
                  DW_AT_const_value	(52)

0x000006f5:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_PH0_HAS_LTK")
                  DW_AT_const_value	(53)

0x000006fb:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_PH0_SEND_START_ENCRYPTION")
                  DW_AT_const_value	(54)

0x00000701:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_PH0_W4_CONNECTION_ENCRYPTED")
                  DW_AT_const_value	(55)

0x00000707:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_PH1_W2_SEND_PAIRING_REQUEST")
                  DW_AT_const_value	(56)

0x0000070d:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_PH1_SEND_PAIRING_REQUEST")
                  DW_AT_const_value	(57)

0x00000713:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_PH1_W4_PAIRING_RESPONSE")
                  DW_AT_const_value	(58)

0x00000719:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_PH2_W4_PAIRING_CONFIRM")
                  DW_AT_const_value	(59)

0x0000071f:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_PH2_W4_PAIRING_RANDOM")
                  DW_AT_const_value	(60)

0x00000725:     DW_TAG_enumerator
                  DW_AT_name	("SM_INITIATOR_PH3_SEND_START_ENCRYPTION")
                  DW_AT_const_value	(61)

0x0000072b:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_RECEIVED_LTK_REQUEST")
                  DW_AT_const_value	(62)

0x00000731:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_SEND_PUBLIC_KEY_COMMAND")
                  DW_AT_const_value	(63)

0x00000737:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_PUBLIC_KEY_COMMAND")
                  DW_AT_const_value	(64)

0x0000073e:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_GET_RANDOM_A")
                  DW_AT_const_value	(65)

0x00000745:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_GET_RANDOM_A")
                  DW_AT_const_value	(66)

0x0000074c:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_GET_RANDOM_B")
                  DW_AT_const_value	(67)

0x00000753:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_GET_RANDOM_B")
                  DW_AT_const_value	(68)

0x0000075a:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CMAC_FOR_CONFIRMATION")
                  DW_AT_const_value	(69)

0x00000761:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CMAC_FOR_CONFIRMATION")
                  DW_AT_const_value	(70)

0x00000768:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_SEND_CONFIRMATION")
                  DW_AT_const_value	(71)

0x0000076f:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CMAC_FOR_CHECK_CONFIRMATION")
                  DW_AT_const_value	(72)

0x00000776:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CMAC_FOR_CHECK_CONFIRMATION")
                  DW_AT_const_value	(73)

0x0000077d:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CONFIRMATION")
                  DW_AT_const_value	(74)

0x00000784:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_SEND_PAIRING_RANDOM")
                  DW_AT_const_value	(75)

0x0000078b:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_PAIRING_RANDOM")
                  DW_AT_const_value	(76)

0x00000792:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CALCULATE_G2")
                  DW_AT_const_value	(77)

0x00000799:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CALCULATE_G2")
                  DW_AT_const_value	(78)

0x000007a0:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CALCULATE_DHKEY")
                  DW_AT_const_value	(79)

0x000007a7:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CALCULATE_F5_SALT")
                  DW_AT_const_value	(80)

0x000007ae:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CALCULATE_F5_SALT")
                  DW_AT_const_value	(81)

0x000007b5:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CALCULATE_F5_MACKEY")
                  DW_AT_const_value	(82)

0x000007bc:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CALCULATE_F5_MACKEY")
                  DW_AT_const_value	(83)

0x000007c3:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CALCULATE_F5_LTK")
                  DW_AT_const_value	(84)

0x000007ca:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CALCULATE_F5_LTK")
                  DW_AT_const_value	(85)

0x000007d1:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CALCULATE_F6_FOR_DHKEY_CHECK")
                  DW_AT_const_value	(86)

0x000007d8:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CALCULATE_F6_FOR_DHKEY_CHECK")
                  DW_AT_const_value	(87)

0x000007df:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CALCULATE_F6_TO_VERIFY_DHKEY_CHECK")
                  DW_AT_const_value	(88)

0x000007e6:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CALCULATE_F6_TO_VERIFY_DHKEY_CHECK")
                  DW_AT_const_value	(89)

0x000007ed:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_USER_RESPONSE")
                  DW_AT_const_value	(90)

0x000007f4:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_SEND_DHKEY_CHECK_COMMAND")
                  DW_AT_const_value	(91)

0x000007fb:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_DHKEY_CHECK_COMMAND")
                  DW_AT_const_value	(92)

0x00000802:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_LTK_REQUEST_SC")
                  DW_AT_const_value	(93)

0x00000809:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CALCULATE_H6_ILK")
                  DW_AT_const_value	(94)

0x00000810:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CALCULATE_H6_ILK")
                  DW_AT_const_value	(95)

0x00000817:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W2_CALCULATE_H6_BR_EDR_LINK_KEY")
                  DW_AT_const_value	(96)

0x0000081e:     DW_TAG_enumerator
                  DW_AT_name	("SM_SC_W4_CALCULATE_H6_BR_EDR_LINK_KEY")
                  DW_AT_const_value	(97)

0x00000825:     NULL

0x00000826:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(436)

0x0000082b:     DW_TAG_enumerator
                  DW_AT_name	("IRK_LOOKUP_IDLE")
                  DW_AT_const_value	(0)

0x00000831:     DW_TAG_enumerator
                  DW_AT_name	("IRK_LOOKUP_W4_READY")
                  DW_AT_const_value	(1)

0x00000837:     DW_TAG_enumerator
                  DW_AT_name	("IRK_LOOKUP_STARTED")
                  DW_AT_const_value	(2)

0x0000083d:     DW_TAG_enumerator
                  DW_AT_name	("IRK_LOOKUP_SUCCEEDED")
                  DW_AT_const_value	(3)

0x00000843:     DW_TAG_enumerator
                  DW_AT_name	("IRK_LOOKUP_FAILED")
                  DW_AT_const_value	(4)

0x00000849:     NULL

0x0000084a:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(445)

0x0000084f:     DW_TAG_enumerator
                  DW_AT_name	("AUTHORIZATION_UNKNOWN")
                  DW_AT_const_value	(0)

0x00000855:     DW_TAG_enumerator
                  DW_AT_name	("AUTHORIZATION_PENDING")
                  DW_AT_const_value	(1)

0x0000085b:     DW_TAG_enumerator
                  DW_AT_name	("AUTHORIZATION_DECLINED")
                  DW_AT_const_value	(2)

0x00000861:     DW_TAG_enumerator
                  DW_AT_name	("AUTHORIZATION_GRANTED")
                  DW_AT_const_value	(3)

0x00000867:     NULL

0x00000868:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                DW_AT_decl_line	(157)

0x0000086c:     DW_TAG_enumerator
                  DW_AT_name	("ATT_SERVER_IDLE")
                  DW_AT_const_value	(0)

0x00000872:     DW_TAG_enumerator
                  DW_AT_name	("ATT_SERVER_REQUEST_RECEIVED")
                  DW_AT_const_value	(1)

0x00000878:     DW_TAG_enumerator
                  DW_AT_name	("ATT_SERVER_W4_SIGNED_WRITE_VALIDATION")
                  DW_AT_const_value	(2)

0x0000087e:     DW_TAG_enumerator
                  DW_AT_name	("ATT_SERVER_REQUEST_RECEIVED_AND_VALIDATED")
                  DW_AT_const_value	(3)

0x00000884:     NULL

0x00000885:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0112 "linked_item_t")

0x0000088a:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x088f "l2cap_channel_t")

0x0000088f:   DW_TAG_typedef
                DW_AT_type	(cu + 0x089a "structure ")
                DW_AT_name	("l2cap_channel_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(222)

0x0000089a:   DW_TAG_structure_type
                DW_AT_byte_size	(0x38)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(204)

0x0000089e:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x0112 "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(206)
                  DW_AT_data_member_location	(0x00)

0x000008aa:     DW_TAG_member
                  DW_AT_name	("handle")
                  DW_AT_type	(cu + 0x02f9 "hci_con_handle_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(208)
                  DW_AT_data_member_location	(0x04)

0x000008b6:     DW_TAG_member
                  DW_AT_name	("waiting_for_can_send_now")
                  DW_AT_type	(cu + 0x00c7 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(211)
                  DW_AT_data_member_location	(0x06)

0x000008c2:     DW_TAG_member
                  DW_AT_name	("connection")
                  DW_AT_type	(cu + 0x021c "*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(215)
                  DW_AT_data_member_location	(0x08)

0x000008ce:     DW_TAG_member
                  DW_AT_name	("packet_handler")
                  DW_AT_type	(cu + 0x0142 "btstack_packet_handler_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(218)
                  DW_AT_data_member_location	(0x0c)

0x000008da:     DW_TAG_member
                  DW_AT_name	("channel_core_data")
                  DW_AT_type	(cu + 0x08e7 "channel_core_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(220)
                  DW_AT_data_member_location	(0x10)

0x000008e6:     NULL

0x000008e7:   DW_TAG_typedef
                DW_AT_type	(cu + 0x08f2 "structure ")
                DW_AT_name	("channel_core_data_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(200)

0x000008f2:   DW_TAG_structure_type
                DW_AT_byte_size	(0x28)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(178)

0x000008f6:     DW_TAG_member
                  DW_AT_name	("state_var")
                  DW_AT_type	(cu + 0x021d "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(180)
                  DW_AT_data_member_location	(0x00)

0x00000902:     DW_TAG_member
                  DW_AT_name	("state")
                  DW_AT_type	(cu + 0x00c7 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(181)
                  DW_AT_data_member_location	(0x02)

0x0000090e:     DW_TAG_member
                  DW_AT_name	("remote_sig_id")
                  DW_AT_type	(cu + 0x00c7 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(183)
                  DW_AT_data_member_location	(0x03)

0x0000091a:     DW_TAG_member
                  DW_AT_name	("local_sig_id")
                  DW_AT_type	(cu + 0x00c7 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(184)
                  DW_AT_data_member_location	(0x04)

0x00000926:     DW_TAG_member
                  DW_AT_name	("reason")
                  DW_AT_type	(cu + 0x00c7 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(186)
                  DW_AT_data_member_location	(0x05)

0x00000932:     DW_TAG_member
                  DW_AT_name	("address")
                  DW_AT_type	(cu + 0x0376 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(188)
                  DW_AT_data_member_location	(0x06)

0x0000093e:     DW_TAG_member
                  DW_AT_name	("psm")
                  DW_AT_type	(cu + 0x021d "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(189)
                  DW_AT_data_member_location	(0x0c)

0x0000094a:     DW_TAG_member
                  DW_AT_name	("local_cid")
                  DW_AT_type	(cu + 0x021d "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(191)
                  DW_AT_data_member_location	(0x0e)

0x00000956:     DW_TAG_member
                  DW_AT_name	("remote_cid")
                  DW_AT_type	(cu + 0x021d "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(192)
                  DW_AT_data_member_location	(0x10)

0x00000962:     DW_TAG_member
                  DW_AT_name	("local_mtu")
                  DW_AT_type	(cu + 0x021d "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(194)
                  DW_AT_data_member_location	(0x12)

0x0000096e:     DW_TAG_member
                  DW_AT_name	("remote_mtu")
                  DW_AT_type	(cu + 0x021d "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(195)
                  DW_AT_data_member_location	(0x14)

0x0000097a:     DW_TAG_member
                  DW_AT_name	("channel_mode")
                  DW_AT_type	(cu + 0x00c7 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(197)
                  DW_AT_data_member_location	(0x16)

0x00000986:     DW_TAG_member
                  DW_AT_name	("remote_extended_feature")
                  DW_AT_type	(cu + 0x030b "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(198)
                  DW_AT_data_member_location	(0x18)

0x00000992:     DW_TAG_member
                  DW_AT_name	("retran_op")
                  DW_AT_type	(cu + 0x099f "retran_flow_ctl_op_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(199)
                  DW_AT_data_member_location	(0x1c)

0x0000099e:     NULL

0x0000099f:   DW_TAG_typedef
                DW_AT_type	(cu + 0x09aa "structure ")
                DW_AT_name	("retran_flow_ctl_op_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(174)

0x000009aa:   DW_TAG_structure_type
                DW_AT_byte_size	(0x0c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                DW_AT_decl_line	(165)

0x000009ae:     DW_TAG_member
                  DW_AT_name	("retransmission_flow_ctl")
                  DW_AT_type	(cu + 0x00c7 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(166)
                  DW_AT_data_member_location	(0x00)

0x000009ba:     DW_TAG_member
                  DW_AT_name	("length")
                  DW_AT_type	(cu + 0x00c7 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(167)
                  DW_AT_data_member_location	(0x01)

0x000009c6:     DW_TAG_member
                  DW_AT_name	("mode")
                  DW_AT_type	(cu + 0x00c7 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(168)
                  DW_AT_data_member_location	(0x02)

0x000009d2:     DW_TAG_member
                  DW_AT_name	("tx_window")
                  DW_AT_type	(cu + 0x00c7 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(169)
                  DW_AT_data_member_location	(0x03)

0x000009de:     DW_TAG_member
                  DW_AT_name	("max_transmit")
                  DW_AT_type	(cu + 0x00c7 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(170)
                  DW_AT_data_member_location	(0x04)

0x000009ea:     DW_TAG_member
                  DW_AT_name	("retransmission_timeout")
                  DW_AT_type	(cu + 0x021d "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(171)
                  DW_AT_data_member_location	(0x06)

0x000009f6:     DW_TAG_member
                  DW_AT_name	("monitor_timeout")
                  DW_AT_type	(cu + 0x021d "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(172)
                  DW_AT_data_member_location	(0x08)

0x00000a02:     DW_TAG_member
                  DW_AT_name	("max_pdu")
                  DW_AT_type	(cu + 0x021d "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/l2cap.h")
                  DW_AT_decl_line	(173)
                  DW_AT_data_member_location	(0x0a)

0x00000a0e:     NULL

0x00000a0f:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0a14 "le_hci_connection_t")

0x00000a14:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0a20 "__le_hci_connection")
                DW_AT_name	("le_hci_connection_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(605)

0x00000a20:   DW_TAG_structure_type
                DW_AT_name	("__le_hci_connection")
                DW_AT_byte_size	(0x04c8)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(571)

0x00000a2a:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x0112 "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(572)
                  DW_AT_data_member_location	(0x00)

0x00000a37:     DW_TAG_member
                  DW_AT_name	("address")
                  DW_AT_type	(cu + 0x0376 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(574)
                  DW_AT_data_member_location	(0x04)

0x00000a44:     DW_TAG_member
                  DW_AT_name	("con_handle")
                  DW_AT_type	(cu + 0x02f9 "hci_con_handle_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(576)
                  DW_AT_data_member_location	(0x0a)

0x00000a51:     DW_TAG_member
                  DW_AT_name	("address_type")
                  DW_AT_type	(cu + 0x0b36 "bd_addr_type_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(578)
                  DW_AT_data_member_location	(0x0c)

0x00000a5e:     DW_TAG_member
                  DW_AT_name	("role")
                  DW_AT_type	(cu + 0x0168 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(581)
                  DW_AT_data_member_location	(0x10)

0x00000a6b:     DW_TAG_member
                  DW_AT_name	("le_con_parameter_update_state")
                  DW_AT_type	(cu + 0x0b42 "le_con_parameter_update_state_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(584)
                  DW_AT_data_member_location	(0x14)

0x00000a78:     DW_TAG_member
                  DW_AT_name	("le_con_param_update_identifier")
                  DW_AT_type	(cu + 0x0168 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(585)
                  DW_AT_data_member_location	(0x18)

0x00000a85:     DW_TAG_member
                  DW_AT_name	("le_conn_interval_min")
                  DW_AT_type	(cu + 0x017e "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(586)
                  DW_AT_data_member_location	(0x1a)

0x00000a92:     DW_TAG_member
                  DW_AT_name	("le_conn_interval_max")
                  DW_AT_type	(cu + 0x017e "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(587)
                  DW_AT_data_member_location	(0x1c)

0x00000a9f:     DW_TAG_member
                  DW_AT_name	("le_conn_latency")
                  DW_AT_type	(cu + 0x017e "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(588)
                  DW_AT_data_member_location	(0x1e)

0x00000aac:     DW_TAG_member
                  DW_AT_name	("le_supervision_timeout")
                  DW_AT_type	(cu + 0x017e "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(589)
                  DW_AT_data_member_location	(0x20)

0x00000ab9:     DW_TAG_member
                  DW_AT_name	("sm_connection")
                  DW_AT_type	(cu + 0x0b4d "sm_connection_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(592)
                  DW_AT_data_member_location	(0x24)

0x00000ac6:     DW_TAG_member
                  DW_AT_name	("att_server")
                  DW_AT_type	(cu + 0x0c95 "att_server_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(595)
                  DW_AT_data_member_location	(0x5c)

0x00000ad3:     DW_TAG_member
                  DW_AT_name	("acl_recombination_buffer")
                  DW_AT_type	(cu + 0x0eb6 "uint8_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(597)
                  DW_AT_data_member_location	(0x02a0)

0x00000ae1:     DW_TAG_member
                  DW_AT_name	("acl_recombination_pos")
                  DW_AT_type	(cu + 0x017e "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(598)
                  DW_AT_data_member_location	(0x04b2)

0x00000aef:     DW_TAG_member
                  DW_AT_name	("acl_recombination_length")
                  DW_AT_type	(cu + 0x017e "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(599)
                  DW_AT_data_member_location	(0x04b4)

0x00000afd:     DW_TAG_member
                  DW_AT_name	("num_acl_packets_sent")
                  DW_AT_type	(cu + 0x0168 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(600)
                  DW_AT_data_member_location	(0x04b6)

0x00000b0b:     DW_TAG_member
                  DW_AT_name	("own_id_address")
                  DW_AT_type	(cu + 0x0376 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(602)
                  DW_AT_data_member_location	(0x04b7)

0x00000b19:     DW_TAG_member
                  DW_AT_name	("own_address")
                  DW_AT_type	(cu + 0x0376 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(603)
                  DW_AT_data_member_location	(0x04bd)

0x00000b27:     DW_TAG_member
                  DW_AT_name	("own_address_type")
                  DW_AT_type	(cu + 0x0b36 "bd_addr_type_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(604)
                  DW_AT_data_member_location	(0x04c4)

0x00000b35:     NULL

0x00000b36:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0568 "enumeration ")
                DW_AT_name	("bd_addr_type_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(1475)

0x00000b42:   DW_TAG_typedef
                DW_AT_type	(cu + 0x058f "enumeration ")
                DW_AT_name	("le_con_parameter_update_state_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(252)

0x00000b4d:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0b59 "sm_connection")
                DW_AT_name	("sm_connection_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(475)

0x00000b59:   DW_TAG_structure_type
                DW_AT_name	("sm_connection")
                DW_AT_byte_size	(0x38)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(456)

0x00000b62:     DW_TAG_member
                  DW_AT_name	("sm_handle")
                  DW_AT_type	(cu + 0x02f9 "hci_con_handle_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(457)
                  DW_AT_data_member_location	(0x00)

0x00000b6f:     DW_TAG_member
                  DW_AT_name	("sm_role")
                  DW_AT_type	(cu + 0x0168 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(458)
                  DW_AT_data_member_location	(0x02)

0x00000b7c:     DW_TAG_member
                  DW_AT_name	("sm_security_request_received")
                  DW_AT_type	(cu + 0x0168 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(459)
                  DW_AT_data_member_location	(0x03)

0x00000b89:     DW_TAG_member
                  DW_AT_name	("sm_bonding_requested")
                  DW_AT_type	(cu + 0x0168 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(460)
                  DW_AT_data_member_location	(0x04)

0x00000b96:     DW_TAG_member
                  DW_AT_name	("sm_peer_addr_type")
                  DW_AT_type	(cu + 0x0168 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(461)
                  DW_AT_data_member_location	(0x05)

0x00000ba3:     DW_TAG_member
                  DW_AT_name	("sm_peer_address")
                  DW_AT_type	(cu + 0x0376 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(462)
                  DW_AT_data_member_location	(0x06)

0x00000bb0:     DW_TAG_member
                  DW_AT_name	("sm_engine_state")
                  DW_AT_type	(cu + 0x0c4d "security_manager_state_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(463)
                  DW_AT_data_member_location	(0x0c)

0x00000bbd:     DW_TAG_member
                  DW_AT_name	("sm_irk_lookup_state")
                  DW_AT_type	(cu + 0x0c59 "irk_lookup_state_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(464)
                  DW_AT_data_member_location	(0x10)

0x00000bca:     DW_TAG_member
                  DW_AT_name	("sm_connection_encrypted")
                  DW_AT_type	(cu + 0x0168 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(465)
                  DW_AT_data_member_location	(0x14)

0x00000bd7:     DW_TAG_member
                  DW_AT_name	("sm_connection_authenticated")
                  DW_AT_type	(cu + 0x0168 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(466)
                  DW_AT_data_member_location	(0x15)

0x00000be4:     DW_TAG_member
                  DW_AT_name	("sm_actual_encryption_key_size")
                  DW_AT_type	(cu + 0x0168 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(467)
                  DW_AT_data_member_location	(0x16)

0x00000bf1:     DW_TAG_member
                  DW_AT_name	("sm_m_preq")
                  DW_AT_type	(cu + 0x0c65 "sm_pairing_packet_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(468)
                  DW_AT_data_member_location	(0x17)

0x00000bfe:     DW_TAG_member
                  DW_AT_name	("sm_connection_authorization_state")
                  DW_AT_type	(cu + 0x0c7d "authorization_state_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(469)
                  DW_AT_data_member_location	(0x20)

0x00000c0b:     DW_TAG_member
                  DW_AT_name	("sm_local_ediv")
                  DW_AT_type	(cu + 0x017e "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(470)
                  DW_AT_data_member_location	(0x24)

0x00000c18:     DW_TAG_member
                  DW_AT_name	("sm_local_rand")
                  DW_AT_type	(cu + 0x0c89 "uint8_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(471)
                  DW_AT_data_member_location	(0x26)

0x00000c25:     DW_TAG_member
                  DW_AT_name	("sm_disconn_reason")
                  DW_AT_type	(cu + 0x0168 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(472)
                  DW_AT_data_member_location	(0x2e)

0x00000c32:     DW_TAG_member
                  DW_AT_name	("sm_le_db_index")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(473)
                  DW_AT_data_member_location	(0x30)

0x00000c3f:     DW_TAG_member
                  DW_AT_name	("sm_timeout_id")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                  DW_AT_decl_line	(474)
                  DW_AT_data_member_location	(0x34)

0x00000c4c:     NULL

0x00000c4d:   DW_TAG_typedef
                DW_AT_type	(cu + 0x05b2 "enumeration ")
                DW_AT_name	("security_manager_state_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(433)

0x00000c59:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0826 "enumeration ")
                DW_AT_name	("irk_lookup_state_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(442)

0x00000c65:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0c71 "uint8_t[]")
                DW_AT_name	("sm_pairing_packet_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(452)

0x00000c71:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0168 "uint8_t")

0x00000c76:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0304 "sizetype")
                  DW_AT_count	(0x07)

0x00000c7c:     NULL

0x00000c7d:   DW_TAG_typedef
                DW_AT_type	(cu + 0x084a "enumeration ")
                DW_AT_name	("authorization_state_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(450)

0x00000c89:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0168 "uint8_t")

0x00000c8e:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0304 "sizetype")
                  DW_AT_count	(0x08)

0x00000c94:     NULL

0x00000c95:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0ca0 "structure ")
                DW_AT_name	("att_server_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                DW_AT_decl_line	(187)

0x00000ca0:   DW_TAG_structure_type
                DW_AT_byte_size	(0x0244)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                DW_AT_decl_line	(164)

0x00000ca5:     DW_TAG_member
                  DW_AT_name	("state")
                  DW_AT_type	(cu + 0x0d7b "att_server_state_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(165)
                  DW_AT_data_member_location	(0x00)

0x00000cb1:     DW_TAG_member
                  DW_AT_name	("peer_addr_type")
                  DW_AT_type	(cu + 0x0168 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(167)
                  DW_AT_data_member_location	(0x04)

0x00000cbd:     DW_TAG_member
                  DW_AT_name	("peer_address")
                  DW_AT_type	(cu + 0x0376 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(168)
                  DW_AT_data_member_location	(0x05)

0x00000cc9:     DW_TAG_member
                  DW_AT_name	("ir_le_device_db_index")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(170)
                  DW_AT_data_member_location	(0x0c)

0x00000cd5:     DW_TAG_member
                  DW_AT_name	("ir_lookup_active")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(171)
                  DW_AT_data_member_location	(0x10)

0x00000ce1:     DW_TAG_member
                  DW_AT_name	("value_indication_handle")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(173)
                  DW_AT_data_member_location	(0x14)

0x00000ced:     DW_TAG_member
                  DW_AT_name	("value_indication_timer")
                  DW_AT_type	(cu + 0x0d86 "btstack_timer_source_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(174)
                  DW_AT_data_member_location	(0x18)

0x00000cf9:     DW_TAG_member
                  DW_AT_name	("connection")
                  DW_AT_type	(cu + 0x0e3c "att_connection_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(176)
                  DW_AT_data_member_location	(0x2c)

0x00000d05:     DW_TAG_member
                  DW_AT_name	("request_size")
                  DW_AT_type	(cu + 0x017e "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(178)
                  DW_AT_data_member_location	(0x36)

0x00000d11:     DW_TAG_member
                  DW_AT_name	("request_buffer")
                  DW_AT_type	(cu + 0x0e98 "uint8_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(179)
                  DW_AT_data_member_location	(0x38)

0x00000d1d:     DW_TAG_member
                  DW_AT_name	("flow_hold_flag")
                  DW_AT_type	(cu + 0x0168 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(181)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x07)
                  DW_AT_data_member_location	(0x023d)

0x00000d2d:     DW_TAG_member
                  DW_AT_name	("mtu_request_flag")
                  DW_AT_type	(cu + 0x0168 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(182)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x06)
                  DW_AT_data_member_location	(0x023d)

0x00000d3d:     DW_TAG_member
                  DW_AT_name	("check_remote_tag")
                  DW_AT_type	(cu + 0x0168 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(183)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x03)
                  DW_AT_bit_offset	(0x03)
                  DW_AT_data_member_location	(0x023d)

0x00000d4d:     DW_TAG_member
                  DW_AT_name	("request_busy")
                  DW_AT_type	(cu + 0x0168 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(184)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x02)
                  DW_AT_data_member_location	(0x023d)

0x00000d5d:     DW_TAG_member
                  DW_AT_name	("reserverd")
                  DW_AT_type	(cu + 0x0168 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(185)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x023d)

0x00000d6d:     DW_TAG_member
                  DW_AT_name	("result_callback")
                  DW_AT_type	(cu + 0x0ea5 "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                  DW_AT_decl_line	(186)
                  DW_AT_data_member_location	(0x0240)

0x00000d7a:     NULL

0x00000d7b:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0868 "enumeration ")
                DW_AT_name	("att_server_state_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/att_server.h")
                DW_AT_decl_line	(162)

0x00000d86:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0d91 "btstack_timer_source")
                DW_AT_name	("btstack_timer_source_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                DW_AT_decl_line	(19)

0x00000d91:   DW_TAG_structure_type
                DW_AT_name	("btstack_timer_source")
                DW_AT_byte_size	(0x14)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                DW_AT_decl_line	(7)

0x00000d99:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x011d "btstack_linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(8)
                  DW_AT_data_member_location	(0x00)

0x00000da5:     DW_TAG_member
                  DW_AT_name	("timeout")
                  DW_AT_type	(cu + 0x0e15 "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(10)
                  DW_AT_data_member_location	(0x04)

0x00000db1:     DW_TAG_member
                  DW_AT_name	("timeout_interval")
                  DW_AT_type	(cu + 0x0e15 "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(11)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x10)
                  DW_AT_bit_offset	(0x10)
                  DW_AT_data_member_location	(0x08)

0x00000dc0:     DW_TAG_member
                  DW_AT_name	("timer_type")
                  DW_AT_type	(cu + 0x0e15 "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(12)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x0c)
                  DW_AT_data_member_location	(0x08)

0x00000dcf:     DW_TAG_member
                  DW_AT_name	("timer_tick_overflow")
                  DW_AT_type	(cu + 0x0e15 "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(13)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x0b)
                  DW_AT_data_member_location	(0x08)

0x00000dde:     DW_TAG_member
                  DW_AT_name	("loop_flag")
                  DW_AT_type	(cu + 0x0e15 "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(14)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x0a)
                  DW_AT_data_member_location	(0x08)

0x00000ded:     DW_TAG_member
                  DW_AT_name	("loop_times")
                  DW_AT_type	(cu + 0x0e15 "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(15)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x0a)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x08)

0x00000dfc:     DW_TAG_member
                  DW_AT_name	("process")
                  DW_AT_type	(cu + 0x0e2b "subroutine *")
