temp.o:	file format ELF32-i386

.debug_info contents:
0x00000000: Compile Unit: length = 0x00000439 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x0000043d)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)")
              DW_AT_language	(DW_LANG_C99)
              DW_AT_name	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/BLE/le_device_db_memory.c")
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
              DW_AT_GNU_pubnames	(true)
              DW_AT_low_pc	(0x0000000000000000)
              DW_AT_ranges	(0x00000000
                 [0x00000000 - 0x00000196)
                 [0x00000196 - 0x000006c4)
                 [0x00000000 - 0x00000009))

0x00000026:   DW_TAG_variable
                DW_AT_name	("app_info_debug_enable")
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/profile_stack_debug.h")
                DW_AT_decl_line	(190)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000037:   DW_TAG_base_type
                DW_AT_name	("int")
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_byte_size	(0x04)

0x0000003e:   DW_TAG_variable
                DW_AT_name	("le_global_db_info")
                DW_AT_type	(cu + 0x004f "le_db_info_t")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/BLE/le_device_db_memory.c")
                DW_AT_decl_line	(97)
                DW_AT_location	(DW_OP_addr 0x0)

0x0000004f:   DW_TAG_typedef
                DW_AT_type	(cu + 0x005a "structure ")
                DW_AT_name	("le_db_info_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/BLE/le_device_db_memory.c")
                DW_AT_decl_line	(95)

0x0000005a:   DW_TAG_structure_type
                DW_AT_byte_size	(0x20)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/BLE/le_device_db_memory.c")
                DW_AT_decl_line	(93)

0x0000005e:     DW_TAG_member
                  DW_AT_name	("le_devices")
                  DW_AT_type	(cu + 0x006b "le_device_memory_db_t*[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/BLE/le_device_db_memory.c")
                  DW_AT_decl_line	(94)
                  DW_AT_data_member_location	(0x00)

0x0000006a:     NULL

0x0000006b:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0077 "le_device_memory_db_t*")

0x00000070:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0125 "sizetype")
                  DW_AT_count	(0x08)

0x00000076:     NULL

0x00000077:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x007c "le_device_memory_db_t")

0x0000007c:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0087 "le_device_memory_db")
                DW_AT_name	("le_device_memory_db_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/BLE/le_device_db_memory.c")
                DW_AT_decl_line	(85)

0x00000087:   DW_TAG_structure_type
                DW_AT_name	("le_device_memory_db")
                DW_AT_byte_size	(0x38)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/BLE/le_device_db_memory.c")
                DW_AT_decl_line	(59)

0x0000008f:     DW_TAG_member
                  DW_AT_name	("addr_type")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/BLE/le_device_db_memory.c")
                  DW_AT_decl_line	(62)
                  DW_AT_data_member_location	(0x00)

0x0000009b:     DW_TAG_member
                  DW_AT_name	("addr")
                  DW_AT_type	(cu + 0x00fc "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/BLE/le_device_db_memory.c")
                  DW_AT_decl_line	(63)
                  DW_AT_data_member_location	(0x04)

0x000000a7:     DW_TAG_member
                  DW_AT_name	("irk")
                  DW_AT_type	(cu + 0x012c "sm_key_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/BLE/le_device_db_memory.c")
                  DW_AT_decl_line	(64)
                  DW_AT_data_member_location	(0x0a)

0x000000b3:     DW_TAG_member
                  DW_AT_name	("ltk")
                  DW_AT_type	(cu + 0x012c "sm_key_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/BLE/le_device_db_memory.c")
                  DW_AT_decl_line	(68)
                  DW_AT_data_member_location	(0x1a)

0x000000bf:     DW_TAG_member
                  DW_AT_name	("ediv")
                  DW_AT_type	(cu + 0x0143 "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/BLE/le_device_db_memory.c")
                  DW_AT_decl_line	(69)
                  DW_AT_data_member_location	(0x2a)

0x000000cb:     DW_TAG_member
                  DW_AT_name	("rand")
                  DW_AT_type	(cu + 0x0155 "uint8_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/BLE/le_device_db_memory.c")
                  DW_AT_decl_line	(70)
                  DW_AT_data_member_location	(0x2c)

0x000000d7:     DW_TAG_member
                  DW_AT_name	("key_size")
                  DW_AT_type	(cu + 0x0113 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/BLE/le_device_db_memory.c")
                  DW_AT_decl_line	(71)
                  DW_AT_data_member_location	(0x34)

0x000000e3:     DW_TAG_member
                  DW_AT_name	("authenticated")
                  DW_AT_type	(cu + 0x0113 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/BLE/le_device_db_memory.c")
                  DW_AT_decl_line	(72)
                  DW_AT_data_member_location	(0x35)

0x000000ef:     DW_TAG_member
                  DW_AT_name	("authorized")
                  DW_AT_type	(cu + 0x0113 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/BLE/le_device_db_memory.c")
                  DW_AT_decl_line	(73)
                  DW_AT_data_member_location	(0x36)

0x000000fb:     NULL

0x000000fc:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0107 "uint8_t[]")
                DW_AT_name	("bd_addr_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/utils.h")
                DW_AT_decl_line	(66)

0x00000107:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0113 "uint8_t")

0x0000010c:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0125 "sizetype")
                  DW_AT_count	(0x06)

0x00000112:     NULL

0x00000113:   DW_TAG_typedef
                DW_AT_type	(cu + 0x011e "unsigned char")
                DW_AT_name	("uint8_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(44)

0x0000011e:   DW_TAG_base_type
                DW_AT_name	("unsigned char")
                DW_AT_encoding	(DW_ATE_unsigned_char)
                DW_AT_byte_size	(0x01)

0x00000125:   DW_TAG_base_type
                DW_AT_name	("sizetype")
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_unsigned)

0x0000012c:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0137 "uint8_t[]")
                DW_AT_name	("sm_key_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/utils.h")
                DW_AT_decl_line	(90)

0x00000137:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0113 "uint8_t")

0x0000013c:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0125 "sizetype")
                  DW_AT_count	(0x10)

0x00000142:     NULL

0x00000143:   DW_TAG_typedef
                DW_AT_type	(cu + 0x014e "unsigned short")
                DW_AT_name	("uint16_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(46)

0x0000014e:   DW_TAG_base_type
                DW_AT_name	("unsigned short")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x02)

0x00000155:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0113 "uint8_t")

0x0000015a:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0125 "sizetype")
                  DW_AT_count	(0x08)

0x00000160:     NULL

0x00000161:   DW_TAG_subprogram
                DW_AT_name	("le_device_db_remove")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/BLE/le_device_db_memory.c")
                DW_AT_decl_line	(163)
                DW_AT_prototyped	(true)
                DW_AT_external	(true)
                DW_AT_inline	(DW_INL_inlined)

0x00000169:     DW_TAG_formal_parameter
                  DW_AT_name	("index")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/BLE/le_device_db_memory.c")
                  DW_AT_decl_line	(163)
                  DW_AT_type	(cu + 0x0037 "int")

0x00000174:     NULL

0x00000175:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000000)
                DW_AT_high_pc	(0x0000000000000196)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("le_device_db_init")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/BLE/le_device_db_memory.c")
                DW_AT_decl_line	(103)
                DW_AT_prototyped	(true)
                DW_AT_external	(true)

0x00000186:     DW_TAG_variable
                  DW_AT_location	(0x00000000
                     0x00000000000000be - 0x00000000000000c6: DW_OP_reg1 ECX
                     0x00000000000000c6 - 0x0000000000000196: DW_OP_breg5 EBP-24)
