; ModuleID = 'le_device_db_memory.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/BLE/le_device_db_memory.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.le_db_info_t = type { [8 x %struct.le_device_memory_db*] }
%struct.le_device_memory_db = type { i32, [6 x i8], [16 x i8], [16 x i8], i16, [8 x i8], i8, i8, i8 }

@app_info_debug_enable = weak hidden local_unnamed_addr global i32 0, align 4, !dbg !0
@config_le_sm_support_enable = external local_unnamed_addr constant i32, align 4
@config_le_hci_connection_num = external local_unnamed_addr constant i32, align 4
@config_asser = external local_unnamed_addr constant i32, align 4
@.str = private unnamed_addr constant [17 x i8] c"file:%s, line:%d\00", align 1
@.str.1 = private unnamed_addr constant [122 x i8] c"/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/BLE/le_device_db_memory.c\00", align 1
@.str.2 = private unnamed_addr constant [90 x i8] c"ASSERT-FAILD: MAX_NR_LE_DEVICE_DB_ENTRIES >= CONFIG_MAX_DEVICE_DB_NUM device db not match\00", align 1
@.str.3 = private unnamed_addr constant [42 x i8] c"ASSERT-FAILD: db_pt device db malloc fail\00", align 1
@le_global_db_info = hidden local_unnamed_addr global %struct.le_db_info_t zeroinitializer, section ".ble_db_bss", align 4, !dbg !6
@ble_debug_enable = external local_unnamed_addr global i8, align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "app_info_debug_enable", scope: !2, file: !44, line: 190, type: !18, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5)
!3 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Host/BLE/le_device_db_memory.c", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!4 = !{}
!5 = !{!0, !6}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "le_global_db_info", scope: !2, file: !3, line: 97, type: !8, isLocal: false, isDefinition: true)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "le_db_info_t", file: !3, line: 95, baseType: !9)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 93, size: 256, elements: !10)
!10 = !{!11}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "le_devices", scope: !9, file: !3, line: 94, baseType: !12, size: 256)
!12 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 256, elements: !39)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "le_device_memory_db_t", file: !3, line: 85, baseType: !15)
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "le_device_memory_db", file: !3, line: 59, size: 448, elements: !16)
!16 = !{!17, !19, !28, !33, !34, !37, !41, !42, !43}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "addr_type", scope: !15, file: !3, line: 62, baseType: !18, size: 32)
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !15, file: !3, line: 63, baseType: !20, size: 48, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_addr_t", file: !21, line: 66, baseType: !22)
!21 = !DIFile(filename: "../btcommon/utils.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!22 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 48, elements: !26)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !24, line: 44, baseType: !25)
!24 = !DIFile(filename: "../btcommon/typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!27}
!27 = !DISubrange(count: 6)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "irk", scope: !15, file: !3, line: 64, baseType: !29, size: 128, offset: 80)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "sm_key_t", file: !21, line: 90, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 128, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 16)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ltk", scope: !15, file: !3, line: 68, baseType: !29, size: 128, offset: 208)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ediv", scope: !15, file: !3, line: 69, baseType: !35, size: 16, offset: 336)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !24, line: 46, baseType: !36)
!36 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "rand", scope: !15, file: !3, line: 70, baseType: !38, size: 64, offset: 352)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 64, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 8)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !15, file: !3, line: 71, baseType: !23, size: 8, offset: 416)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !15, file: !3, line: 72, baseType: !23, size: 8, offset: 424)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "authorized", scope: !15, file: !3, line: 73, baseType: !23, size: 8, offset: 432)
!44 = !DIFile(filename: "../btcommon/profile_stack_debug.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!45 = !{i32 2, !"Dwarf Version", i32 4}
!46 = !{i32 2, !"Debug Info Version", i32 3}
!47 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!48 = distinct !DISubprogram(name: "le_device_db_init", scope: !3, file: !3, line: 103, type: !49, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !51)
!49 = !DISubroutineType(types: !50)
!50 = !{null}
!51 = !{!52, !53}
!52 = !DILocalVariable(name: "i", scope: !48, file: !3, line: 105, type: !18)
!53 = !DILocalVariable(name: "db_pt", scope: !48, file: !3, line: 106, type: !13)
!54 = !DILocation(line: 108, column: 10, scope: !55)
!55 = distinct !DILexicalBlock(scope: !48, file: !3, line: 108, column: 9)
!56 = !{!57, !57, i64 0}
!57 = !{!"int", !58, i64 0}
!58 = !{!"omnipotent char", !59, i64 0}
!59 = !{!"Simple C/C++ TBAA"}
!60 = !DILocation(line: 108, column: 9, scope: !48)
!61 = !DILocation(line: 112, column: 9, scope: !62)
!62 = distinct !DILexicalBlock(scope: !48, file: !3, line: 112, column: 9)
!63 = !DILocation(line: 112, column: 9, scope: !48)
!64 = !DILocation(line: 113, column: 9, scope: !65)
!65 = !DILexicalBlockFile(scope: !66, file: !3, discriminator: 1)
!66 = distinct !DILexicalBlock(scope: !67, file: !3, line: 113, column: 9)
!67 = distinct !DILexicalBlock(scope: !68, file: !3, line: 113, column: 9)
!68 = distinct !DILexicalBlock(scope: !62, file: !3, line: 112, column: 35)
!69 = !DILocation(line: 113, column: 9, scope: !70)
!70 = !DILexicalBlockFile(scope: !67, file: !3, discriminator: 1)
!71 = !DILocation(line: 113, column: 9, scope: !72)
!72 = !DILexicalBlockFile(scope: !73, file: !3, discriminator: 2)
!73 = distinct !DILexicalBlock(scope: !66, file: !3, line: 113, column: 9)
!74 = !DILocation(line: 113, column: 9, scope: !75)
!75 = !DILexicalBlockFile(scope: !76, file: !3, discriminator: 3)
!76 = distinct !DILexicalBlock(scope: !77, file: !3, line: 113, column: 9)
!77 = distinct !DILexicalBlock(scope: !73, file: !3, line: 113, column: 9)
!78 = !DILocation(line: 113, column: 9, scope: !79)
!79 = !DILexicalBlockFile(scope: !76, file: !3, discriminator: 9)
!80 = !DILocation(line: 113, column: 9, scope: !81)
!81 = !DILexicalBlockFile(scope: !76, file: !3, discriminator: 10)
!82 = !DILocation(line: 113, column: 9, scope: !83)
!83 = !DILexicalBlockFile(scope: !84, file: !3, discriminator: 5)
!84 = distinct !DILexicalBlock(scope: !66, file: !3, line: 113, column: 9)
!85 = !DILocation(line: 113, column: 9, scope: !86)
!86 = !DILexicalBlockFile(scope: !87, file: !3, discriminator: 6)
!87 = distinct !DILexicalBlock(scope: !88, file: !3, line: 113, column: 9)
!88 = distinct !DILexicalBlock(scope: !84, file: !3, line: 113, column: 9)
!89 = !DILocation(line: 115, column: 54, scope: !68)
!90 = !DILocation(line: 115, column: 17, scope: !68)
!91 = !DILocation(line: 106, column: 28, scope: !48)
!92 = !DILocation(line: 116, column: 9, scope: !93)
!93 = !DILexicalBlockFile(scope: !94, file: !3, discriminator: 2)
!94 = distinct !DILexicalBlock(scope: !95, file: !3, line: 116, column: 9)
!95 = distinct !DILexicalBlock(scope: !96, file: !3, line: 116, column: 9)
!96 = distinct !DILexicalBlock(scope: !68, file: !3, line: 116, column: 9)
!97 = !DILocation(line: 116, column: 9, scope: !98)
!98 = !DILexicalBlockFile(scope: !99, file: !3, discriminator: 3)
!99 = distinct !DILexicalBlock(scope: !100, file: !3, line: 116, column: 9)
!100 = distinct !DILexicalBlock(scope: !94, file: !3, line: 116, column: 9)
!101 = !DILocation(line: 116, column: 9, scope: !102)
!102 = !DILexicalBlockFile(scope: !99, file: !3, discriminator: 9)
