; ModuleID = 'opp.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/opp.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.opp_channel_info = type { i8, i8, i8, i8, i16, i16, i16, i16, i16, i32, i32, i32, [16 x i16], [6 x i8], i8* }
%struct._stack_config = type <{ i32, i16, i16, i16, i16, i16, i8, i8, i8, i32, i8, i8, i8, i8, [6 x i8], i8 }>
%struct.user_interface_handler = type { void (i8*, i32, i32)*, void (i8, i8*, i8*)*, void (i8*, i32)*, i32 ()*, void (i8, i16, i8*, i16)*, void (i8*, i32, i32, i8)*, i32 ()*, void (i32)*, void (i8, i32, i8*, i16)*, i32 (i8*, i8, i8)*, void ()*, void (i8)*, i8 (i8*, i8, i8*, i32, i8)*, void (i8, i16, i8*, i16)*, i32 ()* }
%struct.profile_cmd_handle = type { i32 (i8*)*, i32 (i8*, i32)*, i32 (i8*)*, i32 (i8*)*, i32 (i8*, i32, i32)*, i32 (i8*, i32)*, i32 (i8*)*, i32 (i8*, i32, i32)*, i32 (i8*, i32, i32)*, i32 (i8*, i32, i32, i8*)*, i32 (i8*)* }

@app_info_debug_enable = weak hidden local_unnamed_addr global i32 0, align 4, !dbg !0
@opp_info = internal unnamed_addr global %struct.opp_channel_info* null, align 4, !dbg !174
@profile_debug_enable = external local_unnamed_addr global i8, align 1
@pbap_connect.type_head = internal constant [2 x i8] c"F\00", align 1, !dbg !155
@.str.2 = private unnamed_addr constant [15 x i8] c"telecom/pb.vcf\00", align 1

!32 = !DIEnumerator(name: "OBEX_OPCODE_FINAL_GET", value: 131)
!33 = !DIEnumerator(name: "OBEX_OPCODE_SETPATH", value: 133)
!34 = !DIEnumerator(name: "OBEX_OPCODE_ACTION", value: 134)
!35 = !DIEnumerator(name: "OBEX_OPCODE_SESSION", value: 135)
!36 = !DIEnumerator(name: "OBEX_OPCODE_ABORT", value: 255)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 62, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!39 = !DIEnumerator(name: "OBEX_HEADER_COUNT", value: 192)
!40 = !DIEnumerator(name: "OBEX_HEADER_OBJNAME", value: 1)
!41 = !DIEnumerator(name: "OBEX_HEADER_TYPE", value: 66)
!42 = !DIEnumerator(name: "OBEX_HEADER_LENGTH", value: 195)
!43 = !DIEnumerator(name: "OBEX_HEADER_TIME", value: 68)
!44 = !DIEnumerator(name: "OBEX_HEADER_DESCRIPTION", value: 5)
!45 = !DIEnumerator(name: "OBEX_HEADER_TARGET", value: 70)
!46 = !DIEnumerator(name: "OBEX_HEADER_HTTP", value: 71)
!47 = !DIEnumerator(name: "OBEX_HEADER_BODY", value: 72)
!48 = !DIEnumerator(name: "OBEX_HEADER_ENDOFBODY", value: 73)
!49 = !DIEnumerator(name: "OBEX_HEADER_WHO", value: 74)
!50 = !DIEnumerator(name: "OBEX_HEADER_CONNECTION_ID", value: 203)
!51 = !DIEnumerator(name: "OBEX_HEADER_APP_PARAMETERS", value: 76)
!52 = !DIEnumerator(name: "OBEX_HEADER_AUTH_CHALLENGE", value: 77)
!53 = !DIEnumerator(name: "OBEX_HEADER_AUTH_RESPONSE", value: 78)
!54 = !DIEnumerator(name: "OBEX_HEADER_CREATOR_ID", value: 207)
!55 = !DIEnumerator(name: "OBEX_HEADER_WAN_UUID", value: 80)
!56 = !DIEnumerator(name: "OBEX_HEADER_OBJ_CLASS", value: 81)
!57 = !DIEnumerator(name: "OBEX_HEADER_SESSION_PARAM", value: 82)
!58 = !DIEnumerator(name: "OBEX_HEADER_SESSION_SEQUENCE_NUM", value: 147)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CALL_TYPE", file: !60, line: 26, size: 32, elements: !61)
!60 = !DIFile(filename: "../btstack/Profile/include/bredr/vcard.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!61 = !{!62, !63, !64}
!62 = !DIEnumerator(name: "DIALED", value: 1)
!63 = !DIEnumerator(name: "INCOME", value: 2)
!64 = !DIEnumerator(name: "MISS", value: 3)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 19, size: 32, elements: !66)
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74}
!67 = !DIEnumerator(name: "PHONE_PHONEBOOK", value: 0)
!68 = !DIEnumerator(name: "SIM_PHONEBOOK", value: 1)
!69 = !DIEnumerator(name: "OUTGOING_CALLS_HISTORY", value: 2)
!70 = !DIEnumerator(name: "INCOMING_CALLS_HISTORY", value: 3)
!71 = !DIEnumerator(name: "MISSED_CALLS_HISTORY", value: 4)
!72 = !DIEnumerator(name: "COMBINED_CALLS_HISTORY", value: 5)
!73 = !DIEnumerator(name: "SPEED_DIAL", value: 6)
!74 = !DIEnumerator(name: "FAVORITE_CONTACTS", value: 7)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !76, line: 31, size: 32, elements: !77)
!76 = !DIFile(filename: "../btstack/Profile/include/bredr/profile_common.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85}
!78 = !DIEnumerator(name: "PROFILE_CMD_OK", value: 0)
!79 = !DIEnumerator(name: "PROFILE_CMD_DEVICE_NO_FOUND", value: -1000)
!80 = !DIEnumerator(name: "PROFILE_CMD_NO_FOUND", value: -1001)
!81 = !DIEnumerator(name: "PROFILE_CMD_SEND_ERROR", value: -1002)
!82 = !DIEnumerator(name: "PROFILE_CMD_REMOTE_NOT_SUPPORT", value: -1003)
!83 = !DIEnumerator(name: "PROFILE_CMD_TRY_AGAIN_LATER", value: -1004)
!84 = !DIEnumerator(name: "PROFILE_CMD_DATA_PARSE_ERROE", value: -1005)
!85 = !DIEnumerator(name: "PROFILE_CMD_PROFILE_NOT_SUPPORT", value: -1006)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !87, line: 143, size: 32, elements: !88)
!87 = !DIFile(filename: "../btstack/Protocol/include/bredr/sdp.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!88 = !{!89, !90, !91}
!89 = !DIEnumerator(name: "SDP_CMD_CONNECT", value: 0)
!90 = !DIEnumerator(name: "SDP_CMD_DISCONNECT", value: 1)
!91 = !DIEnumerator(name: "SDP_CMD_GET_REMOTE_PNP_INFO", value: 2)
!92 = !{!93, !94, !98, !101, !103, !105, !121, !149}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 32)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !96, line: 44, baseType: !97)
!96 = !DIFile(filename: "../btcommon/typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!97 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!100 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !96, line: 48, baseType: !102)
!102 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !96, line: 46, baseType: !104)
!104 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "Obex_connect_t", file: !25, line: 93, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Obex_connect", file: !25, line: 86, size: 56, elements: !108)
!108 = !{!109, !112, !114, !115, !116, !117}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !107, file: !25, line: 87, baseType: !110, size: 8)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !111, line: 11, baseType: !97)
!111 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!112 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_len", scope: !107, file: !25, line: 88, baseType: !113, size: 16, offset: 8)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !111, line: 13, baseType: !104)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !107, file: !25, line: 89, baseType: !110, size: 8, offset: 24)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !107, file: !25, line: 90, baseType: !110, size: 8, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "max_pkt_len", scope: !107, file: !25, line: 91, baseType: !113, size: 16, offset: 40)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "data_optional_headers", scope: !107, file: !25, line: 92, baseType: !118, offset: 56)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 0)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "opp_info_t", file: !6, line: 71, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opp_channel_info", file: !6, line: 54, size: 576, elements: !124)
!124 = !{!125, !126, !127, !128, !129, !131, !132, !133, !134, !135, !137, !138, !140, !144, !148}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "pbap_pos_read", scope: !123, file: !6, line: 55, baseType: !95, size: 8)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "pbap_pos_write", scope: !123, file: !6, line: 56, baseType: !95, size: 8, offset: 8)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "op_type", scope: !123, file: !6, line: 57, baseType: !95, size: 8, offset: 16)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "reserve", scope: !123, file: !6, line: 58, baseType: !95, size: 8, offset: 24)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "last_index", scope: !123, file: !6, line: 59, baseType: !130, size: 16, offset: 32)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !96, line: 46, baseType: !104)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "temp_buffer_size", scope: !123, file: !6, line: 60, baseType: !130, size: 16, offset: 48)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "current_index", scope: !123, file: !6, line: 61, baseType: !130, size: 16, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "opp_rfcomm_channel_id", scope: !123, file: !6, line: 62, baseType: !130, size: 16, offset: 80)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "current_packet_total_len", scope: !123, file: !6, line: 63, baseType: !130, size: 16, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "header_conn_id", scope: !123, file: !6, line: 64, baseType: !136, size: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !96, line: 48, baseType: !102)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "total_get_len", scope: !123, file: !6, line: 65, baseType: !136, size: 32, offset: 160)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "pbap_status", scope: !123, file: !6, line: 66, baseType: !139, size: 32, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "PBAP_STATUS", file: !6, line: 48, baseType: !5)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "pbap_index", scope: !123, file: !6, line: 67, baseType: !141, size: 256, offset: 224)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 256, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 16)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "conn_addr", scope: !123, file: !6, line: 68, baseType: !145, size: 48, offset: 480)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 48, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 6)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "temp_data_buffer", scope: !123, file: !6, line: 69, baseType: !94, size: 32, offset: 544)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_addr_t", file: !151, line: 7, baseType: !152)
!151 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 48, elements: !146)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !96, line: 44, baseType: !97)
!154 = !{!0, !155, !165, !167, !174}
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "type_head", scope: !157, file: !3, line: 258, type: !161, isLocal: true, isDefinition: true)
!157 = distinct !DISubprogram(name: "pbap_connect", scope: !3, file: !3, line: 256, type: !158, isLocal: false, isDefinition: true, scopeLine: 257, isOptimized: true, unit: !2, variables: !160)
!158 = !DISubroutineType(types: !159)
!159 = !{null}
!160 = !{}
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 16, elements: !163)
!162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!163 = !{!164}
!164 = !DISubrange(count: 2)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "number_type", scope: !2, file: !3, line: 414, type: !95, isLocal: false, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "opp_buf", scope: !2, file: !3, line: 38, type: !169, isLocal: true, isDefinition: true)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opp_buf_struct", file: !3, line: 34, size: 64, elements: !170)
!170 = !{!171, !173}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !169, file: !3, line: 35, baseType: !172, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !169, file: !3, line: 36, baseType: !136, size: 32, offset: 32)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "opp_info", scope: !2, file: !3, line: 29, type: !176, isLocal: true, isDefinition: true)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!177 = !DIFile(filename: "../btcommon/profile_stack_debug.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!178 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!179 = !{i32 2, !"Dwarf Version", i32 4}
!180 = !{i32 2, !"Debug Info Version", i32 3}
!181 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!182 = distinct !DISubprogram(name: "pbap_init", scope: !3, file: !3, line: 52, type: !183, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !185)
!183 = !DISubroutineType(types: !184)
!184 = !{null, !121, !94, !136}
!185 = !{!186, !187, !188}
!186 = !DILocalVariable(name: "opp_info_str", arg: 1, scope: !182, file: !3, line: 52, type: !121)
!187 = !DILocalVariable(name: "buffer", arg: 2, scope: !182, file: !3, line: 52, type: !94)
!188 = !DILocalVariable(name: "buf_size", arg: 3, scope: !182, file: !3, line: 52, type: !136)
!189 = !DILocation(line: 52, column: 28, scope: !182)
!190 = !DILocation(line: 52, column: 46, scope: !182)
!191 = !DILocation(line: 52, column: 58, scope: !182)
!192 = !DILocation(line: 55, column: 9, scope: !193)
!193 = distinct !DILexicalBlock(scope: !182, file: !3, line: 55, column: 9)
!194 = !DILocation(line: 55, column: 9, scope: !182)
!195 = !{!196, !196, i64 0}
!196 = !{!"any pointer", !197, i64 0}
!197 = !{!"omnipotent char", !198, i64 0}
!198 = !{!"Simple C/C++ TBAA"}
!199 = !DILocation(line: 56, column: 18, scope: !200)
!200 = distinct !DILexicalBlock(scope: !193, file: !3, line: 55, column: 23)
!201 = !DILocation(line: 57, column: 5, scope: !200)
!202 = !DILocation(line: 69, column: 5, scope: !182)
!203 = !DILocation(line: 60, column: 15, scope: !182)
!204 = !DILocation(line: 60, column: 29, scope: !182)
!205 = !{!206, !197, i64 0}
!206 = !{!"opp_channel_info", !197, i64 0, !197, i64 1, !197, i64 2, !197, i64 3, !207, i64 4, !207, i64 6, !207, i64 8, !207, i64 10, !207, i64 12, !208, i64 16, !208, i64 20, !197, i64 24, !197, i64 28, !197, i64 60, !196, i64 68}
!207 = !{!"short", !197, i64 0}
!208 = !{!"int", !197, i64 0}
!209 = !DILocation(line: 61, column: 15, scope: !182)
!210 = !DILocation(line: 61, column: 30, scope: !182)
!211 = !{!206, !197, i64 1}
!212 = !DILocation(line: 62, column: 15, scope: !182)
!213 = !DILocation(line: 62, column: 27, scope: !182)
!214 = !{!206, !197, i64 24}
!215 = !DILocation(line: 63, column: 15, scope: !182)
!216 = !DILocation(line: 63, column: 37, scope: !182)
!217 = !{!206, !207, i64 10}
!218 = !DILocation(line: 64, column: 15, scope: !182)
!219 = !DILocation(line: 64, column: 29, scope: !182)
!220 = !{!206, !207, i64 8}
!221 = !DILocation(line: 65, column: 15, scope: !182)
!222 = !DILocation(line: 65, column: 29, scope: !182)
!223 = !{!206, !208, i64 20}
!224 = !DILocation(line: 66, column: 17, scope: !182)
!225 = !{!226, !196, i64 0}
!226 = !{!"opp_buf_struct", !196, i64 0, !208, i64 4}
!227 = !DILocation(line: 67, column: 17, scope: !182)
!228 = !{!226, !208, i64 4}
!229 = !DILocation(line: 68, column: 15, scope: !182)
!230 = !DILocation(line: 68, column: 32, scope: !182)
!231 = !{!206, !207, i64 6}
!232 = !DILocation(line: 69, column: 15, scope: !182)
!233 = !DILocation(line: 69, column: 32, scope: !182)
!234 = !{!206, !196, i64 68}
!235 = !DILocation(line: 70, column: 5, scope: !182)
!236 = !DILocation(line: 73, column: 5, scope: !182)
!237 = !DILocation(line: 74, column: 1, scope: !182)
