temp.o:	file format ELF32-i386

.debug_info contents:
0x00000000: Compile Unit: length = 0x00000fb5 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x00000fb9)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)")
              DW_AT_language	(DW_LANG_C99)
              DW_AT_name	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/opp.c")
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
              DW_AT_GNU_pubnames	(true)
              DW_AT_low_pc	(0x0000000000000000)
              DW_AT_high_pc	(0x0000000000002371)

0x00000026:   DW_TAG_variable
                DW_AT_name	("app_info_debug_enable")
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/profile_stack_debug.h")
                DW_AT_decl_line	(190)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000037:   DW_TAG_base_type
                DW_AT_name	("int")
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_byte_size	(0x04)

0x0000003e:   DW_TAG_subprogram
                DW_AT_low_pc	(0x000000000000083e)
                DW_AT_high_pc	(0x00000000000008d4)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("pbap_connect")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/opp.c")
                DW_AT_decl_line	(256)
                DW_AT_external	(true)

0x00000050:     DW_TAG_variable
                  DW_AT_name	("type_head")
                  DW_AT_type	(cu + 0x0063 "const u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/opp.c")
                  DW_AT_decl_line	(258)
                  DW_AT_location	(DW_OP_addr 0xa0)

0x00000062:     NULL

0x00000063:   DW_TAG_array_type
                DW_AT_type	(cu + 0x006f "const u8")

0x00000068:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0086 "sizetype")
                  DW_AT_count	(0x02)

0x0000006e:     NULL

0x0000006f:   DW_TAG_const_type
                DW_AT_type	(cu + 0x0074 "u8")

0x00000074:   DW_TAG_typedef
                DW_AT_type	(cu + 0x007f "unsigned char")
                DW_AT_name	("u8")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(44)

0x0000007f:   DW_TAG_base_type
                DW_AT_name	("unsigned char")
                DW_AT_encoding	(DW_ATE_unsigned_char)
                DW_AT_byte_size	(0x01)

0x00000086:   DW_TAG_base_type
                DW_AT_name	("sizetype")
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_unsigned)

0x0000008d:   DW_TAG_variable
                DW_AT_name	("number_type")
                DW_AT_type	(cu + 0x0074 "u8")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/opp.c")
                DW_AT_decl_line	(414)
                DW_AT_location	(DW_OP_addr 0x0)

0x0000009f:   DW_TAG_variable
                DW_AT_name	("opp_buf")
                DW_AT_type	(cu + 0x00aa "opp_buf_struct")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/opp.c")
                DW_AT_decl_line	(38)

0x000000aa:   DW_TAG_structure_type
                DW_AT_name	("opp_buf_struct")
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/opp.c")
                DW_AT_decl_line	(34)

0x000000b2:     DW_TAG_member
                  DW_AT_name	("ptr")
                  DW_AT_type	(cu + 0x00cb "u32*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/opp.c")
                  DW_AT_decl_line	(35)
                  DW_AT_data_member_location	(0x00)

0x000000be:     DW_TAG_member
                  DW_AT_name	("len")
                  DW_AT_type	(cu + 0x00d0 "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/opp.c")
                  DW_AT_decl_line	(36)
                  DW_AT_data_member_location	(0x04)

0x000000ca:     NULL

0x000000cb:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x00d0 "u32")

0x000000d0:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00db "unsigned int")
                DW_AT_name	("u32")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(48)

0x000000db:   DW_TAG_base_type
                DW_AT_name	("unsigned int")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x04)

0x000000e2:   DW_TAG_variable
                DW_AT_name	("opp_info")
                DW_AT_type	(cu + 0x00f3 "opp_channel_info*")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/opp.c")
                DW_AT_decl_line	(29)
                DW_AT_location	(DW_OP_addr 0x4)

0x000000f3:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x00f8 "opp_channel_info")

0x000000f8:   DW_TAG_structure_type
                DW_AT_name	("opp_channel_info")
                DW_AT_byte_size	(0x48)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/opp.h")
                DW_AT_decl_line	(54)

0x00000100:     DW_TAG_member
                  DW_AT_name	("pbap_pos_read")
                  DW_AT_type	(cu + 0x0074 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/opp.h")
                  DW_AT_decl_line	(55)
                  DW_AT_data_member_location	(0x00)

0x0000010c:     DW_TAG_member
                  DW_AT_name	("pbap_pos_write")
                  DW_AT_type	(cu + 0x0074 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/opp.h")
                  DW_AT_decl_line	(56)
                  DW_AT_data_member_location	(0x01)

0x00000118:     DW_TAG_member
                  DW_AT_name	("op_type")
                  DW_AT_type	(cu + 0x0074 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/opp.h")
                  DW_AT_decl_line	(57)
                  DW_AT_data_member_location	(0x02)

0x00000124:     DW_TAG_member
                  DW_AT_name	("reserve")
                  DW_AT_type	(cu + 0x0074 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/opp.h")
                  DW_AT_decl_line	(58)
                  DW_AT_data_member_location	(0x03)

0x00000130:     DW_TAG_member
                  DW_AT_name	("last_index")
                  DW_AT_type	(cu + 0x01b5 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/opp.h")
                  DW_AT_decl_line	(59)
                  DW_AT_data_member_location	(0x04)

0x0000013c:     DW_TAG_member
                  DW_AT_name	("temp_buffer_size")
                  DW_AT_type	(cu + 0x01b5 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/opp.h")
                  DW_AT_decl_line	(60)
                  DW_AT_data_member_location	(0x06)

0x00000148:     DW_TAG_member
                  DW_AT_name	("current_index")
                  DW_AT_type	(cu + 0x01b5 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/opp.h")
                  DW_AT_decl_line	(61)
                  DW_AT_data_member_location	(0x08)

0x00000154:     DW_TAG_member
                  DW_AT_name	("opp_rfcomm_channel_id")
                  DW_AT_type	(cu + 0x01b5 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/opp.h")
                  DW_AT_decl_line	(62)
                  DW_AT_data_member_location	(0x0a)

0x00000160:     DW_TAG_member
                  DW_AT_name	("current_packet_total_len")
                  DW_AT_type	(cu + 0x01b5 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/opp.h")
                  DW_AT_decl_line	(63)
                  DW_AT_data_member_location	(0x0c)

0x0000016c:     DW_TAG_member
                  DW_AT_name	("header_conn_id")
                  DW_AT_type	(cu + 0x00d0 "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/opp.h")
                  DW_AT_decl_line	(64)
                  DW_AT_data_member_location	(0x10)

0x00000178:     DW_TAG_member
                  DW_AT_name	("total_get_len")
                  DW_AT_type	(cu + 0x00d0 "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/opp.h")
                  DW_AT_decl_line	(65)
                  DW_AT_data_member_location	(0x14)

0x00000184:     DW_TAG_member
                  DW_AT_name	("pbap_status")
                  DW_AT_type	(cu + 0x01c7 "PBAP_STATUS")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/opp.h")
                  DW_AT_decl_line	(66)
                  DW_AT_data_member_location	(0x18)

0x00000190:     DW_TAG_member
                  DW_AT_name	("pbap_index")
                  DW_AT_type	(cu + 0x0237 "u16[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/opp.h")
                  DW_AT_decl_line	(67)
                  DW_AT_data_member_location	(0x1c)

0x0000019c:     DW_TAG_member
                  DW_AT_name	("conn_addr")
                  DW_AT_type	(cu + 0x0243 "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/opp.h")
                  DW_AT_decl_line	(68)
                  DW_AT_data_member_location	(0x3c)

0x000001a8:     DW_TAG_member
                  DW_AT_name	("temp_data_buffer")
                  DW_AT_type	(cu + 0x024f "u8*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/opp.h")
                  DW_AT_decl_line	(69)
                  DW_AT_data_member_location	(0x44)

0x000001b4:     NULL

0x000001b5:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01c0 "unsigned short")
                DW_AT_name	("u16")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(46)

0x000001c0:   DW_TAG_base_type
                DW_AT_name	("unsigned short")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x02)

0x000001c7:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01d2 "enumeration ")
                DW_AT_name	("PBAP_STATUS")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/opp.h")
                DW_AT_decl_line	(48)

0x000001d2:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/opp.h")
                DW_AT_decl_line	(30)

0x000001d6:     DW_TAG_enumerator
                  DW_AT_name	("PBAP_NOT_USE")
                  DW_AT_const_value	(0)

0x000001dc:     DW_TAG_enumerator
                  DW_AT_name	("PBAP_READY_OPEN_RFCOMM")
                  DW_AT_const_value	(1)

0x000001e2:     DW_TAG_enumerator
                  DW_AT_name	("PBAP_WILL_OPEN_RFCOMM")
                  DW_AT_const_value	(2)

0x000001e8:     DW_TAG_enumerator
                  DW_AT_name	("PBAP_WILL_SENT_CONNECT")
                  DW_AT_const_value	(3)

0x000001ee:     DW_TAG_enumerator
                  DW_AT_name	("PBAP_WILL_SENT_GET_CMD")
                  DW_AT_const_value	(4)

0x000001f4:     DW_TAG_enumerator
                  DW_AT_name	("PBAP_WILL_SENT_SETROOTPATH")
                  DW_AT_const_value	(5)

0x000001fa:     DW_TAG_enumerator
                  DW_AT_name	("PBAP_WILL_SENT_TELECOM_PATH")
                  DW_AT_const_value	(6)

0x00000200:     DW_TAG_enumerator
                  DW_AT_name	("PBAP_WILL_SENT_SETFOLDER_PATH")
                  DW_AT_const_value	(7)

0x00000206:     DW_TAG_enumerator
                  DW_AT_name	("PBAP_WILL_SENT_GET_VCARD")
                  DW_AT_const_value	(8)

0x0000020c:     DW_TAG_enumerator
                  DW_AT_name	("PBAP_WAIT_VCARD_RESPONSE")
                  DW_AT_const_value	(9)

0x00000212:     DW_TAG_enumerator
                  DW_AT_name	("PBAP_WAIT_PHONEPB_RESPONSE")
                  DW_AT_const_value	(10)

0x00000218:     DW_TAG_enumerator
                  DW_AT_name	("PBAP_WAIT_SIMPB_RESPONSE")
                  DW_AT_const_value	(11)

0x0000021e:     DW_TAG_enumerator
                  DW_AT_name	("PBAP_WAIT_ICH_RESPONSE")
                  DW_AT_const_value	(12)

0x00000224:     DW_TAG_enumerator
                  DW_AT_name	("PBAP_WAIT_OCH_RESPONSE")
                  DW_AT_const_value	(13)

0x0000022a:     DW_TAG_enumerator
                  DW_AT_name	("PBAP_WAIT_MCH_RESPONSE")
                  DW_AT_const_value	(14)

0x00000230:     DW_TAG_enumerator
                  DW_AT_name	("PBAP_WILL_SENT_DISCONNECT")
                  DW_AT_const_value	(15)

0x00000236:     NULL

0x00000237:   DW_TAG_array_type
                DW_AT_type	(cu + 0x01b5 "u16")

0x0000023c:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0086 "sizetype")
                  DW_AT_count	(0x10)

0x00000242:     NULL

0x00000243:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0074 "u8")

0x00000248:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0086 "sizetype")
                  DW_AT_count	(0x06)

0x0000024e:     NULL

0x0000024f:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0074 "u8")

0x00000254:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/obex.h")
                DW_AT_decl_line	(6)

0x00000258:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_OPCODE_CONNECT")
                  DW_AT_const_value	(128)

0x0000025f:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_OPCODE_DISCONNECT")
                  DW_AT_const_value	(129)

0x00000266:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_OPCODE_PUT")
                  DW_AT_const_value	(2)

0x0000026c:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_OPCODE_FINAL_PUT")
                  DW_AT_const_value	(130)

0x00000273:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_OPCODE_GET")
                  DW_AT_const_value	(3)

0x00000279:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_OPCODE_FINAL_GET")
                  DW_AT_const_value	(131)

0x00000280:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_OPCODE_SETPATH")
                  DW_AT_const_value	(133)

0x00000287:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_OPCODE_ACTION")
                  DW_AT_const_value	(134)

0x0000028e:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_OPCODE_SESSION")
                  DW_AT_const_value	(135)

0x00000295:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_OPCODE_ABORT")
                  DW_AT_const_value	(255)

0x0000029c:     NULL

0x0000029d:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/obex.h")
                DW_AT_decl_line	(62)

0x000002a1:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_HEADER_COUNT")
                  DW_AT_const_value	(192)

0x000002a8:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_HEADER_OBJNAME")
                  DW_AT_const_value	(1)

0x000002ae:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_HEADER_TYPE")
                  DW_AT_const_value	(66)

0x000002b5:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_HEADER_LENGTH")
                  DW_AT_const_value	(195)

0x000002bc:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_HEADER_TIME")
                  DW_AT_const_value	(68)

0x000002c3:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_HEADER_DESCRIPTION")
                  DW_AT_const_value	(5)

0x000002c9:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_HEADER_TARGET")
                  DW_AT_const_value	(70)

0x000002d0:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_HEADER_HTTP")
                  DW_AT_const_value	(71)

0x000002d7:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_HEADER_BODY")
                  DW_AT_const_value	(72)

0x000002de:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_HEADER_ENDOFBODY")
                  DW_AT_const_value	(73)

0x000002e5:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_HEADER_WHO")
                  DW_AT_const_value	(74)

0x000002ec:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_HEADER_CONNECTION_ID")
                  DW_AT_const_value	(203)

0x000002f3:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_HEADER_APP_PARAMETERS")
                  DW_AT_const_value	(76)

0x000002fa:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_HEADER_AUTH_CHALLENGE")
                  DW_AT_const_value	(77)

0x00000301:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_HEADER_AUTH_RESPONSE")
                  DW_AT_const_value	(78)

0x00000308:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_HEADER_CREATOR_ID")
                  DW_AT_const_value	(207)

0x0000030f:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_HEADER_WAN_UUID")
                  DW_AT_const_value	(80)

0x00000316:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_HEADER_OBJ_CLASS")
                  DW_AT_const_value	(81)

0x0000031d:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_HEADER_SESSION_PARAM")
                  DW_AT_const_value	(82)

0x00000324:     DW_TAG_enumerator
                  DW_AT_name	("OBEX_HEADER_SESSION_SEQUENCE_NUM")
                  DW_AT_const_value	(147)

0x0000032b:     NULL

0x0000032c:   DW_TAG_enumeration_type
                DW_AT_name	("CALL_TYPE")
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                DW_AT_decl_line	(26)

0x00000334:     DW_TAG_enumerator
                  DW_AT_name	("DIALED")
                  DW_AT_const_value	(1)

0x0000033a:     DW_TAG_enumerator
                  DW_AT_name	("INCOME")
                  DW_AT_const_value	(2)

0x00000340:     DW_TAG_enumerator
                  DW_AT_name	("MISS")
                  DW_AT_const_value	(3)

0x00000346:     NULL

0x00000347:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/opp.h")
                DW_AT_decl_line	(19)

0x0000034b:     DW_TAG_enumerator
                  DW_AT_name	("PHONE_PHONEBOOK")
                  DW_AT_const_value	(0)

0x00000351:     DW_TAG_enumerator
                  DW_AT_name	("SIM_PHONEBOOK")
                  DW_AT_const_value	(1)

0x00000357:     DW_TAG_enumerator
                  DW_AT_name	("OUTGOING_CALLS_HISTORY")
                  DW_AT_const_value	(2)

0x0000035d:     DW_TAG_enumerator
                  DW_AT_name	("INCOMING_CALLS_HISTORY")
                  DW_AT_const_value	(3)

0x00000363:     DW_TAG_enumerator
                  DW_AT_name	("MISSED_CALLS_HISTORY")
                  DW_AT_const_value	(4)

0x00000369:     DW_TAG_enumerator
                  DW_AT_name	("COMBINED_CALLS_HISTORY")
                  DW_AT_const_value	(5)

0x0000036f:     DW_TAG_enumerator
                  DW_AT_name	("SPEED_DIAL")
                  DW_AT_const_value	(6)

0x00000375:     DW_TAG_enumerator
                  DW_AT_name	("FAVORITE_CONTACTS")
                  DW_AT_const_value	(7)

0x0000037b:     NULL

0x0000037c:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/profile_common.h")
                DW_AT_decl_line	(31)

0x00000380:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_OK")
                  DW_AT_const_value	(0)

0x00000386:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_DEVICE_NO_FOUND")
                  DW_AT_const_value	(-1000)

0x0000038d:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_NO_FOUND")
                  DW_AT_const_value	(-1001)

0x00000394:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_SEND_ERROR")
                  DW_AT_const_value	(-1002)

0x0000039b:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_REMOTE_NOT_SUPPORT")
                  DW_AT_const_value	(-1003)

0x000003a2:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_TRY_AGAIN_LATER")
                  DW_AT_const_value	(-1004)

0x000003a9:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_DATA_PARSE_ERROE")
                  DW_AT_const_value	(-1005)

0x000003b0:     DW_TAG_enumerator
                  DW_AT_name	("PROFILE_CMD_PROFILE_NOT_SUPPORT")
                  DW_AT_const_value	(-1006)

0x000003b7:     NULL

0x000003b8:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/sdp.h")
                DW_AT_decl_line	(143)

0x000003bc:     DW_TAG_enumerator
                  DW_AT_name	("SDP_CMD_CONNECT")
                  DW_AT_const_value	(0)

0x000003c2:     DW_TAG_enumerator
                  DW_AT_name	("SDP_CMD_DISCONNECT")
                  DW_AT_const_value	(1)

0x000003c8:     DW_TAG_enumerator
                  DW_AT_name	("SDP_CMD_GET_REMOTE_PNP_INFO")
                  DW_AT_const_value	(2)

0x000003ce:     NULL

0x000003cf:   DW_TAG_pointer_type

0x000003d0:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x03d5 "const char")

0x000003d5:   DW_TAG_const_type
                DW_AT_type	(cu + 0x03da "char")

0x000003da:   DW_TAG_base_type
                DW_AT_name	("char")
                DW_AT_encoding	(DW_ATE_signed_char)
                DW_AT_byte_size	(0x01)

0x000003e1:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00db "unsigned int")
                DW_AT_name	("uint32_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(48)

0x000003ec:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01c0 "unsigned short")
                DW_AT_name	("uint16_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(46)

0x000003f7:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x03fc "Obex_connect_t")

0x000003fc:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0407 "Obex_connect")
                DW_AT_name	("Obex_connect_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/obex.h")
                DW_AT_decl_line	(93)

0x00000407:   DW_TAG_structure_type
                DW_AT_name	("Obex_connect")
                DW_AT_byte_size	(0x07)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/obex.h")
                DW_AT_decl_line	(86)

0x0000040f:     DW_TAG_member
                  DW_AT_name	("opcode")
                  DW_AT_type	(cu + 0x0458 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/obex.h")
                  DW_AT_decl_line	(87)
                  DW_AT_data_member_location	(0x00)

0x0000041b:     DW_TAG_member
                  DW_AT_name	("pkt_len")
                  DW_AT_type	(cu + 0x0463 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/obex.h")
                  DW_AT_decl_line	(88)
                  DW_AT_data_member_location	(0x01)

0x00000427:     DW_TAG_member
                  DW_AT_name	("version")
                  DW_AT_type	(cu + 0x0458 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/obex.h")
                  DW_AT_decl_line	(89)
                  DW_AT_data_member_location	(0x03)

0x00000433:     DW_TAG_member
                  DW_AT_name	("flag")
                  DW_AT_type	(cu + 0x0458 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/obex.h")
                  DW_AT_decl_line	(90)
                  DW_AT_data_member_location	(0x04)

0x0000043f:     DW_TAG_member
                  DW_AT_name	("max_pkt_len")
                  DW_AT_type	(cu + 0x0463 "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/obex.h")
                  DW_AT_decl_line	(91)
                  DW_AT_data_member_location	(0x05)

0x0000044b:     DW_TAG_member
                  DW_AT_name	("data_optional_headers")
                  DW_AT_type	(cu + 0x046e "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/obex.h")
                  DW_AT_decl_line	(92)
                  DW_AT_data_member_location	(0x07)

0x00000457:     NULL

0x00000458:   DW_TAG_typedef
                DW_AT_type	(cu + 0x007f "unsigned char")
                DW_AT_name	("u8")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(11)

0x00000463:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01c0 "unsigned short")
                DW_AT_name	("u16")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(13)

0x0000046e:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0458 "u8")

0x00000473:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0086 "sizetype")
                  DW_AT_count	(0x00)

0x00000479:     NULL

0x0000047a:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x047f "opp_info_t")

0x0000047f:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00f8 "opp_channel_info")
                DW_AT_name	("opp_info_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/opp.h")
                DW_AT_decl_line	(71)

0x0000048a:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x048f "bd_addr_t")

0x0000048f:   DW_TAG_typedef
                DW_AT_type	(cu + 0x049a "uint8_t[]")
                DW_AT_name	("bd_addr_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h")
                DW_AT_decl_line	(7)

0x0000049a:   DW_TAG_array_type
                DW_AT_type	(cu + 0x04a6 "uint8_t")

0x0000049f:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0086 "sizetype")
                  DW_AT_count	(0x06)

0x000004a5:     NULL

0x000004a6:   DW_TAG_typedef
                DW_AT_type	(cu + 0x007f "unsigned char")
                DW_AT_name	("uint8_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(44)

0x000004b1:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000000)
                DW_AT_high_pc	(0x00000000000000cf)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("pbap_init")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/opp.c")
                DW_AT_decl_line	(52)
                DW_AT_prototyped	(true)
                DW_AT_external	(true)

0x000004c2:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000000
                     0x0000000000000000 - 0x000000000000001d: DW_OP_reg2 EDX
                     0x000000000000001d - 0x00000000000000cf: DW_OP_breg5 EBP-20)
                  DW_AT_name	("opp_info_str")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/opp.c")
                  DW_AT_decl_line	(52)
                  DW_AT_type	(cu + 0x047a "opp_info_t*")

0x000004d1:     DW_TAG_formal_parameter
                  DW_AT_location	(0x0000001f
                     0x0000000000000000 - 0x000000000000001a: DW_OP_reg1 ECX
                     0x000000000000001a - 0x00000000000000cf: DW_OP_breg5 EBP-16)
                  DW_AT_name	("buffer")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/opp.c")
                  DW_AT_decl_line	(52)
                  DW_AT_type	(cu + 0x024f "u8*")

0x000004e0:     DW_TAG_formal_parameter
                  DW_AT_location	(0x0000003e
                     0x0000000000000000 - 0x0000000000000017: DW_OP_reg0 EAX
