temp.o:	file format ELF32-i386

.debug_info contents:
0x00000000: Compile Unit: length = 0x00000c50 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x00000c54)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)")
              DW_AT_language	(DW_LANG_C99)
              DW_AT_name	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/pan.c")
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
              DW_AT_GNU_pubnames	(true)
              DW_AT_low_pc	(0x0000000000000000)
              DW_AT_high_pc	(0x0000000000001b6e)

0x00000026:   DW_TAG_variable
                DW_AT_name	("app_info_debug_enable")
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/profile_stack_debug.h")
                DW_AT_decl_line	(190)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000037:   DW_TAG_base_type
                DW_AT_name	("int")
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_byte_size	(0x04)

0x0000003e:   DW_TAG_variable
                DW_AT_name	("pan")
                DW_AT_type	(cu + 0x004f "pan_cmd_deal_t*")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/pan.c")
                DW_AT_decl_line	(250)
                DW_AT_location	(DW_OP_addr 0x0)

0x0000004f:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0054 "pan_cmd_deal_t")

0x00000054:   DW_TAG_typedef
                DW_AT_type	(cu + 0x005f "structure ")
                DW_AT_name	("pan_cmd_deal_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/pan.c")
                DW_AT_decl_line	(247)

0x0000005f:   DW_TAG_structure_type
                DW_AT_byte_size	(0x0c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/pan.c")
                DW_AT_decl_line	(245)

0x00000063:     DW_TAG_member
                  DW_AT_name	("pan_loop")
                  DW_AT_type	(cu + 0x0070 "run_loop")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/pan.c")
                  DW_AT_decl_line	(246)
                  DW_AT_data_member_location	(0x00)

0x0000006f:     NULL

0x00000070:   DW_TAG_structure_type
                DW_AT_name	("run_loop")
                DW_AT_byte_size	(0x0c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/run_loop.h")
                DW_AT_decl_line	(9)

0x00000078:     DW_TAG_member
                  DW_AT_name	("entry")
                  DW_AT_type	(cu + 0x009d "btstack_linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/run_loop.h")
                  DW_AT_decl_line	(10)
                  DW_AT_data_member_location	(0x00)

0x00000084:     DW_TAG_member
                  DW_AT_name	("run")
                  DW_AT_type	(cu + 0x00c2 "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/run_loop.h")
                  DW_AT_decl_line	(11)
                  DW_AT_data_member_location	(0x04)

0x00000090:     DW_TAG_member
                  DW_AT_name	("var")
                  DW_AT_type	(cu + 0x00d3 "*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/run_loop.h")
                  DW_AT_decl_line	(12)
                  DW_AT_data_member_location	(0x08)

0x0000009c:     NULL

0x0000009d:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00a8 "btstack_linked_item")
                DW_AT_name	("btstack_linked_item_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(55)

0x000000a8:   DW_TAG_structure_type
                DW_AT_name	("btstack_linked_item")
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(53)

0x000000b0:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(cu + 0x00bd "btstack_linked_item*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                  DW_AT_decl_line	(54)
                  DW_AT_data_member_location	(0x00)

0x000000bc:     NULL

0x000000bd:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x00a8 "btstack_linked_item")

0x000000c2:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x00c7 "subroutine ")

0x000000c7:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x000000c8:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x00ce "run_loop*")

0x000000cd:     NULL

0x000000ce:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0070 "run_loop")

0x000000d3:   DW_TAG_pointer_type

0x000000d4:   DW_TAG_variable
                DW_AT_name	("sdp_pan_service_data")
                DW_AT_type	(cu + 0x00e6 "const u8[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/pan.c")
                DW_AT_decl_line	(580)
                DW_AT_location	(DW_OP_addr 0x0)

0x000000e6:   DW_TAG_array_type
                DW_AT_type	(cu + 0x00f2 "const u8")

0x000000eb:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0109 "sizetype")
                  DW_AT_count	(0xc8)

0x000000f1:     NULL

0x000000f2:   DW_TAG_const_type
                DW_AT_type	(cu + 0x00f7 "u8")

0x000000f7:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0102 "unsigned char")
                DW_AT_name	("u8")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(44)

0x00000102:   DW_TAG_base_type
                DW_AT_name	("unsigned char")
                DW_AT_encoding	(DW_ATE_unsigned_char)
                DW_AT_byte_size	(0x01)

0x00000109:   DW_TAG_base_type
                DW_AT_name	("sizetype")
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_unsigned)

0x00000110:   DW_TAG_variable
                DW_AT_name	("bt_suspend_pan_loop_resumepan_loop_release")
                DW_AT_type	(cu + 0x0122 "const bt_sleep")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/pan.c")
                DW_AT_decl_line	(669)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000122:   DW_TAG_const_type
                DW_AT_type	(cu + 0x0127 "bt_sleep")

0x00000127:   DW_TAG_structure_type
                DW_AT_name	("bt_sleep")
                DW_AT_byte_size	(0x0c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/bt_config.h")
                DW_AT_decl_line	(313)

0x00000130:     DW_TAG_member
                  DW_AT_name	("suspend")
                  DW_AT_type	(cu + 0x0158 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/bt_config.h")
                  DW_AT_decl_line	(314)
                  DW_AT_data_member_location	(0x00)

0x0000013d:     DW_TAG_member
                  DW_AT_name	("resume")
                  DW_AT_type	(cu + 0x0158 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/bt_config.h")
                  DW_AT_decl_line	(315)
                  DW_AT_data_member_location	(0x04)

0x0000014a:     DW_TAG_member
                  DW_AT_name	("release")
                  DW_AT_type	(cu + 0x0158 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/bt_config.h")
                  DW_AT_decl_line	(316)
                  DW_AT_data_member_location	(0x08)

0x00000157:     NULL

0x00000158:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x015d "subroutine int")

0x0000015d:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")

0x00000162:     DW_TAG_unspecified_parameters

0x00000163:     NULL

0x00000164:   DW_TAG_variable
                DW_AT_name	("pan_deal")
                DW_AT_type	(cu + 0x0054 "pan_cmd_deal_t")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/pan.c")
                DW_AT_decl_line	(249)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000175:   DW_TAG_variable
                DW_AT_name	("default_panu_service_name")
                DW_AT_type	(cu + 0x0186 "const char[]")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/pan.c")
                DW_AT_decl_line	(33)
                DW_AT_location	(DW_OP_addr 0xc8)

0x00000186:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0192 "const char")

0x0000018b:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0109 "sizetype")
                  DW_AT_count	(0x1d)

0x00000191:     NULL

0x00000192:   DW_TAG_const_type
                DW_AT_type	(cu + 0x0197 "char")

0x00000197:   DW_TAG_base_type
                DW_AT_name	("char")
                DW_AT_encoding	(DW_ATE_signed_char)
                DW_AT_byte_size	(0x01)

0x0000019e:   DW_TAG_variable
                DW_AT_name	("default_nap_service_name")
                DW_AT_type	(cu + 0x0186 "const char[]")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/pan.c")
                DW_AT_decl_line	(36)
                DW_AT_location	(DW_OP_addr 0xe5)

0x000001af:   DW_TAG_variable
                DW_AT_name	("default_gn_service_name")
                DW_AT_type	(cu + 0x0186 "const char[]")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/pan.c")
                DW_AT_decl_line	(39)
                DW_AT_location	(DW_OP_addr 0x102)

0x000001c0:   DW_TAG_variable
                DW_AT_name	("default_panu_service_desc")
                DW_AT_type	(cu + 0x0186 "const char[]")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/pan.c")
                DW_AT_decl_line	(34)
                DW_AT_location	(DW_OP_addr 0x11f)

0x000001d1:   DW_TAG_variable
                DW_AT_name	("default_nap_service_desc")
                DW_AT_type	(cu + 0x01e2 "const char[]")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/pan.c")
                DW_AT_decl_line	(37)
                DW_AT_location	(DW_OP_addr 0x13c)

0x000001e2:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0192 "const char")

0x000001e7:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0109 "sizetype")
                  DW_AT_count	(0x33)

0x000001ed:     NULL

0x000001ee:   DW_TAG_variable
                DW_AT_name	("default_gn_service_desc")
                DW_AT_type	(cu + 0x01ff "const char[]")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/pan.c")
                DW_AT_decl_line	(40)
                DW_AT_location	(DW_OP_addr 0x16f)

0x000001ff:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0192 "const char")

0x00000204:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0109 "sizetype")
                  DW_AT_count	(0x26)

0x0000020a:     NULL

0x0000020b:   DW_TAG_variable
                DW_AT_name	("bnep_cid")
