temp.o:	file format ELF32-i386

.debug_info contents:
0x00000000: Compile Unit: length = 0x00000b7c version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x00000b80)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)")
              DW_AT_language	(DW_LANG_C99)
              DW_AT_name	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
              DW_AT_GNU_pubnames	(true)
              DW_AT_low_pc	(0x0000000000000000)
              DW_AT_high_pc	(0x0000000000001cef)

0x00000026:   DW_TAG_variable
                DW_AT_name	("app_info_debug_enable")
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/profile_stack_debug.h")
                DW_AT_decl_line	(190)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000037:   DW_TAG_base_type
                DW_AT_name	("int")
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_byte_size	(0x04)

0x0000003e:   DW_TAG_variable
                DW_AT_name	("remote_info_hdl")
                DW_AT_type	(cu + 0x004f "remote_ctrl_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                DW_AT_decl_line	(91)
                DW_AT_location	(DW_OP_addr 0x0)

0x0000004f:   DW_TAG_typedef
                DW_AT_type	(cu + 0x005a "structure ")
                DW_AT_name	("remote_ctrl_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                DW_AT_decl_line	(79)

0x0000005a:   DW_TAG_structure_type
                DW_AT_byte_size	(0x0e)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                DW_AT_decl_line	(70)

0x0000005e:     DW_TAG_member
                  DW_AT_name	("info_tag")
                  DW_AT_type	(cu + 0x00cb "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(71)
                  DW_AT_data_member_location	(0x00)

0x0000006a:     DW_TAG_member
                  DW_AT_name	("cfg_dev_max")
                  DW_AT_type	(cu + 0x00cb "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(72)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x01)

0x00000079:     DW_TAG_member
                  DW_AT_name	("cfg_cover_allow")
                  DW_AT_type	(cu + 0x00cb "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(73)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x02)
                  DW_AT_data_member_location	(0x01)

0x00000088:     DW_TAG_member
                  DW_AT_name	("pair_lock")
                  DW_AT_type	(cu + 0x00cb "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(74)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x01)
                  DW_AT_data_member_location	(0x01)

0x00000097:     DW_TAG_member
                  DW_AT_name	("reserved")
                  DW_AT_type	(cu + 0x00cb "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(75)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x01)

0x000000a6:     DW_TAG_member
                  DW_AT_name	("dev_count")
                  DW_AT_type	(cu + 0x00cb "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(76)
                  DW_AT_data_member_location	(0x02)

0x000000b2:     DW_TAG_member
                  DW_AT_name	("last_vm_write_index")
                  DW_AT_type	(cu + 0x00cb "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(77)
                  DW_AT_data_member_location	(0x03)

0x000000be:     DW_TAG_member
                  DW_AT_name	("vm_dev_sn")
                  DW_AT_type	(cu + 0x00dd "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(78)
                  DW_AT_data_member_location	(0x04)

0x000000ca:     NULL

0x000000cb:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00d6 "unsigned char")
                DW_AT_name	("u8")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(11)

0x000000d6:   DW_TAG_base_type
                DW_AT_name	("unsigned char")
                DW_AT_encoding	(DW_ATE_unsigned_char)
                DW_AT_byte_size	(0x01)

0x000000dd:   DW_TAG_array_type
                DW_AT_type	(cu + 0x00cb "u8")

0x000000e2:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x00e9 "sizetype")
                  DW_AT_count	(0x0a)

0x000000e8:     NULL

0x000000e9:   DW_TAG_base_type
                DW_AT_name	("sizetype")
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_unsigned)

0x000000f0:   DW_TAG_variable
                DW_AT_name	("remote_info_init")
                DW_AT_type	(cu + 0x00fb "const remote_ctrl_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                DW_AT_decl_line	(82)

0x000000fb:   DW_TAG_const_type
                DW_AT_type	(cu + 0x004f "remote_ctrl_t")

0x00000100:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0105 "const ")

0x00000105:   DW_TAG_const_type

0x00000106:   DW_TAG_pointer_type

0x00000107:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x00cb "u8")

0x0000010c:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000000)
                DW_AT_high_pc	(0x0000000000000034)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("ble_list_get_conn_addr_item")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                DW_AT_decl_line	(351)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0232 "bool")
                DW_AT_external	(true)

0x00000122:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000000
                     0x0000000000000000 - 0x0000000000000030: DW_OP_reg6 ESI)
                  DW_AT_name	("conn_addr")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(351)
                  DW_AT_type	(cu + 0x0107 "u8*")

0x00000132:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000013
                     0x0000000000000000 - 0x0000000000000022: DW_OP_reg2 EDX)
                  DW_AT_name	("conn_addr_type")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(351)
                  DW_AT_type	(cu + 0x00cb "u8")

0x00000142:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000026
                     0x0000000000000000 - 0x0000000000000024: DW_OP_reg1 ECX)
                  DW_AT_name	("role")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(351)
                  DW_AT_type	(cu + 0x00cb "u8")

0x00000152:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000039
                     0x0000000000000000 - 0x0000000000000029: DW_OP_reg0 EAX)
                  DW_AT_name	("item")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(351)
                  DW_AT_type	(cu + 0x0b6e "BLE_REMOTE_LIST_T*")

0x00000162:     NULL

0x00000163:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000034)
                DW_AT_high_pc	(0x000000000000018a)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("get_conn_addr_item")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                DW_AT_decl_line	(318)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0232 "bool")

0x00000179:     DW_TAG_formal_parameter
                  DW_AT_location	(0x0000004c
                     0x0000000000000034 - 0x0000000000000059: DW_OP_reg1 ECX
                     0x0000000000000059 - 0x000000000000018a: DW_OP_breg5 EBP-20)
                  DW_AT_name	("conn_addr")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(318)
                  DW_AT_type	(cu + 0x0107 "u8*")

0x00000189:     DW_TAG_formal_parameter
                  DW_AT_location	(0x0000006b
                     0x0000000000000034 - 0x0000000000000053: DW_OP_reg0 EAX
                     0x0000000000000053 - 0x000000000000018a: DW_OP_breg5 EBP-13)
                  DW_AT_name	("conn_addr_type")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(318)
                  DW_AT_type	(cu + 0x00cb "u8")

0x00000199:     DW_TAG_formal_parameter
                  DW_AT_location	(0x0000008a
                     0x0000000000000034 - 0x0000000000000050: DW_OP_reg2 EDX
                     0x0000000000000050 - 0x000000000000018a: DW_OP_breg5 EBP-12)
                  DW_AT_name	("item")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(318)
                  DW_AT_type	(cu + 0x0b6e "BLE_REMOTE_LIST_T*")

0x000001a9:     DW_TAG_formal_parameter
                  DW_AT_location	(0x000000a9
                     0x0000000000000034 - 0x0000000000000056: DW_OP_reg0 EAX, DW_OP_bit_piece 0x8 0x8
                     0x0000000000000056 - 0x000000000000018a: DW_OP_breg5 EBP-14)
                  DW_AT_name	("role")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(318)
                  DW_AT_type	(cu + 0x00cb "u8")

0x000001b9:     DW_TAG_variable
                  DW_AT_const_value	(0)
                  DW_AT_name	("ret")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(321)
                  DW_AT_type	(cu + 0x0232 "bool")

0x000001c6:     DW_TAG_variable
                  DW_AT_location	(0x000000cb
                     0x000000000000006c - 0x000000000000015d: DW_OP_constu 0x0, DW_OP_stack_value
                     0x000000000000015d - 0x000000000000016e: DW_OP_reg0 EAX
                     0x000000000000016e - 0x000000000000018a: DW_OP_breg5 EBP-40)
                  DW_AT_name	("i")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(320)
                  DW_AT_type	(cu + 0x039d "u32")

0x000001d6:     NULL

0x000001d7:   DW_TAG_subprogram
                DW_AT_low_pc	(0x000000000000018a)
                DW_AT_high_pc	(0x00000000000001e2)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("ble_list_get_count")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                DW_AT_decl_line	(406)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0b5c "u16")
                DW_AT_external	(true)

0x000001ed:   DW_TAG_subprogram
                DW_AT_low_pc	(0x00000000000001e2)
                DW_AT_high_pc	(0x0000000000000311)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_abstract_origin	(cu + 0x020f "reflash_remote_info")

0x000001fc:     DW_TAG_formal_parameter
                  DW_AT_location	(0x000000f7
                     0x00000000000001e2 - 0x00000000000001fa: DW_OP_reg0 EAX
                     0x00000000000002cd - 0x00000000000002d2: DW_OP_reg0 EAX)
                  DW_AT_abstract_origin	(cu + 0x021b "act_rw")

0x00000205:     DW_TAG_variable
                  DW_AT_location	(0x00000115
                     0x00000000000001ed - 0x0000000000000225: DW_OP_constu 0x0, DW_OP_stack_value
                     0x0000000000000225 - 0x0000000000000231: DW_OP_reg0 EAX)
                  DW_AT_abstract_origin	(cu + 0x0226 "ret")

0x0000020e:     NULL

0x0000020f:   DW_TAG_subprogram
                DW_AT_name	("reflash_remote_info")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                DW_AT_decl_line	(210)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0232 "bool")
                DW_AT_inline	(DW_INL_inlined)

0x0000021b:     DW_TAG_formal_parameter
                  DW_AT_name	("act_rw")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(210)
                  DW_AT_type	(cu + 0x00cb "u8")

0x00000226:     DW_TAG_variable
                  DW_AT_name	("ret")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(212)
                  DW_AT_type	(cu + 0x023d "s32")

0x00000231:     NULL

0x00000232:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00d6 "unsigned char")
                DW_AT_name	("bool")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(11)

0x0000023d:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_name	("s32")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(16)

0x00000248:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000311)
                DW_AT_high_pc	(0x0000000000000412)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("ble_list_config_reset")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                DW_AT_decl_line	(418)
                DW_AT_prototyped	(true)
                DW_AT_external	(true)

0x0000025a:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000135
                     0x0000000000000311 - 0x000000000000032c: DW_OP_reg1 ECX
                     0x000000000000032c - 0x000000000000033b: DW_OP_breg5 EBP-10
                     0x000000000000033b - 0x0000000000000359: DW_OP_constu 0xa, DW_OP_stack_value
                     0x0000000000000359 - 0x0000000000000369: DW_OP_reg0 EAX
                     0x0000000000000369 - 0x0000000000000372: DW_OP_breg5 EBP-14
                     0x0000000000000372 - 0x0000000000000412: DW_OP_breg5 EBP-10)
                  DW_AT_name	("pair_devices_count")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(418)
                  DW_AT_type	(cu + 0x00cb "u8")

0x0000026a:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000184
                     0x0000000000000311 - 0x0000000000000329: DW_OP_reg0 EAX
                     0x0000000000000329 - 0x0000000000000412: DW_OP_breg5 EBP-9)
                  DW_AT_name	("is_allow_cover")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(418)
                  DW_AT_type	(cu + 0x00cb "u8")

0x0000027a:     DW_TAG_inlined_subroutine
                  DW_AT_abstract_origin	(cu + 0x020f "reflash_remote_info")
                  DW_AT_low_pc	(0x00000000000003ae)
                  DW_AT_high_pc	(0x00000000000003cc)
                  DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_call_line	(433)

0x0000028a:       DW_TAG_formal_parameter
                    DW_AT_const_value	(1)
                    DW_AT_abstract_origin	(cu + 0x021b "act_rw")

0x00000290:       DW_TAG_variable
                    DW_AT_const_value	(0)
                    DW_AT_abstract_origin	(cu + 0x0226 "ret")

0x00000296:       NULL

0x00000297:     NULL

0x00000298:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000412)
                DW_AT_high_pc	(0x0000000000000579)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("ble_list_clear_all")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                DW_AT_decl_line	(444)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0232 "bool")
                DW_AT_external	(true)

0x000002ae:     DW_TAG_variable
                  DW_AT_location	(0x000001a3
                     0x0000000000000435 - 0x00000000000004d1: DW_OP_constu 0x0, DW_OP_stack_value
                     0x00000000000004d1 - 0x00000000000004f4: DW_OP_reg0 EAX)
                  DW_AT_name	("i")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(446)
                  DW_AT_type	(cu + 0x00cb "u8")

0x000002be:     DW_TAG_variable
                  DW_AT_location	(0x000001c3
                     0x0000000000000463 - 0x000000000000046c: DW_OP_breg2 EDX+0)
                  DW_AT_name	("item")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(448)
                  DW_AT_type	(cu + 0x03af "BLE_REMOTE_LIST_T")

0x000002ce:     DW_TAG_variable
                  DW_AT_name	("ret")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(447)
                  DW_AT_type	(cu + 0x023d "s32")

0x000002da:     DW_TAG_inlined_subroutine
                  DW_AT_abstract_origin	(cu + 0x020f "reflash_remote_info")
                  DW_AT_low_pc	(0x0000000000000548)
                  DW_AT_high_pc	(0x000000000000056b)
                  DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_call_line	(469)

0x000002ea:       DW_TAG_formal_parameter
                    DW_AT_const_value	(1)
                    DW_AT_abstract_origin	(cu + 0x021b "act_rw")

0x000002f0:       DW_TAG_variable
                    DW_AT_const_value	(0)
                    DW_AT_abstract_origin	(cu + 0x0226 "ret")

0x000002f6:       NULL

0x000002f7:     NULL

0x000002f8:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000579)
                DW_AT_high_pc	(0x0000000000000609)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("get_list_exist_item")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                DW_AT_decl_line	(237)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0232 "bool")

0x0000030d:     DW_TAG_formal_parameter
                  DW_AT_location	(0x000001d7
                     0x0000000000000579 - 0x0000000000000598: DW_OP_reg1 ECX
                     0x0000000000000598 - 0x0000000000000609: DW_OP_breg5 EBP-16)
                  DW_AT_name	("item")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(237)
                  DW_AT_type	(cu + 0x0b6e "BLE_REMOTE_LIST_T*")

0x0000031c:     DW_TAG_formal_parameter
                  DW_AT_location	(0x000001f6
                     0x0000000000000579 - 0x0000000000000595: DW_OP_reg0 EAX
                     0x0000000000000595 - 0x0000000000000609: DW_OP_breg5 EBP-9)
                  DW_AT_name	("index")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(237)
                  DW_AT_type	(cu + 0x00cb "u8")

0x0000032b:     DW_TAG_variable
                  DW_AT_location	(0x00000215
                     0x00000000000005d0 - 0x00000000000005db: DW_OP_reg0 EAX)
                  DW_AT_name	("ret")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(243)
                  DW_AT_type	(cu + 0x023d "s32")

0x0000033a:     NULL

0x0000033b:   DW_TAG_subprogram
                DW_AT_name	("delete_conn_addr_exist")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                DW_AT_decl_line	(357)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0232 "bool")
                DW_AT_inline	(DW_INL_inlined)

0x00000348:     DW_TAG_formal_parameter
                  DW_AT_name	("conn_addr")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(357)
                  DW_AT_type	(cu + 0x0107 "u8*")

0x00000354:     DW_TAG_formal_parameter
                  DW_AT_name	("conn_addr_type")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(357)
                  DW_AT_type	(cu + 0x00cb "u8")

0x00000360:     DW_TAG_formal_parameter
                  DW_AT_name	("irk_key")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(357)
                  DW_AT_type	(cu + 0x0107 "u8*")

0x0000036c:     DW_TAG_formal_parameter
                  DW_AT_name	("distribution")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(357)
                  DW_AT_type	(cu + 0x00cb "u8")

0x00000378:     DW_TAG_variable
                  DW_AT_name	("del_flag")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(361)
                  DW_AT_type	(cu + 0x0232 "bool")

0x00000384:     DW_TAG_variable
                  DW_AT_name	("i")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(359)
                  DW_AT_type	(cu + 0x039d "u32")

0x00000390:     DW_TAG_variable
                  DW_AT_name	("item")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(360)
                  DW_AT_type	(cu + 0x03af "BLE_REMOTE_LIST_T")

0x0000039c:     NULL

0x0000039d:   DW_TAG_typedef
                DW_AT_type	(cu + 0x03a8 "unsigned int")
                DW_AT_name	("u32")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(15)

0x000003a8:   DW_TAG_base_type
                DW_AT_name	("unsigned int")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x04)

0x000003af:   DW_TAG_typedef
                DW_AT_type	(cu + 0x03ba "structure ")
                DW_AT_name	("BLE_REMOTE_LIST_T")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../User/include/ble/remote_device_list.h")
                DW_AT_decl_line	(62)

0x000003ba:   DW_TAG_structure_type
                DW_AT_byte_size	(0x34)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../User/include/ble/remote_device_list.h")
                DW_AT_decl_line	(47)

0x000003be:     DW_TAG_member
                  DW_AT_name	("irk_key")
                  DW_AT_type	(cu + 0x046d "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../User/include/ble/remote_device_list.h")
                  DW_AT_decl_line	(48)
                  DW_AT_data_member_location	(0x00)

0x000003ca:     DW_TAG_member
                  DW_AT_name	("ltk_key")
                  DW_AT_type	(cu + 0x046d "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../User/include/ble/remote_device_list.h")
                  DW_AT_decl_line	(49)
                  DW_AT_data_member_location	(0x10)

0x000003d6:     DW_TAG_member
                  DW_AT_name	("addr")
                  DW_AT_type	(cu + 0x0479 "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../User/include/ble/remote_device_list.h")
                  DW_AT_decl_line	(50)
                  DW_AT_data_member_location	(0x20)

0x000003e2:     DW_TAG_member
                  DW_AT_name	("flag")
                  DW_AT_type	(cu + 0x00cb "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../User/include/ble/remote_device_list.h")
                  DW_AT_decl_line	(51)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x26)

0x000003f1:     DW_TAG_member
                  DW_AT_name	("role")
                  DW_AT_type	(cu + 0x00cb "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../User/include/ble/remote_device_list.h")
                  DW_AT_decl_line	(52)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x03)
                  DW_AT_data_member_location	(0x26)

0x00000400:     DW_TAG_member
                  DW_AT_name	("addr_type")
                  DW_AT_type	(cu + 0x00cb "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../User/include/ble/remote_device_list.h")
                  DW_AT_decl_line	(53)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x02)
                  DW_AT_data_member_location	(0x26)

0x0000040f:     DW_TAG_member
                  DW_AT_name	("remote_type")
                  DW_AT_type	(cu + 0x00cb "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../User/include/ble/remote_device_list.h")
                  DW_AT_decl_line	(54)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x26)

0x0000041e:     DW_TAG_member
                  DW_AT_name	("distribution")
                  DW_AT_type	(cu + 0x00cb "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../User/include/ble/remote_device_list.h")
                  DW_AT_decl_line	(55)
                  DW_AT_data_member_location	(0x27)

0x0000042a:     DW_TAG_member
                  DW_AT_name	("rand")
                  DW_AT_type	(cu + 0x0485 "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../User/include/ble/remote_device_list.h")
                  DW_AT_decl_line	(57)
                  DW_AT_data_member_location	(0x28)

0x00000436:     DW_TAG_member
                  DW_AT_name	("ediv")
                  DW_AT_type	(cu + 0x0491 "u8[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../User/include/ble/remote_device_list.h")
                  DW_AT_decl_line	(58)
                  DW_AT_data_member_location	(0x30)

0x00000442:     DW_TAG_member
                  DW_AT_name	("encryption_keysize")
                  DW_AT_type	(cu + 0x00cb "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../User/include/ble/remote_device_list.h")
                  DW_AT_decl_line	(59)
                  DW_AT_data_member_location	(0x32)

0x0000044e:     DW_TAG_member
                  DW_AT_name	("authenticated")
                  DW_AT_type	(cu + 0x00cb "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../User/include/ble/remote_device_list.h")
                  DW_AT_decl_line	(60)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x33)

0x0000045d:     DW_TAG_member
                  DW_AT_name	("authentication_state")
                  DW_AT_type	(cu + 0x00cb "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../User/include/ble/remote_device_list.h")
                  DW_AT_decl_line	(61)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x33)

0x0000046c:     NULL

0x0000046d:   DW_TAG_array_type
                DW_AT_type	(cu + 0x00cb "u8")

0x00000472:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x00e9 "sizetype")
                  DW_AT_count	(0x10)

0x00000478:     NULL

0x00000479:   DW_TAG_array_type
                DW_AT_type	(cu + 0x00cb "u8")

0x0000047e:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x00e9 "sizetype")
                  DW_AT_count	(0x06)

0x00000484:     NULL

0x00000485:   DW_TAG_array_type
                DW_AT_type	(cu + 0x00cb "u8")

0x0000048a:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x00e9 "sizetype")
                  DW_AT_count	(0x08)

0x00000490:     NULL

0x00000491:   DW_TAG_array_type
                DW_AT_type	(cu + 0x00cb "u8")

0x00000496:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x00e9 "sizetype")
                  DW_AT_count	(0x02)

0x0000049c:     NULL

0x0000049d:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000609)
                DW_AT_high_pc	(0x0000000000000b54)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("ble_list_pair_add")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                DW_AT_decl_line	(500)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0232 "bool")
                DW_AT_external	(true)

0x000004b3:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000228
                     0x0000000000000609 - 0x0000000000000636: DW_OP_reg3 EBX, DW_OP_bit_piece 0x8 0x8
                     0x0000000000000636 - 0x0000000000000b54: DW_OP_breg5 EBP-125)
                  DW_AT_name	("role")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(500)
                  DW_AT_type	(cu + 0x00cb "u8")

0x000004c3:     DW_TAG_formal_parameter
                  DW_AT_location	(0x0000024b
                     0x0000000000000609 - 0x000000000000064e: DW_OP_reg6 ESI
                     0x000000000000064e - 0x0000000000000b54: DW_OP_breg5 EBP-144)
                  DW_AT_name	("conn_addr")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(500)
                  DW_AT_type	(cu + 0x0107 "u8*")

0x000004d3:     DW_TAG_formal_parameter
                  DW_AT_location	(0x0000026b
                     0x0000000000000609 - 0x0000000000000648: DW_OP_reg3 EBX
                     0x0000000000000648 - 0x0000000000000b54: DW_OP_breg5 EBP-137)
                  DW_AT_name	("conn_addr_type")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(500)
                  DW_AT_type	(cu + 0x00cb "u8")

0x000004e3:     DW_TAG_formal_parameter
                  DW_AT_location	(0x0000028b
                     0x0000000000000609 - 0x0000000000000642: DW_OP_reg2 EDX
                     0x0000000000000642 - 0x0000000000000b54: DW_OP_breg5 EBP-136)
                  DW_AT_name	("irk_key")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c")
                  DW_AT_decl_line	(500)
                  DW_AT_type	(cu + 0x0107 "u8*")

0x000004f3:     DW_TAG_formal_parameter
                  DW_AT_location	(0x000002ab
                     0x0000000000000609 - 0x000000000000063c: DW_OP_reg1 ECX
                     0x000000000000063c - 0x0000000000000b54: DW_OP_breg5 EBP-132)
                  DW_AT_name	("ltk_key")
