; ModuleID = 'remote_device_list.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.remote_ctrl_t = type { i8, i8, i8, i8, [10 x i8] }
%struct.BLE_REMOTE_LIST_T = type { [16 x i8], [16 x i8], [6 x i8], i8, i8, [8 x i8], [2 x i8], i8, i8 }

@app_info_debug_enable = weak hidden local_unnamed_addr global i32 0, align 4, !dbg !0
@config_le_sm_support_enable = external local_unnamed_addr constant i32, align 4
@remote_info_hdl = internal global %struct.remote_ctrl_t { i8 0, i8 0, i8 -1, i8 -1, [10 x i8] zeroinitializer }, section ".bt_stack_data", align 1, !dbg !14
@.str = private unnamed_addr constant [20 x i8] c"###fix ble list:%d\0A\00", align 1
@str = private unnamed_addr constant [18 x i8] c"###reset ble list\00"

; Function Attrs: nounwind optsize
define hidden zeroext i8 @ble_list_get_conn_addr_item(i8*, i8 zeroext, i8 zeroext, %struct.BLE_REMOTE_LIST_T*) local_unnamed_addr #0 section ".bt_stack_code" !dbg !38 {
  call void @llvm.dbg.value(metadata i8* %0, metadata !73, metadata !DIExpression()), !dbg !77
  call void @llvm.dbg.value(metadata i8 %1, metadata !74, metadata !DIExpression()), !dbg !78
  call void @llvm.dbg.value(metadata i8 %2, metadata !75, metadata !DIExpression()), !dbg !79

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "app_info_debug_enable", scope: !2, file: !33, line: 190, type: !34, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !13)
!3 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/ble/remote_device_list.c", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!4 = !{}
!5 = !{!6, !8, !11, !12}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !9, line: 11, baseType: !10)
!9 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!10 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!13 = !{!0, !14, !30}
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "remote_info_hdl", scope: !2, file: !3, line: 91, type: !16, isLocal: true, isDefinition: true)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "remote_ctrl_t", file: !3, line: 79, baseType: !17)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 70, size: 112, elements: !18)
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "info_tag", scope: !17, file: !3, line: 71, baseType: !8, size: 8)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "cfg_dev_max", scope: !17, file: !3, line: 72, baseType: !8, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "cfg_cover_allow", scope: !17, file: !3, line: 73, baseType: !8, size: 2, offset: 12, flags: DIFlagBitField, extraData: i64 8)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "pair_lock", scope: !17, file: !3, line: 74, baseType: !8, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 8)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !17, file: !3, line: 75, baseType: !8, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 8)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "dev_count", scope: !17, file: !3, line: 76, baseType: !8, size: 8, offset: 16)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "last_vm_write_index", scope: !17, file: !3, line: 77, baseType: !8, size: 8, offset: 24)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "vm_dev_sn", scope: !17, file: !3, line: 78, baseType: !27, size: 80, offset: 32)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 80, elements: !28)
!28 = !{!29}
!29 = !DISubrange(count: 10)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "remote_info_init", scope: !2, file: !3, line: 82, type: !32, isLocal: true, isDefinition: true)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!33 = !DIFile(filename: "../btcommon/profile_stack_debug.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !{i32 2, !"Dwarf Version", i32 4}
!36 = !{i32 2, !"Debug Info Version", i32 3}
!37 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!38 = distinct !DISubprogram(name: "ble_list_get_conn_addr_item", scope: !3, file: !3, line: 351, type: !39, isLocal: false, isDefinition: true, scopeLine: 352, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !72)
!39 = !DISubroutineType(types: !40)
!40 = !{!41, !12, !8, !8, !42}
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !9, line: 11, baseType: !10)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 32)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLE_REMOTE_LIST_T", file: !44, line: 62, baseType: !45)
!44 = !DIFile(filename: "../User/include/ble/remote_device_list.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !44, line: 47, size: 416, elements: !46)
!46 = !{!47, !51, !52, !56, !57, !58, !59, !60, !61, !65, !69, !70, !71}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "irk_key", scope: !45, file: !44, line: 48, baseType: !48, size: 128)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 128, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 16)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ltk_key", scope: !45, file: !44, line: 49, baseType: !48, size: 128, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !45, file: !44, line: 50, baseType: !53, size: 48, offset: 256)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 48, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 6)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !45, file: !44, line: 51, baseType: !8, size: 4, offset: 304, flags: DIFlagBitField, extraData: i64 304)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "role", scope: !45, file: !44, line: 52, baseType: !8, size: 1, offset: 308, flags: DIFlagBitField, extraData: i64 304)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "addr_type", scope: !45, file: !44, line: 53, baseType: !8, size: 1, offset: 309, flags: DIFlagBitField, extraData: i64 304)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "remote_type", scope: !45, file: !44, line: 54, baseType: !8, size: 2, offset: 310, flags: DIFlagBitField, extraData: i64 304)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "distribution", scope: !45, file: !44, line: 55, baseType: !8, size: 8, offset: 312)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "rand", scope: !45, file: !44, line: 57, baseType: !62, size: 64, offset: 320)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 64, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 8)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "ediv", scope: !45, file: !44, line: 58, baseType: !66, size: 16, offset: 384)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 16, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 2)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "encryption_keysize", scope: !45, file: !44, line: 59, baseType: !8, size: 8, offset: 400)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !45, file: !44, line: 60, baseType: !8, size: 4, offset: 408, flags: DIFlagBitField, extraData: i64 408)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "authentication_state", scope: !45, file: !44, line: 61, baseType: !8, size: 4, offset: 412, flags: DIFlagBitField, extraData: i64 408)
!72 = !{!73, !74, !75, !76}
!73 = !DILocalVariable(name: "conn_addr", arg: 1, scope: !38, file: !3, line: 351, type: !12)
!74 = !DILocalVariable(name: "conn_addr_type", arg: 2, scope: !38, file: !3, line: 351, type: !8)
!75 = !DILocalVariable(name: "role", arg: 3, scope: !38, file: !3, line: 351, type: !8)
!76 = !DILocalVariable(name: "item", arg: 4, scope: !38, file: !3, line: 351, type: !42)
!77 = !DILocation(line: 351, column: 38, scope: !38)
!78 = !DILocation(line: 351, column: 52, scope: !38)
!79 = !DILocation(line: 351, column: 71, scope: !38)
!80 = !DILocation(line: 351, column: 96, scope: !38)
!81 = !DILocation(line: 353, column: 12, scope: !38)
!82 = !DILocation(line: 353, column: 5, scope: !38)
!83 = distinct !DISubprogram(name: "get_conn_addr_item", scope: !3, file: !3, line: 318, type: !84, isLocal: true, isDefinition: true, scopeLine: 319, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !86)
!84 = !DISubroutineType(types: !85)
!85 = !{!41, !12, !8, !42, !8}
!86 = !{!87, !88, !89, !90, !91, !94}
!87 = !DILocalVariable(name: "conn_addr", arg: 1, scope: !83, file: !3, line: 318, type: !12)
!88 = !DILocalVariable(name: "conn_addr_type", arg: 2, scope: !83, file: !3, line: 318, type: !8)
!89 = !DILocalVariable(name: "item", arg: 3, scope: !83, file: !3, line: 318, type: !42)
!90 = !DILocalVariable(name: "role", arg: 4, scope: !83, file: !3, line: 318, type: !8)
!91 = !DILocalVariable(name: "i", scope: !83, file: !3, line: 320, type: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !9, line: 15, baseType: !93)
!93 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!94 = !DILocalVariable(name: "ret", scope: !83, file: !3, line: 321, type: !41)
!95 = !DILocation(line: 318, column: 36, scope: !83)
!96 = !DILocation(line: 318, column: 50, scope: !83)
!97 = !DILocation(line: 318, column: 85, scope: !83)
!98 = !DILocation(line: 318, column: 94, scope: !83)
!99 = !DILocation(line: 321, column: 10, scope: !83)
!100 = !DILocation(line: 323, column: 22, scope: !101)
!101 = distinct !DILexicalBlock(scope: !83, file: !3, line: 323, column: 9)
!102 = !{!103, !104, i64 2}
!103 = !{!"", !104, i64 0, !104, i64 1, !104, i64 1, !104, i64 1, !104, i64 1, !104, i64 2, !104, i64 3, !104, i64 4}
!104 = !{!"omnipotent char", !105, i64 0}
!105 = !{!"Simple C/C++ TBAA"}
!106 = !DILocation(line: 323, column: 11, scope: !101)
!107 = !DILocation(line: 323, column: 9, scope: !83)
!108 = !DILocation(line: 338, column: 61, scope: !109)
!109 = !DILexicalBlockFile(scope: !110, file: !3, discriminator: 1)
!110 = distinct !DILexicalBlock(scope: !111, file: !3, line: 338, column: 24)
!111 = distinct !DILexicalBlock(scope: !112, file: !3, line: 332, column: 24)
!112 = distinct !DILexicalBlock(scope: !113, file: !3, line: 330, column: 17)
!113 = distinct !DILexicalBlock(scope: !114, file: !3, line: 329, column: 43)
!114 = distinct !DILexicalBlock(scope: !115, file: !3, line: 329, column: 13)
!115 = distinct !DILexicalBlock(scope: !116, file: !3, line: 328, column: 47)
!116 = distinct !DILexicalBlock(scope: !117, file: !3, line: 328, column: 5)
!117 = distinct !DILexicalBlock(scope: !83, file: !3, line: 328, column: 5)
!118 = !DILocation(line: 338, column: 76, scope: !109)
!119 = !DILocation(line: 320, column: 9, scope: !83)
!120 = !DILocation(line: 328, column: 29, scope: !121)
!121 = !DILexicalBlockFile(scope: !116, file: !3, discriminator: 1)
!122 = !DILocation(line: 328, column: 19, scope: !121)
!123 = !DILocation(line: 328, column: 5, scope: !124)
!124 = !DILexicalBlockFile(scope: !117, file: !3, discriminator: 1)
!125 = !DILocation(line: 329, column: 39, scope: !114)
!126 = !DILocation(line: 329, column: 13, scope: !114)
!127 = !DILocation(line: 329, column: 13, scope: !115)
!128 = !DILocation(line: 330, column: 30, scope: !112)
