; ModuleID = 'remote_device_db.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/remote_device_db.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct._stack_config = type <{ i32, i16, i16, i16, i16, i16, i8, i8, i8, i32, i8, i8, i8, i8, [6 x i8], i8 }>
%struct.database_file = type { i32 (...)*, void (...)*, i32 (i8*, i32, i32)*, i32 (i8*, i32, i32)*, void (i32, i32)*, i32 ()*, i32 (...)* }
%struct._remote_database = type { i16, i16, i8, i8, i8, i8, i8, i8, [6 x i8], [16 x i8] }

@temp_link_key_flag = hidden global i8 0, section ".bt_stack_data", align 1, !dbg !0
@temp_device_connect_linkkey = hidden local_unnamed_addr global [16 x i8] zeroinitializer, section ".bt_stack_bss", align 1, !dbg !47
@own_private_linkkey = internal unnamed_addr constant [16 x i8] c"\06w_\87\91\8D\D4#\00]\F1\D8\CF\0C\14+", section ".bt_stack_const", align 1, !dbg !56
@CONFIG_BTCTLER_FAST_CONNECT_ENABLE = external local_unnamed_addr constant i32, align 4
@user_stack_configs = external local_unnamed_addr global %struct._stack_config*, align 4
@dbf_file = internal unnamed_addr global %struct.database_file* null, section ".bt_stack_bss", align 4, !dbg !14
@more_addr_reconnect_support = external local_unnamed_addr constant i8, align 1
@last_device_connect_linkkey = hidden local_unnamed_addr global [16 x i8] zeroinitializer, section ".bt_stack_bss", align 1, !dbg !54


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "temp_link_key_flag", scope: !2, file: !3, line: 205, type: !60, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !11, globals: !13)
!3 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/User/bredr/remote_device_db.c", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 14, size: 32, elements: !7)
!6 = !DIFile(filename: "../btstack/Host/include/bredr/user_interface.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "DB_ID_REMOTE", value: 0)
!9 = !DIEnumerator(name: "DB_ID_EMITTER", value: 1)
!10 = !DIEnumerator(name: "DB_ID_TWS", value: 2)
!11 = !{!12}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!13 = !{!0, !14, !47, !54, !56}
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "dbf_file", scope: !2, file: !3, line: 30, type: !16, isLocal: true, isDefinition: true)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "database_file", file: !19, line: 47, size: 224, elements: !20)
!19 = !DIFile(filename: "../User/include/bredr/remote_device_db.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!20 = !{!21, !26, !30, !37, !38, !42, !46}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !18, file: !19, line: 48, baseType: !22, size: 32)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 32)
!23 = !DISubroutineType(types: !24)
!24 = !{!25, null}
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !18, file: !19, line: 49, baseType: !27, size: 32, offset: 32)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 32)
!28 = !DISubroutineType(types: !29)
!29 = !{null, null}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !18, file: !19, line: 50, baseType: !31, size: 32, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!32 = !DISubroutineType(types: !33)
!33 = !{!25, !12, !25, !34}
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !35, line: 48, baseType: !36)
!35 = !DIFile(filename: "../btcommon/typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!36 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !18, file: !19, line: 51, baseType: !31, size: 32, offset: 96)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !18, file: !19, line: 52, baseType: !39, size: 32, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32)
!40 = !DISubroutineType(types: !41)
!41 = !{null, !25, !25}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "getlen", scope: !18, file: !19, line: 53, baseType: !43, size: 32, offset: 160)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = !DISubroutineType(types: !45)
!45 = !{!25}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "get_fpos", scope: !18, file: !19, line: 54, baseType: !22, size: 32, offset: 192)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "temp_device_connect_linkkey", scope: !2, file: !3, line: 206, type: !49, isLocal: false, isDefinition: true)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 128, elements: !52)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !35, line: 44, baseType: !51)
!51 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!52 = !{!53}
!53 = !DISubrange(count: 16)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "last_device_connect_linkkey", scope: !2, file: !3, line: 248, type: !49, isLocal: false, isDefinition: true)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "own_private_linkkey", scope: !2, file: !3, line: 200, type: !58, isLocal: true, isDefinition: true)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 128, elements: !52)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!60 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !50)
!61 = !{i32 2, !"Dwarf Version", i32 4}
!62 = !{i32 2, !"Debug Info Version", i32 3}
!63 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!64 = distinct !DISubprogram(name: "set_temp_link_key", scope: !3, file: !3, line: 207, type: !65, isLocal: false, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !68)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !67}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 32)
!68 = !{!69}
!69 = !DILocalVariable(name: "linkkey", arg: 1, scope: !64, file: !3, line: 207, type: !67)
!70 = !DILocation(line: 207, column: 28, scope: !64)
!71 = !DILocation(line: 209, column: 5, scope: !64)
!72 = !DILocation(line: 210, column: 24, scope: !64)
!73 = !{!74, !74, i64 0}
!74 = !{!"omnipotent char", !75, i64 0}
!75 = !{!"Simple C/C++ TBAA"}
!76 = !DILocation(line: 211, column: 1, scope: !64)
!77 = distinct !DISubprogram(name: "get_support_profile", scope: !3, file: !3, line: 213, type: !78, isLocal: false, isDefinition: true, scopeLine: 214, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !87)
!78 = !DISubroutineType(types: !79)
!79 = !{!25, !80, !50}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_addr_t", file: !82, line: 7, baseType: !83)
!82 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 48, elements: !85)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !35, line: 44, baseType: !51)
!85 = !{!86}
!86 = !DISubrange(count: 6)
!87 = !{!88, !89, !90, !91}
!88 = !DILocalVariable(name: "bd_addr", arg: 1, scope: !77, file: !3, line: 213, type: !80)
!89 = !DILocalVariable(name: "id", arg: 2, scope: !77, file: !3, line: 213, type: !50)
!90 = !DILocalVariable(name: "profile", scope: !77, file: !3, line: 215, type: !50)
!91 = !DILocalVariable(name: "remote_db", scope: !77, file: !3, line: 216, type: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "remote_database_t", file: !19, line: 69, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_remote_database", file: !19, line: 58, size: 256, elements: !94)
!94 = !{!95, !98, !99, !100, !101, !102, !103, !104, !105, !108}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !93, file: !19, line: 59, baseType: !96, size: 16)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !35, line: 46, baseType: !97)
!97 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !93, file: !19, line: 60, baseType: !96, size: 16, offset: 16)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "dev_type", scope: !93, file: !19, line: 61, baseType: !50, size: 8, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "a2dp_discover_by_remote", scope: !93, file: !19, line: 62, baseType: !50, size: 8, offset: 40)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "a2dp_volume", scope: !93, file: !19, line: 63, baseType: !50, size: 8, offset: 48)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "hfp_volume", scope: !93, file: !19, line: 64, baseType: !50, size: 8, offset: 56)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "support_profile", scope: !93, file: !19, line: 65, baseType: !50, size: 8, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "pair_connect_att", scope: !93, file: !19, line: 66, baseType: !50, size: 8, offset: 72)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "mac_addr", scope: !93, file: !19, line: 67, baseType: !106, size: 48, offset: 80)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_addr_t", file: !107, line: 66, baseType: !83)
!107 = !DIFile(filename: "../btcommon/utils.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!108 = !DIDerivedType(tag: DW_TAG_member, name: "link_key", scope: !93, file: !19, line: 68, baseType: !109, size: 128, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "link_key_t", file: !107, line: 73, baseType: !110)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 128, elements: !52)
!111 = !DILocation(line: 213, column: 36, scope: !77)
!112 = !DILocation(line: 213, column: 48, scope: !77)
!113 = !DILocation(line: 215, column: 8, scope: !77)
!114 = !DILocation(line: 216, column: 5, scope: !77)
!115 = !DILocation(line: 216, column: 23, scope: !77)
!116 = !DILocation(line: 217, column: 10, scope: !117)
!117 = distinct !DILexicalBlock(scope: !77, file: !3, line: 217, column: 9)
!118 = !DILocation(line: 222, column: 29, scope: !119)
!119 = distinct !DILexicalBlock(scope: !117, file: !3, line: 220, column: 12)
!120 = !DILocation(line: 217, column: 9, scope: !77)
!121 = !DILocation(line: 228, column: 1, scope: !77)
!122 = !DILocation(line: 227, column: 5, scope: !77)
!123 = distinct !DISubprogram(name: "get_database", scope: !3, file: !3, line: 32, type: !124, isLocal: true, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !127)
!124 = !DISubroutineType(types: !125)
!125 = !{!25, !126, !80, !50}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 32)
!127 = !{!128, !129, !130, !131, !132}
!128 = !DILocalVariable(name: "db", arg: 1, scope: !123, file: !3, line: 32, type: !126)
!129 = !DILocalVariable(name: "bd_addr", arg: 2, scope: !123, file: !3, line: 32, type: !80)
!130 = !DILocalVariable(name: "id", arg: 3, scope: !123, file: !3, line: 32, type: !50)
!131 = !DILocalVariable(name: "len", scope: !123, file: !3, line: 34, type: !25)
!132 = !DILocalVariable(name: "res", scope: !123, file: !3, line: 35, type: !25)
!133 = !DILocation(line: 32, column: 44, scope: !123)
!134 = !DILocation(line: 32, column: 59, scope: !123)
!135 = !DILocation(line: 32, column: 71, scope: !123)
!136 = !DILocation(line: 35, column: 9, scope: !123)
!137 = !DILocation(line: 37, column: 10, scope: !138)
!138 = distinct !DILexicalBlock(scope: !123, file: !3, line: 37, column: 9)
!139 = !{!140, !140, i64 0}
!140 = !{!"any pointer", !74, i64 0}
!141 = !DILocation(line: 37, column: 20, scope: !138)
!142 = !{!143, !140, i64 0}
!143 = !{!"database_file", !140, i64 0, !140, i64 4, !140, i64 8, !140, i64 12, !140, i64 16, !140, i64 20, !140, i64 24}
!144 = !DILocation(line: 37, column: 9, scope: !123)
!145 = !DILocation(line: 42, column: 15, scope: !146)
!146 = distinct !DILexicalBlock(scope: !123, file: !3, line: 41, column: 15)
!147 = !DILocation(line: 42, column: 25, scope: !146)
!148 = !{!143, !140, i64 8}
!149 = !DILocation(line: 34, column: 9, scope: !123)
!150 = !DILocation(line: 43, column: 17, scope: !151)
!151 = distinct !DILexicalBlock(scope: !146, file: !3, line: 43, column: 13)
!152 = !DILocation(line: 43, column: 13, scope: !146)
!153 = !DILocation(line: 47, column: 14, scope: !154)
!154 = distinct !DILexicalBlock(scope: !146, file: !3, line: 47, column: 13)
!155 = !DILocation(line: 47, column: 13, scope: !146)
!156 = distinct !{!156, !157, !158}
!157 = !DILocation(line: 41, column: 5, scope: !123)
!158 = !DILocation(line: 56, column: 5, scope: !123)
!159 = !DILocation(line: 48, column: 21, scope: !160)
!160 = distinct !DILexicalBlock(scope: !161, file: !3, line: 48, column: 17)
!161 = distinct !DILexicalBlock(scope: !154, file: !3, line: 47, column: 50)
!162 = !{!163, !164, i64 0}
!163 = !{!"_remote_database", !164, i64 0, !164, i64 2, !74, i64 4, !74, i64 5, !74, i64 6, !74, i64 7, !74, i64 8, !74, i64 9, !74, i64 10, !74, i64 16}
!164 = !{!"short", !74, i64 0}
!165 = !DILocation(line: 48, column: 28, scope: !160)
!166 = !DILocation(line: 48, column: 25, scope: !160)
!167 = !DILocation(line: 48, column: 17, scope: !161)
!168 = !DILocation(line: 58, column: 5, scope: !123)
!169 = !DILocation(line: 58, column: 15, scope: !123)
!170 = !{!143, !140, i64 4}
