temp.o:	file format ELF32-i386

.debug_info contents:
0x00000000: Compile Unit: length = 0x00002207 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x0000220b)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)")
              DW_AT_language	(DW_LANG_C99)
              DW_AT_name	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/rfcomm.c")
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
              DW_AT_GNU_pubnames	(true)
              DW_AT_low_pc	(0x0000000000000000)
              DW_AT_ranges	(0x000000e0
                 [0x00000000 - 0x000005de)
                 [0x000005de - 0x00003c3a)
                 [0x00000000 - 0x00000009))

0x00000026:   DW_TAG_variable
                DW_AT_name	("app_info_debug_enable")
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/profile_stack_debug.h")
                DW_AT_decl_line	(190)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000037:   DW_TAG_base_type
                DW_AT_name	("int")
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_byte_size	(0x04)

0x0000003e:   DW_TAG_variable
                DW_AT_name	("rfcomm_stack")
                DW_AT_type	(cu + 0x004f "rfcomm_stack_t*")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/rfcomm.c")
                DW_AT_decl_line	(99)
                DW_AT_location	(DW_OP_addr 0x0)

0x0000004f:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0054 "rfcomm_stack_t")

0x00000054:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0060 "structure ")
                DW_AT_name	("rfcomm_stack_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(299)

0x00000060:   DW_TAG_structure_type
                DW_AT_byte_size	(0x14)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(286)

0x00000065:     DW_TAG_member
                  DW_AT_name	("app_packet_handler")
                  DW_AT_type	(cu + 0x00a7 "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(288)
                  DW_AT_data_member_location	(0x00)

0x00000072:     DW_TAG_member
                  DW_AT_name	("rfcomm_multiplexers")
                  DW_AT_type	(cu + 0x00f1 "linked_list_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(291)
                  DW_AT_data_member_location	(0x04)

0x0000007f:     DW_TAG_member
                  DW_AT_name	("rfcomm_channels")
                  DW_AT_type	(cu + 0x00f1 "linked_list_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(293)
                  DW_AT_data_member_location	(0x08)

0x0000008c:     DW_TAG_member
                  DW_AT_name	("rfcomm_services")
                  DW_AT_type	(cu + 0x00f1 "linked_list_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(295)
                  DW_AT_data_member_location	(0x0c)

0x00000099:     DW_TAG_member
                  DW_AT_name	("rfcomm_client_cid_generator")
                  DW_AT_type	(cu + 0x00da "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(298)
                  DW_AT_data_member_location	(0x10)

0x000000a6:     NULL

0x000000a7:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x00ac "subroutine ")

0x000000ac:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x000000ad:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x00c7 "*")

0x000000b2:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x00c8 "u8")

0x000000b7:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x00da "u16")

0x000000bc:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x00ec "u8*")

0x000000c1:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x00da "u16")

0x000000c6:     NULL

0x000000c7:   DW_TAG_pointer_type

0x000000c8:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00d3 "unsigned char")
                DW_AT_name	("u8")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(11)

0x000000d3:   DW_TAG_base_type
                DW_AT_name	("unsigned char")
                DW_AT_encoding	(DW_ATE_unsigned_char)
                DW_AT_byte_size	(0x01)

0x000000da:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00e5 "unsigned short")
                DW_AT_name	("u16")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(13)

0x000000e5:   DW_TAG_base_type
                DW_AT_name	("unsigned short")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x02)

0x000000ec:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x00c8 "u8")

0x000000f1:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00fc "btstack_linked_item_t*")
                DW_AT_name	("linked_list_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(101)

0x000000fc:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0101 "btstack_linked_item_t")

0x00000101:   DW_TAG_typedef
                DW_AT_type	(cu + 0x010c "btstack_linked_item")
                DW_AT_name	("btstack_linked_item_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(55)

0x0000010c:   DW_TAG_structure_type
                DW_AT_name	("btstack_linked_item")
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(53)

0x00000114:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(cu + 0x0121 "btstack_linked_item*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                  DW_AT_decl_line	(54)
                  DW_AT_data_member_location	(0x00)

0x00000120:     NULL

0x00000121:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x010c "btstack_linked_item")

0x00000126:   DW_TAG_variable
                DW_AT_name	("rfcomm_init_credits")
                DW_AT_type	(cu + 0x00da "u16")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/rfcomm.c")
                DW_AT_decl_line	(93)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000137:   DW_TAG_variable
                DW_AT_name	("rfcomm_credits_base")
                DW_AT_type	(cu + 0x00c8 "u8")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/rfcomm.c")
                DW_AT_decl_line	(94)
                DW_AT_location	(DW_OP_addr 0x2)

0x00000148:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(69)

0x0000014c:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_MULTIPLEXER_CLOSED")
                  DW_AT_const_value	(1)

0x00000152:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_MULTIPLEXER_W4_CONNECT")
                  DW_AT_const_value	(2)

0x00000158:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_MULTIPLEXER_SEND_SABM_0")
                  DW_AT_const_value	(3)

0x0000015e:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_MULTIPLEXER_W4_UA_0")
                  DW_AT_const_value	(4)

0x00000164:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_MULTIPLEXER_W4_SABM_0")
                  DW_AT_const_value	(5)

0x0000016a:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_MULTIPLEXER_SEND_UA_0")
                  DW_AT_const_value	(6)

0x00000170:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_MULTIPLEXER_OPEN")
                  DW_AT_const_value	(7)

0x00000176:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_MULTIPLEXER_SEND_UA_0_AND_DISC")
                  DW_AT_const_value	(8)

0x0000017c:     NULL

0x0000017d:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(85)

0x00000181:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_CLOSED")
                  DW_AT_const_value	(1)

0x00000187:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_W4_MULTIPLEXER")
                  DW_AT_const_value	(2)

0x0000018d:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_SEND_UIH_PN")
                  DW_AT_const_value	(3)

0x00000193:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_W4_PN_RSP")
                  DW_AT_const_value	(4)

0x00000199:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_SEND_SABM_W4_UA")
                  DW_AT_const_value	(5)

0x0000019f:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_W4_UA")
                  DW_AT_const_value	(6)

0x000001a5:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_INCOMING_SETUP")
                  DW_AT_const_value	(7)

0x000001ab:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_DLC_SETUP")
                  DW_AT_const_value	(8)

0x000001b1:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_OPEN")
                  DW_AT_const_value	(9)

0x000001b7:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_SEND_UA_AFTER_DISC")
                  DW_AT_const_value	(10)

0x000001bd:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_SEND_DISC")
                  DW_AT_const_value	(11)

0x000001c3:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_SEND_DM")
                  DW_AT_const_value	(12)

0x000001c9:     NULL

0x000001ca:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(101)

0x000001ce:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_STATE_VAR_NONE")
                  DW_AT_const_value	(0)

0x000001d4:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_STATE_VAR_CLIENT_ACCEPTED")
                  DW_AT_const_value	(1)

0x000001da:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_STATE_VAR_RCVD_PN")
                  DW_AT_const_value	(2)

0x000001e0:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_STATE_VAR_RCVD_RPN")
                  DW_AT_const_value	(4)

0x000001e6:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_STATE_VAR_RCVD_SABM")
                  DW_AT_const_value	(8)

0x000001ec:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_STATE_VAR_RCVD_MSC_CMD")
                  DW_AT_const_value	(16)

0x000001f2:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_STATE_VAR_RCVD_MSC_RSP")
                  DW_AT_const_value	(32)

0x000001f8:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_STATE_VAR_SEND_PN_RSP")
                  DW_AT_const_value	(64)

0x000001ff:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_STATE_VAR_SEND_RPN_INFO")
                  DW_AT_const_value	(128)

0x00000206:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_STATE_VAR_SEND_RPN_RSP")
                  DW_AT_const_value	(256)

0x0000020d:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_STATE_VAR_SEND_UA")
                  DW_AT_const_value	(512)

0x00000214:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_STATE_VAR_SEND_MSC_CMD")
                  DW_AT_const_value	(1024)

0x0000021b:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_STATE_VAR_SEND_MSC_RSP")
                  DW_AT_const_value	(2048)

0x00000222:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_STATE_VAR_SEND_CREDITS")
                  DW_AT_const_value	(4096)

0x00000229:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_STATE_VAR_SENT_MSC_CMD")
                  DW_AT_const_value	(8192)

0x00000231:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_STATE_VAR_SENT_MSC_RSP")
                  DW_AT_const_value	(16384)

0x00000239:     DW_TAG_enumerator
                  DW_AT_name	("RFCOMM_CHANNEL_STATE_VAR_SENT_CREDITS")
                  DW_AT_const_value	(32768)

0x00000241:     NULL

0x00000242:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(124)

0x00000246:     DW_TAG_enumerator
                  DW_AT_name	("CH_EVT_RCVD_SABM")
                  DW_AT_const_value	(1)

0x0000024c:     DW_TAG_enumerator
                  DW_AT_name	("CH_EVT_RCVD_UA")
                  DW_AT_const_value	(2)

0x00000252:     DW_TAG_enumerator
                  DW_AT_name	("CH_EVT_RCVD_PN")
                  DW_AT_const_value	(3)

0x00000258:     DW_TAG_enumerator
                  DW_AT_name	("CH_EVT_RCVD_PN_RSP")
                  DW_AT_const_value	(4)

0x0000025e:     DW_TAG_enumerator
                  DW_AT_name	("CH_EVT_RCVD_DISC")
                  DW_AT_const_value	(5)

0x00000264:     DW_TAG_enumerator
                  DW_AT_name	("CH_EVT_RCVD_DM")
                  DW_AT_const_value	(6)

0x0000026a:     DW_TAG_enumerator
                  DW_AT_name	("CH_EVT_RCVD_MSC_CMD")
                  DW_AT_const_value	(7)

0x00000270:     DW_TAG_enumerator
                  DW_AT_name	("CH_EVT_RCVD_MSC_RSP")
                  DW_AT_const_value	(8)

0x00000276:     DW_TAG_enumerator
                  DW_AT_name	("CH_EVT_RCVD_RPN_CMD")
                  DW_AT_const_value	(9)

0x0000027c:     DW_TAG_enumerator
                  DW_AT_name	("CH_EVT_RCVD_RPN_REQ")
                  DW_AT_const_value	(10)

0x00000282:     DW_TAG_enumerator
                  DW_AT_name	("CH_EVT_RCVD_CREDITS")
                  DW_AT_const_value	(11)

0x00000288:     DW_TAG_enumerator
                  DW_AT_name	("CH_EVT_MULTIPLEXER_READY")
                  DW_AT_const_value	(12)

0x0000028e:     DW_TAG_enumerator
                  DW_AT_name	("CH_EVT_READY_TO_SEND")
                  DW_AT_const_value	(13)

0x00000294:     NULL

0x00000295:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(80)

0x00000299:     DW_TAG_enumerator
                  DW_AT_name	("MULT_EV_READY_TO_SEND")
                  DW_AT_const_value	(1)

0x0000029f:     NULL

0x000002a0:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x02a5 "linked_item_t")

0x000002a5:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0101 "btstack_linked_item_t")
                DW_AT_name	("linked_item_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(100)

0x000002b0:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x02b5 "rfcomm_channel_t")

0x000002b5:   DW_TAG_typedef
                DW_AT_type	(cu + 0x02c1 "structure ")
                DW_AT_name	("rfcomm_channel_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(282)

0x000002c1:   DW_TAG_structure_type
                DW_AT_byte_size	(0x34)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(262)

0x000002c6:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x02a5 "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(264)
                  DW_AT_data_member_location	(0x00)

0x000002d3:     DW_TAG_member
                  DW_AT_name	("multiplexer")
                  DW_AT_type	(cu + 0x0322 "rfcomm_multiplexer_t*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(266)
                  DW_AT_data_member_location	(0x04)

0x000002e0:     DW_TAG_member
                  DW_AT_name	("rfc_channel_core_data")
                  DW_AT_type	(cu + 0x0426 "rfc_channel_core_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(268)
                  DW_AT_data_member_location	(0x08)

0x000002ed:     DW_TAG_member
                  DW_AT_name	("max_frame_size")
                  DW_AT_type	(cu + 0x00da "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(271)
                  DW_AT_data_member_location	(0x26)

0x000002fa:     DW_TAG_member
                  DW_AT_name	("service")
                  DW_AT_type	(cu + 0x0548 "rfcomm_service_t*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(274)
                  DW_AT_data_member_location	(0x28)

0x00000307:     DW_TAG_member
                  DW_AT_name	("packet_handler")
                  DW_AT_type	(cu + 0x05b1 "btstack_packet_handler_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(277)
                  DW_AT_data_member_location	(0x2c)

0x00000314:     DW_TAG_member
                  DW_AT_name	("connection")
                  DW_AT_type	(cu + 0x00c7 "*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(280)
                  DW_AT_data_member_location	(0x30)

0x00000321:     NULL

0x00000322:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0327 "rfcomm_multiplexer_t")

0x00000327:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0332 "structure ")
                DW_AT_name	("rfcomm_multiplexer_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(221)

0x00000332:   DW_TAG_structure_type
                DW_AT_byte_size	(0x14)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(211)

0x00000336:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x02a5 "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(213)
                  DW_AT_data_member_location	(0x00)

0x00000342:     DW_TAG_member
                  DW_AT_name	("max_frame_size")
                  DW_AT_type	(cu + 0x00da "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(218)
                  DW_AT_data_member_location	(0x04)

0x0000034e:     DW_TAG_member
                  DW_AT_name	("multiplexer_core_data")
                  DW_AT_type	(cu + 0x035b "multiplexer_core_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(219)
                  DW_AT_data_member_location	(0x06)

0x0000035a:     NULL

0x0000035b:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0366 "structure ")
                DW_AT_name	("multiplexer_core_data_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(207)

0x00000366:   DW_TAG_structure_type
                DW_AT_byte_size	(0x0e)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(191)

0x0000036a:     DW_TAG_member
                  DW_AT_name	("remote_addr")
                  DW_AT_type	(cu + 0x03d1 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(192)
                  DW_AT_data_member_location	(0x00)

0x00000376:     DW_TAG_member
                  DW_AT_name	("l2cap_cid")
                  DW_AT_type	(cu + 0x00da "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(193)
                  DW_AT_data_member_location	(0x06)

0x00000382:     DW_TAG_member
                  DW_AT_name	("state")
                  DW_AT_type	(cu + 0x00c8 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(196)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x08)

0x00000391:     DW_TAG_member
                  DW_AT_name	("l2cap_credits")
                  DW_AT_type	(cu + 0x00c8 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(197)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x08)

0x000003a0:     DW_TAG_member
                  DW_AT_name	("outgoing")
                  DW_AT_type	(cu + 0x00c8 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(200)
                  DW_AT_data_member_location	(0x09)

0x000003ac:     DW_TAG_member
                  DW_AT_name	("at_least_one_connection")
                  DW_AT_type	(cu + 0x00c8 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(202)
                  DW_AT_data_member_location	(0x0a)

0x000003b8:     DW_TAG_member
                  DW_AT_name	("send_dm_for_dlci")
                  DW_AT_type	(cu + 0x00c8 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(205)
                  DW_AT_data_member_location	(0x0b)

0x000003c4:     DW_TAG_member
                  DW_AT_name	("con_handle")
                  DW_AT_type	(cu + 0x0405 "hci_con_handle_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(206)
                  DW_AT_data_member_location	(0x0c)

0x000003d0:     NULL

0x000003d1:   DW_TAG_typedef
                DW_AT_type	(cu + 0x03dc "uint8_t[]")
                DW_AT_name	("bd_addr_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h")
                DW_AT_decl_line	(7)

0x000003dc:   DW_TAG_array_type
                DW_AT_type	(cu + 0x03e8 "uint8_t")

0x000003e1:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x03fe "sizetype")
                  DW_AT_count	(0x06)

0x000003e7:     NULL

0x000003e8:   DW_TAG_typedef
                DW_AT_type	(cu + 0x03f3 "__uint8_t")
                DW_AT_name	("uint8_t")
                DW_AT_decl_file	("/opt/q32s/include/sys/_stdint.h")
                DW_AT_decl_line	(20)

0x000003f3:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00d3 "unsigned char")
                DW_AT_name	("__uint8_t")
                DW_AT_decl_file	("/opt/q32s/include/machine/_default_types.h")
                DW_AT_decl_line	(29)

0x000003fe:   DW_TAG_base_type
                DW_AT_name	("sizetype")
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_unsigned)

0x00000405:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0410 "uint16_t")
                DW_AT_name	("hci_con_handle_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h")
                DW_AT_decl_line	(9)

0x00000410:   DW_TAG_typedef
                DW_AT_type	(cu + 0x041b "__uint16_t")
                DW_AT_name	("uint16_t")
                DW_AT_decl_file	("/opt/q32s/include/sys/_stdint.h")
                DW_AT_decl_line	(26)

0x0000041b:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00e5 "unsigned short")
                DW_AT_name	("__uint16_t")
                DW_AT_decl_file	("/opt/q32s/include/machine/_default_types.h")
                DW_AT_decl_line	(43)

0x00000426:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0432 "structure ")
                DW_AT_name	("rfc_channel_core_data_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(259)

0x00000432:   DW_TAG_structure_type
                DW_AT_byte_size	(0x1e)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(223)

0x00000436:     DW_TAG_member
                  DW_AT_name	("rfc_channel_type")
                  DW_AT_type	(cu + 0x00c8 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(224)
                  DW_AT_data_member_location	(0x00)

0x00000442:     DW_TAG_member
                  DW_AT_name	("remote_addr")
                  DW_AT_type	(cu + 0x03d1 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(225)
                  DW_AT_data_member_location	(0x01)

0x0000044e:     DW_TAG_member
                  DW_AT_name	("rfcomm_cid")
                  DW_AT_type	(cu + 0x00da "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(226)
                  DW_AT_data_member_location	(0x08)

0x0000045a:     DW_TAG_member
                  DW_AT_name	("outgoing")
                  DW_AT_type	(cu + 0x00c8 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(227)
                  DW_AT_data_member_location	(0x0a)

0x00000466:     DW_TAG_member
                  DW_AT_name	("dlci")
                  DW_AT_type	(cu + 0x00c8 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(228)
                  DW_AT_data_member_location	(0x0b)

0x00000472:     DW_TAG_member
                  DW_AT_name	("packets_granted")
                  DW_AT_type	(cu + 0x00c8 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(231)
                  DW_AT_data_member_location	(0x0c)

0x0000047e:     DW_TAG_member
                  DW_AT_name	("credits_outgoing")
                  DW_AT_type	(cu + 0x00c8 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(234)
                  DW_AT_data_member_location	(0x0d)

0x0000048a:     DW_TAG_member
                  DW_AT_name	("new_credits_incoming")
                  DW_AT_type	(cu + 0x00c8 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(237)
                  DW_AT_data_member_location	(0x0e)

0x00000496:     DW_TAG_member
                  DW_AT_name	("credits_incoming")
                  DW_AT_type	(cu + 0x00c8 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(240)
                  DW_AT_data_member_location	(0x0f)

0x000004a2:     DW_TAG_member
                  DW_AT_name	("incoming_flow_control")
                  DW_AT_type	(cu + 0x00c8 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(243)
                  DW_AT_data_member_location	(0x10)

0x000004ae:     DW_TAG_member
                  DW_AT_name	("state")
                  DW_AT_type	(cu + 0x00c8 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(247)
                  DW_AT_data_member_location	(0x11)

0x000004ba:     DW_TAG_member
                  DW_AT_name	("pn_priority")
                  DW_AT_type	(cu + 0x00c8 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(250)
                  DW_AT_data_member_location	(0x12)

0x000004c6:     DW_TAG_member
                  DW_AT_name	("state_var")
                  DW_AT_type	(cu + 0x00da "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(254)
                  DW_AT_data_member_location	(0x14)

0x000004d2:     DW_TAG_member
                  DW_AT_name	("rpn_data")
                  DW_AT_type	(cu + 0x04e0 "rfcomm_rpn_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(257)
                  DW_AT_data_member_location	(0x16)

0x000004df:     NULL

0x000004e0:   DW_TAG_typedef
                DW_AT_type	(cu + 0x04eb "rfcomm_rpn_data")
                DW_AT_name	("rfcomm_rpn_data_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(159)

0x000004eb:   DW_TAG_structure_type
                DW_AT_name	("rfcomm_rpn_data")
                DW_AT_byte_size	(0x07)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(151)

0x000004f3:     DW_TAG_member
                  DW_AT_name	("baud_rate")
                  DW_AT_type	(cu + 0x00c8 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(152)
                  DW_AT_data_member_location	(0x00)

0x000004ff:     DW_TAG_member
                  DW_AT_name	("flags")
                  DW_AT_type	(cu + 0x00c8 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(153)
                  DW_AT_data_member_location	(0x01)

0x0000050b:     DW_TAG_member
                  DW_AT_name	("flow_control")
                  DW_AT_type	(cu + 0x00c8 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(154)
                  DW_AT_data_member_location	(0x02)

0x00000517:     DW_TAG_member
                  DW_AT_name	("xon")
                  DW_AT_type	(cu + 0x00c8 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(155)
                  DW_AT_data_member_location	(0x03)

0x00000523:     DW_TAG_member
                  DW_AT_name	("xoff")
                  DW_AT_type	(cu + 0x00c8 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(156)
                  DW_AT_data_member_location	(0x04)

0x0000052f:     DW_TAG_member
                  DW_AT_name	("parameter_mask_0")
                  DW_AT_type	(cu + 0x00c8 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(157)
                  DW_AT_data_member_location	(0x05)

0x0000053b:     DW_TAG_member
                  DW_AT_name	("parameter_mask_1")
                  DW_AT_type	(cu + 0x00c8 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(158)
                  DW_AT_data_member_location	(0x06)

0x00000547:     NULL

0x00000548:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x054d "rfcomm_service_t")

0x0000054d:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0558 "structure ")
                DW_AT_name	("rfcomm_service_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(189)

0x00000558:   DW_TAG_structure_type
                DW_AT_byte_size	(0x14)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(167)

0x0000055c:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x02a5 "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(169)
                  DW_AT_data_member_location	(0x00)

0x00000568:     DW_TAG_member
                  DW_AT_name	("server_channel")
                  DW_AT_type	(cu + 0x00c8 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(172)
                  DW_AT_data_member_location	(0x04)

0x00000574:     DW_TAG_member
                  DW_AT_name	("incoming_flow_control")
                  DW_AT_type	(cu + 0x00c8 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(175)
                  DW_AT_data_member_location	(0x05)

0x00000580:     DW_TAG_member
                  DW_AT_name	("incoming_initial_credits")
                  DW_AT_type	(cu + 0x00c8 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(178)
                  DW_AT_data_member_location	(0x06)

0x0000058c:     DW_TAG_member
                  DW_AT_name	("max_frame_size")
                  DW_AT_type	(cu + 0x00da "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(181)
                  DW_AT_data_member_location	(0x08)

0x00000598:     DW_TAG_member
                  DW_AT_name	("connection")
                  DW_AT_type	(cu + 0x00c7 "*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(184)
                  DW_AT_data_member_location	(0x0c)

0x000005a4:     DW_TAG_member
                  DW_AT_name	("packet_handler")
                  DW_AT_type	(cu + 0x05b1 "btstack_packet_handler_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(187)
                  DW_AT_data_member_location	(0x10)

0x000005b0:     NULL

0x000005b1:   DW_TAG_typedef
                DW_AT_type	(cu + 0x05bc "subroutine *")
                DW_AT_name	("btstack_packet_handler_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(58)

0x000005bc:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x05c1 "subroutine ")

0x000005c1:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x000005c2:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x03e8 "uint8_t")

0x000005c7:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0410 "uint16_t")

0x000005cc:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x05d7 "uint8_t*")

0x000005d1:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0410 "uint16_t")

0x000005d6:     NULL

0x000005d7:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x03e8 "uint8_t")

0x000005dc:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0426 "rfc_channel_core_data_t")

0x000005e1:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x035b "multiplexer_core_data_t")

0x000005e6:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x05eb "rfcomm_channel_event_rpn_t")

0x000005eb:   DW_TAG_typedef
                DW_AT_type	(cu + 0x05f6 "rfcomm_channel_event_rpn")
                DW_AT_name	("rfcomm_channel_event_rpn_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(164)

0x000005f6:   DW_TAG_structure_type
                DW_AT_name	("rfcomm_channel_event_rpn")
                DW_AT_byte_size	(0x0c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(161)

0x000005fe:     DW_TAG_member
                  DW_AT_name	("super")
                  DW_AT_type	(cu + 0x0617 "rfcomm_channel_event_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(162)
                  DW_AT_data_member_location	(0x00)

0x0000060a:     DW_TAG_member
                  DW_AT_name	("data")
                  DW_AT_type	(cu + 0x04e0 "rfcomm_rpn_data_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(163)
                  DW_AT_data_member_location	(0x04)

0x00000616:     NULL

0x00000617:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0622 "rfcomm_channel_event")
                DW_AT_name	("rfcomm_channel_event_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(142)

0x00000622:   DW_TAG_structure_type
                DW_AT_name	("rfcomm_channel_event")
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(140)

0x0000062a:     DW_TAG_member
                  DW_AT_name	("type")
                  DW_AT_type	(cu + 0x0637 "RFCOMM_CHANNEL_EVENT")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(141)
                  DW_AT_data_member_location	(0x00)

0x00000636:     NULL

0x00000637:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0242 "enumeration ")
                DW_AT_name	("RFCOMM_CHANNEL_EVENT")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(138)

0x00000642:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0647 "rfcomm_channel_event_pn_t")

0x00000647:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0652 "rfcomm_channel_event_pn")
                DW_AT_name	("rfcomm_channel_event_pn_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(149)

0x00000652:   DW_TAG_structure_type
                DW_AT_name	("rfcomm_channel_event_pn")
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                DW_AT_decl_line	(144)

0x0000065a:     DW_TAG_member
                  DW_AT_name	("super")
                  DW_AT_type	(cu + 0x0617 "rfcomm_channel_event_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(145)
                  DW_AT_data_member_location	(0x00)

0x00000666:     DW_TAG_member
                  DW_AT_name	("max_frame_size")
                  DW_AT_type	(cu + 0x00da "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(146)
                  DW_AT_data_member_location	(0x04)

0x00000672:     DW_TAG_member
                  DW_AT_name	("priority")
                  DW_AT_type	(cu + 0x00c8 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(147)
                  DW_AT_data_member_location	(0x06)

0x0000067e:     DW_TAG_member
                  DW_AT_name	("credits_outgoing")
                  DW_AT_type	(cu + 0x00c8 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/rfcomm.h")
                  DW_AT_decl_line	(148)
                  DW_AT_data_member_location	(0x07)

0x0000068a:     NULL

0x0000068b:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0617 "rfcomm_channel_event_t")

0x00000690:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000000)
                DW_AT_high_pc	(0x0000000000000018)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("rfcomm_change_credits_setting")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/rfcomm.c")
                DW_AT_decl_line	(110)
                DW_AT_prototyped	(true)
                DW_AT_external	(true)

0x000006a1:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_reg1 ECX)
                  DW_AT_name	("init_credits")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/rfcomm.c")
                  DW_AT_decl_line	(110)
                  DW_AT_type	(cu + 0x00da "u16")

0x000006ae:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_reg0 EAX)
                  DW_AT_name	("base")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/rfcomm.c")
                  DW_AT_decl_line	(110)
                  DW_AT_type	(cu + 0x00c8 "u8")

0x000006bb:     NULL

0x000006bc:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000018)
                DW_AT_high_pc	(0x000000000000008d)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_abstract_origin	(cu + 0x076b "rfcomm_channel_for_rfcomm_cid")

0x000006cb:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000000
                     0x0000000000000018 - 0x0000000000000035: DW_OP_reg0 EAX
                     0x0000000000000035 - 0x000000000000008d: DW_OP_breg5 EBP-6)
                  DW_AT_abstract_origin	(cu + 0x0778 "rfcomm_cid")

0x000006d4:     DW_TAG_variable
                  DW_AT_location	(0x0000001f
                     0x000000000000002e - 0x0000000000000038: DW_OP_reg2 EDX
                     0x0000000000000038 - 0x0000000000000053: DW_OP_breg5 EBP-12
                     0x0000000000000053 - 0x0000000000000059: DW_OP_reg2 EDX
                     0x0000000000000059 - 0x0000000000000062: DW_OP_breg5 EBP-20
                     0x0000000000000062 - 0x000000000000008d: DW_OP_breg5 EBP-12)
                  DW_AT_abstract_origin	(cu + 0x0784 "it")

0x000006dd:     DW_TAG_lexical_block
                  DW_AT_ranges	(0x00000000
                     [0x00000044 - 0x0000004c)
                     [0x00000065 - 0x0000007e))

0x000006e2:       DW_TAG_variable
                    DW_AT_abstract_origin	(cu + 0x0791 "channel")

0x000006e7:       NULL

0x000006e8:     NULL

0x000006e9:   DW_TAG_subprogram
                DW_AT_low_pc	(0x000000000000008d)
                DW_AT_high_pc	(0x00000000000000b6)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("rfcomm_init")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/rfcomm.c")
                DW_AT_decl_line	(1945)
                DW_AT_prototyped	(true)
                DW_AT_external	(true)

0x000006fb:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_reg0 EAX)
                  DW_AT_name	("stack")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/rfcomm.c")
                  DW_AT_decl_line	(1945)
                  DW_AT_type	(cu + 0x004f "rfcomm_stack_t*")

0x00000709:     NULL

0x0000070a:   DW_TAG_subprogram
                DW_AT_low_pc	(0x00000000000000b6)
                DW_AT_high_pc	(0x00000000000000bb)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
