; ModuleID = 'rfcomm.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/rfcomm.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.rfcomm_stack_t = type { void (i8*, i8, i16, i8*, i16)*, %struct.btstack_linked_item*, %struct.btstack_linked_item*, %struct.btstack_linked_item*, i16 }
%struct.btstack_linked_item = type { %struct.btstack_linked_item* }
%struct.rfcomm_channel_t = type { %struct.btstack_linked_item, %struct.rfcomm_multiplexer_t*, %struct.rfc_channel_core_data_t, i16, %struct.rfcomm_service_t*, void (i8, i16, i8*, i16)*, i8* }
%struct.rfcomm_multiplexer_t = type { %struct.btstack_linked_item, i16, %struct.multiplexer_core_data_t }
%struct.multiplexer_core_data_t = type { [6 x i8], i16, i8, i8, i8, i8, i16 }
%struct.rfc_channel_core_data_t = type { i8, [6 x i8], i16, i8, i8, i8, i8, i8, i8, i8, i8, i8, i16, %struct.rfcomm_rpn_data }
%struct.rfcomm_rpn_data = type { i8, i8, i8, i8, i8, i8, i8 }
%struct.rfcomm_service_t = type { %struct.btstack_linked_item, i8, i8, i8, i16, i8*, void (i8, i16, i8*, i16)* }
%struct.rfcomm_channel_event = type { i32 }
%struct.rfcomm_channel_event_pn = type { %struct.rfcomm_channel_event, i16, i8, i8 }
%struct.rfcomm_channel_event_rpn = type { %struct.rfcomm_channel_event, %struct.rfcomm_rpn_data }

@app_info_debug_enable = weak hidden local_unnamed_addr global i32 0, align 4, !dbg !0

!3 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/rfcomm.c", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!4 = !{!5, !16, !30, !49, !64}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 69, size: 32, elements: !7)
!6 = !DIFile(filename: "../btstack/Protocol/include/bredr/rfcomm.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15}
!8 = !DIEnumerator(name: "RFCOMM_MULTIPLEXER_CLOSED", value: 1)
!9 = !DIEnumerator(name: "RFCOMM_MULTIPLEXER_W4_CONNECT", value: 2)
!10 = !DIEnumerator(name: "RFCOMM_MULTIPLEXER_SEND_SABM_0", value: 3)
!11 = !DIEnumerator(name: "RFCOMM_MULTIPLEXER_W4_UA_0", value: 4)
!12 = !DIEnumerator(name: "RFCOMM_MULTIPLEXER_W4_SABM_0", value: 5)
!13 = !DIEnumerator(name: "RFCOMM_MULTIPLEXER_SEND_UA_0", value: 6)
!14 = !DIEnumerator(name: "RFCOMM_MULTIPLEXER_OPEN", value: 7)
!15 = !DIEnumerator(name: "RFCOMM_MULTIPLEXER_SEND_UA_0_AND_DISC", value: 8)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 85, size: 32, elements: !17)
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29}
!18 = !DIEnumerator(name: "RFCOMM_CHANNEL_CLOSED", value: 1)
!19 = !DIEnumerator(name: "RFCOMM_CHANNEL_W4_MULTIPLEXER", value: 2)
!20 = !DIEnumerator(name: "RFCOMM_CHANNEL_SEND_UIH_PN", value: 3)
!21 = !DIEnumerator(name: "RFCOMM_CHANNEL_W4_PN_RSP", value: 4)
!22 = !DIEnumerator(name: "RFCOMM_CHANNEL_SEND_SABM_W4_UA", value: 5)
!23 = !DIEnumerator(name: "RFCOMM_CHANNEL_W4_UA", value: 6)
!24 = !DIEnumerator(name: "RFCOMM_CHANNEL_INCOMING_SETUP", value: 7)
!25 = !DIEnumerator(name: "RFCOMM_CHANNEL_DLC_SETUP", value: 8)
!26 = !DIEnumerator(name: "RFCOMM_CHANNEL_OPEN", value: 9)
!27 = !DIEnumerator(name: "RFCOMM_CHANNEL_SEND_UA_AFTER_DISC", value: 10)
!28 = !DIEnumerator(name: "RFCOMM_CHANNEL_SEND_DISC", value: 11)
!29 = !DIEnumerator(name: "RFCOMM_CHANNEL_SEND_DM", value: 12)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 101, size: 32, elements: !31)
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48}
!32 = !DIEnumerator(name: "RFCOMM_CHANNEL_STATE_VAR_NONE", value: 0)
!33 = !DIEnumerator(name: "RFCOMM_CHANNEL_STATE_VAR_CLIENT_ACCEPTED", value: 1)
!34 = !DIEnumerator(name: "RFCOMM_CHANNEL_STATE_VAR_RCVD_PN", value: 2)
!35 = !DIEnumerator(name: "RFCOMM_CHANNEL_STATE_VAR_RCVD_RPN", value: 4)
!36 = !DIEnumerator(name: "RFCOMM_CHANNEL_STATE_VAR_RCVD_SABM", value: 8)
!37 = !DIEnumerator(name: "RFCOMM_CHANNEL_STATE_VAR_RCVD_MSC_CMD", value: 16)
!38 = !DIEnumerator(name: "RFCOMM_CHANNEL_STATE_VAR_RCVD_MSC_RSP", value: 32)
!39 = !DIEnumerator(name: "RFCOMM_CHANNEL_STATE_VAR_SEND_PN_RSP", value: 64)
!40 = !DIEnumerator(name: "RFCOMM_CHANNEL_STATE_VAR_SEND_RPN_INFO", value: 128)
!41 = !DIEnumerator(name: "RFCOMM_CHANNEL_STATE_VAR_SEND_RPN_RSP", value: 256)
!42 = !DIEnumerator(name: "RFCOMM_CHANNEL_STATE_VAR_SEND_UA", value: 512)
!43 = !DIEnumerator(name: "RFCOMM_CHANNEL_STATE_VAR_SEND_MSC_CMD", value: 1024)
!44 = !DIEnumerator(name: "RFCOMM_CHANNEL_STATE_VAR_SEND_MSC_RSP", value: 2048)
!45 = !DIEnumerator(name: "RFCOMM_CHANNEL_STATE_VAR_SEND_CREDITS", value: 4096)
!46 = !DIEnumerator(name: "RFCOMM_CHANNEL_STATE_VAR_SENT_MSC_CMD", value: 8192)
!47 = !DIEnumerator(name: "RFCOMM_CHANNEL_STATE_VAR_SENT_MSC_RSP", value: 16384)
!48 = !DIEnumerator(name: "RFCOMM_CHANNEL_STATE_VAR_SENT_CREDITS", value: 32768)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 124, size: 32, elements: !50)
!50 = !{!51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!51 = !DIEnumerator(name: "CH_EVT_RCVD_SABM", value: 1)
!52 = !DIEnumerator(name: "CH_EVT_RCVD_UA", value: 2)
!53 = !DIEnumerator(name: "CH_EVT_RCVD_PN", value: 3)
!54 = !DIEnumerator(name: "CH_EVT_RCVD_PN_RSP", value: 4)
!55 = !DIEnumerator(name: "CH_EVT_RCVD_DISC", value: 5)
!56 = !DIEnumerator(name: "CH_EVT_RCVD_DM", value: 6)
!57 = !DIEnumerator(name: "CH_EVT_RCVD_MSC_CMD", value: 7)
!58 = !DIEnumerator(name: "CH_EVT_RCVD_MSC_RSP", value: 8)
!59 = !DIEnumerator(name: "CH_EVT_RCVD_RPN_CMD", value: 9)
!60 = !DIEnumerator(name: "CH_EVT_RCVD_RPN_REQ", value: 10)
!61 = !DIEnumerator(name: "CH_EVT_RCVD_CREDITS", value: 11)
!62 = !DIEnumerator(name: "CH_EVT_MULTIPLEXER_READY", value: 12)
!63 = !DIEnumerator(name: "CH_EVT_READY_TO_SEND", value: 13)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 80, size: 32, elements: !65)
!65 = !{!66}
!66 = !DIEnumerator(name: "MULT_EV_READY_TO_SEND", value: 1)
!67 = !{!68, !76, !167, !157, !168, !82, !169, !115, !170, !181, !189, !147, !190}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_item_t", file: !70, line: 100, baseType: !71)
!70 = !DIFile(filename: "../btcommon/btstack_linked_list.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_linked_item_t", file: !70, line: 55, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btstack_linked_item", file: !70, line: 53, size: 32, elements: !73)
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !72, file: !70, line: 54, baseType: !75, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "rfcomm_channel_t", file: !6, line: 282, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 262, size: 416, elements: !79)
!79 = !{!80, !81, !117, !145, !146, !165, !166}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !78, file: !6, line: 264, baseType: !69, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "multiplexer", scope: !78, file: !6, line: 266, baseType: !82, size: 32, offset: 32)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "rfcomm_multiplexer_t", file: !6, line: 221, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 211, size: 160, elements: !85)
!85 = !{!86, !87, !91}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !84, file: !6, line: 213, baseType: !69, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "max_frame_size", scope: !84, file: !6, line: 218, baseType: !88, size: 16, offset: 32)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !89, line: 13, baseType: !90)
!89 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!90 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "multiplexer_core_data", scope: !84, file: !6, line: 219, baseType: !92, size: 112, offset: 48)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiplexer_core_data_t", file: !6, line: 207, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 191, size: 112, elements: !94)
!94 = !{!95, !106, !107, !109, !110, !111, !112, !113}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "remote_addr", scope: !93, file: !6, line: 192, baseType: !96, size: 48)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_addr_t", file: !97, line: 7, baseType: !98)
!97 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 48, elements: !104)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !100, line: 20, baseType: !101)
!100 = !DIFile(filename: "/opt/q32s/include/sys/_stdint.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !102, line: 29, baseType: !103)
!102 = !DIFile(filename: "/opt/q32s/include/machine/_default_types.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!103 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!104 = !{!105}
!105 = !DISubrange(count: 6)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "l2cap_cid", scope: !93, file: !6, line: 193, baseType: !88, size: 16, offset: 48)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !93, file: !6, line: 196, baseType: !108, size: 4, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !89, line: 11, baseType: !103)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "l2cap_credits", scope: !93, file: !6, line: 197, baseType: !108, size: 4, offset: 68, flags: DIFlagBitField, extraData: i64 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "outgoing", scope: !93, file: !6, line: 200, baseType: !108, size: 8, offset: 72)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "at_least_one_connection", scope: !93, file: !6, line: 202, baseType: !108, size: 8, offset: 80)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "send_dm_for_dlci", scope: !93, file: !6, line: 205, baseType: !108, size: 8, offset: 88)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "con_handle", scope: !93, file: !6, line: 206, baseType: !114, size: 16, offset: 96)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "hci_con_handle_t", file: !97, line: 9, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !100, line: 26, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !102, line: 43, baseType: !90)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "rfc_channel_core_data", scope: !78, file: !6, line: 268, baseType: !118, size: 240, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "rfc_channel_core_data_t", file: !6, line: 259, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 223, size: 240, elements: !120)
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "rfc_channel_type", scope: !119, file: !6, line: 224, baseType: !108, size: 8)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "remote_addr", scope: !119, file: !6, line: 225, baseType: !96, size: 48, offset: 8)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_cid", scope: !119, file: !6, line: 226, baseType: !88, size: 16, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "outgoing", scope: !119, file: !6, line: 227, baseType: !108, size: 8, offset: 80)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !119, file: !6, line: 228, baseType: !108, size: 8, offset: 88)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "packets_granted", scope: !119, file: !6, line: 231, baseType: !108, size: 8, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "credits_outgoing", scope: !119, file: !6, line: 234, baseType: !108, size: 8, offset: 104)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "new_credits_incoming", scope: !119, file: !6, line: 237, baseType: !108, size: 8, offset: 112)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "credits_incoming", scope: !119, file: !6, line: 240, baseType: !108, size: 8, offset: 120)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_flow_control", scope: !119, file: !6, line: 243, baseType: !108, size: 8, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !119, file: !6, line: 247, baseType: !108, size: 8, offset: 136)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "pn_priority", scope: !119, file: !6, line: 250, baseType: !108, size: 8, offset: 144)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "state_var", scope: !119, file: !6, line: 254, baseType: !88, size: 16, offset: 160)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "rpn_data", scope: !119, file: !6, line: 257, baseType: !135, size: 56, offset: 176)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "rfcomm_rpn_data_t", file: !6, line: 159, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rfcomm_rpn_data", file: !6, line: 151, size: 56, elements: !137)
!137 = !{!138, !139, !140, !141, !142, !143, !144}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "baud_rate", scope: !136, file: !6, line: 152, baseType: !108, size: 8)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !136, file: !6, line: 153, baseType: !108, size: 8, offset: 8)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "flow_control", scope: !136, file: !6, line: 154, baseType: !108, size: 8, offset: 16)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "xon", scope: !136, file: !6, line: 155, baseType: !108, size: 8, offset: 24)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "xoff", scope: !136, file: !6, line: 156, baseType: !108, size: 8, offset: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "parameter_mask_0", scope: !136, file: !6, line: 157, baseType: !108, size: 8, offset: 40)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "parameter_mask_1", scope: !136, file: !6, line: 158, baseType: !108, size: 8, offset: 48)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "max_frame_size", scope: !78, file: !6, line: 271, baseType: !88, size: 16, offset: 304)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "service", scope: !78, file: !6, line: 274, baseType: !147, size: 32, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "rfcomm_service_t", file: !6, line: 189, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 167, size: 160, elements: !150)
!150 = !{!151, !152, !153, !154, !155, !156, !158}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !149, file: !6, line: 169, baseType: !69, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "server_channel", scope: !149, file: !6, line: 172, baseType: !108, size: 8, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_flow_control", scope: !149, file: !6, line: 175, baseType: !108, size: 8, offset: 40)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_initial_credits", scope: !149, file: !6, line: 178, baseType: !108, size: 8, offset: 48)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "max_frame_size", scope: !149, file: !6, line: 181, baseType: !88, size: 16, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !149, file: !6, line: 184, baseType: !157, size: 32, offset: 96)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "packet_handler", scope: !149, file: !6, line: 187, baseType: !159, size: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_packet_handler_t", file: !160, line: 58, baseType: !161)
!160 = !DIFile(filename: "../btcommon/hci_cmds.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !99, !115, !164, !115}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "packet_handler", scope: !78, file: !6, line: 277, baseType: !159, size: 32, offset: 352)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !78, file: !6, line: 280, baseType: !157, size: 32, offset: 384)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "rfcomm_channel_event_rpn_t", file: !6, line: 164, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rfcomm_channel_event_rpn", file: !6, line: 161, size: 96, elements: !173)
!173 = !{!174, !180}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "super", scope: !172, file: !6, line: 162, baseType: !175, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "rfcomm_channel_event_t", file: !6, line: 142, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rfcomm_channel_event", file: !6, line: 140, size: 32, elements: !177)
!177 = !{!178}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !176, file: !6, line: 141, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "RFCOMM_CHANNEL_EVENT", file: !6, line: 138, baseType: !49)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !172, file: !6, line: 163, baseType: !135, size: 56, offset: 32)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "rfcomm_channel_event_pn_t", file: !6, line: 149, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rfcomm_channel_event_pn", file: !6, line: 144, size: 64, elements: !184)
!184 = !{!185, !186, !187, !188}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "super", scope: !183, file: !6, line: 145, baseType: !175, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "max_frame_size", scope: !183, file: !6, line: 146, baseType: !88, size: 16, offset: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !183, file: !6, line: 147, baseType: !108, size: 8, offset: 48)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "credits_outgoing", scope: !183, file: !6, line: 148, baseType: !108, size: 8, offset: 56)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 32)
!190 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!191 = !{!0, !192, !208, !210}
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "rfcomm_stack", scope: !2, file: !3, line: 99, type: !194, isLocal: true, isDefinition: true)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "rfcomm_stack_t", file: !6, line: 299, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 286, size: 160, elements: !197)
!197 = !{!198, !202, !205, !206, !207}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "app_packet_handler", scope: !196, file: !6, line: 288, baseType: !199, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !157, !108, !88, !167, !88}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_multiplexers", scope: !196, file: !6, line: 291, baseType: !203, size: 32, offset: 32)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_list_t", file: !70, line: 101, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_channels", scope: !196, file: !6, line: 293, baseType: !203, size: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_services", scope: !196, file: !6, line: 295, baseType: !203, size: 32, offset: 96)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "rfcomm_client_cid_generator", scope: !196, file: !6, line: 298, baseType: !88, size: 16, offset: 128)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "rfcomm_init_credits", scope: !2, file: !3, line: 93, type: !88, isLocal: true, isDefinition: true)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "rfcomm_credits_base", scope: !2, file: !3, line: 94, type: !108, isLocal: true, isDefinition: true)
!212 = !DIFile(filename: "../btcommon/profile_stack_debug.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!213 = !{i32 2, !"Dwarf Version", i32 4}
!214 = !{i32 2, !"Debug Info Version", i32 3}
!215 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!216 = distinct !DISubprogram(name: "rfcomm_change_credits_setting", scope: !3, file: !3, line: 110, type: !217, isLocal: false, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !219)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !88, !108}
!219 = !{!220, !221}
!220 = !DILocalVariable(name: "init_credits", arg: 1, scope: !216, file: !3, line: 110, type: !88)
!221 = !DILocalVariable(name: "base", arg: 2, scope: !216, file: !3, line: 110, type: !108)
!222 = !DILocation(line: 110, column: 40, scope: !216)
!223 = !DILocation(line: 110, column: 57, scope: !216)
!224 = !DILocation(line: 112, column: 25, scope: !216)
!225 = !{!226, !226, i64 0}
!226 = !{!"short", !227, i64 0}
!227 = !{!"omnipotent char", !228, i64 0}
!228 = !{!"Simple C/C++ TBAA"}
!229 = !DILocation(line: 113, column: 25, scope: !216)
!230 = !{!227, !227, i64 0}
!231 = !DILocation(line: 114, column: 1, scope: !216)
!232 = distinct !DISubprogram(name: "rfcomm_channel_for_rfcomm_cid", scope: !3, file: !3, line: 431, type: !233, isLocal: false, isDefinition: true, scopeLine: 432, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !235)
!233 = !DISubroutineType(types: !234)
!234 = !{!76, !88}
!235 = !{!236, !237, !238}
!236 = !DILocalVariable(name: "rfcomm_cid", arg: 1, scope: !232, file: !3, line: 431, type: !88)
!237 = !DILocalVariable(name: "it", scope: !232, file: !3, line: 433, type: !68)
!238 = !DILocalVariable(name: "channel", scope: !239, file: !3, line: 435, type: !76)
!239 = distinct !DILexicalBlock(scope: !240, file: !3, line: 434, column: 84)
!240 = distinct !DILexicalBlock(scope: !241, file: !3, line: 434, column: 5)
!241 = distinct !DILexicalBlock(scope: !232, file: !3, line: 434, column: 5)
!242 = !DILocation(line: 431, column: 53, scope: !232)
!243 = !DILocation(line: 434, column: 33, scope: !241)
!244 = !{!245, !245, i64 0}
!245 = !{!"any pointer", !227, i64 0}
!246 = !DILocation(line: 434, column: 47, scope: !241)
!247 = !DILocation(line: 433, column: 20, scope: !232)
!248 = !DILocation(line: 434, column: 5, scope: !249)
!249 = !DILexicalBlockFile(scope: !241, file: !3, discriminator: 1)
!250 = !DILocation(line: 435, column: 27, scope: !239)
!251 = !DILocation(line: 434, column: 78, scope: !252)
!252 = !DILexicalBlockFile(scope: !240, file: !3, discriminator: 2)
!253 = distinct !{!253, !254, !255}
!254 = !DILocation(line: 434, column: 5, scope: !241)
!255 = !DILocation(line: 439, column: 5, scope: !241)
!256 = !DILocation(line: 436, column: 44, scope: !257)
!257 = distinct !DILexicalBlock(scope: !239, file: !3, line: 436, column: 13)
!258 = !{!259, !226, i64 16}
!259 = !{!"", !260, i64 0, !245, i64 4, !261, i64 8, !226, i64 38, !245, i64 40, !245, i64 44, !245, i64 48}
!260 = !{!"btstack_linked_item", !245, i64 0}
