temp.o:	file format ELF32-i386

.debug_info contents:
0x00000000: Compile Unit: length = 0x00001eba version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x00001ebe)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)")
              DW_AT_language	(DW_LANG_C99)
              DW_AT_name	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
              DW_AT_GNU_pubnames	(true)
              DW_AT_low_pc	(0x0000000000000000)
              DW_AT_ranges	(0x000000b0
                 [0x00000000 - 0x00002bb8)
                 [0x00000000 - 0x00000009))

0x00000026:   DW_TAG_variable
                DW_AT_name	("app_info_debug_enable")
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/profile_stack_debug.h")
                DW_AT_decl_line	(190)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000037:   DW_TAG_base_type
                DW_AT_name	("int")
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_byte_size	(0x04)

0x0000003e:   DW_TAG_variable
                DW_AT_name	("sdp_type_names")
                DW_AT_type	(cu + 0x004f "const const char*[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(68)
                DW_AT_location	(DW_OP_addr 0x0)

0x0000004f:   DW_TAG_array_type
                DW_AT_type	(cu + 0x005b "const const char*")

0x00000054:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0071 "sizetype")
                  DW_AT_count	(0x09)

0x0000005a:     NULL

0x0000005b:   DW_TAG_const_type
                DW_AT_type	(cu + 0x0060 "const char*")

0x00000060:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0065 "const char")

0x00000065:   DW_TAG_const_type
                DW_AT_type	(cu + 0x006a "char")

0x0000006a:   DW_TAG_base_type
                DW_AT_name	("char")
                DW_AT_encoding	(DW_ATE_signed_char)
                DW_AT_byte_size	(0x01)

0x00000071:   DW_TAG_base_type
                DW_AT_name	("sizetype")
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_unsigned)

0x00000078:   DW_TAG_variable
                DW_AT_name	("sdp_bluetooth_base_uuid")
                DW_AT_type	(cu + 0x0089 "const u8[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(71)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000089:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0095 "const u8")

0x0000008e:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0071 "sizetype")
                  DW_AT_count	(0x10)

0x00000094:     NULL

0x00000095:   DW_TAG_const_type
                DW_AT_type	(cu + 0x009a "u8")

0x0000009a:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00a5 "unsigned char")
                DW_AT_name	("u8")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(44)

0x000000a5:   DW_TAG_base_type
                DW_AT_name	("unsigned char")
                DW_AT_encoding	(DW_ATE_unsigned_char)
                DW_AT_byte_size	(0x01)

0x000000ac:   DW_TAG_variable
                DW_AT_name	("hid_sdp_info")
                DW_AT_type	(cu + 0x00be "const hid_sdp_info_t")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(1088)
                DW_AT_location	(DW_OP_addr 0x0)

0x000000be:   DW_TAG_const_type
                DW_AT_type	(cu + 0x00c3 "hid_sdp_info_t")

0x000000c3:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00cf "__hid_sdp_info")
                DW_AT_name	("hid_sdp_info_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                DW_AT_decl_line	(612)

0x000000cf:   DW_TAG_structure_type
                DW_AT_name	("__hid_sdp_info")
                DW_AT_byte_size	(0x3c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                DW_AT_decl_line	(584)

0x000000d8:     DW_TAG_member
                  DW_AT_name	("vid_private")
                  DW_AT_type	(cu + 0x022b "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(585)
                  DW_AT_data_member_location	(0x00)

0x000000e5:     DW_TAG_member
                  DW_AT_name	("pid_private")
                  DW_AT_type	(cu + 0x022b "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(586)
                  DW_AT_data_member_location	(0x02)

0x000000f2:     DW_TAG_member
                  DW_AT_name	("ver_private")
                  DW_AT_type	(cu + 0x022b "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(587)
                  DW_AT_data_member_location	(0x04)

0x000000ff:     DW_TAG_member
                  DW_AT_name	("sub_class")
                  DW_AT_type	(cu + 0x009a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(589)
                  DW_AT_data_member_location	(0x06)

0x0000010c:     DW_TAG_member
                  DW_AT_name	("country_code")
                  DW_AT_type	(cu + 0x009a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(590)
                  DW_AT_data_member_location	(0x07)

0x00000119:     DW_TAG_member
                  DW_AT_name	("virtual_cable")
                  DW_AT_type	(cu + 0x023d "bool")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(591)
                  DW_AT_data_member_location	(0x08)

0x00000126:     DW_TAG_member
                  DW_AT_name	("reconnect_initiate")
                  DW_AT_type	(cu + 0x023d "bool")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(592)
                  DW_AT_data_member_location	(0x09)

0x00000133:     DW_TAG_member
                  DW_AT_name	("sdp_disable")
                  DW_AT_type	(cu + 0x023d "bool")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(593)
                  DW_AT_data_member_location	(0x0a)

0x00000140:     DW_TAG_member
                  DW_AT_name	("battery_power")
                  DW_AT_type	(cu + 0x023d "bool")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(594)
                  DW_AT_data_member_location	(0x0b)

0x0000014d:     DW_TAG_member
                  DW_AT_name	("remote_wake")
                  DW_AT_type	(cu + 0x023d "bool")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(595)
                  DW_AT_data_member_location	(0x0c)

0x0000015a:     DW_TAG_member
                  DW_AT_name	("normally_connectable")
                  DW_AT_type	(cu + 0x023d "bool")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(596)
                  DW_AT_data_member_location	(0x0d)

0x00000167:     DW_TAG_member
                  DW_AT_name	("boot_device")
                  DW_AT_type	(cu + 0x023d "bool")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(597)
                  DW_AT_data_member_location	(0x0e)

0x00000174:     DW_TAG_member
                  DW_AT_name	("version")
                  DW_AT_type	(cu + 0x022b "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(598)
                  DW_AT_data_member_location	(0x10)

0x00000181:     DW_TAG_member
                  DW_AT_name	("parser_version")
                  DW_AT_type	(cu + 0x022b "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(599)
                  DW_AT_data_member_location	(0x12)

0x0000018e:     DW_TAG_member
                  DW_AT_name	("profile_version")
                  DW_AT_type	(cu + 0x022b "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(600)
                  DW_AT_data_member_location	(0x14)

0x0000019b:     DW_TAG_member
                  DW_AT_name	("supervision_timeout")
                  DW_AT_type	(cu + 0x022b "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(601)
                  DW_AT_data_member_location	(0x16)

0x000001a8:     DW_TAG_member
                  DW_AT_name	("language")
                  DW_AT_type	(cu + 0x022b "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(602)
                  DW_AT_data_member_location	(0x18)

0x000001b5:     DW_TAG_member
                  DW_AT_name	("bt_string_offset")
                  DW_AT_type	(cu + 0x022b "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(603)
                  DW_AT_data_member_location	(0x1a)

0x000001c2:     DW_TAG_member
                  DW_AT_name	("descriptor_len")
                  DW_AT_type	(cu + 0x022b "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(604)
                  DW_AT_data_member_location	(0x1c)

0x000001cf:     DW_TAG_member
                  DW_AT_name	("descriptor")
                  DW_AT_type	(cu + 0x0248 "u8*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(605)
                  DW_AT_data_member_location	(0x20)

0x000001dc:     DW_TAG_member
                  DW_AT_name	("service_name")
                  DW_AT_type	(cu + 0x024d "char*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(606)
                  DW_AT_data_member_location	(0x24)

0x000001e9:     DW_TAG_member
                  DW_AT_name	("service_description")
                  DW_AT_type	(cu + 0x024d "char*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(607)
                  DW_AT_data_member_location	(0x28)

0x000001f6:     DW_TAG_member
                  DW_AT_name	("provide_name")
                  DW_AT_type	(cu + 0x024d "char*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(608)
                  DW_AT_data_member_location	(0x2c)

0x00000203:     DW_TAG_member
                  DW_AT_name	("sdp_request_respone_callback")
                  DW_AT_type	(cu + 0x0252 "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(609)
                  DW_AT_data_member_location	(0x30)

0x00000210:     DW_TAG_member
                  DW_AT_name	("extra_buf")
                  DW_AT_type	(cu + 0x0248 "u8*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(610)
                  DW_AT_data_member_location	(0x34)

0x0000021d:     DW_TAG_member
                  DW_AT_name	("extra_len")
                  DW_AT_type	(cu + 0x009a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                  DW_AT_decl_line	(611)
                  DW_AT_data_member_location	(0x38)

0x0000022a:     NULL

0x0000022b:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0236 "unsigned short")
                DW_AT_name	("u16")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(46)

0x00000236:   DW_TAG_base_type
                DW_AT_name	("unsigned short")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x02)

0x0000023d:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00a5 "unsigned char")
                DW_AT_name	("bool")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(44)

0x00000248:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x009a "u8")

0x0000024d:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x006a "char")

0x00000252:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0257 "subroutine ")

0x00000257:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x00000258:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x009a "u8")

0x0000025d:     NULL

0x0000025e:   DW_TAG_variable
                DW_AT_name	("sdp_pnp_service_data")
                DW_AT_type	(cu + 0x0270 "const u8[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(2660)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000270:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0095 "const u8")

0x00000275:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0071 "sizetype")
                  DW_AT_count	(0x39)

0x0000027b:     NULL

0x0000027c:   DW_TAG_variable
                DW_AT_name	("sdp_pnp_service_data_for_hid")
                DW_AT_type	(cu + 0x028e "const u8[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(2667)
                DW_AT_location	(DW_OP_addr 0x0)

0x0000028e:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0095 "const u8")

0x00000293:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0071 "sizetype")
                  DW_AT_count	(0x5f)

0x00000299:     NULL

0x0000029a:   DW_TAG_variable
                DW_AT_name	("sdp_pnp_service_data2")
                DW_AT_type	(cu + 0x02ac "const u8[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(2676)
                DW_AT_location	(DW_OP_addr 0x0)

0x000002ac:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0095 "const u8")

0x000002b1:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0071 "sizetype")
                  DW_AT_count	(0x48)

0x000002b7:     NULL

0x000002b8:   DW_TAG_variable
                DW_AT_name	("sdp_a2dp_service_data")
                DW_AT_type	(cu + 0x02ca "const u8[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(2683)
                DW_AT_location	(DW_OP_addr 0x0)

0x000002ca:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0095 "const u8")

0x000002cf:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0071 "sizetype")
                  DW_AT_count	(0x4f)

0x000002d5:     NULL

0x000002d6:   DW_TAG_variable
                DW_AT_name	("sdp_avctp_ct_service_data")
                DW_AT_type	(cu + 0x02e8 "const u8[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(2690)
                DW_AT_location	(DW_OP_addr 0x0)

0x000002e8:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0095 "const u8")

0x000002ed:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0071 "sizetype")
                  DW_AT_count	(0x46)

0x000002f3:     NULL

0x000002f4:   DW_TAG_variable
                DW_AT_name	("sdp_avctp_ta_service_data")
                DW_AT_type	(cu + 0x0306 "const u8[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(2697)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000306:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0095 "const u8")

0x0000030b:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0071 "sizetype")
                  DW_AT_count	(0x43)

0x00000311:     NULL

0x00000312:   DW_TAG_variable
                DW_AT_name	("sdp_hfp_service_data")
                DW_AT_type	(cu + 0x0324 "const u8[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(2704)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000324:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0095 "const u8")

0x00000329:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0071 "sizetype")
                  DW_AT_count	(0x4d)

0x0000032f:     NULL

0x00000330:   DW_TAG_variable
                DW_AT_name	("sdp_spp_service_data")
                DW_AT_type	(cu + 0x0342 "const u8[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(2711)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000342:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0095 "const u8")

0x00000347:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0071 "sizetype")
                  DW_AT_count	(0x44)

0x0000034d:     NULL

0x0000034e:   DW_TAG_variable
                DW_AT_name	("sdp_spp_update_service_data")
                DW_AT_type	(cu + 0x02e8 "const u8[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(2718)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000360:   DW_TAG_variable
                DW_AT_name	("sdp_dueros_ota_service_data")
                DW_AT_type	(cu + 0x0372 "const u8[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(2725)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000372:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0095 "const u8")

0x00000377:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0071 "sizetype")
                  DW_AT_count	(0x60)

0x0000037d:     NULL

0x0000037e:   DW_TAG_variable
                DW_AT_name	("sdp_dueros_spp_service_data")
                DW_AT_type	(cu + 0x0372 "const u8[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(2733)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000390:   DW_TAG_variable
                DW_AT_name	("sdp_tme_service_data")
                DW_AT_type	(cu + 0x0372 "const u8[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(2741)
                DW_AT_location	(DW_OP_addr 0x0)

0x000003a2:   DW_TAG_variable
                DW_AT_name	("sdp_weixin_spp_service_data")
                DW_AT_type	(cu + 0x0372 "const u8[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(2749)
                DW_AT_location	(DW_OP_addr 0x0)

0x000003b4:   DW_TAG_variable
                DW_AT_name	("sdp_gma_spp_service_data")
                DW_AT_type	(cu + 0x0372 "const u8[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(2758)
                DW_AT_location	(DW_OP_addr 0x0)

0x000003c6:   DW_TAG_variable
                DW_AT_name	("sdp_ama_spp_service_data")
                DW_AT_type	(cu + 0x03d8 "const u8[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(2767)
                DW_AT_location	(DW_OP_addr 0x0)

0x000003d8:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0095 "const u8")

0x000003dd:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0071 "sizetype")
                  DW_AT_count	(0x70)

0x000003e3:     NULL

0x000003e4:   DW_TAG_variable
                DW_AT_name	("sdp_hid_service_data")
                DW_AT_type	(cu + 0x03f6 "const u8[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(2777)
                DW_AT_location	(DW_OP_addr 0x0)

0x000003f6:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0095 "const u8")

0x000003fb:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0071 "sizetype")
                  DW_AT_count	(0x010f)

0x00000402:     NULL

0x00000403:   DW_TAG_variable
                DW_AT_name	("sdp_pbap_service_data")
                DW_AT_type	(cu + 0x0415 "const u8[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(2797)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000415:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0095 "const u8")

0x0000041a:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0071 "sizetype")
                  DW_AT_count	(0x36)

0x00000420:     NULL

0x00000421:   DW_TAG_variable
                DW_AT_name	("sdp_a2dp_source_service_data")
                DW_AT_type	(cu + 0x0433 "const u8[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(2804)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000433:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0095 "const u8")

0x00000438:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0071 "sizetype")
                  DW_AT_count	(0x52)

0x0000043e:     NULL

0x0000043f:   DW_TAG_variable
                DW_AT_name	("sdp_hfp_ag_service_data")
                DW_AT_type	(cu + 0x0451 "const u8[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(2813)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000451:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0095 "const u8")

0x00000456:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0071 "sizetype")
                  DW_AT_count	(0x54)

0x0000045c:     NULL

0x0000045d:   DW_TAG_variable
                DW_AT_name	("sdp_iap_service_data")
                DW_AT_type	(cu + 0x046f "const u8[]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(2821)
                DW_AT_location	(DW_OP_addr 0x0)

0x0000046f:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0095 "const u8")

0x00000474:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0071 "sizetype")
                  DW_AT_count	(0x45)

0x0000047a:     NULL

0x0000047b:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/sdp_util.h")
                DW_AT_decl_line	(57)

0x0000047f:     DW_TAG_enumerator
                  DW_AT_name	("DE_SIZE_8")
                  DW_AT_const_value	(0)

0x00000485:     DW_TAG_enumerator
                  DW_AT_name	("DE_SIZE_16")
                  DW_AT_const_value	(1)

0x0000048b:     DW_TAG_enumerator
                  DW_AT_name	("DE_SIZE_32")
                  DW_AT_const_value	(2)

0x00000491:     DW_TAG_enumerator
                  DW_AT_name	("DE_SIZE_64")
                  DW_AT_const_value	(3)

0x00000497:     DW_TAG_enumerator
                  DW_AT_name	("DE_SIZE_128")
                  DW_AT_const_value	(4)

0x0000049d:     DW_TAG_enumerator
                  DW_AT_name	("DE_SIZE_VAR_8")
                  DW_AT_const_value	(5)

0x000004a3:     DW_TAG_enumerator
                  DW_AT_name	("DE_SIZE_VAR_16")
                  DW_AT_const_value	(6)

0x000004a9:     DW_TAG_enumerator
                  DW_AT_name	("DE_SIZE_VAR_32")
                  DW_AT_const_value	(7)

0x000004af:     NULL

0x000004b0:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/sdp_util.h")
                DW_AT_decl_line	(45)

0x000004b4:     DW_TAG_enumerator
                  DW_AT_name	("DE_NIL")
                  DW_AT_const_value	(0)

0x000004ba:     DW_TAG_enumerator
                  DW_AT_name	("DE_UINT")
                  DW_AT_const_value	(1)

0x000004c0:     DW_TAG_enumerator
                  DW_AT_name	("DE_INT")
                  DW_AT_const_value	(2)

0x000004c6:     DW_TAG_enumerator
                  DW_AT_name	("DE_UUID")
                  DW_AT_const_value	(3)

0x000004cc:     DW_TAG_enumerator
                  DW_AT_name	("DE_STRING")
                  DW_AT_const_value	(4)

0x000004d2:     DW_TAG_enumerator
                  DW_AT_name	("DE_BOOL")
                  DW_AT_const_value	(5)

0x000004d8:     DW_TAG_enumerator
                  DW_AT_name	("DE_DES")
                  DW_AT_const_value	(6)

0x000004de:     DW_TAG_enumerator
                  DW_AT_name	("DE_DEA")
                  DW_AT_const_value	(7)

0x000004e4:     DW_TAG_enumerator
                  DW_AT_name	("DE_URL")
                  DW_AT_const_value	(8)

0x000004ea:     NULL

0x000004eb:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h")
                DW_AT_decl_line	(631)

0x000004f0:     DW_TAG_enumerator
                  DW_AT_name	("REMOTE_DEV_UNKNOWN")
                  DW_AT_const_value	(0)

0x000004f6:     DW_TAG_enumerator
                  DW_AT_name	("REMOTE_DEV_ANDROID")
                  DW_AT_const_value	(1)

0x000004fc:     DW_TAG_enumerator
                  DW_AT_name	("REMOTE_DEV_IOS")
                  DW_AT_const_value	(2)

0x00000502:     DW_TAG_enumerator
                  DW_AT_name	("REMOTE_DEV_XIAOMI")
                  DW_AT_const_value	(3)

0x00000508:     NULL

0x00000509:   DW_TAG_typedef
                DW_AT_type	(cu + 0x047b "enumeration ")
                DW_AT_name	("de_size_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/sdp_util.h")
                DW_AT_decl_line	(66)

0x00000514:   DW_TAG_typedef
                DW_AT_type	(cu + 0x04b0 "enumeration ")
                DW_AT_name	("de_type_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/bredr/sdp_util.h")
                DW_AT_decl_line	(55)

0x0000051f:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0236 "unsigned short")
                DW_AT_name	("uint16_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(46)

0x0000052a:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0535 "unsigned int")
                DW_AT_name	("uint32_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(48)

0x00000535:   DW_TAG_base_type
                DW_AT_name	("unsigned int")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x04)

0x0000053c:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0541 "sdp_context_match_pattern")

0x00000541:   DW_TAG_structure_type
                DW_AT_name	("sdp_context_match_pattern")
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(872)

0x0000054a:     DW_TAG_member
                  DW_AT_name	("record")
                  DW_AT_type	(cu + 0x0248 "u8*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                  DW_AT_decl_line	(873)
                  DW_AT_data_member_location	(0x00)

0x00000557:     DW_TAG_member
                  DW_AT_name	("result")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                  DW_AT_decl_line	(874)
                  DW_AT_data_member_location	(0x04)

0x00000564:     NULL

0x00000565:   DW_TAG_pointer_type

0x00000566:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x056b "sdp_context_attributeID_search")

0x0000056b:   DW_TAG_structure_type
                DW_AT_name	("sdp_context_attributeID_search")
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(336)

0x00000574:     DW_TAG_member
                  DW_AT_name	("result")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                  DW_AT_decl_line	(337)
                  DW_AT_data_member_location	(0x00)

0x00000581:     DW_TAG_member
                  DW_AT_name	("attributeID")
                  DW_AT_type	(cu + 0x022b "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                  DW_AT_decl_line	(338)
                  DW_AT_data_member_location	(0x04)

0x0000058e:     NULL

0x0000058f:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0594 "sdp_context_append_attributes")

0x00000594:   DW_TAG_structure_type
                DW_AT_name	("sdp_context_append_attributes")
                DW_AT_byte_size	(0x10)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(376)

0x0000059d:     DW_TAG_member
                  DW_AT_name	("buffer")
                  DW_AT_type	(cu + 0x0248 "u8*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                  DW_AT_decl_line	(377)
                  DW_AT_data_member_location	(0x00)

0x000005aa:     DW_TAG_member
                  DW_AT_name	("startOffset")
                  DW_AT_type	(cu + 0x022b "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                  DW_AT_decl_line	(378)
                  DW_AT_data_member_location	(0x04)

0x000005b7:     DW_TAG_member
                  DW_AT_name	("maxBytes")
                  DW_AT_type	(cu + 0x022b "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                  DW_AT_decl_line	(379)
                  DW_AT_data_member_location	(0x06)

0x000005c4:     DW_TAG_member
                  DW_AT_name	("usedBytes")
                  DW_AT_type	(cu + 0x022b "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                  DW_AT_decl_line	(380)
                  DW_AT_data_member_location	(0x08)

0x000005d1:     DW_TAG_member
                  DW_AT_name	("attributeIDList")
                  DW_AT_type	(cu + 0x0248 "u8*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                  DW_AT_decl_line	(381)
                  DW_AT_data_member_location	(0x0c)

0x000005de:     NULL

0x000005df:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x05e4 "sdp_context_filter_attributes")

0x000005e4:   DW_TAG_structure_type
                DW_AT_name	("sdp_context_filter_attributes")
                DW_AT_byte_size	(0x14)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(659)

0x000005ed:     DW_TAG_member
                  DW_AT_name	("buffer")
                  DW_AT_type	(cu + 0x0248 "u8*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                  DW_AT_decl_line	(660)
                  DW_AT_data_member_location	(0x00)

0x000005fa:     DW_TAG_member
                  DW_AT_name	("startOffset")
                  DW_AT_type	(cu + 0x022b "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                  DW_AT_decl_line	(661)
                  DW_AT_data_member_location	(0x04)

0x00000607:     DW_TAG_member
                  DW_AT_name	("maxBytes")
                  DW_AT_type	(cu + 0x022b "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                  DW_AT_decl_line	(662)
                  DW_AT_data_member_location	(0x06)

0x00000614:     DW_TAG_member
                  DW_AT_name	("usedBytes")
                  DW_AT_type	(cu + 0x022b "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                  DW_AT_decl_line	(663)
                  DW_AT_data_member_location	(0x08)

0x00000621:     DW_TAG_member
                  DW_AT_name	("attributeIDList")
                  DW_AT_type	(cu + 0x0248 "u8*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                  DW_AT_decl_line	(664)
                  DW_AT_data_member_location	(0x0c)

0x0000062e:     DW_TAG_member
                  DW_AT_name	("complete")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                  DW_AT_decl_line	(665)
                  DW_AT_data_member_location	(0x10)

0x0000063b:     NULL

0x0000063c:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0641 "sdp_context_get_filtered_size")

0x00000641:   DW_TAG_structure_type
                DW_AT_name	("sdp_context_get_filtered_size")
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(750)

0x0000064a:     DW_TAG_member
                  DW_AT_name	("attributeIDList")
                  DW_AT_type	(cu + 0x0248 "u8*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                  DW_AT_decl_line	(751)
                  DW_AT_data_member_location	(0x00)

0x00000657:     DW_TAG_member
                  DW_AT_name	("size")
                  DW_AT_type	(cu + 0x022b "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                  DW_AT_decl_line	(752)
                  DW_AT_data_member_location	(0x04)

0x00000664:     NULL

0x00000665:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x066a "sdp_context_attribute_by_id")

0x0000066a:   DW_TAG_structure_type
                DW_AT_name	("sdp_context_attribute_by_id")
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(775)

0x00000673:     DW_TAG_member
                  DW_AT_name	("attributeID")
                  DW_AT_type	(cu + 0x022b "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                  DW_AT_decl_line	(776)
                  DW_AT_data_member_location	(0x00)

0x00000680:     DW_TAG_member
                  DW_AT_name	("attributeValue")
                  DW_AT_type	(cu + 0x0248 "u8*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                  DW_AT_decl_line	(777)
                  DW_AT_data_member_location	(0x04)

0x0000068d:     NULL

0x0000068e:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0693 "sdp_context_set_attribute_for_id")

0x00000693:   DW_TAG_structure_type
                DW_AT_name	("sdp_context_set_attribute_for_id")
                DW_AT_byte_size	(0x0c)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(799)

0x0000069c:     DW_TAG_member
                  DW_AT_name	("attributeID")
                  DW_AT_type	(cu + 0x022b "u16")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                  DW_AT_decl_line	(800)
                  DW_AT_data_member_location	(0x00)

0x000006a9:     DW_TAG_member
                  DW_AT_name	("attributeValue")
                  DW_AT_type	(cu + 0x06c4 "u32")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                  DW_AT_decl_line	(801)
                  DW_AT_data_member_location	(0x04)

0x000006b6:     DW_TAG_member
                  DW_AT_name	("attributeFound")
                  DW_AT_type	(cu + 0x009a "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                  DW_AT_decl_line	(802)
                  DW_AT_data_member_location	(0x08)

0x000006c3:     NULL

0x000006c4:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0535 "unsigned int")
                DW_AT_name	("u32")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(48)

0x000006cf:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x06d4 "sdp_context_contains_uuid128")

0x000006d4:   DW_TAG_structure_type
                DW_AT_name	("sdp_context_contains_uuid128")
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(842)

0x000006dd:     DW_TAG_member
                  DW_AT_name	("uuid128")
                  DW_AT_type	(cu + 0x0248 "u8*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                  DW_AT_decl_line	(843)
                  DW_AT_data_member_location	(0x00)

0x000006ea:     DW_TAG_member
                  DW_AT_name	("result")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                  DW_AT_decl_line	(844)
                  DW_AT_data_member_location	(0x04)

0x000006f7:     NULL

0x000006f8:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0037 "int")

0x000006fd:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000000)
                DW_AT_high_pc	(0x0000000000000047)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_abstract_origin	(cu + 0x0898 "sdp_normalize_uuid")

0x0000070c:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000000
                     0x0000000000000000 - 0x0000000000000042: DW_OP_reg1 ECX)
                  DW_AT_abstract_origin	(cu + 0x08a0 "uuid")

0x00000715:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000013
                     0x0000000000000000 - 0x0000000000000042: DW_OP_reg0 EAX)
                  DW_AT_abstract_origin	(cu + 0x08ab "shortUUID")

0x0000071e:     NULL

0x0000071f:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000047)
                DW_AT_high_pc	(0x0000000000000057)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_abstract_origin	(cu + 0x0751 "de_get_size_type")

0x0000072e:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000026
                     0x0000000000000047 - 0x0000000000000055: DW_OP_reg0 EAX)
                  DW_AT_abstract_origin	(cu + 0x075d "header")

0x00000737:     NULL

0x00000738:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000057)
                DW_AT_high_pc	(0x0000000000000065)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_abstract_origin	(cu + 0x079c "de_get_element_type")

0x00000747:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000039
                     0x0000000000000057 - 0x0000000000000060: DW_OP_reg0 EAX)
                  DW_AT_abstract_origin	(cu + 0x07a8 "header")

0x00000750:     NULL

0x00000751:   DW_TAG_subprogram
                DW_AT_name	("de_get_size_type")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                DW_AT_decl_line	(86)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0509 "de_size_t")
                DW_AT_external	(true)
                DW_AT_inline	(DW_INL_inlined)

0x0000075d:     DW_TAG_formal_parameter
                  DW_AT_name	("header")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                  DW_AT_decl_line	(86)
                  DW_AT_type	(cu + 0x0248 "u8*")

0x00000768:     NULL

0x00000769:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000065)
                DW_AT_high_pc	(0x00000000000000a7)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_abstract_origin	(cu + 0x0822 "de_get_header_size")

0x00000778:     DW_TAG_formal_parameter
                  DW_AT_location	(0x0000004c
                     0x0000000000000065 - 0x000000000000008c: DW_OP_reg0 EAX)
                  DW_AT_abstract_origin	(cu + 0x082e "header")

0x00000781:     DW_TAG_variable
                  DW_AT_abstract_origin	(cu + 0x0839 "de_size")

0x00000786:     DW_TAG_inlined_subroutine
                  DW_AT_abstract_origin	(cu + 0x0751 "de_get_size_type")
                  DW_AT_ranges	(0x00000000
                     [0x00000073 - 0x00000078)
                     [0x0000008c - 0x00000092))
                  DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c")
                  DW_AT_call_line	(98)

0x00000791:       DW_TAG_formal_parameter
                    DW_AT_location	(0x0000005f
                       0x0000000000000073 - 0x000000000000008c: DW_OP_reg0 EAX)
                    DW_AT_abstract_origin	(cu + 0x075d "header")

0x0000079a:       NULL

0x0000079b:     NULL

