temp.o:	file format ELF32-i386

.debug_info contents:
0x00000000: Compile Unit: length = 0x00000806 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x0000080a)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)")
              DW_AT_language	(DW_LANG_C99)
              DW_AT_name	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_master.c")
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
              DW_AT_GNU_pubnames	(true)
              DW_AT_low_pc	(0x0000000000000000)
              DW_AT_ranges	(0x00000000
                 [0x00000000 - 0x000000a8)
                 [0x000000a8 - 0x00001d2e)
                 [0x00000000 - 0x00000009))

0x00000026:   DW_TAG_variable
                DW_AT_name	("app_info_debug_enable")
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/profile_stack_debug.h")
                DW_AT_decl_line	(190)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000037:   DW_TAG_base_type

                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_master.c")
                  DW_AT_decl_line	(124)
                  DW_AT_type	(cu + 0x07fc "u8[]")

0x00000681:     DW_TAG_variable
                  DW_AT_location	(0x00000247
                     0x0000000000001892 - 0x00000000000019b0: DW_OP_consts +0, DW_OP_stack_value
                     0x00000000000019b0 - 0x00000000000019d0: DW_OP_reg0 EAX
                     0x00000000000019d0 - 0x0000000000001b68: DW_OP_breg5 EBP-308
                     0x0000000000001b68 - 0x0000000000001b76: DW_OP_reg0 EAX)
                  DW_AT_name	("len")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_master.c")
                  DW_AT_decl_line	(125)
                  DW_AT_type	(cu + 0x0037 "int")

0x00000690:     DW_TAG_variable
                  DW_AT_location	(0x0000027f
                     0x0000000000001892 - 0x0000000000001cfa: DW_OP_constu 0x0, DW_OP_stack_value
                     0x0000000000001cfa - 0x0000000000001d1d: DW_OP_reg2 EDX)
                  DW_AT_name	("sdp_response_size")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_master.c")
                  DW_AT_decl_line	(126)
                  DW_AT_type	(cu + 0x00b3 "u16")

0x0000069f:     DW_TAG_variable
                  DW_AT_location	(0x0000029f
                     0x0000000000001892 - 0x00000000000019b6: DW_OP_constu 0x0, DW_OP_stack_value
                     0x00000000000019b6 - 0x00000000000019c1: DW_OP_reg1 ECX
                     0x0000000000001c7c - 0x0000000000001cbb: DW_OP_reg2 EDX
                     0x0000000000001cbb - 0x0000000000001d2e: DW_OP_breg5 EBP-398)
                  DW_AT_name	("parameterlength")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_master.c")
                  DW_AT_decl_line	(127)
                  DW_AT_type	(cu + 0x00b3 "u16")

0x000006ae:     DW_TAG_variable
                  DW_AT_location	(0x000002d7
                     0x0000000000001898 - 0x00000000000018ca: DW_OP_reg7 EDI
                     0x00000000000018ca - 0x0000000000001d2e: DW_OP_breg5 EBP-284)
                  DW_AT_name	("pservicesearchpattern")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_master.c")
                  DW_AT_decl_line	(129)
                  DW_AT_type	(cu + 0x009c "u8*")

0x000006bd:     DW_TAG_variable
                  DW_AT_location	(0x000002f7
                     0x00000000000019ee - 0x00000000000019fe: DW_OP_reg7 EDI
                     0x00000000000019fe - 0x0000000000001d2e: DW_OP_breg5 EBP-316)
                  DW_AT_name	("attribute")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_master.c")
                  DW_AT_decl_line	(128)
                  DW_AT_type	(cu + 0x009c "u8*")

0x000006cc:     DW_TAG_lexical_block
                  DW_AT_low_pc	(0x0000000000001b90)
                  DW_AT_high_pc	(0x0000000000001c34)

0x000006d5:       DW_TAG_variable
                    DW_AT_location	(0x00000317
                       0x0000000000001b85 - 0x0000000000001bab: DW_OP_consts +0, DW_OP_stack_value
                       0x0000000000001bab - 0x0000000000001c0d: DW_OP_consts +1, DW_OP_stack_value
                       0x0000000000001c0d - 0x0000000000001c29: DW_OP_reg1 ECX
                       0x0000000000001c29 - 0x0000000000001d2e: DW_OP_breg5 EBP-384)
                    DW_AT_name	("i")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_master.c")
                    DW_AT_decl_line	(177)
                    DW_AT_type	(cu + 0x0037 "int")

0x000006e4:       NULL

0x000006e5:     DW_TAG_inlined_subroutine
                  DW_AT_abstract_origin	(cu + 0x0630 "sdp_get_transaction_id")
                  DW_AT_low_pc	(0x0000000000001c85)
                  DW_AT_high_pc	(0x0000000000001c9c)
                  DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_master.c")
                  DW_AT_call_line	(187)

0x000006f4:     NULL

0x000006f5:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0700 "unsigned int")
                DW_AT_name	("u32")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(48)

0x00000700:   DW_TAG_base_type
                DW_AT_name	("unsigned int")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x04)

0x00000707:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0713 "structure ")
                DW_AT_name	("hfp_ioctrl_str")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hfp_profile.h")
                DW_AT_decl_line	(315)

0x00000713:   DW_TAG_structure_type
                DW_AT_byte_size	(0x30)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hfp_profile.h")
                DW_AT_decl_line	(305)

0x00000718:     DW_TAG_member
                  DW_AT_name	("addr")
                  DW_AT_type	(cu + 0x04c5 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hfp_profile.h")
                  DW_AT_decl_line	(306)
                  DW_AT_data_member_location	(0x00)

0x00000725:     DW_TAG_member
                  DW_AT_name	("type")
                  DW_AT_type	(cu + 0x0783 "HFP_PHONE_CTL_TYPE")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hfp_profile.h")
                  DW_AT_decl_line	(307)
                  DW_AT_data_member_location	(0x08)

0x00000732:     DW_TAG_member
                  DW_AT_name	("value")
                  DW_AT_type	(cu + 0x0060 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hfp_profile.h")
                  DW_AT_decl_line	(308)
                  DW_AT_data_member_location	(0x0c)

0x0000073f:     DW_TAG_member
                  DW_AT_type	(cu + 0x0748 "union ")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hfp_profile.h")
                  DW_AT_decl_line	(309)
                  DW_AT_data_member_location	(0x10)

0x00000748:     DW_TAG_union_type
                  DW_AT_byte_size	(0x20)
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hfp_profile.h")
                  DW_AT_decl_line	(309)

0x0000074d:       DW_TAG_member
                    DW_AT_name	("gain_mode")
                    DW_AT_type	(cu + 0x078e "HFP_GAIN_CTL_MODE")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hfp_profile.h")
                    DW_AT_decl_line	(310)
                    DW_AT_data_member_location	(0x00)

0x0000075a:       DW_TAG_member
                    DW_AT_name	("three_way_ctrl")
                    DW_AT_type	(cu + 0x0799 "HFP_THREE_WAY_CALL_FLAG")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hfp_profile.h")
                    DW_AT_decl_line	(311)
                    DW_AT_data_member_location	(0x00)

0x00000767:       DW_TAG_member
                    DW_AT_name	("phone_num")
                    DW_AT_type	(cu + 0x07a4 "u8[]")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hfp_profile.h")
                    DW_AT_decl_line	(312)
                    DW_AT_data_member_location	(0x00)

0x00000774:       DW_TAG_member
                    DW_AT_name	("data_ptr")
                    DW_AT_type	(cu + 0x009c "u8*")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hfp_profile.h")
                    DW_AT_decl_line	(313)
                    DW_AT_data_member_location	(0x00)

0x00000781:       NULL

0x00000782:     NULL

0x00000783:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00f4 "enumeration ")
                DW_AT_name	("HFP_PHONE_CTL_TYPE")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hfp_profile.h")
                DW_AT_decl_line	(170)

0x0000078e:   DW_TAG_typedef
                DW_AT_type	(cu + 0x019c "enumeration ")
                DW_AT_name	("HFP_GAIN_CTL_MODE")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hfp_profile.h")
                DW_AT_decl_line	(129)

0x00000799:   DW_TAG_typedef
                DW_AT_type	(cu + 0x01b9 "enumeration ")
                DW_AT_name	("HFP_THREE_WAY_CALL_FLAG")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/hfp_profile.h")
                DW_AT_decl_line	(140)

0x000007a4:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0060 "u8")

0x000007a9:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0072 "sizetype")
                  DW_AT_count	(0x1e)

0x000007af:     NULL

0x000007b0:   DW_TAG_typedef
                DW_AT_type	(cu + 0x07bb "structure ")
                DW_AT_name	("spp_ioctrl_str")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/spp_profile.h")
                DW_AT_decl_line	(38)

0x000007bb:   DW_TAG_structure_type
                DW_AT_byte_size	(0x14)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/spp_profile.h")
                DW_AT_decl_line	(32)

0x000007bf:     DW_TAG_member
                  DW_AT_name	("addr")
                  DW_AT_type	(cu + 0x04c5 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/spp_profile.h")
                  DW_AT_decl_line	(33)
                  DW_AT_data_member_location	(0x00)

0x000007cb:     DW_TAG_member
                  DW_AT_name	("rfcomm_service_cid")
                  DW_AT_type	(cu + 0x0060 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/spp_profile.h")
                  DW_AT_decl_line	(34)
                  DW_AT_data_member_location	(0x06)

0x000007d7:     DW_TAG_member
                  DW_AT_name	("type")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/spp_profile.h")
                  DW_AT_decl_line	(35)
                  DW_AT_data_member_location	(0x08)

0x000007e3:     DW_TAG_member
                  DW_AT_name	("data_len")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/spp_profile.h")
                  DW_AT_decl_line	(36)
                  DW_AT_data_member_location	(0x0c)

0x000007ef:     DW_TAG_member
                  DW_AT_name	("data_ptr")
                  DW_AT_type	(cu + 0x009c "u8*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/spp_profile.h")
                  DW_AT_decl_line	(37)
                  DW_AT_data_member_location	(0x10)

0x000007fb:     NULL

0x000007fc:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0060 "u8")

0x00000801:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0072 "sizetype")
                  DW_AT_count	(0x0100)

0x00000808:     NULL

0x00000809:   NULL
