; ModuleID = 'sdp_util.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct._stack_config = type <{ i32, i16, i16, i16, i16, i16, i8, i8, i8, i32, i8, i8, i8, i8, [6 x i8], i8 }>
%struct.__hid_sdp_info = type { i16, i16, i16, i8, i8, i8, i8, i8, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, i16, i8*, i8*, i8*, i8*, void (i8)*, i8*, i8 }
%struct.sdp_context_attributeID_search = type { i32, i16 }
%struct.sdp_context_append_attributes = type { i8*, i16, i16, i16, i8* }
%struct.sdp_context_filter_attributes = type { i8*, i16, i16, i16, i8*, i32 }
%struct.sdp_context_get_filtered_size = type { i8*, i16 }
%struct.sdp_context_attribute_by_id = type { i16, i8* }
%struct.sdp_context_set_attribute_for_id = type { i16, i32, i8 }
%struct.sdp_context_contains_uuid128 = type { i8*, i32 }
%struct.sdp_context_match_pattern = type { i8*, i32 }

@app_info_debug_enable = weak hidden local_unnamed_addr global i32 0, align 4, !dbg !0
@.str = private unnamed_addr constant [4 x i8] c"NIL\00", align 1
@.str.1 = private unnamed_addr constant [5 x i8] c"UINT\00", align 1
@.str.2 = private unnamed_addr constant [4 x i8] c"INT\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"UUID\00", align 1
@.str.4 = private unnamed_addr constant [7 x i8] c"STRING\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "app_info_debug_enable", scope: !2, file: !236, line: 190, type: !50, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !34, globals: !98)
!3 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BR_EDR/sdp_util.c", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!4 = !{!5, !16, !27}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 57, size: 32, elements: !7)
!6 = !DIFile(filename: "../btstack/Protocol/include/bredr/sdp_util.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15}
!8 = !DIEnumerator(name: "DE_SIZE_8", value: 0)
!9 = !DIEnumerator(name: "DE_SIZE_16", value: 1)
!10 = !DIEnumerator(name: "DE_SIZE_32", value: 2)
!11 = !DIEnumerator(name: "DE_SIZE_64", value: 3)
!12 = !DIEnumerator(name: "DE_SIZE_128", value: 4)
!13 = !DIEnumerator(name: "DE_SIZE_VAR_8", value: 5)
!14 = !DIEnumerator(name: "DE_SIZE_VAR_16", value: 6)
!15 = !DIEnumerator(name: "DE_SIZE_VAR_32", value: 7)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 45, size: 32, elements: !17)
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26}
!18 = !DIEnumerator(name: "DE_NIL", value: 0)
!19 = !DIEnumerator(name: "DE_UINT", value: 1)
!20 = !DIEnumerator(name: "DE_INT", value: 2)
!21 = !DIEnumerator(name: "DE_UUID", value: 3)
!22 = !DIEnumerator(name: "DE_STRING", value: 4)
!23 = !DIEnumerator(name: "DE_BOOL", value: 5)
!24 = !DIEnumerator(name: "DE_DES", value: 6)
!25 = !DIEnumerator(name: "DE_DEA", value: 7)
!26 = !DIEnumerator(name: "DE_URL", value: 8)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 631, size: 32, elements: !29)
!28 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/avctp_user.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!29 = !{!30, !31, !32, !33}
!30 = !DIEnumerator(name: "REMOTE_DEV_UNKNOWN", value: 0)
!31 = !DIEnumerator(name: "REMOTE_DEV_ANDROID", value: 1)
!32 = !DIEnumerator(name: "REMOTE_DEV_IOS", value: 2)
!33 = !DIEnumerator(name: "REMOTE_DEV_XIAOMI", value: 3)
!34 = !{!35, !36, !37, !40, !42, !51, !46, !52, !58, !66, !75, !80, !85, !92, !97}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "de_size_t", file: !6, line: 66, baseType: !5)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "de_type_t", file: !6, line: 55, baseType: !16)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !38, line: 46, baseType: !39)
!38 = !DIFile(filename: "../btcommon/typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!39 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !38, line: 48, baseType: !41)
!41 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 32)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdp_context_match_pattern", file: !3, line: 872, size: 64, elements: !44)
!44 = !{!45, !49}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "record", scope: !43, file: !3, line: 873, baseType: !46, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !38, line: 44, baseType: !48)
!48 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !43, file: !3, line: 874, baseType: !50, size: 32, offset: 32)
!50 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 32)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdp_context_attributeID_search", file: !3, line: 336, size: 64, elements: !54)
!54 = !{!55, !56}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !53, file: !3, line: 337, baseType: !50, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "attributeID", scope: !53, file: !3, line: 338, baseType: !57, size: 16, offset: 32)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !38, line: 46, baseType: !39)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 32)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdp_context_append_attributes", file: !3, line: 376, size: 128, elements: !60)
!60 = !{!61, !62, !63, !64, !65}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !59, file: !3, line: 377, baseType: !46, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "startOffset", scope: !59, file: !3, line: 378, baseType: !57, size: 16, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "maxBytes", scope: !59, file: !3, line: 379, baseType: !57, size: 16, offset: 48)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "usedBytes", scope: !59, file: !3, line: 380, baseType: !57, size: 16, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "attributeIDList", scope: !59, file: !3, line: 381, baseType: !46, size: 32, offset: 96)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 32)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdp_context_filter_attributes", file: !3, line: 659, size: 160, elements: !68)
!68 = !{!69, !70, !71, !72, !73, !74}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !67, file: !3, line: 660, baseType: !46, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "startOffset", scope: !67, file: !3, line: 661, baseType: !57, size: 16, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "maxBytes", scope: !67, file: !3, line: 662, baseType: !57, size: 16, offset: 48)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "usedBytes", scope: !67, file: !3, line: 663, baseType: !57, size: 16, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "attributeIDList", scope: !67, file: !3, line: 664, baseType: !46, size: 32, offset: 96)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !67, file: !3, line: 665, baseType: !50, size: 32, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 32)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdp_context_get_filtered_size", file: !3, line: 750, size: 64, elements: !77)
!77 = !{!78, !79}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "attributeIDList", scope: !76, file: !3, line: 751, baseType: !46, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !76, file: !3, line: 752, baseType: !57, size: 16, offset: 32)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 32)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdp_context_attribute_by_id", file: !3, line: 775, size: 64, elements: !82)
!82 = !{!83, !84}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "attributeID", scope: !81, file: !3, line: 776, baseType: !57, size: 16)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "attributeValue", scope: !81, file: !3, line: 777, baseType: !46, size: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 32)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdp_context_set_attribute_for_id", file: !3, line: 799, size: 96, elements: !87)
!87 = !{!88, !89, !91}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "attributeID", scope: !86, file: !3, line: 800, baseType: !57, size: 16)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "attributeValue", scope: !86, file: !3, line: 801, baseType: !90, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !38, line: 48, baseType: !41)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "attributeFound", scope: !86, file: !3, line: 802, baseType: !47, size: 8, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 32)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdp_context_contains_uuid128", file: !3, line: 842, size: 64, elements: !94)
!94 = !{!95, !96}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "uuid128", scope: !93, file: !3, line: 843, baseType: !46, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !93, file: !3, line: 844, baseType: !50, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 32)
!98 = !{!0, !99, !108, !114, !151, !156, !161, !166, !171, !176, !181, !186, !191, !193, !198, !200, !202, !204, !206, !211, !216, !221, !226, !231}
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "sdp_type_names", scope: !2, file: !3, line: 68, type: !101, isLocal: false, isDefinition: true)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 288, elements: !106)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!105 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!106 = !{!107}
!107 = !DISubrange(count: 9)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "sdp_bluetooth_base_uuid", scope: !2, file: !3, line: 71, type: !110, isLocal: false, isDefinition: true)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 128, elements: !112)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!112 = !{!113}
!113 = !DISubrange(count: 16)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "hid_sdp_info", scope: !2, file: !3, line: 1088, type: !116, isLocal: false, isDefinition: true)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "hid_sdp_info_t", file: !28, line: 612, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__hid_sdp_info", file: !28, line: 584, size: 480, elements: !119)
!119 = !{!120, !121, !122, !123, !124, !125, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !143, !144, !145, !149, !150}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "vid_private", scope: !118, file: !28, line: 585, baseType: !57, size: 16)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "pid_private", scope: !118, file: !28, line: 586, baseType: !57, size: 16, offset: 16)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ver_private", scope: !118, file: !28, line: 587, baseType: !57, size: 16, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "sub_class", scope: !118, file: !28, line: 589, baseType: !47, size: 8, offset: 48)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "country_code", scope: !118, file: !28, line: 590, baseType: !47, size: 8, offset: 56)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_cable", scope: !118, file: !28, line: 591, baseType: !126, size: 8, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !38, line: 44, baseType: !48)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_initiate", scope: !118, file: !28, line: 592, baseType: !126, size: 8, offset: 72)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "sdp_disable", scope: !118, file: !28, line: 593, baseType: !126, size: 8, offset: 80)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "battery_power", scope: !118, file: !28, line: 594, baseType: !126, size: 8, offset: 88)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "remote_wake", scope: !118, file: !28, line: 595, baseType: !126, size: 8, offset: 96)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "normally_connectable", scope: !118, file: !28, line: 596, baseType: !126, size: 8, offset: 104)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "boot_device", scope: !118, file: !28, line: 597, baseType: !126, size: 8, offset: 112)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !118, file: !28, line: 598, baseType: !57, size: 16, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "parser_version", scope: !118, file: !28, line: 599, baseType: !57, size: 16, offset: 144)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "profile_version", scope: !118, file: !28, line: 600, baseType: !57, size: 16, offset: 160)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "supervision_timeout", scope: !118, file: !28, line: 601, baseType: !57, size: 16, offset: 176)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !118, file: !28, line: 602, baseType: !57, size: 16, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "bt_string_offset", scope: !118, file: !28, line: 603, baseType: !57, size: 16, offset: 208)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_len", scope: !118, file: !28, line: 604, baseType: !57, size: 16, offset: 224)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor", scope: !118, file: !28, line: 605, baseType: !46, size: 32, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "service_name", scope: !118, file: !28, line: 606, baseType: !142, size: 32, offset: 288)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "service_description", scope: !118, file: !28, line: 607, baseType: !142, size: 32, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "provide_name", scope: !118, file: !28, line: 608, baseType: !142, size: 32, offset: 352)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "sdp_request_respone_callback", scope: !118, file: !28, line: 609, baseType: !146, size: 32, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !47}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "extra_buf", scope: !118, file: !28, line: 610, baseType: !46, size: 32, offset: 416)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "extra_len", scope: !118, file: !28, line: 611, baseType: !47, size: 8, offset: 448)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "sdp_pnp_service_data", scope: !2, file: !3, line: 2660, type: !153, isLocal: false, isDefinition: true)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 456, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 57)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "sdp_pnp_service_data_for_hid", scope: !2, file: !3, line: 2667, type: !158, isLocal: false, isDefinition: true)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 760, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 95)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "sdp_pnp_service_data2", scope: !2, file: !3, line: 2676, type: !163, isLocal: false, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 576, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 72)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "sdp_a2dp_service_data", scope: !2, file: !3, line: 2683, type: !168, isLocal: false, isDefinition: true)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 632, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 79)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "sdp_avctp_ct_service_data", scope: !2, file: !3, line: 2690, type: !173, isLocal: false, isDefinition: true)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 560, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 70)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "sdp_avctp_ta_service_data", scope: !2, file: !3, line: 2697, type: !178, isLocal: false, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 536, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 67)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "sdp_hfp_service_data", scope: !2, file: !3, line: 2704, type: !183, isLocal: false, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 616, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 77)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "sdp_spp_service_data", scope: !2, file: !3, line: 2711, type: !188, isLocal: false, isDefinition: true)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 544, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 68)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "sdp_spp_update_service_data", scope: !2, file: !3, line: 2718, type: !173, isLocal: false, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "sdp_dueros_ota_service_data", scope: !2, file: !3, line: 2725, type: !195, isLocal: false, isDefinition: true)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 768, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 96)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "sdp_dueros_spp_service_data", scope: !2, file: !3, line: 2733, type: !195, isLocal: false, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "sdp_tme_service_data", scope: !2, file: !3, line: 2741, type: !195, isLocal: false, isDefinition: true)
