; ModuleID = 'sm.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.sm_info_t = type { %struct.sm_setup_context, i8, i8, i8, i8, i8, i8, i8, i32, i8, [16 x i8], [16 x i8], [16 x i8], [16 x i8], i8, i32, i32, [6 x i8], i32, i32, i8, [6 x i8], i8*, i32, %struct.btstack_linked_item*, i32, i8*, i8*, %struct.btstack_packet_callback_registration_t, %struct.btstack_packet_callback_registration_t, %struct.btstack_linked_item*, i16, i32 (i8, i8*, i8*)*, void (i32*, i16)*, i16 }
%struct.sm_setup_context = type { %struct.btstack_timer_source, i8, i8, i8, i8, i8, i8, i32, [16 x i8], i8, [16 x i8], [7 x i8], [7 x i8], [16 x i8], [16 x i8], [16 x i8], [16 x i8], i8, i8, [6 x i8], [6 x i8], [16 x i8], i8, i16, i16, i16, [8 x i8], [16 x i8], [16 x i8], [16 x i8], i16, i16, i16, [8 x i8], [16 x i8], [16 x i8], [16 x i8], i8, [6 x i8] }
%struct.btstack_timer_source = type { %struct.btstack_linked_item, i32, i32, void (%struct.btstack_timer_source*)*, i8* }
%struct.btstack_linked_item = type { %struct.btstack_linked_item* }
%struct.btstack_packet_callback_registration_t = type { %struct.btstack_linked_item, void (i8, i16, i8*, i16)* }
%struct.btstack_linked_list_iterator_t = type { i32, %struct.btstack_linked_item*, %struct.btstack_linked_item* }

!226 = !DIEnumerator(name: "BLE_CMD_PERIODIC_ADV_CREAT_SYNC", value: 75)
!227 = !DIEnumerator(name: "BLE_CMD_SEARCH_PROFILE", value: 128)
!228 = !DIEnumerator(name: "BLE_CMD_WRITE_CCC", value: 129)
!229 = !DIEnumerator(name: "BLE_CMD_ONNN_PARAM_UPDATA", value: 130)
!230 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 5393, size: 32, elements: !231)
!231 = !{!232}
!232 = !DIEnumerator(name: "SM_API_REQ_PAIRING", value: 1)
!233 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 1489, size: 32, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240}
!235 = !DIEnumerator(name: "HCI_STATE_OFF", value: 0)
!236 = !DIEnumerator(name: "HCI_STATE_INITIALIZING", value: 1)
!237 = !DIEnumerator(name: "HCI_STATE_WORKING", value: 2)
!238 = !DIEnumerator(name: "HCI_STATE_HALTING", value: 3)
!239 = !DIEnumerator(name: "HCI_STATE_SLEEPING", value: 4)
!240 = !DIEnumerator(name: "HCI_STATE_FALLING_ASLEEP", value: 5)
!241 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !56, line: 246, size: 32, elements: !242)
!242 = !{!243, !244, !245, !246, !247}
!243 = !DIEnumerator(name: "CON_PARAMETER_UPDATE_NONE", value: 0)
!244 = !DIEnumerator(name: "CON_PARAMETER_UPDATE_SEND_REQUEST", value: 1)
!245 = !DIEnumerator(name: "CON_PARAMETER_UPDATE_SEND_RESPONSE", value: 2)
!246 = !DIEnumerator(name: "CON_PARAMETER_UPDATE_CHANGE_HCI_CON_PARAMETERS", value: 3)
!247 = !DIEnumerator(name: "CON_PARAMETER_UPDATE_DENY", value: 4)
!248 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !249, line: 157, size: 32, elements: !250)
!249 = !DIFile(filename: "../btstack/Protocol/include/ble/att_server.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!250 = !{!251, !252, !253, !254}
!251 = !DIEnumerator(name: "ATT_SERVER_IDLE", value: 0)
!252 = !DIEnumerator(name: "ATT_SERVER_REQUEST_RECEIVED", value: 1)
!253 = !DIEnumerator(name: "ATT_SERVER_W4_SIGNED_WRITE_VALIDATION", value: 2)
!254 = !DIEnumerator(name: "ATT_SERVER_REQUEST_RECEIVED_AND_VALIDATED", value: 3)
!255 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 201, size: 32, elements: !256)
!256 = !{!257, !258}
!257 = !DIEnumerator(name: "ADDRESS_RESOLUTION_SUCEEDED", value: 0)
!258 = !DIEnumerator(name: "ADDRESS_RESOLUTION_FAILED", value: 1)
!259 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !260, line: 57, size: 32, elements: !261)
!260 = !DIFile(filename: "../btstack/Protocol/include/ble/sm.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!261 = !{!262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275}
!262 = !DIEnumerator(name: "SM_CODE_PAIRING_REQUEST", value: 1)
!263 = !DIEnumerator(name: "SM_CODE_PAIRING_RESPONSE", value: 2)
!264 = !DIEnumerator(name: "SM_CODE_PAIRING_CONFIRM", value: 3)
!265 = !DIEnumerator(name: "SM_CODE_PAIRING_RANDOM", value: 4)
!266 = !DIEnumerator(name: "SM_CODE_PAIRING_FAILED", value: 5)
!267 = !DIEnumerator(name: "SM_CODE_ENCRYPTION_INFORMATION", value: 6)
!268 = !DIEnumerator(name: "SM_CODE_MASTER_IDENTIFICATION", value: 7)
!269 = !DIEnumerator(name: "SM_CODE_IDENTITY_INFORMATION", value: 8)
!270 = !DIEnumerator(name: "SM_CODE_IDENTITY_ADDRESS_INFORMATION", value: 9)
!271 = !DIEnumerator(name: "SM_CODE_SIGNING_INFORMATION", value: 10)
!272 = !DIEnumerator(name: "SM_CODE_SECURITY_REQUEST", value: 11)
!273 = !DIEnumerator(name: "SM_CODE_PAIRING_PUBLIC_KEY", value: 12)
!274 = !DIEnumerator(name: "SM_CODE_PAIRING_DHKEY_CHECK", value: 13)
!275 = !DIEnumerator(name: "SM_CODE_KEYPRESS_NOTIFICATION", value: 14)
!276 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 525, size: 32, elements: !277)
!277 = !{!278, !279, !280, !281, !282}
!278 = !DIEnumerator(name: "DIS_REASON_TIMOUT", value: 1)
!279 = !DIEnumerator(name: "DIS_REASON_KEY_MISS", value: 2)
!280 = !DIEnumerator(name: "DIS_REASON_REJECT", value: 3)
!281 = !DIEnumerator(name: "DIS_REASON_FAIL_PEER", value: 4)
!282 = !DIEnumerator(name: "DIS_REASON_FAIL_LOACL", value: 5)
!283 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !184, line: 156, size: 32, elements: !284)
!284 = !{!285, !286, !287}
!285 = !DIEnumerator(name: "REMOTE_TYPE_UNKNOWN", value: 0)
!286 = !DIEnumerator(name: "REMOTE_TYPE_ANDROID", value: 1)
!287 = !DIEnumerator(name: "REMOTE_TYPE_IOS", value: 2)
!288 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !184, line: 148, size: 32, elements: !289)
!289 = !{!290, !291, !292, !293}
!290 = !DIEnumerator(name: "HCI_CFG_OWN_ADDRESS_TYPE", value: 0)
!291 = !DIEnumerator(name: "HCI_CFG_ADV_FILTER_POLICY", value: 1)
!292 = !DIEnumerator(name: "HCI_CFG_SCAN_FILTER_POLICY", value: 2)
!293 = !DIEnumerator(name: "HCI_CFG_INITIATOR_FILTER_POLICY", value: 3)
!294 = !{!295, !317, !318, !319, !320, !441, !442, !370, !443, !444, !454, !350, !455}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "sm_lookup_entry_t", file: !260, line: 130, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !260, line: 126, size: 128, elements: !298)
!298 = !{!299, !307, !316}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !297, file: !260, line: 127, baseType: !300, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_item_t", file: !301, line: 100, baseType: !302)
!301 = !DIFile(filename: "../btcommon/btstack_linked_list.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_linked_item_t", file: !301, line: 55, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btstack_linked_item", file: !301, line: 53, size: 32, elements: !304)
!304 = !{!305}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !303, file: !301, line: 54, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !297, file: !260, line: 128, baseType: !308, size: 48, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_addr_t", file: !309, line: 7, baseType: !310)
!309 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 48, elements: !314)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !312, line: 44, baseType: !313)
!312 = !DIFile(filename: "../btcommon/typedef.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!313 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!314 = !{!315}
!315 = !DISubrange(count: 6)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "address_type", scope: !297, file: !260, line: 129, baseType: !317, size: 32, offset: 96)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_addr_type_t", file: !6, line: 1475, baseType: !5)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "le_hci_connection_t", file: !56, line: 605, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__le_hci_connection", file: !56, line: 571, size: 9792, elements: !323)
!323 = !{!324, !325, !326, !330, !331, !332, !334, !335, !336, !337, !338, !339, !372, !431, !435, !436, !437, !438, !439, !440}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !322, file: !56, line: 572, baseType: !300, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !322, file: !56, line: 574, baseType: !308, size: 48, offset: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "con_handle", scope: !322, file: !56, line: 576, baseType: !327, size: 16, offset: 80)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "hci_con_handle_t", file: !309, line: 9, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !312, line: 46, baseType: !329)
!329 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "address_type", scope: !322, file: !56, line: 578, baseType: !317, size: 32, offset: 96)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "role", scope: !322, file: !56, line: 581, baseType: !311, size: 8, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "le_con_parameter_update_state", scope: !322, file: !56, line: 584, baseType: !333, size: 32, offset: 160)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "le_con_parameter_update_state_t", file: !56, line: 252, baseType: !241)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "le_con_param_update_identifier", scope: !322, file: !56, line: 585, baseType: !311, size: 8, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "le_conn_interval_min", scope: !322, file: !56, line: 586, baseType: !328, size: 16, offset: 208)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "le_conn_interval_max", scope: !322, file: !56, line: 587, baseType: !328, size: 16, offset: 224)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "le_conn_latency", scope: !322, file: !56, line: 588, baseType: !328, size: 16, offset: 240)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "le_supervision_timeout", scope: !322, file: !56, line: 589, baseType: !328, size: 16, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "sm_connection", scope: !322, file: !56, line: 592, baseType: !340, size: 448, offset: 288)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "sm_connection_t", file: !56, line: 475, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sm_connection", file: !56, line: 456, size: 448, elements: !342)
!342 = !{!343, !344, !345, !346, !347, !348, !349, !351, !353, !354, !355, !356, !361, !363, !364, !368, !369, !371}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "sm_handle", scope: !341, file: !56, line: 457, baseType: !327, size: 16)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "sm_role", scope: !341, file: !56, line: 458, baseType: !311, size: 8, offset: 16)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "sm_security_request_received", scope: !341, file: !56, line: 459, baseType: !311, size: 8, offset: 24)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "sm_bonding_requested", scope: !341, file: !56, line: 460, baseType: !311, size: 8, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "sm_peer_addr_type", scope: !341, file: !56, line: 461, baseType: !311, size: 8, offset: 40)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "sm_peer_address", scope: !341, file: !56, line: 462, baseType: !308, size: 48, offset: 48)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "sm_engine_state", scope: !341, file: !56, line: 463, baseType: !350, size: 32, offset: 96)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "security_manager_state_t", file: !56, line: 433, baseType: !55)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "sm_irk_lookup_state", scope: !341, file: !56, line: 464, baseType: !352, size: 32, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "irk_lookup_state_t", file: !56, line: 442, baseType: !156)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "sm_connection_encrypted", scope: !341, file: !56, line: 465, baseType: !311, size: 8, offset: 160)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "sm_connection_authenticated", scope: !341, file: !56, line: 466, baseType: !311, size: 8, offset: 168)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "sm_actual_encryption_key_size", scope: !341, file: !56, line: 467, baseType: !311, size: 8, offset: 176)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "sm_m_preq", scope: !341, file: !56, line: 468, baseType: !357, size: 56, offset: 184)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "sm_pairing_packet_t", file: !56, line: 452, baseType: !358)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 56, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 7)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "sm_connection_authorization_state", scope: !341, file: !56, line: 469, baseType: !362, size: 32, offset: 256)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "authorization_state_t", file: !56, line: 450, baseType: !163)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "sm_local_ediv", scope: !341, file: !56, line: 470, baseType: !328, size: 16, offset: 288)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "sm_local_rand", scope: !341, file: !56, line: 471, baseType: !365, size: 64, offset: 304)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 64, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 8)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "sm_disconn_reason", scope: !341, file: !56, line: 472, baseType: !311, size: 8, offset: 368)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "sm_le_db_index", scope: !341, file: !56, line: 473, baseType: !370, size: 32, offset: 384)
!370 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "sm_timeout_id", scope: !341, file: !56, line: 474, baseType: !370, size: 32, offset: 416)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "att_server", scope: !322, file: !56, line: 595, baseType: !373, size: 4640, offset: 736)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_server_t", file: !249, line: 187, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !249, line: 164, size: 4640, elements: !375)
!375 = !{!376, !378, !379, !380, !381, !382, !383, !403, !414, !415, !419, !420, !421, !422, !423, !424}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !374, file: !249, line: 165, baseType: !377, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_server_state_t", file: !249, line: 162, baseType: !248)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "peer_addr_type", scope: !374, file: !249, line: 167, baseType: !311, size: 8, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "peer_address", scope: !374, file: !249, line: 168, baseType: !308, size: 48, offset: 40)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ir_le_device_db_index", scope: !374, file: !249, line: 170, baseType: !370, size: 32, offset: 96)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ir_lookup_active", scope: !374, file: !249, line: 171, baseType: !370, size: 32, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "value_indication_handle", scope: !374, file: !249, line: 173, baseType: !370, size: 32, offset: 160)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "value_indication_timer", scope: !374, file: !249, line: 174, baseType: !384, size: 160, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_timer_source_t", file: !385, line: 19, baseType: !386)
!385 = !DIFile(filename: "../btcommon/btstack_sys_timer.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btstack_timer_source", file: !385, line: 7, size: 160, elements: !387)
!387 = !{!388, !389, !392, !393, !394, !395, !396, !397, !402}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !386, file: !385, line: 8, baseType: !302, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !386, file: !385, line: 10, baseType: !390, size: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !312, line: 48, baseType: !391)
!391 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_interval", scope: !386, file: !385, line: 11, baseType: !390, size: 16, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "timer_type", scope: !386, file: !385, line: 12, baseType: !390, size: 4, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "timer_tick_overflow", scope: !386, file: !385, line: 13, baseType: !390, size: 1, offset: 84, flags: DIFlagBitField, extraData: i64 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "loop_flag", scope: !386, file: !385, line: 14, baseType: !390, size: 1, offset: 85, flags: DIFlagBitField, extraData: i64 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "loop_times", scope: !386, file: !385, line: 15, baseType: !390, size: 10, offset: 86, flags: DIFlagBitField, extraData: i64 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !386, file: !385, line: 17, baseType: !398, size: 32, offset: 96)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 32)
!399 = !DISubroutineType(types: !400)
!400 = !{null, !401}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !386, file: !385, line: 18, baseType: !319, size: 32, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !374, file: !249, line: 176, baseType: !404, size: 80, offset: 352)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "att_connection_t", file: !405, line: 41, baseType: !406)
!405 = !DIFile(filename: "../btstack/Protocol/include/ble/att_db.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "att_connection", file: !405, line: 34, size: 80, elements: !407)
!407 = !{!408, !409, !410, !411, !412, !413}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "con_handle", scope: !406, file: !405, line: 35, baseType: !327, size: 16)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !406, file: !405, line: 36, baseType: !328, size: 16, offset: 16)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "max_mtu", scope: !406, file: !405, line: 37, baseType: !328, size: 16, offset: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "encryption_key_size", scope: !406, file: !405, line: 38, baseType: !311, size: 8, offset: 48)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !406, file: !405, line: 39, baseType: !311, size: 8, offset: 56)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "authorized", scope: !406, file: !405, line: 40, baseType: !311, size: 8, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "request_size", scope: !374, file: !249, line: 178, baseType: !328, size: 16, offset: 432)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "request_buffer", scope: !374, file: !249, line: 179, baseType: !416, size: 4136, offset: 448)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 4136, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 517)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "flow_hold_flag", scope: !374, file: !249, line: 181, baseType: !311, size: 1, offset: 4584, flags: DIFlagBitField, extraData: i64 4584)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "mtu_request_flag", scope: !374, file: !249, line: 182, baseType: !311, size: 1, offset: 4585, flags: DIFlagBitField, extraData: i64 4584)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "check_remote_tag", scope: !374, file: !249, line: 183, baseType: !311, size: 3, offset: 4586, flags: DIFlagBitField, extraData: i64 4584)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "request_busy", scope: !374, file: !249, line: 184, baseType: !311, size: 1, offset: 4589, flags: DIFlagBitField, extraData: i64 4584)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "reserverd", scope: !374, file: !249, line: 185, baseType: !311, size: 2, offset: 4590, flags: DIFlagBitField, extraData: i64 4584)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "result_callback", scope: !374, file: !249, line: 186, baseType: !425, size: 32, offset: 4608)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !428, !430}
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !429, line: 13, baseType: !329)
!429 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !429, line: 11, baseType: !313)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "acl_recombination_buffer", scope: !322, file: !56, line: 597, baseType: !432, size: 4232, offset: 5376)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 4232, elements: !433)
!433 = !{!434}
!434 = !DISubrange(count: 529)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "acl_recombination_pos", scope: !322, file: !56, line: 598, baseType: !328, size: 16, offset: 9616)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "acl_recombination_length", scope: !322, file: !56, line: 599, baseType: !328, size: 16, offset: 9632)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "num_acl_packets_sent", scope: !322, file: !56, line: 600, baseType: !311, size: 8, offset: 9648)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "own_id_address", scope: !322, file: !56, line: 602, baseType: !308, size: 48, offset: 9656)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "own_address", scope: !322, file: !56, line: 603, baseType: !308, size: 48, offset: 9704)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "own_address_type", scope: !322, file: !56, line: 604, baseType: !317, size: 32, offset: 9760)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "derived_key_generation_t", file: !3, line: 151, baseType: !29)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "random_address_update_t", file: !3, line: 161, baseType: !37)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_packet_callback_registration_t", file: !6, line: 64, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 61, size: 64, elements: !447)
!447 = !{!448, !449}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !446, file: !6, line: 62, baseType: !300, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !446, file: !6, line: 63, baseType: !450, size: 32, offset: 32)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_packet_handler_t", file: !6, line: 58, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 32)
!452 = !DISubroutineType(types: !453)
!453 = !{null, !311, !328, !441, !328}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "JL_RAND_TypeDef", file: !457, line: 578, baseType: !458)
!457 = !DIFile(filename: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/bd19.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !457, line: 575, size: 64, elements: !459)
!459 = !{!460, !463}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "R64L", scope: !458, file: !457, line: 576, baseType: !461, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !391)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "R64H", scope: !458, file: !457, line: 577, baseType: !461, size: 32, offset: 32)
!464 = !{!0, !465, !468, !470, !573, !687, !693, !698}
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "gap_random_adress_type", scope: !2, file: !3, line: 666, type: !467, isLocal: true, isDefinition: true)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "gap_random_address_type_t", file: !177, line: 117, baseType: !176)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "gap_random_adress_update_period", scope: !2, file: !3, line: 668, type: !390, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "sm_global_info", scope: !2, file: !3, line: 434, type: !472, isLocal: true, isDefinition: true)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "sm_info_t", file: !3, line: 429, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 318, size: 3840, elements: !475)
!475 = !{!476, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !551, !554, !556, !557, !558, !559, !560, !561, !562, !566, !572}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "the_setup", scope: !474, file: !3, line: 319, baseType: !477, size: 2464)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "sm_setup_context_t", file: !3, line: 308, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sm_setup_context", file: !3, line: 236, size: 2464, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !485, !486, !487, !489, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "sm_timeout", scope: !478, file: !3, line: 238, baseType: !384, size: 160)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "sm_pairing_failed_reason", scope: !478, file: !3, line: 241, baseType: !311, size: 8, offset: 160)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "sm_user_response", scope: !478, file: !3, line: 244, baseType: !311, size: 8, offset: 168)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "sm_keypress_notification", scope: !478, file: !3, line: 245, baseType: !311, size: 8, offset: 176)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sm_key_distribution_send_set", scope: !478, file: !3, line: 248, baseType: !311, size: 8, offset: 184)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sm_key_distribution_send_set_save", scope: !478, file: !3, line: 249, baseType: !311, size: 8, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "sm_key_distribution_received_set", scope: !478, file: !3, line: 250, baseType: !311, size: 8, offset: 200)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "sm_stk_generation_method", scope: !478, file: !3, line: 253, baseType: !488, size: 32, offset: 224)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "stk_generation_method_t", file: !3, line: 180, baseType: !21)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "sm_tk", scope: !478, file: !3, line: 254, baseType: !490, size: 128, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "sm_key_t", file: !6, line: 76, baseType: !491)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 128, elements: !492)
!492 = !{!493}
!493 = !DISubrange(count: 16)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "sm_use_secure_connections", scope: !478, file: !3, line: 255, baseType: !311, size: 8, offset: 384)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "sm_c1_t3_value", scope: !478, file: !3, line: 257, baseType: !490, size: 128, offset: 392)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "sm_m_preq", scope: !478, file: !3, line: 258, baseType: !357, size: 56, offset: 520)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "sm_s_pres", scope: !478, file: !3, line: 259, baseType: !357, size: 56, offset: 576)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "sm_local_random", scope: !478, file: !3, line: 260, baseType: !490, size: 128, offset: 632)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "sm_local_confirm", scope: !478, file: !3, line: 261, baseType: !490, size: 128, offset: 760)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "sm_peer_random", scope: !478, file: !3, line: 262, baseType: !490, size: 128, offset: 888)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "sm_peer_confirm", scope: !478, file: !3, line: 263, baseType: !490, size: 128, offset: 1016)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "sm_m_addr_type", scope: !478, file: !3, line: 264, baseType: !311, size: 8, offset: 1144)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "sm_s_addr_type", scope: !478, file: !3, line: 265, baseType: !311, size: 8, offset: 1152)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "sm_m_address", scope: !478, file: !3, line: 266, baseType: !308, size: 48, offset: 1160)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "sm_s_address", scope: !478, file: !3, line: 267, baseType: !308, size: 48, offset: 1208)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "sm_ltk", scope: !478, file: !3, line: 268, baseType: !490, size: 128, offset: 1256)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "sm_state_vars", scope: !478, file: !3, line: 270, baseType: !311, size: 8, offset: 1384)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "sm_local_y", scope: !478, file: !3, line: 288, baseType: !328, size: 16, offset: 1392)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "sm_local_div", scope: !478, file: !3, line: 289, baseType: !328, size: 16, offset: 1408)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "sm_local_ediv", scope: !478, file: !3, line: 290, baseType: !328, size: 16, offset: 1424)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "sm_local_rand", scope: !478, file: !3, line: 291, baseType: !365, size: 64, offset: 1440)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "sm_local_ltk", scope: !478, file: !3, line: 292, baseType: !490, size: 128, offset: 1504)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "sm_local_csrk", scope: !478, file: !3, line: 293, baseType: !490, size: 128, offset: 1632)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "sm_local_irk", scope: !478, file: !3, line: 294, baseType: !490, size: 128, offset: 1760)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "sm_peer_y", scope: !478, file: !3, line: 298, baseType: !328, size: 16, offset: 1888)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "sm_peer_div", scope: !478, file: !3, line: 299, baseType: !328, size: 16, offset: 1904)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "sm_peer_ediv", scope: !478, file: !3, line: 300, baseType: !328, size: 16, offset: 1920)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sm_peer_rand", scope: !478, file: !3, line: 301, baseType: !365, size: 64, offset: 1936)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "sm_peer_ltk", scope: !478, file: !3, line: 302, baseType: !490, size: 128, offset: 2000)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "sm_peer_irk", scope: !478, file: !3, line: 303, baseType: !490, size: 128, offset: 2128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "sm_peer_csrk", scope: !478, file: !3, line: 304, baseType: !490, size: 128, offset: 2256)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "sm_peer_addr_type", scope: !478, file: !3, line: 305, baseType: !311, size: 8, offset: 2384)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "sm_peer_address", scope: !478, file: !3, line: 306, baseType: !308, size: 48, offset: 2392)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "test_use_fixed_local_csrk", scope: !474, file: !3, line: 320, baseType: !311, size: 8, offset: 2464)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "sm_accepted_stk_generation_methods", scope: !474, file: !3, line: 323, baseType: !311, size: 8, offset: 2472)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "sm_max_encryption_key_size", scope: !474, file: !3, line: 324, baseType: !311, size: 8, offset: 2480)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "sm_min_encryption_key_size", scope: !474, file: !3, line: 325, baseType: !311, size: 8, offset: 2488)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "sm_auth_req", scope: !474, file: !3, line: 326, baseType: !311, size: 8, offset: 2496)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "sm_io_capabilities", scope: !474, file: !3, line: 327, baseType: !311, size: 8, offset: 2504)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "sm_request_security", scope: !474, file: !3, line: 328, baseType: !311, size: 4, offset: 2512, flags: DIFlagBitField, extraData: i64 2512)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "sm_master_auto_pair", scope: !474, file: !3, line: 329, baseType: !311, size: 2, offset: 2516, flags: DIFlagBitField, extraData: i64 2512)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "sm_master_pair_redo", scope: !474, file: !3, line: 330, baseType: !311, size: 2, offset: 2518, flags: DIFlagBitField, extraData: i64 2512)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "sm_fixed_legacy_pairing_passkey_in_display_role", scope: !474, file: !3, line: 331, baseType: !390, size: 32, offset: 2528)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "sm_reconstruct_ltk_without_le_device_db_entry", scope: !474, file: !3, line: 332, baseType: !311, size: 8, offset: 2560)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "sm_persistent_er", scope: !474, file: !3, line: 338, baseType: !490, size: 128, offset: 2568)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "sm_persistent_ir", scope: !474, file: !3, line: 339, baseType: !490, size: 128, offset: 2696)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "sm_persistent_dhk", scope: !474, file: !3, line: 342, baseType: !490, size: 128, offset: 2824)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "sm_persistent_irk", scope: !474, file: !3, line: 343, baseType: !490, size: 128, offset: 2952)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "sm_persistent_irk_ready", scope: !474, file: !3, line: 344, baseType: !311, size: 4, offset: 3080, flags: DIFlagBitField, extraData: i64 3080)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "sm_irk_generate_address", scope: !474, file: !3, line: 345, baseType: !311, size: 4, offset: 3084, flags: DIFlagBitField, extraData: i64 3080)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "dkg_state", scope: !474, file: !3, line: 346, baseType: !442, size: 32, offset: 3104)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "rau_state", scope: !474, file: !3, line: 352, baseType: !443, size: 32, offset: 3136)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "sm_random_address", scope: !474, file: !3, line: 353, baseType: !308, size: 48, offset: 3168)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "sm_address_resolution_test", scope: !474, file: !3, line: 382, baseType: !370, size: 32, offset: 3232)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "sm_address_resolution_ah_calculation_active", scope: !474, file: !3, line: 383, baseType: !370, size: 32, offset: 3264)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "sm_address_resolution_addr_type", scope: !474, file: !3, line: 384, baseType: !311, size: 8, offset: 3296)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "sm_address_resolution_address", scope: !474, file: !3, line: 385, baseType: !308, size: 48, offset: 3304)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "sm_address_resolution_context", scope: !474, file: !3, line: 386, baseType: !319, size: 32, offset: 3360)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "sm_address_resolution_mode", scope: !474, file: !3, line: 387, baseType: !550, size: 32, offset: 3392)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "address_resolution_mode_t", file: !3, line: 199, baseType: !46)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "sm_address_resolution_general_queue", scope: !474, file: !3, line: 388, baseType: !552, size: 32, offset: 3424)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_list_t", file: !301, line: 101, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "sm_aes128_state", scope: !474, file: !3, line: 391, baseType: !555, size: 32, offset: 3456)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "sm_aes128_state_t", file: !3, line: 193, baseType: !51)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "sm_aes128_context", scope: !474, file: !3, line: 392, baseType: !319, size: 32, offset: 3488)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "sm_random_context", scope: !474, file: !3, line: 401, baseType: !319, size: 32, offset: 3520)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "hci_event_callback_registration", scope: !474, file: !3, line: 404, baseType: !445, size: 64, offset: 3552)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "sm_event_callback_registration", scope: !474, file: !3, line: 405, baseType: !445, size: 64, offset: 3616)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "sm_event_handlers", scope: !474, file: !3, line: 408, baseType: !552, size: 32, offset: 3680)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "sm_active_connection_handle", scope: !474, file: !3, line: 422, baseType: !328, size: 16, offset: 3712)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "sm_get_oob_data", scope: !474, file: !3, line: 426, baseType: !563, size: 32, offset: 3744)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 32)
!564 = !DISubroutineType(types: !565)
!565 = !{!370, !311, !441, !441}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "reset_passkey_cbk", scope: !474, file: !3, line: 427, baseType: !567, size: 32, offset: 3776)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 32)
!568 = !DISubroutineType(types: !569)
!569 = !{null, !570, !328}
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !429, line: 15, baseType: !391)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_enc_delay", scope: !474, file: !3, line: 428, baseType: !328, size: 16, offset: 3808)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(name: "buffer", scope: !575, file: !3, line: 2555, type: !685, isLocal: true, isDefinition: true)
!575 = distinct !DISubprogram(name: "sm_run", scope: !3, file: !3, line: 2323, type: !576, isLocal: true, isDefinition: true, scopeLine: 2324, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !578)
!576 = !DISubroutineType(types: !577)
!577 = !{null}
!578 = !{!579, !587, !591, !594, !598, !602, !603, !608, !612, !613, !614, !615, !617, !618, !621, !622, !623, !624, !625, !631, !632, !633, !636, !638, !639, !640, !645, !648, !651, !653, !655, !657, !659, !662, !668, !671, !674, !675, !678, !684}
!579 = !DILocalVariable(name: "it", scope: !575, file: !3, line: 2326, type: !580)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "linked_list_iterator_t", file: !301, line: 102, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "btstack_linked_list_iterator_t", file: !301, line: 65, baseType: !582)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !301, line: 61, size: 96, elements: !583)
!583 = !{!584, !585, !586}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "advance_on_next", scope: !582, file: !301, line: 62, baseType: !370, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !582, file: !301, line: 63, baseType: !553, size: 32, offset: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !582, file: !301, line: 64, baseType: !553, size: 32, offset: 64)
!587 = !DILocalVariable(name: "d1_prime", scope: !588, file: !3, line: 2350, type: !490)
!588 = distinct !DILexicalBlock(scope: !589, file: !3, line: 2348, column: 56)
!589 = distinct !DILexicalBlock(scope: !590, file: !3, line: 2348, column: 13)
!590 = distinct !DILexicalBlock(scope: !575, file: !3, line: 2345, column: 32)
!591 = !DILocalVariable(name: "d1_prime", scope: !592, file: !3, line: 2361, type: !490)
!592 = distinct !DILexicalBlock(scope: !593, file: !3, line: 2359, column: 56)
!593 = distinct !DILexicalBlock(scope: !590, file: !3, line: 2359, column: 13)
!594 = !DILocalVariable(name: "r_prime", scope: !595, file: !3, line: 2394, type: !490)
!595 = distinct !DILexicalBlock(scope: !596, file: !3, line: 2393, column: 56)
!596 = distinct !DILexicalBlock(scope: !597, file: !3, line: 2393, column: 13)
!597 = distinct !DILexicalBlock(scope: !575, file: !3, line: 2386, column: 32)
!598 = !DILocalVariable(name: "hci_connection", scope: !599, file: !3, line: 2433, type: !320)
!599 = distinct !DILexicalBlock(scope: !600, file: !3, line: 2432, column: 52)
!600 = distinct !DILexicalBlock(scope: !601, file: !3, line: 2430, column: 39)
!601 = distinct !DILexicalBlock(scope: !575, file: !3, line: 2430, column: 9)
!602 = !DILocalVariable(name: "sm_connection", scope: !599, file: !3, line: 2434, type: !454)
!603 = !DILocalVariable(name: "entry", scope: !604, file: !3, line: 2447, type: !295)
!604 = distinct !DILexicalBlock(scope: !605, file: !3, line: 2446, column: 79)
!605 = distinct !DILexicalBlock(scope: !606, file: !3, line: 2446, column: 13)
!606 = distinct !DILexicalBlock(scope: !607, file: !3, line: 2445, column: 39)
!607 = distinct !DILexicalBlock(scope: !575, file: !3, line: 2445, column: 9)
!608 = !DILocalVariable(name: "addr_type", scope: !609, file: !3, line: 2458, type: !370)
!609 = distinct !DILexicalBlock(scope: !610, file: !3, line: 2457, column: 75)
!610 = distinct !DILexicalBlock(scope: !611, file: !3, line: 2455, column: 40)
!611 = distinct !DILexicalBlock(scope: !575, file: !3, line: 2455, column: 9)
!612 = !DILocalVariable(name: "addr", scope: !609, file: !3, line: 2459, type: !308)
!613 = !DILocalVariable(name: "irk", scope: !609, file: !3, line: 2460, type: !490)
!614 = !DILocalVariable(name: "r_prime", scope: !609, file: !3, line: 2482, type: !490)
!615 = !DILocalVariable(name: "hci_connection", scope: !616, file: !3, line: 2498, type: !320)
!616 = distinct !DILexicalBlock(scope: !575, file: !3, line: 2497, column: 115)
!617 = !DILocalVariable(name: "sm_connection", scope: !616, file: !3, line: 2499, type: !454)
!618 = !DILocalVariable(name: "hci_connection", scope: !619, file: !3, line: 2543, type: !320)
!619 = distinct !DILexicalBlock(scope: !620, file: !3, line: 2542, column: 119)
!620 = distinct !DILexicalBlock(scope: !575, file: !3, line: 2538, column: 15)
!621 = !DILocalVariable(name: "sm_connection", scope: !619, file: !3, line: 2544, type: !454)
!622 = !DILocalVariable(name: "done", scope: !619, file: !3, line: 2546, type: !370)
!623 = !DILocalVariable(name: "err", scope: !619, file: !3, line: 2547, type: !370)
!624 = !DILocalVariable(name: "connection", scope: !620, file: !3, line: 2659, type: !454)
!625 = !DILocalVariable(name: "buffer", scope: !626, file: !3, line: 2688, type: !628)
!626 = distinct !DILexicalBlock(scope: !627, file: !3, line: 2687, column: 54)
!627 = distinct !DILexicalBlock(scope: !620, file: !3, line: 2687, column: 13)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 16, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 2)
!631 = !DILocalVariable(name: "plaintext", scope: !620, file: !3, line: 2696, type: !490)
!632 = !DILocalVariable(name: "key_distribution_flags", scope: !620, file: !3, line: 2697, type: !370)
!633 = !DILocalVariable(name: "buffer", scope: !634, file: !3, line: 2707, type: !628)
!634 = distinct !DILexicalBlock(scope: !635, file: !3, line: 2706, column: 46)
!635 = distinct !DILexicalBlock(scope: !620, file: !3, line: 2703, column: 46)
!636 = !DILocalVariable(name: "peer_ltk_flipped", scope: !637, file: !3, line: 2817, type: !490)
!637 = distinct !DILexicalBlock(scope: !635, file: !3, line: 2816, column: 54)
!638 = !DILocalVariable(name: "rand_high", scope: !637, file: !3, line: 2820, type: !390)
!639 = !DILocalVariable(name: "rand_low", scope: !637, file: !3, line: 2821, type: !390)
!640 = !DILocalVariable(name: "buffer", scope: !641, file: !3, line: 2977, type: !642)
!641 = distinct !DILexicalBlock(scope: !635, file: !3, line: 2976, column: 42)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 136, elements: !643)
!643 = !{!644}
!644 = !DISubrange(count: 17)
!645 = !DILocalVariable(name: "d_prime", scope: !646, file: !3, line: 3013, type: !490)
!646 = distinct !DILexicalBlock(scope: !647, file: !3, line: 3012, column: 60)
!647 = distinct !DILexicalBlock(scope: !635, file: !3, line: 3012, column: 17)
!648 = !DILocalVariable(name: "d_prime", scope: !649, file: !3, line: 3024, type: !490)
!649 = distinct !DILexicalBlock(scope: !650, file: !3, line: 3023, column: 60)
!650 = distinct !DILexicalBlock(scope: !635, file: !3, line: 3023, column: 17)
!651 = !DILocalVariable(name: "buffer", scope: !652, file: !3, line: 3078, type: !642)
!652 = distinct !DILexicalBlock(scope: !635, file: !3, line: 3077, column: 46)
!653 = !DILocalVariable(name: "stk_flipped", scope: !654, file: !3, line: 3092, type: !490)
!654 = distinct !DILexicalBlock(scope: !635, file: !3, line: 3091, column: 47)
!655 = !DILocalVariable(name: "ltk_flipped", scope: !656, file: !3, line: 3104, type: !490)
!656 = distinct !DILexicalBlock(scope: !635, file: !3, line: 3103, column: 47)
!657 = !DILocalVariable(name: "stk_flipped", scope: !658, file: !3, line: 3141, type: !490)
!658 = distinct !DILexicalBlock(scope: !635, file: !3, line: 3140, column: 54)
!659 = !DILocalVariable(name: "buffer", scope: !660, file: !3, line: 3156, type: !642)
!660 = distinct !DILexicalBlock(scope: !661, file: !3, line: 3154, column: 97)
!661 = distinct !DILexicalBlock(scope: !635, file: !3, line: 3154, column: 17)
!662 = !DILocalVariable(name: "buffer", scope: !663, file: !3, line: 3167, type: !665)
!663 = distinct !DILexicalBlock(scope: !664, file: !3, line: 3165, column: 96)
!664 = distinct !DILexicalBlock(scope: !635, file: !3, line: 3165, column: 17)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 88, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 11)
!668 = !DILocalVariable(name: "buffer", scope: !669, file: !3, line: 3184, type: !642)
!669 = distinct !DILexicalBlock(scope: !670, file: !3, line: 3182, column: 95)
!670 = distinct !DILexicalBlock(scope: !635, file: !3, line: 3182, column: 17)
!671 = !DILocalVariable(name: "local_address", scope: !672, file: !3, line: 3197, type: !308)
!672 = distinct !DILexicalBlock(scope: !673, file: !3, line: 3195, column: 103)
!673 = distinct !DILexicalBlock(scope: !635, file: !3, line: 3195, column: 17)
!674 = !DILocalVariable(name: "buffer", scope: !672, file: !3, line: 3198, type: !365)
!675 = !DILocalVariable(name: "buffer", scope: !676, file: !3, line: 3230, type: !642)
!676 = distinct !DILexicalBlock(scope: !677, file: !3, line: 3222, column: 97)
!677 = distinct !DILexicalBlock(scope: !635, file: !3, line: 3222, column: 17)
!678 = !DILocalVariable(name: "ext_data", scope: !679, file: !3, line: 3257, type: !683)
!679 = distinct !DILexicalBlock(scope: !680, file: !3, line: 3256, column: 77)
!680 = distinct !DILexicalBlock(scope: !681, file: !3, line: 3256, column: 21)
!681 = distinct !DILexicalBlock(scope: !682, file: !3, line: 3251, column: 20)
!682 = distinct !DILexicalBlock(scope: !635, file: !3, line: 3241, column: 17)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 128, elements: !492)
!684 = !DILocalVariable(name: "ret_msg", scope: !679, file: !3, line: 3258, type: !370)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 16, elements: !629)
!686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !311)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "stk_generation_method", scope: !2, file: !3, line: 441, type: !689, isLocal: true, isDefinition: true)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !690, size: 800, elements: !691)
!690 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !488)
!691 = !{!692, !692}
!692 = !DISubrange(count: 5)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(name: "sm_pdu_size", scope: !2, file: !3, line: 4211, type: !695, isLocal: true, isDefinition: true)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 120, elements: !696)
!696 = !{!697}
!697 = !DISubrange(count: 15)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "gap_random_address_update_timer", scope: !2, file: !3, line: 667, type: !384, isLocal: true, isDefinition: true)
!700 = !DIFile(filename: "../btcommon/profile_stack_debug.h", directory: "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
!701 = !{i32 2, !"Dwarf Version", i32 4}
!702 = !{i32 2, !"Debug Info Version", i32 3}
!703 = !{!"clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)"}
!704 = distinct !DISubprogram(name: "sm_address_resolution_lookup", scope: !3, file: !3, line: 1117, type: !705, isLocal: false, isDefinition: true, scopeLine: 1118, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !707)
!705 = !DISubroutineType(types: !706)
!706 = !{!370, !311, !441}
!707 = !{!708, !709, !710, !711}
!708 = !DILocalVariable(name: "address_type", arg: 1, scope: !704, file: !3, line: 1117, type: !311)
!709 = !DILocalVariable(name: "address", arg: 2, scope: !704, file: !3, line: 1117, type: !441)
!710 = !DILocalVariable(name: "it", scope: !704, file: !3, line: 1120, type: !580)
!711 = !DILocalVariable(name: "entry", scope: !704, file: !3, line: 1121, type: !295)
!712 = !DILocation(line: 1117, column: 42, scope: !704)
!713 = !DILocation(line: 1117, column: 66, scope: !704)
!714 = !DILocation(line: 1120, column: 5, scope: !704)
!715 = !DILocation(line: 1122, column: 5, scope: !704)
!716 = !{!717, !717, i64 0}
!717 = !{!"any pointer", !718, i64 0}
!718 = !{!"omnipotent char", !719, i64 0}
!719 = !{!"Simple C/C++ TBAA"}
!720 = !DILocation(line: 1120, column: 28, scope: !704)
!721 = !DILocation(line: 1123, column: 12, scope: !722)
!722 = !DILexicalBlockFile(scope: !704, file: !3, discriminator: 1)
!723 = !DILocation(line: 1123, column: 5, scope: !722)
!724 = !DILocation(line: 1124, column: 39, scope: !725)
!725 = distinct !DILexicalBlock(scope: !704, file: !3, line: 1123, column: 48)
!726 = !DILocation(line: 1125, column: 20, scope: !727)
!727 = distinct !DILexicalBlock(scope: !725, file: !3, line: 1125, column: 13)
!728 = !{!729, !718, i64 12}
!729 = !{!"", !730, i64 0, !718, i64 4, !718, i64 12}
!730 = !{!"btstack_linked_item", !717, i64 0}
!731 = !DILocation(line: 1125, column: 33, scope: !727)
!732 = !DILocation(line: 1125, column: 13, scope: !725)
!733 = distinct !{!733, !734, !735}
!734 = !DILocation(line: 1123, column: 5, scope: !704)
!735 = !DILocation(line: 1133, column: 5, scope: !704)
!736 = !DILocation(line: 1128, column: 27, scope: !737)
!737 = distinct !DILexicalBlock(scope: !725, file: !3, line: 1128, column: 13)
!738 = !DILocation(line: 1128, column: 20, scope: !737)
!739 = !DILocation(line: 1128, column: 13, scope: !737)
!740 = !DILocation(line: 1128, column: 13, scope: !725)
!741 = !DILocation(line: 1134, column: 13, scope: !704)
!742 = !DILocation(line: 1135, column: 10, scope: !743)
!743 = distinct !DILexicalBlock(scope: !704, file: !3, line: 1135, column: 9)
!744 = !DILocation(line: 1135, column: 9, scope: !704)
!745 = !DILocation(line: 1138, column: 27, scope: !704)
!746 = !DILocation(line: 1138, column: 12, scope: !704)
!747 = !DILocation(line: 1138, column: 25, scope: !704)
!748 = !DILocation(line: 1139, column: 19, scope: !704)
!749 = !DILocation(line: 1139, column: 5, scope: !704)
!750 = !DILocation(line: 1140, column: 5, scope: !704)
!751 = !DILocation(line: 1141, column: 5, scope: !704)
!752 = !DILocation(line: 1142, column: 5, scope: !704)
!753 = !DILocation(line: 1143, column: 1, scope: !704)
!754 = !DILocation(line: 2326, column: 5, scope: !575)
!755 = !DILocation(line: 2328, column: 5, scope: !756)
!756 = distinct !DILexicalBlock(scope: !575, file: !3, line: 2328, column: 5)
!757 = !{!758, !758, i64 0}
!758 = !{!"int", !718, i64 0}
!759 = !DILocation(line: 2328, column: 5, scope: !575)
!760 = !DILocation(line: 2331, column: 9, scope: !761)
!761 = distinct !DILexicalBlock(scope: !575, file: !3, line: 2331, column: 9)
!762 = !DILocation(line: 2331, column: 25, scope: !761)
!763 = !DILocation(line: 2331, column: 9, scope: !575)
!764 = !DILocation(line: 2336, column: 10, scope: !765)
!765 = distinct !DILexicalBlock(scope: !575, file: !3, line: 2336, column: 9)
!766 = !DILocation(line: 2336, column: 9, scope: !575)
!767 = !DILocation(line: 2345, column: 13, scope: !575)
!768 = !DILocation(line: 2345, column: 21, scope: !575)
!769 = !{!770, !718, i64 388}
!770 = !{!"", !771, i64 0, !718, i64 308, !718, i64 309, !718, i64 310, !718, i64 311, !718, i64 312, !718, i64 313, !718, i64 314, !718, i64 314, !718, i64 314, !758, i64 316, !718, i64 320, !718, i64 321, !718, i64 337, !718, i64 353, !718, i64 369, !718, i64 385, !718, i64 385, !718, i64 388, !718, i64 392, !718, i64 396, !758, i64 404, !758, i64 408, !718, i64 412, !718, i64 413, !717, i64 420, !718, i64 424, !717, i64 428, !718, i64 432, !717, i64 436, !717, i64 440, !774, i64 444, !774, i64 452, !717, i64 460, !773, i64 464, !717, i64 468, !717, i64 472, !773, i64 476}
!771 = !{!"sm_setup_context", !772, i64 0, !718, i64 20, !718, i64 21, !718, i64 22, !718, i64 23, !718, i64 24, !718, i64 25, !718, i64 28, !718, i64 32, !718, i64 48, !718, i64 49, !718, i64 65, !718, i64 72, !718, i64 79, !718, i64 95, !718, i64 111, !718, i64 127, !718, i64 143, !718, i64 144, !718, i64 145, !718, i64 151, !718, i64 157, !718, i64 173, !773, i64 174, !773, i64 176, !773, i64 178, !718, i64 180, !718, i64 188, !718, i64 204, !718, i64 220, !773, i64 236, !773, i64 238, !773, i64 240, !718, i64 242, !718, i64 250, !718, i64 266, !718, i64 282, !718, i64 298, !718, i64 299}
!772 = !{!"btstack_timer_source", !730, i64 0, !758, i64 4, !758, i64 8, !758, i64 10, !758, i64 10, !758, i64 10, !758, i64 10, !717, i64 12, !717, i64 16}
!773 = !{!"short", !718, i64 0}
!774 = !{!"", !730, i64 0, !717, i64 4}
!775 = !DILocation(line: 2345, column: 5, scope: !575)
!776 = !DILocation(line: 2348, column: 21, scope: !589)
!777 = !{!770, !718, i64 432}
!778 = !DILocation(line: 2348, column: 37, scope: !589)
!779 = !DILocation(line: 2348, column: 13, scope: !590)
!780 = !DILocation(line: 2350, column: 13, scope: !588)
!781 = !DILocation(line: 2350, column: 22, scope: !588)
!782 = !DILocation(line: 2351, column: 13, scope: !588)
!783 = !DILocation(line: 1152, column: 58, scope: !784, inlinedAt: !786)
!784 = distinct !DISubprogram(name: "dkg_next_state", scope: !3, file: !3, line: 1150, type: !576, isLocal: true, isDefinition: true, scopeLine: 1151, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !785)
!785 = !{}
!786 = distinct !DILocation(line: 2352, column: 13, scope: !588)
!787 = !DILocation(line: 1152, column: 66, scope: !784, inlinedAt: !786)
!788 = !DILocation(line: 1152, column: 77, scope: !784, inlinedAt: !786)
!789 = !DILocation(line: 1152, column: 23, scope: !784, inlinedAt: !786)
!790 = !DILocation(line: 2353, column: 29, scope: !588)
!791 = !DILocation(line: 2353, column: 13, scope: !588)
!792 = !DILocation(line: 2355, column: 9, scope: !589)
!793 = !DILocation(line: 2359, column: 21, scope: !593)
!794 = !DILocation(line: 2359, column: 37, scope: !593)
!795 = !DILocation(line: 2359, column: 13, scope: !590)
!796 = !DILocation(line: 2361, column: 13, scope: !592)
!797 = !DILocation(line: 2361, column: 22, scope: !592)
!798 = !DILocation(line: 2362, column: 13, scope: !592)
!799 = !DILocation(line: 1152, column: 58, scope: !784, inlinedAt: !800)
!800 = distinct !DILocation(line: 2363, column: 13, scope: !592)
!801 = !DILocation(line: 1152, column: 66, scope: !784, inlinedAt: !800)
!802 = !DILocation(line: 1152, column: 77, scope: !784, inlinedAt: !800)
!803 = !DILocation(line: 1152, column: 23, scope: !784, inlinedAt: !800)
!804 = !DILocation(line: 2364, column: 29, scope: !592)
!805 = !DILocation(line: 2364, column: 13, scope: !592)
!806 = !DILocation(line: 2366, column: 9, scope: !593)
!807 = !DILocation(line: 2386, column: 21, scope: !575)
!808 = !{!770, !718, i64 392}
!809 = !DILocation(line: 2386, column: 5, scope: !575)
!810 = !DILocation(line: 1156, column: 23, scope: !811, inlinedAt: !812)
!811 = distinct !DISubprogram(name: "rau_next_state", scope: !3, file: !3, line: 1154, type: !576, isLocal: true, isDefinition: true, scopeLine: 1155, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !785)
!812 = distinct !DILocation(line: 2388, column: 9, scope: !597)
!813 = !DILocalVariable(name: "context", arg: 1, scope: !814, file: !3, line: 701, type: !319)
!814 = distinct !DISubprogram(name: "sm_random_start", scope: !3, file: !3, line: 701, type: !815, isLocal: true, isDefinition: true, scopeLine: 702, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !817)
!815 = !DISubroutineType(types: !816)
!816 = !{null, !319}
!817 = !{!813}
!818 = !DILocation(line: 701, column: 35, scope: !814, inlinedAt: !819)
!819 = distinct !DILocation(line: 2389, column: 9, scope: !597)
!820 = !DILocation(line: 703, column: 13, scope: !814, inlinedAt: !819)
!821 = !DILocation(line: 703, column: 31, scope: !814, inlinedAt: !819)
!822 = !{!770, !717, i64 440}
!823 = !DILocation(line: 705, column: 5, scope: !814, inlinedAt: !819)
!824 = !DILocation(line: 2390, column: 9, scope: !597)
!825 = !DILocation(line: 2393, column: 21, scope: !596)
!826 = !DILocation(line: 2393, column: 37, scope: !596)
!827 = !DILocation(line: 2393, column: 13, scope: !597)
!828 = !DILocation(line: 2394, column: 13, scope: !595)
!829 = !DILocation(line: 2394, column: 22, scope: !595)
!830 = !DILocation(line: 2395, column: 27, scope: !595)
!831 = !DILocalVariable(name: "r", arg: 1, scope: !832, file: !3, line: 754, type: !441)
!832 = distinct !DISubprogram(name: "sm_ah_r_prime", scope: !3, file: !3, line: 754, type: !833, isLocal: true, isDefinition: true, scopeLine: 755, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !835)
!833 = !DISubroutineType(types: !834)
!834 = !{null, !441, !441}
!835 = !{!831, !836}
!836 = !DILocalVariable(name: "r_prime", arg: 2, scope: !832, file: !3, line: 754, type: !441)
!837 = !DILocation(line: 754, column: 35, scope: !832, inlinedAt: !838)
!838 = distinct !DILocation(line: 2395, column: 13, scope: !595)
!839 = !DILocation(line: 754, column: 50, scope: !832, inlinedAt: !838)
!840 = !DILocation(line: 757, column: 5, scope: !832, inlinedAt: !838)
!841 = !DILocation(line: 758, column: 13, scope: !832, inlinedAt: !838)
!842 = !DILocation(line: 758, column: 5, scope: !832, inlinedAt: !838)
!843 = !DILocation(line: 1156, column: 23, scope: !811, inlinedAt: !844)
!844 = distinct !DILocation(line: 2396, column: 13, scope: !595)
!845 = !DILocation(line: 2397, column: 29, scope: !595)
!846 = !DILocation(line: 2397, column: 13, scope: !595)
!847 = !DILocation(line: 2399, column: 9, scope: !596)
!848 = !DILocation(line: 2403, column: 27, scope: !597)
!849 = !DILocation(line: 2405, column: 35, scope: !597)
!850 = !DILocation(line: 2405, column: 9, scope: !597)
!851 = !DILocation(line: 2406, column: 9, scope: !597)
!852 = !DILocation(line: 1104, column: 20, scope: !853, inlinedAt: !856)
!853 = distinct !DISubprogram(name: "sm_address_resolution_idle", scope: !3, file: !3, line: 1102, type: !854, isLocal: true, isDefinition: true, scopeLine: 1103, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !785)
!854 = !DISubroutineType(types: !855)
!855 = !{!370}
!856 = distinct !DILocation(line: 2430, column: 9, scope: !601)
!857 = !{!770, !718, i64 424}
!858 = !DILocation(line: 1104, column: 47, scope: !853, inlinedAt: !856)
!859 = !DILocation(line: 2430, column: 9, scope: !575)
!860 = !DILocation(line: 2326, column: 28, scope: !575)
!861 = !DILocation(line: 2431, column: 9, scope: !600)
!862 = !DILocation(line: 2432, column: 9, scope: !600)
!863 = !DILocation(line: 2432, column: 16, scope: !864)
!864 = !DILexicalBlockFile(scope: !600, file: !3, discriminator: 1)
!865 = !DILocation(line: 2432, column: 9, scope: !864)
!866 = !DILocation(line: 2433, column: 75, scope: !599)
!867 = !DILocation(line: 2435, column: 32, scope: !868)
!868 = distinct !DILexicalBlock(scope: !599, file: !3, line: 2435, column: 17)
!869 = !{!870, !718, i64 16}
!870 = !{!"sm_connection", !773, i64 0, !718, i64 2, !718, i64 3, !718, i64 4, !718, i64 5, !718, i64 6, !718, i64 12, !718, i64 16, !718, i64 20, !718, i64 21, !718, i64 22, !718, i64 23, !718, i64 32, !773, i64 36, !718, i64 38, !718, i64 46, !758, i64 48, !758, i64 52}
!871 = !DILocation(line: 2435, column: 52, scope: !868)
!872 = !DILocation(line: 2435, column: 17, scope: !599)
!873 = !DILocation(line: 2434, column: 66, scope: !599)
!874 = !DILocation(line: 2437, column: 67, scope: !875)
!875 = distinct !DILexicalBlock(scope: !868, file: !3, line: 2435, column: 76)
!876 = !{!870, !718, i64 5}
!877 = !DILocation(line: 2437, column: 101, scope: !875)
!878 = !{!870, !773, i64 0}
!879 = !DILocation(line: 2437, column: 112, scope: !875)
!880 = !DILocalVariable(name: "addr_type", arg: 1, scope: !881, file: !3, line: 1107, type: !311)
!881 = distinct !DISubprogram(name: "sm_address_resolution_start_lookup", scope: !3, file: !3, line: 1107, type: !882, isLocal: true, isDefinition: true, scopeLine: 1108, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !884)
!882 = !DISubroutineType(types: !883)
!883 = !{null, !311, !327, !441, !550, !319}
!884 = !{!880, !885, !886, !887, !888}
!885 = !DILocalVariable(name: "con_handle", arg: 2, scope: !881, file: !3, line: 1107, type: !327)
!886 = !DILocalVariable(name: "addr", arg: 3, scope: !881, file: !3, line: 1107, type: !441)
!887 = !DILocalVariable(name: "mode", arg: 4, scope: !881, file: !3, line: 1107, type: !550)
!888 = !DILocalVariable(name: "context", arg: 5, scope: !881, file: !3, line: 1107, type: !319)
!889 = !DILocation(line: 1107, column: 56, scope: !881, inlinedAt: !890)
!890 = distinct !DILocation(line: 2437, column: 17, scope: !875)
!891 = !DILocation(line: 1107, column: 84, scope: !881, inlinedAt: !890)
!892 = !DILocation(line: 1107, column: 106, scope: !881, inlinedAt: !890)
!893 = !DILocation(line: 1107, column: 138, scope: !881, inlinedAt: !890)
!894 = !DILocation(line: 1109, column: 12, scope: !881, inlinedAt: !890)
!895 = !DILocation(line: 1109, column: 5, scope: !881, inlinedAt: !890)
!896 = !DILocation(line: 1110, column: 13, scope: !881, inlinedAt: !890)
!897 = !DILocation(line: 1110, column: 45, scope: !881, inlinedAt: !890)
!898 = !{!770, !718, i64 412}
!899 = !DILocation(line: 1111, column: 13, scope: !881, inlinedAt: !890)
!900 = !DILocation(line: 1111, column: 40, scope: !881, inlinedAt: !890)
!901 = !{!770, !758, i64 404}
!902 = !DILocation(line: 1112, column: 13, scope: !881, inlinedAt: !890)
!903 = !DILocation(line: 1112, column: 40, scope: !881, inlinedAt: !890)
!904 = !DILocation(line: 1113, column: 13, scope: !881, inlinedAt: !890)
!905 = !DILocation(line: 1113, column: 43, scope: !881, inlinedAt: !890)
!906 = !{!770, !717, i64 420}
!907 = !DILocation(line: 1114, column: 5, scope: !881, inlinedAt: !890)
!908 = !DILocation(line: 2438, column: 52, scope: !875)
!909 = !DILocation(line: 1104, column: 12, scope: !853, inlinedAt: !910)
!910 = distinct !DILocation(line: 2445, column: 9, scope: !607)
!911 = !DILocation(line: 1104, column: 20, scope: !853, inlinedAt: !910)
!912 = !DILocation(line: 1104, column: 47, scope: !853, inlinedAt: !910)
!913 = !DILocation(line: 2445, column: 9, scope: !575)
!914 = !DILocation(line: 2446, column: 14, scope: !605)
!915 = !DILocation(line: 2446, column: 13, scope: !606)
!916 = !DILocation(line: 2447, column: 62, scope: !604)
!917 = !DILocation(line: 2447, column: 70, scope: !604)
!918 = !{!770, !717, i64 428}
!919 = !DILocation(line: 2448, column: 13, scope: !604)
!920 = !DILocation(line: 2449, column: 55, scope: !604)
!921 = !DILocation(line: 2449, column: 48, scope: !604)
!922 = !DILocation(line: 2449, column: 79, scope: !604)
!923 = !DILocation(line: 2449, column: 72, scope: !604)
!924 = !DILocation(line: 1107, column: 56, scope: !881, inlinedAt: !925)
!925 = distinct !DILocation(line: 2449, column: 13, scope: !604)
!926 = !DILocation(line: 1107, column: 84, scope: !881, inlinedAt: !925)
!927 = !DILocation(line: 1107, column: 106, scope: !881, inlinedAt: !925)
!928 = !DILocation(line: 1107, column: 138, scope: !881, inlinedAt: !925)
!929 = !DILocation(line: 1107, column: 150, scope: !881, inlinedAt: !925)
!930 = !DILocation(line: 1109, column: 12, scope: !881, inlinedAt: !925)
!931 = !DILocation(line: 1109, column: 5, scope: !881, inlinedAt: !925)
!932 = !DILocation(line: 1110, column: 13, scope: !881, inlinedAt: !925)
!933 = !DILocation(line: 1110, column: 45, scope: !881, inlinedAt: !925)
!934 = !DILocation(line: 1111, column: 13, scope: !881, inlinedAt: !925)
!935 = !DILocation(line: 1111, column: 40, scope: !881, inlinedAt: !925)
!936 = !DILocation(line: 1112, column: 13, scope: !881, inlinedAt: !925)
!937 = !DILocation(line: 1112, column: 40, scope: !881, inlinedAt: !925)
!938 = !DILocation(line: 1113, column: 13, scope: !881, inlinedAt: !925)
!939 = !DILocation(line: 1113, column: 43, scope: !881, inlinedAt: !925)
!940 = !DILocation(line: 1114, column: 5, scope: !881, inlinedAt: !925)
!941 = !DILocation(line: 2450, column: 49, scope: !604)
!942 = !DILocation(line: 2450, column: 13, scope: !604)
!943 = !DILocation(line: 2451, column: 9, scope: !604)
!944 = !DILocation(line: 1104, column: 12, scope: !853, inlinedAt: !945)
!945 = distinct !DILocation(line: 2455, column: 10, scope: !611)
!946 = !DILocation(line: 1104, column: 20, scope: !853, inlinedAt: !945)
!947 = !DILocation(line: 1104, column: 47, scope: !853, inlinedAt: !945)
!948 = !DILocation(line: 2455, column: 9, scope: !575)
!949 = !DILocation(line: 2457, column: 24, scope: !950)
!950 = !DILexicalBlockFile(scope: !610, file: !3, discriminator: 1)
!951 = !DILocation(line: 2457, column: 53, scope: !950)
!952 = !DILocation(line: 2457, column: 51, scope: !950)
!953 = !DILocation(line: 2457, column: 9, scope: !950)
!954 = !DILocation(line: 2458, column: 13, scope: !609)
!955 = !DILocation(line: 2459, column: 13, scope: !609)
!956 = !DILocation(line: 2459, column: 23, scope: !609)
!957 = !DILocation(line: 2460, column: 13, scope: !609)
!958 = !DILocation(line: 2460, column: 22, scope: !609)
!959 = !DILocation(line: 2461, column: 31, scope: !609)
!960 = !DILocation(line: 2461, column: 39, scope: !609)
!961 = !DILocation(line: 2458, column: 17, scope: !609)
!962 = !DILocation(line: 2461, column: 13, scope: !609)
!963 = !DILocation(line: 2464, column: 17, scope: !964)
!964 = distinct !DILexicalBlock(scope: !609, file: !3, line: 2464, column: 17)
!965 = !DILocation(line: 2464, column: 25, scope: !964)
!966 = !DILocation(line: 2464, column: 60, scope: !964)
!967 = !DILocation(line: 2464, column: 57, scope: !964)
!968 = !DILocation(line: 2464, column: 70, scope: !964)
!969 = !DILocation(line: 2464, column: 86, scope: !970)
!970 = !DILexicalBlockFile(scope: !964, file: !3, discriminator: 1)
!971 = !DILocation(line: 2464, column: 73, scope: !970)
!972 = !DILocation(line: 2464, column: 128, scope: !970)
!973 = !DILocation(line: 2464, column: 17, scope: !974)
!974 = !DILexicalBlockFile(scope: !609, file: !3, discriminator: 1)
!975 = !DILocation(line: 2466, column: 17, scope: !976)
!976 = distinct !DILexicalBlock(scope: !964, file: !3, line: 2464, column: 134)
!977 = !DILocation(line: 2467, column: 17, scope: !976)
!978 = !DILocation(line: 2470, column: 57, scope: !979)
!979 = distinct !DILexicalBlock(scope: !609, file: !3, line: 2470, column: 17)
!980 = !DILocation(line: 2470, column: 17, scope: !609)
!981 = !DILocation(line: 2475, column: 25, scope: !982)
!982 = distinct !DILexicalBlock(scope: !609, file: !3, line: 2475, column: 17)
!983 = !DILocation(line: 2475, column: 41, scope: !982)
!984 = !DILocation(line: 2475, column: 17, scope: !609)
!985 = !DILocation(line: 2482, column: 13, scope: !609)
!986 = !DILocation(line: 2482, column: 22, scope: !609)
!987 = !DILocation(line: 2483, column: 27, scope: !609)
!988 = !DILocation(line: 754, column: 35, scope: !832, inlinedAt: !989)
!989 = distinct !DILocation(line: 2483, column: 13, scope: !609)
!990 = !DILocation(line: 754, column: 50, scope: !832, inlinedAt: !989)
!991 = !DILocation(line: 757, column: 5, scope: !832, inlinedAt: !989)
!992 = !DILocation(line: 758, column: 13, scope: !832, inlinedAt: !989)
!993 = !DILocation(line: 758, column: 5, scope: !832, inlinedAt: !989)
!994 = !DILocation(line: 2484, column: 21, scope: !609)
!995 = !DILocation(line: 2484, column: 65, scope: !609)
!996 = !{!770, !758, i64 408}
!997 = !DILocation(line: 2485, column: 51, scope: !609)
!998 = !DILocation(line: 2485, column: 13, scope: !609)
!999 = !DILocation(line: 2487, column: 9, scope: !610)
!1000 = !DILocation(line: 2471, column: 25, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !979, file: !3, line: 2470, column: 63)
!1002 = !DILocation(line: 2471, column: 51, scope: !1001)
!1003 = !DILocation(line: 2489, column: 13, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !610, file: !3, line: 2489, column: 13)
!1005 = !DILocation(line: 2489, column: 21, scope: !1004)
!1006 = !DILocation(line: 2489, column: 51, scope: !1004)
!1007 = !DILocation(line: 2489, column: 48, scope: !1004)
!1008 = !DILocation(line: 2489, column: 13, scope: !610)
!1009 = !DILocation(line: 2491, column: 13, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 2489, column: 73)
!1011 = !DILocation(line: 2492, column: 9, scope: !1010)
!1012 = !DILocation(line: 2496, column: 5, scope: !575)
!1013 = !DILocation(line: 2497, column: 5, scope: !575)
!1014 = !DILocation(line: 2497, column: 13, scope: !1015)
!1015 = !DILexicalBlockFile(scope: !575, file: !3, discriminator: 1)
!1016 = !DILocation(line: 2497, column: 21, scope: !1015)
!1017 = !{!770, !773, i64 464}
!1018 = !DILocation(line: 2497, column: 49, scope: !1015)
!1019 = !DILocation(line: 2497, column: 76, scope: !1015)
!1020 = !DILocation(line: 2497, column: 79, scope: !1021)
!1021 = !DILexicalBlockFile(scope: !575, file: !3, discriminator: 2)
!1022 = !DILocation(line: 2497, column: 76, scope: !1021)
!1023 = !DILocation(line: 2497, column: 5, scope: !1024)
!1024 = !DILexicalBlockFile(scope: !575, file: !3, discriminator: 3)
!1025 = !DILocation(line: 2498, column: 71, scope: !616)
!1026 = !DILocation(line: 2500, column: 46, scope: !616)
!1027 = !DILocation(line: 2501, column: 32, scope: !616)
!1028 = !{!870, !718, i64 12}
!1029 = !DILocation(line: 2501, column: 9, scope: !616)
!1030 = !DILocation(line: 2499, column: 61, scope: !616)
!1031 = !DILocation(line: 2504, column: 44, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !616, file: !3, line: 2501, column: 49)
!1033 = !DILocation(line: 2506, column: 72, scope: !1032)
!1034 = !DILocation(line: 2506, column: 13, scope: !1032)
!1035 = !DILocation(line: 2508, column: 76, scope: !1032)
!1036 = !DILocation(line: 2508, column: 102, scope: !1032)
!1037 = !DILocation(line: 2509, column: 38, scope: !1032)
!1038 = !DILocation(line: 2508, column: 13, scope: !1032)
!1039 = !DILocation(line: 2541, column: 9, scope: !620)
!1040 = !DILocation(line: 2542, column: 17, scope: !1041)
!1041 = !DILexicalBlockFile(scope: !620, file: !3, discriminator: 1)
!1042 = !DILocation(line: 2542, column: 25, scope: !1041)
!1043 = !DILocation(line: 2542, column: 53, scope: !1041)
!1044 = !DILocation(line: 2542, column: 80, scope: !1041)
!1045 = !DILocation(line: 2542, column: 83, scope: !1046)
!1046 = !DILexicalBlockFile(scope: !620, file: !3, discriminator: 2)
!1047 = !DILocation(line: 2542, column: 80, scope: !1046)
!1048 = !DILocation(line: 2542, column: 9, scope: !1049)
!1049 = !DILexicalBlockFile(scope: !620, file: !3, discriminator: 3)
!1050 = !DILocation(line: 2543, column: 75, scope: !619)
!1051 = !DILocation(line: 2544, column: 65, scope: !619)
!1052 = !DILocation(line: 2544, column: 32, scope: !619)
!1053 = !DILocation(line: 2546, column: 17, scope: !619)
!1054 = !DILocation(line: 2549, column: 50, scope: !619)
!1055 = !DILocation(line: 2550, column: 36, scope: !619)
!1056 = !DILocation(line: 2550, column: 13, scope: !619)
!1057 = !DILocation(line: 2554, column: 76, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1059, file: !3, line: 2554, column: 21)
!1059 = distinct !DILexicalBlock(scope: !619, file: !3, line: 2550, column: 53)
!1060 = !DILocation(line: 2554, column: 21, scope: !1058)
!1061 = !DILocation(line: 2554, column: 21, scope: !1059)
!1062 = !DILocation(line: 2556, column: 52, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1058, file: !3, line: 2554, column: 125)
!1064 = !DILocation(line: 2557, column: 62, scope: !1063)
!1065 = !DILocation(line: 2557, column: 21, scope: !1063)
!1066 = !DILocation(line: 2558, column: 17, scope: !1063)
!1067 = !DILocation(line: 2559, column: 81, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1058, file: !3, line: 2558, column: 24)
!1069 = !DILocation(line: 2559, column: 21, scope: !1068)
!1070 = distinct !{!1070, !1071, !1072}
!1071 = !DILocation(line: 2542, column: 9, scope: !620)
!1072 = !DILocation(line: 2649, column: 9, scope: !620)
!1073 = !DILocation(line: 1443, column: 5, scope: !1074, inlinedAt: !1075)
!1074 = distinct !DISubprogram(name: "sm_reset_setup", scope: !3, file: !3, line: 1440, type: !576, isLocal: true, isDefinition: true, scopeLine: 1441, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !785)
!1075 = distinct !DILocation(line: 2566, column: 17, scope: !1059)
!1076 = !DILocation(line: 1443, column: 12, scope: !1074, inlinedAt: !1075)
!1077 = !DILocation(line: 1443, column: 26, scope: !1074, inlinedAt: !1075)
!1078 = !{!771, !718, i64 173}
!1079 = !DILocation(line: 1444, column: 12, scope: !1074, inlinedAt: !1075)
!1080 = !DILocation(line: 1444, column: 37, scope: !1074, inlinedAt: !1075)
!1081 = !{!771, !718, i64 22}
!1082 = !DILocalVariable(name: "i", scope: !1083, file: !3, line: 602, type: !370)
!1083 = distinct !DISubprogram(name: "sm_reset_tk", scope: !3, file: !3, line: 600, type: !576, isLocal: true, isDefinition: true, scopeLine: 601, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1084)
!1084 = !{!1082}
!1085 = !DILocation(line: 602, column: 9, scope: !1083, inlinedAt: !1086)
!1086 = distinct !DILocation(line: 1445, column: 5, scope: !1074, inlinedAt: !1075)
!1087 = !DILocation(line: 603, column: 5, scope: !1088, inlinedAt: !1086)
!1088 = !DILexicalBlockFile(scope: !1089, file: !3, discriminator: 1)
!1089 = distinct !DILexicalBlock(scope: !1083, file: !3, line: 603, column: 5)
!1090 = !DILocation(line: 604, column: 25, scope: !1091, inlinedAt: !1086)
!1091 = distinct !DILexicalBlock(scope: !1092, file: !3, line: 603, column: 30)
!1092 = distinct !DILexicalBlock(scope: !1089, file: !3, line: 603, column: 5)
!1093 = !DILocation(line: 2567, column: 17, scope: !1059)
!1094 = !DILocation(line: 2569, column: 25, scope: !1059)
!1095 = !DILocation(line: 2569, column: 17, scope: !1059)
!1096 = !DILocation(line: 2570, column: 23, scope: !1059)
!1097 = !DILocation(line: 2547, column: 17, scope: !619)
!1098 = !DILocation(line: 2571, column: 21, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1059, file: !3, line: 2571, column: 21)
!1100 = !DILocation(line: 2571, column: 21, scope: !1059)
!1101 = !DILocation(line: 2572, column: 55, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1099, file: !3, line: 2571, column: 26)
!1103 = !DILocation(line: 2572, column: 28, scope: !1102)
!1104 = !DILocation(line: 2572, column: 53, scope: !1102)
!1105 = !{!771, !718, i64 20}
!1106 = !DILocation(line: 2576, column: 17, scope: !1059)
!1107 = !DILocation(line: 2578, column: 21, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1059, file: !3, line: 2578, column: 21)
!1109 = !DILocation(line: 2578, column: 28, scope: !1108)
!1110 = !{!771, !718, i64 28}
!1111 = !DILocation(line: 2578, column: 53, scope: !1108)
!1112 = !DILocation(line: 1443, column: 5, scope: !1074, inlinedAt: !1113)
!1113 = distinct !DILocation(line: 2586, column: 17, scope: !1059)
!1114 = !DILocation(line: 1443, column: 12, scope: !1074, inlinedAt: !1113)
!1115 = !DILocation(line: 1443, column: 26, scope: !1074, inlinedAt: !1113)
!1116 = !DILocation(line: 1444, column: 12, scope: !1074, inlinedAt: !1113)
!1117 = !DILocation(line: 1444, column: 37, scope: !1074, inlinedAt: !1113)
!1118 = !DILocation(line: 602, column: 9, scope: !1083, inlinedAt: !1119)
!1119 = distinct !DILocation(line: 1445, column: 5, scope: !1074, inlinedAt: !1113)
!1120 = !DILocation(line: 603, column: 5, scope: !1088, inlinedAt: !1119)
!1121 = !DILocation(line: 604, column: 25, scope: !1091, inlinedAt: !1119)
!1122 = !DILocalVariable(name: "sm_connection", arg: 1, scope: !1123, file: !3, line: 2308, type: !454)
!1123 = distinct !DISubprogram(name: "sm_start_calculating_ltk_from_ediv_and_rand", scope: !3, file: !3, line: 2308, type: !1124, isLocal: true, isDefinition: true, scopeLine: 2309, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1126)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{null, !454}
!1126 = !{!1122}
!1127 = !DILocation(line: 2308, column: 74, scope: !1123, inlinedAt: !1128)
!1128 = distinct !DILocation(line: 2587, column: 17, scope: !1059)
!1129 = !DILocation(line: 2310, column: 5, scope: !1123, inlinedAt: !1128)
!1130 = !DILocation(line: 2311, column: 43, scope: !1123, inlinedAt: !1128)
!1131 = !{!870, !773, i64 36}
!1132 = !DILocation(line: 2311, column: 12, scope: !1123, inlinedAt: !1128)
!1133 = !DILocation(line: 2311, column: 26, scope: !1123, inlinedAt: !1128)
!1134 = !{!771, !773, i64 178}
!1135 = !DILocation(line: 2314, column: 53, scope: !1123, inlinedAt: !1128)
!1136 = !DILocation(line: 2314, column: 77, scope: !1123, inlinedAt: !1128)
!1137 = !DILocation(line: 2314, column: 85, scope: !1123, inlinedAt: !1128)
!1138 = !DILocation(line: 2314, column: 20, scope: !1123, inlinedAt: !1128)
!1139 = !DILocation(line: 2314, column: 50, scope: !1123, inlinedAt: !1128)
!1140 = !{!870, !718, i64 22}
!1141 = !DILocation(line: 2316, column: 51, scope: !1123, inlinedAt: !1128)
!1142 = !{!718, !718, i64 0}
!1143 = !DILocation(line: 2316, column: 83, scope: !1123, inlinedAt: !1128)
!1144 = !DILocation(line: 2316, column: 20, scope: !1123, inlinedAt: !1128)
!1145 = !DILocation(line: 2316, column: 48, scope: !1123, inlinedAt: !1128)
!1146 = !{!870, !718, i64 21}
!1147 = !DILocation(line: 1443, column: 5, scope: !1074, inlinedAt: !1148)
!1148 = distinct !DILocation(line: 2597, column: 17, scope: !1059)
!1149 = !DILocation(line: 1443, column: 12, scope: !1074, inlinedAt: !1148)
!1150 = !DILocation(line: 1443, column: 26, scope: !1074, inlinedAt: !1148)
!1151 = !DILocation(line: 1444, column: 12, scope: !1074, inlinedAt: !1148)
!1152 = !DILocation(line: 1444, column: 37, scope: !1074, inlinedAt: !1148)
!1153 = !DILocation(line: 602, column: 9, scope: !1083, inlinedAt: !1154)
!1154 = distinct !DILocation(line: 1445, column: 5, scope: !1074, inlinedAt: !1148)
!1155 = !DILocation(line: 603, column: 5, scope: !1088, inlinedAt: !1154)
!1156 = !DILocation(line: 604, column: 25, scope: !1091, inlinedAt: !1154)
!1157 = !DILocalVariable(name: "sm_connection", arg: 1, scope: !1158, file: !3, line: 2286, type: !454)
!1158 = distinct !DISubprogram(name: "sm_load_security_info", scope: !3, file: !3, line: 2286, type: !1124, isLocal: true, isDefinition: true, scopeLine: 2287, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1159)
!1159 = !{!1157, !1160, !1161, !1162}
!1160 = !DILocalVariable(name: "encryption_key_size", scope: !1158, file: !3, line: 2288, type: !370)
!1161 = !DILocalVariable(name: "authenticated", scope: !1158, file: !3, line: 2289, type: !370)
!1162 = !DILocalVariable(name: "authorized", scope: !1158, file: !3, line: 2290, type: !370)
!1163 = !DILocation(line: 2286, column: 52, scope: !1158, inlinedAt: !1164)
!1164 = distinct !DILocation(line: 2598, column: 17, scope: !1059)
!1165 = !DILocation(line: 2288, column: 5, scope: !1158, inlinedAt: !1164)
!1166 = !DILocation(line: 2289, column: 5, scope: !1158, inlinedAt: !1164)
!1167 = !DILocation(line: 2290, column: 5, scope: !1158, inlinedAt: !1164)
!1168 = !DILocation(line: 2292, column: 24, scope: !1169, inlinedAt: !1164)
!1169 = distinct !DILexicalBlock(scope: !1158, file: !3, line: 2292, column: 9)
!1170 = !{!870, !758, i64 48}
!1171 = !DILocation(line: 2292, column: 39, scope: !1169, inlinedAt: !1164)
!1172 = !DILocation(line: 2292, column: 9, scope: !1158, inlinedAt: !1164)
!1173 = !DILocation(line: 2298, column: 72, scope: !1158, inlinedAt: !1164)
!1174 = !DILocation(line: 2298, column: 86, scope: !1158, inlinedAt: !1164)
!1175 = !DILocation(line: 2298, column: 107, scope: !1158, inlinedAt: !1164)
!1176 = !DILocation(line: 2288, column: 9, scope: !1158, inlinedAt: !1164)
!1177 = !DILocation(line: 2289, column: 9, scope: !1158, inlinedAt: !1164)
!1178 = !DILocation(line: 2290, column: 9, scope: !1158, inlinedAt: !1164)
!1179 = !DILocation(line: 2298, column: 5, scope: !1158, inlinedAt: !1164)
!1180 = !DILocation(line: 2300, column: 5, scope: !1181, inlinedAt: !1164)
!1181 = distinct !DILexicalBlock(scope: !1158, file: !3, line: 2300, column: 5)
!1182 = !DILocation(line: 2300, column: 5, scope: !1158, inlinedAt: !1164)
!1183 = !DILocation(line: 2300, column: 5, scope: !1184, inlinedAt: !1164)
!1184 = !DILexicalBlockFile(scope: !1181, file: !3, discriminator: 1)
!1185 = !DILocation(line: 2301, column: 52, scope: !1158, inlinedAt: !1164)
!1186 = !DILocation(line: 2301, column: 20, scope: !1158, inlinedAt: !1164)
!1187 = !DILocation(line: 2301, column: 50, scope: !1158, inlinedAt: !1164)
!1188 = !DILocation(line: 2302, column: 50, scope: !1158, inlinedAt: !1164)
!1189 = !DILocation(line: 2302, column: 20, scope: !1158, inlinedAt: !1164)
!1190 = !DILocation(line: 2302, column: 48, scope: !1158, inlinedAt: !1164)
!1191 = !DILocation(line: 2303, column: 56, scope: !1158, inlinedAt: !1164)
!1192 = !DILocation(line: 2303, column: 20, scope: !1158, inlinedAt: !1164)
!1193 = !DILocation(line: 2303, column: 54, scope: !1158, inlinedAt: !1164)
!1194 = !{!870, !718, i64 32}
!1195 = !DILocation(line: 2304, column: 1, scope: !1158, inlinedAt: !1164)
!1196 = !DILocation(line: 1443, column: 5, scope: !1074, inlinedAt: !1197)
!1197 = distinct !DILocation(line: 2602, column: 17, scope: !1059)
!1198 = !DILocation(line: 1443, column: 12, scope: !1074, inlinedAt: !1197)
!1199 = !DILocation(line: 1443, column: 26, scope: !1074, inlinedAt: !1197)
!1200 = !DILocation(line: 1444, column: 12, scope: !1074, inlinedAt: !1197)
!1201 = !DILocation(line: 1444, column: 37, scope: !1074, inlinedAt: !1197)
!1202 = !DILocation(line: 602, column: 9, scope: !1083, inlinedAt: !1203)
!1203 = distinct !DILocation(line: 1445, column: 5, scope: !1074, inlinedAt: !1197)
!1204 = !DILocation(line: 603, column: 5, scope: !1088, inlinedAt: !1203)
!1205 = !DILocation(line: 604, column: 25, scope: !1091, inlinedAt: !1203)
!1206 = !DILocation(line: 2603, column: 17, scope: !1059)
!1207 = !DILocation(line: 2604, column: 17, scope: !1059)
!1208 = !DILocation(line: 2646, column: 70, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !1210, file: !3, line: 2645, column: 23)
!1210 = distinct !DILexicalBlock(scope: !619, file: !3, line: 2645, column: 17)
!1211 = !DILocation(line: 2646, column: 17, scope: !1209)
!1212 = !DILocation(line: 2646, column: 25, scope: !1209)
!1213 = !DILocation(line: 2646, column: 53, scope: !1209)
!1214 = !DILocation(line: 2648, column: 13, scope: !1209)
!1215 = !DILocation(line: 2655, column: 49, scope: !1216)
!1216 = distinct !DILexicalBlock(scope: !620, file: !3, line: 2655, column: 13)
!1217 = !DILocation(line: 2655, column: 13, scope: !620)
!1218 = !DILocation(line: 5023, column: 71, scope: !1219, inlinedAt: !1225)
!1219 = distinct !DISubprogram(name: "sm_get_connection_for_handle", scope: !3, file: !3, line: 5023, type: !1220, isLocal: true, isDefinition: true, scopeLine: 5024, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1222)
!1220 = !DISubroutineType(types: !1221)
!1221 = !{!454, !327}
!1222 = !{!1223, !1224}
!1223 = !DILocalVariable(name: "con_handle", arg: 1, scope: !1219, file: !3, line: 5023, type: !327)
!1224 = !DILocalVariable(name: "hci_con", scope: !1219, file: !3, line: 5025, type: !320)
!1225 = distinct !DILocation(line: 2659, column: 39, scope: !620)
!1226 = !DILocation(line: 5025, column: 36, scope: !1219, inlinedAt: !1225)
!1227 = !DILocation(line: 5025, column: 26, scope: !1219, inlinedAt: !1225)
!1228 = !DILocation(line: 5026, column: 10, scope: !1229, inlinedAt: !1225)
!1229 = distinct !DILexicalBlock(scope: !1219, file: !3, line: 5026, column: 9)
!1230 = !DILocation(line: 5029, column: 22, scope: !1219, inlinedAt: !1225)
!1231 = !DILocation(line: 5026, column: 9, scope: !1219, inlinedAt: !1225)
!1232 = !DILocation(line: 2659, column: 26, scope: !620)
!1233 = !DILocation(line: 2660, column: 13, scope: !620)
!1234 = !DILocation(line: 2680, column: 54, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !620, file: !3, line: 2680, column: 13)
!1236 = !DILocation(line: 2680, column: 62, scope: !1235)
!1237 = !DILocation(line: 2680, column: 14, scope: !1235)
!1238 = !DILocation(line: 2680, column: 13, scope: !620)
!1239 = !DILocation(line: 2682, column: 66, scope: !1240)
!1240 = distinct !DILexicalBlock(scope: !1235, file: !3, line: 2680, column: 129)
!1241 = !DILocation(line: 2682, column: 13, scope: !1240)
!1242 = !DILocation(line: 2683, column: 13, scope: !1240)
!1243 = !DILocation(line: 2687, column: 20, scope: !627)
!1244 = !DILocation(line: 2687, column: 45, scope: !627)
!1245 = !DILocation(line: 2687, column: 13, scope: !620)
!1246 = !DILocation(line: 2688, column: 13, scope: !626)
!1247 = !DILocation(line: 2688, column: 21, scope: !626)
!1248 = !DILocation(line: 2689, column: 23, scope: !626)
!1249 = !DILocation(line: 2690, column: 13, scope: !626)
!1250 = !DILocation(line: 2690, column: 23, scope: !626)
!1251 = !DILocation(line: 2691, column: 45, scope: !626)
!1252 = !DILocation(line: 2692, column: 51, scope: !626)
!1253 = !DILocation(line: 2692, column: 13, scope: !626)
!1254 = !DILocation(line: 2694, column: 9, scope: !627)
!1255 = !DILocation(line: 2696, column: 9, scope: !620)
!1256 = !DILocation(line: 2696, column: 18, scope: !620)
!1257 = !DILocation(line: 2702, column: 43, scope: !620)
!1258 = !DILocation(line: 2703, column: 29, scope: !620)
!1259 = !DILocation(line: 2703, column: 9, scope: !620)
!1260 = !DILocation(line: 2707, column: 13, scope: !634)
!1261 = !DILocation(line: 2707, column: 21, scope: !634)
!1262 = !DILocation(line: 2708, column: 23, scope: !634)
!1263 = !DILocation(line: 2709, column: 32, scope: !634)
!1264 = !DILocation(line: 2709, column: 23, scope: !634)
!1265 = !DILocation(line: 2710, column: 55, scope: !634)
!1266 = !{!870, !718, i64 2}
!1267 = !DILocation(line: 2710, column: 43, scope: !634)
!1268 = !DILocation(line: 2710, column: 41, scope: !634)
!1269 = !DILocation(line: 2711, column: 51, scope: !634)
!1270 = !DILocation(line: 2711, column: 13, scope: !634)
!1271 = !DILocation(line: 2712, column: 44, scope: !634)
!1272 = !DILocation(line: 2712, column: 13, scope: !634)
!1273 = !DILocation(line: 2713, column: 51, scope: !634)
!1274 = !DILocation(line: 2713, column: 39, scope: !634)
!1275 = !DILocation(line: 2713, column: 13, scope: !634)
!1276 = !DILocation(line: 2714, column: 73, scope: !634)
!1277 = !DILocation(line: 2714, column: 96, scope: !634)
!1278 = !DILocation(line: 2714, column: 115, scope: !634)
!1279 = !DILocation(line: 2715, column: 69, scope: !634)
!1280 = !DILocation(line: 2715, column: 76, scope: !634)
!1281 = !DILocation(line: 2715, column: 101, scope: !634)
!1282 = !DILocation(line: 2715, column: 66, scope: !634)
!1283 = !DILocation(line: 2714, column: 13, scope: !634)
!1284 = !DILocation(line: 2717, column: 9, scope: !635)
!1285 = !DILocation(line: 2817, column: 13, scope: !637)
!1286 = !DILocation(line: 2817, column: 22, scope: !637)
!1287 = !DILocation(line: 2818, column: 25, scope: !637)
!1288 = !DILocation(line: 2818, column: 13, scope: !637)
!1289 = !DILocation(line: 2819, column: 41, scope: !637)
!1290 = !DILocation(line: 2820, column: 53, scope: !637)
!1291 = !DILocation(line: 2820, column: 34, scope: !637)
!1292 = !DILocation(line: 2820, column: 22, scope: !637)
!1293 = !DILocation(line: 2821, column: 53, scope: !637)
!1294 = !DILocation(line: 2821, column: 34, scope: !637)
!1295 = !DILocation(line: 2821, column: 22, scope: !637)
!1296 = !DILocation(line: 2825, column: 49, scope: !637)
!1297 = !DILocation(line: 2825, column: 81, scope: !637)
!1298 = !DILocation(line: 2825, column: 88, scope: !637)
!1299 = !{!771, !773, i64 240}
!1300 = !DILocation(line: 2825, column: 13, scope: !637)
!1301 = !DILocation(line: 2826, column: 73, scope: !637)
!1302 = !DILocation(line: 2826, column: 96, scope: !637)
!1303 = !DILocation(line: 2827, column: 38, scope: !637)
!1304 = !DILocation(line: 2826, column: 13, scope: !637)
!1305 = !DILocation(line: 2829, column: 9, scope: !635)
!1306 = !DILocation(line: 2832, column: 40, scope: !635)
!1307 = !DILocation(line: 2832, column: 13, scope: !635)
!1308 = !DILocation(line: 2833, column: 41, scope: !635)
!1309 = !DILocation(line: 2834, column: 51, scope: !635)
!1310 = !DILocation(line: 2834, column: 112, scope: !635)
!1311 = !DILocation(line: 2834, column: 99, scope: !635)
!1312 = !DILocation(line: 2834, column: 13, scope: !635)
!1313 = !DILocalVariable(name: "sm_conn", arg: 1, scope: !1314, file: !3, line: 659, type: !454)
!1314 = distinct !DISubprogram(name: "sm_timeout_reset", scope: !3, file: !3, line: 659, type: !1124, isLocal: true, isDefinition: true, scopeLine: 660, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1315)
!1315 = !{!1313}
!1316 = !DILocation(line: 659, column: 47, scope: !1314, inlinedAt: !1317)
!1317 = distinct !DILocation(line: 2835, column: 13, scope: !635)
!1318 = !DILocation(line: 661, column: 5, scope: !1314, inlinedAt: !1317)
!1319 = !DILocation(line: 2836, column: 13, scope: !635)
!1320 = !DILocation(line: 2950, column: 40, scope: !635)
!1321 = !DILocation(line: 2950, column: 13, scope: !635)
!1322 = !DILocalVariable(name: "flags", scope: !1323, file: !3, line: 1424, type: !370)
!1323 = distinct !DISubprogram(name: "sm_key_distribution_flags_for_auth_req", scope: !3, file: !3, line: 1422, type: !854, isLocal: true, isDefinition: true, scopeLine: 1423, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1324)
!1324 = !{!1322}
!1325 = !DILocation(line: 1424, column: 9, scope: !1323, inlinedAt: !1326)
!1326 = distinct !DILocation(line: 2951, column: 38, scope: !635)
!1327 = !DILocation(line: 1425, column: 9, scope: !1328, inlinedAt: !1326)
!1328 = distinct !DILexicalBlock(scope: !1323, file: !3, line: 1425, column: 9)
!1329 = !DILocation(line: 1425, column: 17, scope: !1328, inlinedAt: !1326)
!1330 = !{!770, !718, i64 312}
!1331 = !DILocation(line: 1425, column: 29, scope: !1328, inlinedAt: !1326)
!1332 = !DILocation(line: 1425, column: 9, scope: !1323, inlinedAt: !1326)
!1333 = !DILocation(line: 2697, column: 13, scope: !620)
!1334 = !DILocation(line: 2953, column: 24, scope: !1335)
!1335 = distinct !DILexicalBlock(scope: !635, file: !3, line: 2953, column: 17)
!1336 = !{!771, !718, i64 48}
!1337 = !DILocation(line: 2953, column: 17, scope: !1335)
!1338 = !DILocation(line: 2953, column: 17, scope: !635)
!1339 = !DILocation(line: 2962, column: 62, scope: !635)
!1340 = !DILocation(line: 2962, column: 129, scope: !635)
!1341 = !DILocation(line: 2962, column: 80, scope: !635)
!1342 = !DILocation(line: 2962, column: 147, scope: !635)
!1343 = !DILocation(line: 2962, column: 13, scope: !1344)
!1344 = !DILexicalBlockFile(scope: !635, file: !3, discriminator: 1)
!1345 = !DILocation(line: 2963, column: 62, scope: !635)
!1346 = !DILocation(line: 2963, column: 129, scope: !635)
!1347 = !DILocation(line: 2963, column: 80, scope: !635)
!1348 = !DILocation(line: 2963, column: 147, scope: !635)
!1349 = !DILocation(line: 2963, column: 13, scope: !1344)
!1350 = !DILocation(line: 2965, column: 88, scope: !635)
!1351 = !DILocation(line: 2965, column: 39, scope: !635)
!1352 = !DILocalVariable(name: "key_set", arg: 1, scope: !1353, file: !3, line: 1092, type: !311)
!1353 = distinct !DISubprogram(name: "sm_setup_key_distribution", scope: !3, file: !3, line: 1092, type: !1354, isLocal: true, isDefinition: true, scopeLine: 1093, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1356)
!1354 = !DISubroutineType(types: !1355)
!1355 = !{null, !311}
!1356 = !{!1352}
!1357 = !DILocation(line: 1092, column: 47, scope: !1353, inlinedAt: !1358)
!1358 = distinct !DILocation(line: 2965, column: 13, scope: !1344)
!1359 = !DILocation(line: 1094, column: 12, scope: !1353, inlinedAt: !1358)
!1360 = !DILocation(line: 1094, column: 45, scope: !1353, inlinedAt: !1358)
!1361 = !{!771, !718, i64 25}
!1362 = !DILocalVariable(name: "key_set", arg: 1, scope: !1363, file: !3, line: 1075, type: !311)
!1363 = distinct !DISubprogram(name: "sm_key_distribution_flags_for_set", scope: !3, file: !3, line: 1075, type: !1364, isLocal: true, isDefinition: true, scopeLine: 1076, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1366)
!1364 = !DISubroutineType(types: !1365)
!1365 = !{!370, !311}
!1366 = !{!1362, !1367}
!1367 = !DILocalVariable(name: "flags", scope: !1363, file: !3, line: 1077, type: !370)
!1368 = !DILocation(line: 1075, column: 54, scope: !1363, inlinedAt: !1369)
!1369 = distinct !DILocation(line: 1095, column: 43, scope: !1353, inlinedAt: !1358)
!1370 = !DILocation(line: 1077, column: 9, scope: !1363, inlinedAt: !1369)
!1371 = !DILocation(line: 1078, column: 9, scope: !1372, inlinedAt: !1369)
!1372 = distinct !DILexicalBlock(scope: !1363, file: !3, line: 1078, column: 9)
!1373 = !DILocation(line: 1078, column: 17, scope: !1372, inlinedAt: !1369)
!1374 = !DILocation(line: 1078, column: 9, scope: !1363, inlinedAt: !1369)
!1375 = !DILocation(line: 1082, column: 17, scope: !1376, inlinedAt: !1369)
!1376 = distinct !DILexicalBlock(scope: !1363, file: !3, line: 1082, column: 9)
!1377 = !DILocation(line: 1084, column: 15, scope: !1378, inlinedAt: !1369)
!1378 = distinct !DILexicalBlock(scope: !1376, file: !3, line: 1082, column: 38)
!1379 = !DILocation(line: 1082, column: 9, scope: !1363, inlinedAt: !1369)
!1380 = !DILocation(line: 1086, column: 9, scope: !1363, inlinedAt: !1369)
!1381 = !DILocation(line: 1095, column: 43, scope: !1353, inlinedAt: !1358)
!1382 = !DILocation(line: 1095, column: 12, scope: !1353, inlinedAt: !1358)
!1383 = !DILocation(line: 1095, column: 41, scope: !1353, inlinedAt: !1358)
!1384 = !{!771, !718, i64 23}
!1385 = !DILocation(line: 1096, column: 12, scope: !1353, inlinedAt: !1358)
!1386 = !DILocation(line: 1096, column: 46, scope: !1353, inlinedAt: !1358)
!1387 = !{!771, !718, i64 24}
!1388 = !DILocation(line: 2967, column: 51, scope: !635)
!1389 = !DILocation(line: 2967, column: 13, scope: !635)
!1390 = !DILocation(line: 659, column: 47, scope: !1314, inlinedAt: !1391)
!1391 = distinct !DILocation(line: 2968, column: 13, scope: !635)
!1392 = !DILocation(line: 661, column: 5, scope: !1314, inlinedAt: !1391)
!1393 = !DILocation(line: 2970, column: 18, scope: !1394)
!1394 = distinct !DILexicalBlock(scope: !635, file: !3, line: 2970, column: 17)
!1395 = !DILocation(line: 2970, column: 25, scope: !1394)
!1396 = !DILocation(line: 2970, column: 51, scope: !1394)
!1397 = !DILocation(line: 2970, column: 61, scope: !1398)
!1398 = !DILexicalBlockFile(scope: !1394, file: !3, discriminator: 1)
!1399 = !DILocation(line: 2970, column: 86, scope: !1398)
!1400 = !DILocation(line: 2970, column: 17, scope: !1344)
!1401 = !DILocation(line: 2971, column: 17, scope: !1402)
!1402 = distinct !DILexicalBlock(scope: !1394, file: !3, line: 2970, column: 101)
!1403 = !DILocation(line: 2972, column: 13, scope: !1402)
!1404 = !DILocation(line: 2977, column: 13, scope: !641)
!1405 = !DILocation(line: 2977, column: 21, scope: !641)
!1406 = !DILocation(line: 2978, column: 23, scope: !641)
!1407 = !DILocation(line: 2979, column: 25, scope: !641)
!1408 = !DILocation(line: 2979, column: 13, scope: !641)
!1409 = !DILocation(line: 2980, column: 17, scope: !1410)
!1410 = distinct !DILexicalBlock(scope: !641, file: !3, line: 2980, column: 17)
!1411 = !DILocation(line: 2980, column: 17, scope: !641)
!1412 = !DILocation(line: 2985, column: 51, scope: !641)
!1413 = !DILocation(line: 2985, column: 13, scope: !641)
!1414 = !DILocation(line: 659, column: 47, scope: !1314, inlinedAt: !1415)
!1415 = distinct !DILocation(line: 2986, column: 13, scope: !641)
!1416 = !DILocation(line: 661, column: 5, scope: !1314, inlinedAt: !1415)
!1417 = !DILocation(line: 2988, column: 9, scope: !635)
!1418 = !DILocalVariable(name: "sm_conn", arg: 1, scope: !1419, file: !3, line: 1146, type: !454)
!1419 = distinct !DISubprogram(name: "sm_next_responding_state", scope: !3, file: !3, line: 1146, type: !1124, isLocal: true, isDefinition: true, scopeLine: 1147, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1420)
!1420 = !{!1418}
!1421 = !DILocation(line: 1146, column: 62, scope: !1419, inlinedAt: !1422)
!1422 = distinct !DILocation(line: 2995, column: 13, scope: !635)
!1423 = !DILocation(line: 1148, column: 91, scope: !1419, inlinedAt: !1422)
!1424 = !DILocation(line: 1148, column: 30, scope: !1419, inlinedAt: !1422)
!1425 = !DILocation(line: 703, column: 13, scope: !814, inlinedAt: !1426)
!1426 = distinct !DILocation(line: 2996, column: 13, scope: !635)
!1427 = !DILocation(line: 703, column: 31, scope: !814, inlinedAt: !1426)
!1428 = !DILocation(line: 705, column: 5, scope: !814, inlinedAt: !1426)
