temp.o:	file format ELF32-i386

.debug_info contents:
0x00000000: Compile Unit: length = 0x00003feb version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x00003fef)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)")
              DW_AT_language	(DW_LANG_C99)
              DW_AT_name	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
              DW_AT_GNU_pubnames	(true)
              DW_AT_low_pc	(0x0000000000000000)
              DW_AT_ranges	(0x000000f0
                 [0x00000000 - 0x00002a9d)
                 [0x00002a9d - 0x000063fc)
                 [0x000063fc - 0x00006d3f)
                 [0x00006d3f - 0x00006f1a)
                 [0x00006f1a - 0x00007055)
                 [0x00000000 - 0x00000009)
                 [0x00000009 - 0x00000038)
                 [0x00000038 - 0x00000084)
                 [0x00000084 - 0x00000098))

0x00000026:   DW_TAG_variable
                DW_AT_name	("app_info_debug_enable")
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/profile_stack_debug.h")
                DW_AT_decl_line	(190)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000037:   DW_TAG_base_type
                DW_AT_name	("int")
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_byte_size	(0x04)

0x0000003e:   DW_TAG_variable
                DW_AT_name	("gap_random_adress_type")
                DW_AT_type	(cu + 0x0050 "gap_random_address_type_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                DW_AT_decl_line	(666)
                DW_AT_location	(DW_OP_addr 0x4)

0x00000050:   DW_TAG_typedef
                DW_AT_type	(cu + 0x005b "enumeration ")
                DW_AT_name	("gap_random_address_type_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gap.h")
                DW_AT_decl_line	(117)

0x0000005b:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Protocol/include/ble/gap.h")
                DW_AT_decl_line	(112)

0x0000005f:     DW_TAG_enumerator
                  DW_AT_name	("GAP_RANDOM_ADDRESS_TYPE_OFF")
                  DW_AT_const_value	(0)

0x00000065:     DW_TAG_enumerator
                  DW_AT_name	("GAP_RANDOM_ADDRESS_TYPE_STATIC")
                  DW_AT_const_value	(1)

0x0000006b:     DW_TAG_enumerator
                  DW_AT_name	("GAP_RANDOM_ADDRESS_NON_RESOLVABLE")
                  DW_AT_const_value	(2)

0x00000071:     DW_TAG_enumerator
                  DW_AT_name	("GAP_RANDOM_ADDRESS_RESOLVABLE")
                  DW_AT_const_value	(3)

0x00000077:     NULL

0x00000078:   DW_TAG_variable
                DW_AT_name	("gap_random_adress_update_period")
                DW_AT_type	(cu + 0x008a "uint32_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                DW_AT_decl_line	(668)
                DW_AT_location	(DW_OP_addr 0x0)

0x0000008a:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0095 "unsigned int")
                DW_AT_name	("uint32_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(48)

0x00000095:   DW_TAG_base_type
                DW_AT_name	("unsigned int")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x04)

0x0000009c:   DW_TAG_variable
                DW_AT_name	("sm_global_info")
                DW_AT_type	(cu + 0x00ae "sm_info_t*")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                DW_AT_decl_line	(434)
                DW_AT_location	(DW_OP_addr 0x0)

0x000000ae:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x00b3 "sm_info_t")

0x000000b3:   DW_TAG_typedef
                DW_AT_type	(cu + 0x00bf "structure ")
                DW_AT_name	("sm_info_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                DW_AT_decl_line	(429)

0x000000bf:   DW_TAG_structure_type
                DW_AT_byte_size	(0x01e0)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                DW_AT_decl_line	(318)

0x000000c5:     DW_TAG_member
                  DW_AT_name	("the_setup")
                  DW_AT_type	(cu + 0x02e8 "sm_setup_context_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(319)
                  DW_AT_data_member_location	(0x00)

0x000000d2:     DW_TAG_member
                  DW_AT_name	("test_use_fixed_local_csrk")
                  DW_AT_type	(cu + 0x05b9 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(320)
                  DW_AT_data_member_location	(0x0134)

0x000000e0:     DW_TAG_member
                  DW_AT_name	("sm_accepted_stk_generation_methods")
                  DW_AT_type	(cu + 0x05b9 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(323)
                  DW_AT_data_member_location	(0x0135)

0x000000ee:     DW_TAG_member
                  DW_AT_name	("sm_max_encryption_key_size")
                  DW_AT_type	(cu + 0x05b9 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(324)
                  DW_AT_data_member_location	(0x0136)

0x000000fc:     DW_TAG_member
                  DW_AT_name	("sm_min_encryption_key_size")
                  DW_AT_type	(cu + 0x05b9 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(325)
                  DW_AT_data_member_location	(0x0137)

0x0000010a:     DW_TAG_member
                  DW_AT_name	("sm_auth_req")
                  DW_AT_type	(cu + 0x05b9 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(326)
                  DW_AT_data_member_location	(0x0138)

0x00000118:     DW_TAG_member
                  DW_AT_name	("sm_io_capabilities")
                  DW_AT_type	(cu + 0x05b9 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(327)
                  DW_AT_data_member_location	(0x0139)

0x00000126:     DW_TAG_member
                  DW_AT_name	("sm_request_security")
                  DW_AT_type	(cu + 0x05b9 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(328)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x013a)

0x00000137:     DW_TAG_member
                  DW_AT_name	("sm_master_auto_pair")
                  DW_AT_type	(cu + 0x05b9 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(329)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x02)
                  DW_AT_data_member_location	(0x013a)

0x00000148:     DW_TAG_member
                  DW_AT_name	("sm_master_pair_redo")
                  DW_AT_type	(cu + 0x05b9 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(330)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x02)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x013a)

0x00000159:     DW_TAG_member
                  DW_AT_name	("sm_fixed_legacy_pairing_passkey_in_display_role")
                  DW_AT_type	(cu + 0x008a "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(331)
                  DW_AT_data_member_location	(0x013c)

0x00000167:     DW_TAG_member
                  DW_AT_name	("sm_reconstruct_ltk_without_le_device_db_entry")
                  DW_AT_type	(cu + 0x05b9 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(332)
                  DW_AT_data_member_location	(0x0140)

0x00000175:     DW_TAG_member
                  DW_AT_name	("sm_persistent_er")
                  DW_AT_type	(cu + 0x05ff "sm_key_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(338)
                  DW_AT_data_member_location	(0x0141)

0x00000183:     DW_TAG_member
                  DW_AT_name	("sm_persistent_ir")
                  DW_AT_type	(cu + 0x05ff "sm_key_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(339)
                  DW_AT_data_member_location	(0x0151)

0x00000191:     DW_TAG_member
                  DW_AT_name	("sm_persistent_dhk")
                  DW_AT_type	(cu + 0x05ff "sm_key_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(342)
                  DW_AT_data_member_location	(0x0161)

0x0000019f:     DW_TAG_member
                  DW_AT_name	("sm_persistent_irk")
                  DW_AT_type	(cu + 0x05ff "sm_key_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(343)
                  DW_AT_data_member_location	(0x0171)

0x000001ad:     DW_TAG_member
                  DW_AT_name	("sm_persistent_irk_ready")
                  DW_AT_type	(cu + 0x05b9 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(344)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x04)
                  DW_AT_data_member_location	(0x0181)

0x000001be:     DW_TAG_member
                  DW_AT_name	("sm_irk_generate_address")
                  DW_AT_type	(cu + 0x05b9 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(345)
                  DW_AT_byte_size	(0x01)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x0181)

0x000001cf:     DW_TAG_member
                  DW_AT_name	("dkg_state")
                  DW_AT_type	(cu + 0x066a "derived_key_generation_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(346)
                  DW_AT_data_member_location	(0x0184)

0x000001dd:     DW_TAG_member
                  DW_AT_name	("rau_state")
                  DW_AT_type	(cu + 0x069e "random_address_update_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(352)
                  DW_AT_data_member_location	(0x0188)

0x000001eb:     DW_TAG_member
                  DW_AT_name	("sm_random_address")
                  DW_AT_type	(cu + 0x0635 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(353)
                  DW_AT_data_member_location	(0x018c)

0x000001f9:     DW_TAG_member
                  DW_AT_name	("sm_address_resolution_test")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(382)
                  DW_AT_data_member_location	(0x0194)

0x00000207:     DW_TAG_member
                  DW_AT_name	("sm_address_resolution_ah_calculation_active")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(383)
                  DW_AT_data_member_location	(0x0198)

0x00000215:     DW_TAG_member
                  DW_AT_name	("sm_address_resolution_addr_type")
                  DW_AT_type	(cu + 0x05b9 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(384)
                  DW_AT_data_member_location	(0x019c)

0x00000223:     DW_TAG_member
                  DW_AT_name	("sm_address_resolution_address")
                  DW_AT_type	(cu + 0x0635 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(385)
                  DW_AT_data_member_location	(0x019d)

0x00000231:     DW_TAG_member
                  DW_AT_name	("sm_address_resolution_context")
                  DW_AT_type	(cu + 0x05b8 "*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(386)
                  DW_AT_data_member_location	(0x01a4)

0x0000023f:     DW_TAG_member
                  DW_AT_name	("sm_address_resolution_mode")
                  DW_AT_type	(cu + 0x06d8 "address_resolution_mode_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(387)
                  DW_AT_data_member_location	(0x01a8)

0x0000024d:     DW_TAG_member
                  DW_AT_name	("sm_address_resolution_general_queue")
                  DW_AT_type	(cu + 0x06fa "linked_list_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(388)
                  DW_AT_data_member_location	(0x01ac)

0x0000025b:     DW_TAG_member
                  DW_AT_name	("sm_aes128_state")
                  DW_AT_type	(cu + 0x070a "sm_aes128_state_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(391)
                  DW_AT_data_member_location	(0x01b0)

0x00000269:     DW_TAG_member
                  DW_AT_name	("sm_aes128_context")
                  DW_AT_type	(cu + 0x05b8 "*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(392)
                  DW_AT_data_member_location	(0x01b4)

0x00000277:     DW_TAG_member
                  DW_AT_name	("sm_random_context")
                  DW_AT_type	(cu + 0x05b8 "*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(401)
                  DW_AT_data_member_location	(0x01b8)

0x00000285:     DW_TAG_member
                  DW_AT_name	("hci_event_callback_registration")
                  DW_AT_type	(cu + 0x0726 "btstack_packet_callback_registration_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(404)
                  DW_AT_data_member_location	(0x01bc)

0x00000293:     DW_TAG_member
                  DW_AT_name	("sm_event_callback_registration")
                  DW_AT_type	(cu + 0x0726 "btstack_packet_callback_registration_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(405)
                  DW_AT_data_member_location	(0x01c4)

0x000002a1:     DW_TAG_member
                  DW_AT_name	("sm_event_handlers")
                  DW_AT_type	(cu + 0x06fa "linked_list_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(408)
                  DW_AT_data_member_location	(0x01cc)

0x000002af:     DW_TAG_member
                  DW_AT_name	("sm_active_connection_handle")
                  DW_AT_type	(cu + 0x064c "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(422)
                  DW_AT_data_member_location	(0x01d0)

0x000002bd:     DW_TAG_member
                  DW_AT_name	("sm_get_oob_data")
                  DW_AT_type	(cu + 0x0784 "subroutine int*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(426)
                  DW_AT_data_member_location	(0x01d4)

0x000002cb:     DW_TAG_member
                  DW_AT_name	("reset_passkey_cbk")
                  DW_AT_type	(cu + 0x079e "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(427)
                  DW_AT_data_member_location	(0x01d8)

0x000002d9:     DW_TAG_member
                  DW_AT_name	("reconnect_enc_delay")
                  DW_AT_type	(cu + 0x064c "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(428)
                  DW_AT_data_member_location	(0x01dc)

0x000002e7:     NULL

0x000002e8:   DW_TAG_typedef
                DW_AT_type	(cu + 0x02f4 "sm_setup_context")
                DW_AT_name	("sm_setup_context_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                DW_AT_decl_line	(308)

0x000002f4:   DW_TAG_structure_type
                DW_AT_name	("sm_setup_context")
                DW_AT_byte_size	(0x0134)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                DW_AT_decl_line	(236)

0x000002fd:     DW_TAG_member
                  DW_AT_name	("sm_timeout")
                  DW_AT_type	(cu + 0x04f3 "btstack_timer_source_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(238)
                  DW_AT_data_member_location	(0x00)

0x00000309:     DW_TAG_member
                  DW_AT_name	("sm_pairing_failed_reason")
                  DW_AT_type	(cu + 0x05b9 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(241)
                  DW_AT_data_member_location	(0x14)

0x00000315:     DW_TAG_member
                  DW_AT_name	("sm_user_response")
                  DW_AT_type	(cu + 0x05b9 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(244)
                  DW_AT_data_member_location	(0x15)

0x00000321:     DW_TAG_member
                  DW_AT_name	("sm_keypress_notification")
                  DW_AT_type	(cu + 0x05b9 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(245)
                  DW_AT_data_member_location	(0x16)

0x0000032d:     DW_TAG_member
                  DW_AT_name	("sm_key_distribution_send_set")
                  DW_AT_type	(cu + 0x05b9 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(248)
                  DW_AT_data_member_location	(0x17)

0x00000339:     DW_TAG_member
                  DW_AT_name	("sm_key_distribution_send_set_save")
                  DW_AT_type	(cu + 0x05b9 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(249)
                  DW_AT_data_member_location	(0x18)

0x00000345:     DW_TAG_member
                  DW_AT_name	("sm_key_distribution_received_set")
                  DW_AT_type	(cu + 0x05b9 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(250)
                  DW_AT_data_member_location	(0x19)

0x00000351:     DW_TAG_member
                  DW_AT_name	("sm_stk_generation_method")
                  DW_AT_type	(cu + 0x05cb "stk_generation_method_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(253)
                  DW_AT_data_member_location	(0x1c)

0x0000035d:     DW_TAG_member
                  DW_AT_name	("sm_tk")
                  DW_AT_type	(cu + 0x05ff "sm_key_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(254)
                  DW_AT_data_member_location	(0x20)

0x00000369:     DW_TAG_member
                  DW_AT_name	("sm_use_secure_connections")
                  DW_AT_type	(cu + 0x05b9 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(255)
                  DW_AT_data_member_location	(0x30)

0x00000375:     DW_TAG_member
                  DW_AT_name	("sm_c1_t3_value")
                  DW_AT_type	(cu + 0x05ff "sm_key_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(257)
                  DW_AT_data_member_location	(0x31)

0x00000382:     DW_TAG_member
                  DW_AT_name	("sm_m_preq")
                  DW_AT_type	(cu + 0x061d "sm_pairing_packet_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(258)
                  DW_AT_data_member_location	(0x41)

0x0000038f:     DW_TAG_member
                  DW_AT_name	("sm_s_pres")
                  DW_AT_type	(cu + 0x061d "sm_pairing_packet_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(259)
                  DW_AT_data_member_location	(0x48)

0x0000039c:     DW_TAG_member
                  DW_AT_name	("sm_local_random")
                  DW_AT_type	(cu + 0x05ff "sm_key_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(260)
                  DW_AT_data_member_location	(0x4f)

0x000003a9:     DW_TAG_member
                  DW_AT_name	("sm_local_confirm")
                  DW_AT_type	(cu + 0x05ff "sm_key_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(261)
                  DW_AT_data_member_location	(0x5f)

0x000003b6:     DW_TAG_member
                  DW_AT_name	("sm_peer_random")
                  DW_AT_type	(cu + 0x05ff "sm_key_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(262)
                  DW_AT_data_member_location	(0x6f)

0x000003c3:     DW_TAG_member
                  DW_AT_name	("sm_peer_confirm")
                  DW_AT_type	(cu + 0x05ff "sm_key_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(263)
                  DW_AT_data_member_location	(0x7f)

0x000003d0:     DW_TAG_member
                  DW_AT_name	("sm_m_addr_type")
                  DW_AT_type	(cu + 0x05b9 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(264)
                  DW_AT_data_member_location	(0x8f)

0x000003dd:     DW_TAG_member
                  DW_AT_name	("sm_s_addr_type")
                  DW_AT_type	(cu + 0x05b9 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(265)
                  DW_AT_data_member_location	(0x90)

0x000003ea:     DW_TAG_member
                  DW_AT_name	("sm_m_address")
                  DW_AT_type	(cu + 0x0635 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(266)
                  DW_AT_data_member_location	(0x91)

0x000003f7:     DW_TAG_member
                  DW_AT_name	("sm_s_address")
                  DW_AT_type	(cu + 0x0635 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(267)
                  DW_AT_data_member_location	(0x97)

0x00000404:     DW_TAG_member
                  DW_AT_name	("sm_ltk")
                  DW_AT_type	(cu + 0x05ff "sm_key_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(268)
                  DW_AT_data_member_location	(0x9d)

0x00000411:     DW_TAG_member
                  DW_AT_name	("sm_state_vars")
                  DW_AT_type	(cu + 0x05b9 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(270)
                  DW_AT_data_member_location	(0xad)

0x0000041e:     DW_TAG_member
                  DW_AT_name	("sm_local_y")
                  DW_AT_type	(cu + 0x064c "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(288)
                  DW_AT_data_member_location	(0xae)

0x0000042b:     DW_TAG_member
                  DW_AT_name	("sm_local_div")
                  DW_AT_type	(cu + 0x064c "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(289)
                  DW_AT_data_member_location	(0xb0)

0x00000438:     DW_TAG_member
                  DW_AT_name	("sm_local_ediv")
                  DW_AT_type	(cu + 0x064c "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(290)
                  DW_AT_data_member_location	(0xb2)

0x00000445:     DW_TAG_member
                  DW_AT_name	("sm_local_rand")
                  DW_AT_type	(cu + 0x065e "uint8_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(291)
                  DW_AT_data_member_location	(0xb4)

0x00000452:     DW_TAG_member
                  DW_AT_name	("sm_local_ltk")
                  DW_AT_type	(cu + 0x05ff "sm_key_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(292)
                  DW_AT_data_member_location	(0xbc)

0x0000045f:     DW_TAG_member
                  DW_AT_name	("sm_local_csrk")
                  DW_AT_type	(cu + 0x05ff "sm_key_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(293)
                  DW_AT_data_member_location	(0xcc)

0x0000046c:     DW_TAG_member
                  DW_AT_name	("sm_local_irk")
                  DW_AT_type	(cu + 0x05ff "sm_key_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(294)
                  DW_AT_data_member_location	(0xdc)

0x00000479:     DW_TAG_member
                  DW_AT_name	("sm_peer_y")
                  DW_AT_type	(cu + 0x064c "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(298)
                  DW_AT_data_member_location	(0xec)

0x00000486:     DW_TAG_member
                  DW_AT_name	("sm_peer_div")
                  DW_AT_type	(cu + 0x064c "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(299)
                  DW_AT_data_member_location	(0xee)

0x00000493:     DW_TAG_member
                  DW_AT_name	("sm_peer_ediv")
                  DW_AT_type	(cu + 0x064c "uint16_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(300)
                  DW_AT_data_member_location	(0xf0)

0x000004a0:     DW_TAG_member
                  DW_AT_name	("sm_peer_rand")
                  DW_AT_type	(cu + 0x065e "uint8_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(301)
                  DW_AT_data_member_location	(0xf2)

0x000004ad:     DW_TAG_member
                  DW_AT_name	("sm_peer_ltk")
                  DW_AT_type	(cu + 0x05ff "sm_key_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(302)
                  DW_AT_data_member_location	(0xfa)

0x000004ba:     DW_TAG_member
                  DW_AT_name	("sm_peer_irk")
                  DW_AT_type	(cu + 0x05ff "sm_key_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(303)
                  DW_AT_data_member_location	(0x010a)

0x000004c8:     DW_TAG_member
                  DW_AT_name	("sm_peer_csrk")
                  DW_AT_type	(cu + 0x05ff "sm_key_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(304)
                  DW_AT_data_member_location	(0x011a)

0x000004d6:     DW_TAG_member
                  DW_AT_name	("sm_peer_addr_type")
                  DW_AT_type	(cu + 0x05b9 "uint8_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(305)
                  DW_AT_data_member_location	(0x012a)

0x000004e4:     DW_TAG_member
                  DW_AT_name	("sm_peer_address")
                  DW_AT_type	(cu + 0x0635 "bd_addr_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(306)
                  DW_AT_data_member_location	(0x012b)

0x000004f2:     NULL

0x000004f3:   DW_TAG_typedef
                DW_AT_type	(cu + 0x04fe "btstack_timer_source")
                DW_AT_name	("btstack_timer_source_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                DW_AT_decl_line	(19)

0x000004fe:   DW_TAG_structure_type
                DW_AT_name	("btstack_timer_source")
                DW_AT_byte_size	(0x14)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                DW_AT_decl_line	(7)

0x00000506:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x0582 "btstack_linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(8)
                  DW_AT_data_member_location	(0x00)

0x00000512:     DW_TAG_member
                  DW_AT_name	("timeout")
                  DW_AT_type	(cu + 0x008a "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(10)
                  DW_AT_data_member_location	(0x04)

0x0000051e:     DW_TAG_member
                  DW_AT_name	("timeout_interval")
                  DW_AT_type	(cu + 0x008a "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(11)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x10)
                  DW_AT_bit_offset	(0x10)
                  DW_AT_data_member_location	(0x08)

0x0000052d:     DW_TAG_member
                  DW_AT_name	("timer_type")
                  DW_AT_type	(cu + 0x008a "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(12)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x04)
                  DW_AT_bit_offset	(0x0c)
                  DW_AT_data_member_location	(0x08)

0x0000053c:     DW_TAG_member
                  DW_AT_name	("timer_tick_overflow")
                  DW_AT_type	(cu + 0x008a "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(13)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x0b)
                  DW_AT_data_member_location	(0x08)

0x0000054b:     DW_TAG_member
                  DW_AT_name	("loop_flag")
                  DW_AT_type	(cu + 0x008a "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(14)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x01)
                  DW_AT_bit_offset	(0x0a)
                  DW_AT_data_member_location	(0x08)

0x0000055a:     DW_TAG_member
                  DW_AT_name	("loop_times")
                  DW_AT_type	(cu + 0x008a "uint32_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(15)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x0a)
                  DW_AT_bit_offset	(0x00)
                  DW_AT_data_member_location	(0x08)

0x00000569:     DW_TAG_member
                  DW_AT_name	("process")
                  DW_AT_type	(cu + 0x05a7 "subroutine *")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(17)
                  DW_AT_data_member_location	(0x0c)

0x00000575:     DW_TAG_member
                  DW_AT_name	("context")
                  DW_AT_type	(cu + 0x05b8 "*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_sys_timer.h")
                  DW_AT_decl_line	(18)
                  DW_AT_data_member_location	(0x10)

0x00000581:     NULL

0x00000582:   DW_TAG_typedef
                DW_AT_type	(cu + 0x058d "btstack_linked_item")
                DW_AT_name	("btstack_linked_item_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(55)

0x0000058d:   DW_TAG_structure_type
                DW_AT_name	("btstack_linked_item")
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(53)

0x00000595:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(cu + 0x05a2 "btstack_linked_item*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                  DW_AT_decl_line	(54)
                  DW_AT_data_member_location	(0x00)

0x000005a1:     NULL

0x000005a2:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x058d "btstack_linked_item")

0x000005a7:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x05ac "subroutine ")

0x000005ac:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x000005ad:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x05b3 "btstack_timer_source*")

0x000005b2:     NULL

0x000005b3:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x04fe "btstack_timer_source")

0x000005b8:   DW_TAG_pointer_type

0x000005b9:   DW_TAG_typedef
                DW_AT_type	(cu + 0x05c4 "unsigned char")
                DW_AT_name	("uint8_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(44)

0x000005c4:   DW_TAG_base_type
                DW_AT_name	("unsigned char")
                DW_AT_encoding	(DW_ATE_unsigned_char)
                DW_AT_byte_size	(0x01)

0x000005cb:   DW_TAG_typedef
                DW_AT_type	(cu + 0x05d6 "enumeration ")
                DW_AT_name	("stk_generation_method_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                DW_AT_decl_line	(180)

0x000005d6:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                DW_AT_decl_line	(173)

0x000005da:     DW_TAG_enumerator
                  DW_AT_name	("JUST_WORKS")
                  DW_AT_const_value	(0)

0x000005e0:     DW_TAG_enumerator
                  DW_AT_name	("PK_RESP_INPUT")
                  DW_AT_const_value	(1)

0x000005e6:     DW_TAG_enumerator
                  DW_AT_name	("PK_INIT_INPUT")
                  DW_AT_const_value	(2)

0x000005ec:     DW_TAG_enumerator
                  DW_AT_name	("OK_BOTH_INPUT")
                  DW_AT_const_value	(3)

0x000005f2:     DW_TAG_enumerator
                  DW_AT_name	("NK_BOTH_INPUT")
                  DW_AT_const_value	(4)

0x000005f8:     DW_TAG_enumerator
                  DW_AT_name	("OOB")
                  DW_AT_const_value	(5)

0x000005fe:     NULL

0x000005ff:   DW_TAG_typedef
                DW_AT_type	(cu + 0x060a "uint8_t[]")
                DW_AT_name	("sm_key_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(76)

0x0000060a:   DW_TAG_array_type
                DW_AT_type	(cu + 0x05b9 "uint8_t")

0x0000060f:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0616 "sizetype")
                  DW_AT_count	(0x10)

0x00000615:     NULL

0x00000616:   DW_TAG_base_type
                DW_AT_name	("sizetype")
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_unsigned)

0x0000061d:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0629 "uint8_t[]")
                DW_AT_name	("sm_pairing_packet_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Host/include/common/hci.h")
                DW_AT_decl_line	(452)

0x00000629:   DW_TAG_array_type
                DW_AT_type	(cu + 0x05b9 "uint8_t")

0x0000062e:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0616 "sizetype")
                  DW_AT_count	(0x07)

0x00000634:     NULL

0x00000635:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0640 "uint8_t[]")
                DW_AT_name	("bd_addr_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/btstack/btstack_typedef.h")
                DW_AT_decl_line	(7)

0x00000640:   DW_TAG_array_type
                DW_AT_type	(cu + 0x05b9 "uint8_t")

0x00000645:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0616 "sizetype")
                  DW_AT_count	(0x06)

0x0000064b:     NULL

0x0000064c:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0657 "unsigned short")
                DW_AT_name	("uint16_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(46)

0x00000657:   DW_TAG_base_type
                DW_AT_name	("unsigned short")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x02)

0x0000065e:   DW_TAG_array_type
                DW_AT_type	(cu + 0x05b9 "uint8_t")

0x00000663:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0616 "sizetype")
                  DW_AT_count	(0x08)

0x00000669:     NULL

0x0000066a:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0675 "enumeration ")
                DW_AT_name	("derived_key_generation_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                DW_AT_decl_line	(151)

0x00000675:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                DW_AT_decl_line	(144)

0x00000679:     DW_TAG_enumerator
                  DW_AT_name	("DKG_W4_WORKING")
                  DW_AT_const_value	(0)

0x0000067f:     DW_TAG_enumerator
                  DW_AT_name	("DKG_CALC_IRK")
                  DW_AT_const_value	(1)

0x00000685:     DW_TAG_enumerator
                  DW_AT_name	("DKG_W4_IRK")
                  DW_AT_const_value	(2)

0x0000068b:     DW_TAG_enumerator
                  DW_AT_name	("DKG_CALC_DHK")
                  DW_AT_const_value	(3)

0x00000691:     DW_TAG_enumerator
                  DW_AT_name	("DKG_W4_DHK")
                  DW_AT_const_value	(4)

0x00000697:     DW_TAG_enumerator
                  DW_AT_name	("DKG_READY")
                  DW_AT_const_value	(5)

0x0000069d:     NULL

0x0000069e:   DW_TAG_typedef
                DW_AT_type	(cu + 0x06a9 "enumeration ")
                DW_AT_name	("random_address_update_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                DW_AT_decl_line	(161)

0x000006a9:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                DW_AT_decl_line	(153)

0x000006ad:     DW_TAG_enumerator
                  DW_AT_name	("RAU_W4_WORKING")
                  DW_AT_const_value	(0)

0x000006b3:     DW_TAG_enumerator
                  DW_AT_name	("RAU_IDLE")
                  DW_AT_const_value	(1)

0x000006b9:     DW_TAG_enumerator
                  DW_AT_name	("RAU_GET_RANDOM")
                  DW_AT_const_value	(2)

0x000006bf:     DW_TAG_enumerator
                  DW_AT_name	("RAU_W4_RANDOM")
                  DW_AT_const_value	(3)

0x000006c5:     DW_TAG_enumerator
                  DW_AT_name	("RAU_GET_ENC")
                  DW_AT_const_value	(4)

0x000006cb:     DW_TAG_enumerator
                  DW_AT_name	("RAU_W4_ENC")
                  DW_AT_const_value	(5)

0x000006d1:     DW_TAG_enumerator
                  DW_AT_name	("RAU_SET_ADDRESS")
                  DW_AT_const_value	(6)

0x000006d7:     NULL

0x000006d8:   DW_TAG_typedef
                DW_AT_type	(cu + 0x06e3 "enumeration ")
                DW_AT_name	("address_resolution_mode_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                DW_AT_decl_line	(199)

0x000006e3:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                DW_AT_decl_line	(195)

0x000006e7:     DW_TAG_enumerator
                  DW_AT_name	("ADDRESS_RESOLUTION_IDLE")
                  DW_AT_const_value	(0)

0x000006ed:     DW_TAG_enumerator
                  DW_AT_name	("ADDRESS_RESOLUTION_GENERAL")
                  DW_AT_const_value	(1)

0x000006f3:     DW_TAG_enumerator
                  DW_AT_name	("ADDRESS_RESOLUTION_FOR_CONNECTION")
                  DW_AT_const_value	(2)

0x000006f9:     NULL

0x000006fa:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0705 "btstack_linked_item_t*")
                DW_AT_name	("linked_list_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(101)

0x00000705:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0582 "btstack_linked_item_t")

0x0000070a:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0715 "enumeration ")
                DW_AT_name	("sm_aes128_state_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                DW_AT_decl_line	(193)

0x00000715:   DW_TAG_enumeration_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                DW_AT_decl_line	(190)

0x00000719:     DW_TAG_enumerator
                  DW_AT_name	("SM_AES128_IDLE")
                  DW_AT_const_value	(0)

0x0000071f:     DW_TAG_enumerator
                  DW_AT_name	("SM_AES128_ACTIVE")
                  DW_AT_const_value	(1)

0x00000725:     NULL

0x00000726:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0731 "structure ")
                DW_AT_name	("btstack_packet_callback_registration_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(64)

0x00000731:   DW_TAG_structure_type
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(61)

0x00000735:     DW_TAG_member
                  DW_AT_name	("item")
                  DW_AT_type	(cu + 0x074e "linked_item_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                  DW_AT_decl_line	(62)
                  DW_AT_data_member_location	(0x00)

0x00000741:     DW_TAG_member
                  DW_AT_name	("callback")
                  DW_AT_type	(cu + 0x0759 "btstack_packet_handler_t")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                  DW_AT_decl_line	(63)
                  DW_AT_data_member_location	(0x04)

0x0000074d:     NULL

0x0000074e:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0582 "btstack_linked_item_t")
                DW_AT_name	("linked_item_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/btstack_linked_list.h")
                DW_AT_decl_line	(100)

0x00000759:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0764 "subroutine *")
                DW_AT_name	("btstack_packet_handler_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/hci_cmds.h")
                DW_AT_decl_line	(58)

0x00000764:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0769 "subroutine ")

0x00000769:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x0000076a:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x05b9 "uint8_t")

0x0000076f:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x064c "uint16_t")

0x00000774:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x077f "uint8_t*")

0x00000779:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x064c "uint16_t")

0x0000077e:     NULL

0x0000077f:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x05b9 "uint8_t")

0x00000784:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0789 "subroutine int")

0x00000789:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_prototyped	(true)

0x0000078e:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x05b9 "uint8_t")

0x00000793:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x077f "uint8_t*")

0x00000798:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x077f "uint8_t*")

0x0000079d:     NULL

0x0000079e:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x07a3 "subroutine ")

0x000007a3:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x000007a4:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x07af "u32*")

0x000007a9:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x064c "uint16_t")

0x000007ae:     NULL

0x000007af:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x07b4 "u32")

0x000007b4:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0095 "unsigned int")
                DW_AT_name	("u32")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/include_lib/driver/cpu/bd19/asm/cpu.h")
                DW_AT_decl_line	(15)

0x000007bf:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000000126)
                DW_AT_high_pc	(0x00000000000022d1)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("sm_run")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                DW_AT_decl_line	(2323)
                DW_AT_prototyped	(true)

0x000007d1:     DW_TAG_variable
                  DW_AT_name	("buffer")
                  DW_AT_type	(cu + 0x1004 "const uint8_t[]")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(2555)
                  DW_AT_location	(DW_OP_addr 0x14c)

0x000007e3:     DW_TAG_variable
                  DW_AT_location	(0x00000096
                     0x00000000000003d4 - 0x00000000000003dc: DW_OP_breg0 EAX+0
                     0x00000000000003df - 0x00000000000003e7: DW_OP_breg0 EAX+0
                     0x00000000000003f3 - 0x00000000000003fb: DW_OP_breg0 EAX+0
                     0x000000000000078e - 0x0000000000000796: DW_OP_breg0 EAX+0
                     0x00000000000007ac - 0x00000000000007b4: DW_OP_breg0 EAX+0
                     0x0000000000000885 - 0x000000000000088d: DW_OP_breg0 EAX+0
                     0x000000000000091c - 0x0000000000000924: DW_OP_breg0 EAX+0
                     0x0000000000000949 - 0x0000000000000951: DW_OP_breg0 EAX+0
                     0x000000000000095f - 0x00000000000022d1: DW_OP_breg5 EBP-40, DW_OP_deref)
                  DW_AT_name	("it")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_decl_line	(2326)
                  DW_AT_type	(cu + 0x3ecf "linked_list_iterator_t")

0x000007f3:     DW_TAG_lexical_block
                  DW_AT_low_pc	(0x00000000000001c8)
                  DW_AT_high_pc	(0x0000000000000210)

0x000007fc:       DW_TAG_variable
                    DW_AT_location	(DW_OP_fbreg -56)
                    DW_AT_name	("d1_prime")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_decl_line	(2350)
                    DW_AT_type	(cu + 0x05ff "sm_key_t")

0x0000080b:       DW_TAG_inlined_subroutine
                    DW_AT_abstract_origin	(cu + 0x1ab6 "dkg_next_state")
                    DW_AT_low_pc	(0x00000000000001d8)
                    DW_AT_high_pc	(0x00000000000001ed)
                    DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_call_line	(2352)

0x0000081b:       NULL

0x0000081c:     DW_TAG_lexical_block
                  DW_AT_low_pc	(0x000000000000022d)
                  DW_AT_high_pc	(0x0000000000000275)

0x00000825:       DW_TAG_variable
                    DW_AT_location	(DW_OP_fbreg -72)
                    DW_AT_name	("d1_prime")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_decl_line	(2361)
                    DW_AT_type	(cu + 0x05ff "sm_key_t")

0x00000835:       DW_TAG_inlined_subroutine
                    DW_AT_abstract_origin	(cu + 0x1ab6 "dkg_next_state")
                    DW_AT_low_pc	(0x000000000000023d)
                    DW_AT_high_pc	(0x0000000000000252)
                    DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_call_line	(2363)

0x00000845:       NULL

0x00000846:     DW_TAG_inlined_subroutine
                  DW_AT_abstract_origin	(cu + 0x1abf "rau_next_state")
                  DW_AT_low_pc	(0x00000000000002e2)
                  DW_AT_high_pc	(0x00000000000002ee)
                  DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_call_line	(2388)

0x00000856:     DW_TAG_inlined_subroutine
                  DW_AT_abstract_origin	(cu + 0x1ac8 "sm_random_start")
                  DW_AT_low_pc	(0x00000000000002ee)
                  DW_AT_high_pc	(0x0000000000000303)
                  DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_call_line	(2389)

0x00000866:     DW_TAG_lexical_block
                  DW_AT_low_pc	(0x000000000000032b)
                  DW_AT_high_pc	(0x0000000000000399)

0x0000086f:       DW_TAG_variable
                    DW_AT_location	(DW_OP_fbreg -88)
                    DW_AT_name	("r_prime")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_decl_line	(2394)
                    DW_AT_type	(cu + 0x05ff "sm_key_t")

0x0000087f:       DW_TAG_inlined_subroutine
                    DW_AT_abstract_origin	(cu + 0x1ade "sm_ah_r_prime")
                    DW_AT_low_pc	(0x000000000000032b)
                    DW_AT_high_pc	(0x000000000000036f)
                    DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_call_line	(2395)

0x0000088f:         DW_TAG_formal_parameter
                      DW_AT_location	(0x00000076
                         0x000000000000032b - 0x0000000000000350: DW_OP_reg2 EDX
                         0x0000000000000350 - 0x00000000000022d1: DW_OP_breg5 EBP-444)
                      DW_AT_abstract_origin	(cu + 0x1af3 "r_prime")

0x00000898:         NULL

0x00000899:       DW_TAG_inlined_subroutine
                    DW_AT_abstract_origin	(cu + 0x1abf "rau_next_state")
                    DW_AT_low_pc	(0x000000000000036f)
                    DW_AT_high_pc	(0x000000000000037b)
                    DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_call_line	(2396)

0x000008a9:       NULL

0x000008aa:     DW_TAG_inlined_subroutine
                  DW_AT_abstract_origin	(cu + 0x1b00 "sm_address_resolution_idle")
                  DW_AT_low_pc	(0x00000000000003be)
                  DW_AT_high_pc	(0x00000000000003cb)
                  DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_call_line	(2430)

0x000008ba:     DW_TAG_lexical_block
                  DW_AT_low_pc	(0x00000000000003f3)
                  DW_AT_high_pc	(0x00000000000004b9)

0x000008c3:       DW_TAG_variable
                    DW_AT_name	("hci_connection")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_decl_line	(2433)
                    DW_AT_type	(cu + 0x162f "le_hci_connection_t*")

0x000008cf:       DW_TAG_variable
                    DW_AT_name	("sm_connection")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_decl_line	(2434)
                    DW_AT_type	(cu + 0x1a23 "sm_connection_t*")

0x000008db:       DW_TAG_inlined_subroutine
                    DW_AT_abstract_origin	(cu + 0x1b0d "sm_address_resolution_start_lookup")
                    DW_AT_low_pc	(0x0000000000000436)
                    DW_AT_high_pc	(0x00000000000004a8)
                    DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_call_line	(2437)

0x000008eb:         DW_TAG_formal_parameter
                      DW_AT_location	(0x0000010b
                         0x0000000000000436 - 0x00000000000004b9: DW_OP_reg3 EBX)
                      DW_AT_abstract_origin	(cu + 0x1b16 "addr_type")

0x000008f4:         DW_TAG_formal_parameter
                      DW_AT_location	(0x0000011e
                         0x0000000000000436 - 0x00000000000004b9: DW_OP_reg7 EDI)
                      DW_AT_abstract_origin	(cu + 0x1b22 "con_handle")

0x000008fd:         DW_TAG_formal_parameter
                      DW_AT_location	(0x00000131
                         0x0000000000000436 - 0x0000000000000491: DW_OP_reg2 EDX
                         0x0000000000000491 - 0x00000000000022d1: DW_OP_breg5 EBP-460)
                      DW_AT_abstract_origin	(cu + 0x1b2e "addr")

0x00000906:         DW_TAG_formal_parameter
                      DW_AT_const_value	(2)
                      DW_AT_abstract_origin	(cu + 0x1b3a "mode")

0x0000090c:         NULL

0x0000090d:       NULL

0x0000090e:     DW_TAG_inlined_subroutine
                  DW_AT_abstract_origin	(cu + 0x1b00 "sm_address_resolution_idle")
                  DW_AT_low_pc	(0x00000000000004b9)
                  DW_AT_high_pc	(0x00000000000004ca)
                  DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_call_line	(2445)

0x0000091e:     DW_TAG_lexical_block
                  DW_AT_low_pc	(0x00000000000004f2)
                  DW_AT_high_pc	(0x0000000000000597)

0x00000927:       DW_TAG_variable
                    DW_AT_name	("entry")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_decl_line	(2447)
                    DW_AT_type	(cu + 0x15e5 "sm_lookup_entry_t*")

0x00000933:       DW_TAG_inlined_subroutine
                    DW_AT_abstract_origin	(cu + 0x1b0d "sm_address_resolution_start_lookup")
                    DW_AT_low_pc	(0x000000000000052a)
                    DW_AT_high_pc	(0x0000000000000589)
                    DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_call_line	(2449)

0x00000943:         DW_TAG_formal_parameter
                      DW_AT_location	(0x00000151
                         0x000000000000052a - 0x0000000000000597: DW_OP_reg3 EBX)
                      DW_AT_abstract_origin	(cu + 0x1b16 "addr_type")

0x0000094c:         DW_TAG_formal_parameter
                      DW_AT_const_value	(0)
                      DW_AT_abstract_origin	(cu + 0x1b22 "con_handle")

0x00000952:         DW_TAG_formal_parameter
                      DW_AT_location	(0x00000164
                         0x000000000000052a - 0x0000000000000597: DW_OP_reg6 ESI)
                      DW_AT_abstract_origin	(cu + 0x1b2e "addr")

0x0000095b:         DW_TAG_formal_parameter
                      DW_AT_const_value	(1)
                      DW_AT_abstract_origin	(cu + 0x1b3a "mode")

0x00000961:         NULL

0x00000962:       NULL

0x00000963:     DW_TAG_inlined_subroutine
                  DW_AT_abstract_origin	(cu + 0x1b00 "sm_address_resolution_idle")
                  DW_AT_low_pc	(0x0000000000000597)
                  DW_AT_high_pc	(0x00000000000005a3)
                  DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                  DW_AT_call_line	(2455)

0x00000973:     DW_TAG_lexical_block
                  DW_AT_low_pc	(0x00000000000005f2)
                  DW_AT_high_pc	(0x000000000000073f)

0x0000097c:       DW_TAG_variable
                    DW_AT_location	(DW_OP_fbreg -98)
                    DW_AT_name	("addr")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_decl_line	(2459)
                    DW_AT_type	(cu + 0x0635 "bd_addr_t")

0x0000098c:       DW_TAG_variable
                    DW_AT_location	(DW_OP_fbreg -114)
                    DW_AT_name	("irk")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_decl_line	(2460)
                    DW_AT_type	(cu + 0x05ff "sm_key_t")

0x0000099c:       DW_TAG_variable
                    DW_AT_location	(DW_OP_fbreg -130)
                    DW_AT_name	("r_prime")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_decl_line	(2482)
                    DW_AT_type	(cu + 0x05ff "sm_key_t")

0x000009ac:       DW_TAG_variable
                    DW_AT_location	(0x00000177
                       0x00000000000005fe - 0x000000000000060b: DW_OP_breg0 EAX+0
                       0x000000000000062f - 0x00000000000006e1: DW_OP_reg6 ESI
                       0x000000000000072a - 0x0000000000000758: DW_OP_reg6 ESI)
                    DW_AT_name	("addr_type")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_decl_line	(2458)
                    DW_AT_type	(cu + 0x0037 "int")

0x000009bc:       DW_TAG_inlined_subroutine
                    DW_AT_abstract_origin	(cu + 0x1ade "sm_ah_r_prime")
                    DW_AT_low_pc	(0x00000000000006aa)
                    DW_AT_high_pc	(0x00000000000006ee)
                    DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_call_line	(2483)

0x000009cc:         DW_TAG_formal_parameter
                      DW_AT_location	(0x000001a1
                         0x00000000000006aa - 0x00000000000006cf: DW_OP_reg2 EDX
                         0x00000000000006cf - 0x00000000000022d1: DW_OP_breg5 EBP-512)
                      DW_AT_abstract_origin	(cu + 0x1af3 "r_prime")

0x000009d5:         NULL

0x000009d6:       NULL

0x000009d7:     DW_TAG_lexical_block
                  DW_AT_low_pc	(0x0000000000000885)
                  DW_AT_high_pc	(0x0000000000000919)

0x000009e0:       DW_TAG_variable
                    DW_AT_name	("hci_connection")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_decl_line	(2498)
                    DW_AT_type	(cu + 0x162f "le_hci_connection_t*")

0x000009ec:       DW_TAG_variable
                    DW_AT_name	("sm_connection")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_decl_line	(2499)
                    DW_AT_type	(cu + 0x1a23 "sm_connection_t*")

0x000009f8:       NULL

0x000009f9:     DW_TAG_lexical_block
                  DW_AT_ranges	(0x00000018
                     [0x0000091c - 0x00000941)
                     [0x00000949 - 0x000022b2))

0x000009fe:       DW_TAG_variable
                    DW_AT_location	(DW_OP_fbreg -148)
                    DW_AT_name	("plaintext")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_decl_line	(2696)
                    DW_AT_type	(cu + 0x05ff "sm_key_t")

0x00000a0e:       DW_TAG_variable
                    DW_AT_location	(0x000002b5
                       0x0000000000000e89 - 0x0000000000000e92: DW_OP_reg6 ESI
                       0x0000000000000e92 - 0x00000000000022d1: DW_OP_breg5 EBP-752)
                    DW_AT_name	("connection")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_decl_line	(2659)
                    DW_AT_type	(cu + 0x1a23 "sm_connection_t*")

0x00000a1e:       DW_TAG_variable
                    DW_AT_location	(0x00000335
                       0x0000000000001277 - 0x000000000000127a: DW_OP_reg7 EDI
                       0x000000000000127a - 0x000000000000128e: DW_OP_consts +6, DW_OP_stack_value
                       0x000000000000128e - 0x00000000000012a4: DW_OP_reg0 EAX
                       0x00000000000012a4 - 0x00000000000022d1: DW_OP_breg5 EBP-864)
                    DW_AT_name	("key_distribution_flags")
                    DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_decl_line	(2697)
                    DW_AT_type	(cu + 0x0037 "int")

0x00000a2e:       DW_TAG_lexical_block
                    DW_AT_ranges	(0x00000000
                       [0x0000095a - 0x00000ae2)
                       [0x00000b0b - 0x00000e2f))

0x00000a33:         DW_TAG_variable
                      DW_AT_location	(0x000001c1
                         0x000000000000096f - 0x000000000000098e: DW_OP_reg2 EDX
                         0x000000000000098e - 0x00000000000022d1: DW_OP_breg5 EBP-632)
                      DW_AT_name	("sm_connection")
                      DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                      DW_AT_decl_line	(2544)
                      DW_AT_type	(cu + 0x1a23 "sm_connection_t*")

0x00000a43:         DW_TAG_variable
                      DW_AT_location	(0x000001e1
                         0x000000000000096f - 0x00000000000022d1: DW_OP_consts +1, DW_OP_stack_value)
                      DW_AT_name	("done")
                      DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                      DW_AT_decl_line	(2546)
                      DW_AT_type	(cu + 0x0037 "int")

0x00000a53:         DW_TAG_variable
                      DW_AT_location	(0x000001f6
                         0x0000000000000b78 - 0x0000000000000b81: DW_OP_reg0 EAX
                         0x0000000000000b81 - 0x00000000000022d1: DW_OP_breg5 EBP-708)
                      DW_AT_name	("err")
                      DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                      DW_AT_decl_line	(2547)
                      DW_AT_type	(cu + 0x0037 "int")

0x00000a63:         DW_TAG_variable
                      DW_AT_name	("hci_connection")
                      DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                      DW_AT_decl_line	(2543)
                      DW_AT_type	(cu + 0x162f "le_hci_connection_t*")

0x00000a6f:         DW_TAG_inlined_subroutine
                      DW_AT_abstract_origin	(cu + 0x1b53 "sm_reset_setup")
                      DW_AT_low_pc	(0x0000000000000b0b)
                      DW_AT_high_pc	(0x0000000000000b43)
                      DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                      DW_AT_call_line	(2566)

0x00000a7f:           DW_TAG_inlined_subroutine
                        DW_AT_abstract_origin	(cu + 0x1b5c "sm_reset_tk")
                        DW_AT_low_pc	(0x0000000000000b1c)
                        DW_AT_high_pc	(0x0000000000000b43)
                        DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                        DW_AT_call_line	(1445)

0x00000a8f:             DW_TAG_variable
                          DW_AT_const_value	(0)
                          DW_AT_abstract_origin	(cu + 0x1b65 "i")

0x00000a95:             NULL

0x00000a96:           NULL

0x00000a97:         DW_TAG_inlined_subroutine
                      DW_AT_abstract_origin	(cu + 0x1b53 "sm_reset_setup")
                      DW_AT_low_pc	(0x0000000000000bda)
                      DW_AT_high_pc	(0x0000000000000bf9)
                      DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                      DW_AT_call_line	(2586)

0x00000aa7:           DW_TAG_inlined_subroutine
                        DW_AT_abstract_origin	(cu + 0x1b5c "sm_reset_tk")
                        DW_AT_low_pc	(0x0000000000000bed)
                        DW_AT_high_pc	(0x0000000000000bf9)
                        DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                        DW_AT_call_line	(1445)

0x00000ab7:             DW_TAG_variable
                          DW_AT_const_value	(0)
                          DW_AT_abstract_origin	(cu + 0x1b65 "i")

0x00000abd:             NULL

0x00000abe:           NULL

0x00000abf:         DW_TAG_inlined_subroutine
                      DW_AT_abstract_origin	(cu + 0x1b72 "sm_start_calculating_ltk_from_ediv_and_rand")
                      DW_AT_low_pc	(0x0000000000000bf9)
                      DW_AT_high_pc	(0x0000000000000c50)
                      DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                      DW_AT_call_line	(2587)

0x00000acf:           DW_TAG_formal_parameter
                        DW_AT_location	(DW_OP_fbreg -632)
                        DW_AT_abstract_origin	(cu + 0x1b7b "sm_connection")

0x00000ad8:           NULL

0x00000ad9:         DW_TAG_inlined_subroutine
                      DW_AT_abstract_origin	(cu + 0x1b53 "sm_reset_setup")
                      DW_AT_low_pc	(0x0000000000000c57)
                      DW_AT_high_pc	(0x0000000000000c97)
                      DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                      DW_AT_call_line	(2597)

0x00000ae9:           DW_TAG_inlined_subroutine
                        DW_AT_abstract_origin	(cu + 0x1b5c "sm_reset_tk")
                        DW_AT_low_pc	(0x0000000000000c68)
                        DW_AT_high_pc	(0x0000000000000c97)
                        DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                        DW_AT_call_line	(1445)

0x00000af9:             DW_TAG_variable
                          DW_AT_const_value	(0)
                          DW_AT_abstract_origin	(cu + 0x1b65 "i")

0x00000aff:             NULL

0x00000b00:           NULL

0x00000b01:         DW_TAG_inlined_subroutine
                      DW_AT_abstract_origin	(cu + 0x1b88 "sm_load_security_info")
                      DW_AT_low_pc	(0x0000000000000c97)
                      DW_AT_high_pc	(0x0000000000000d96)
                      DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                      DW_AT_call_line	(2598)

0x00000b11:           DW_TAG_formal_parameter
                        DW_AT_location	(DW_OP_fbreg -632)
                        DW_AT_abstract_origin	(cu + 0x1b91 "sm_connection")

0x00000b1a:           DW_TAG_variable
                        DW_AT_location	(0x00000216
                           0x0000000000000ceb - 0x0000000000000cf1: DW_OP_breg0 EAX+0
                           0x0000000000000cf1 - 0x0000000000000d3d: DW_OP_breg5 EBP-736, DW_OP_deref
                           0x0000000000000d3d - 0x0000000000000d61: DW_OP_reg6 ESI
                           0x0000000000000d6b - 0x0000000000000d73: DW_OP_reg2 EDX)
                        DW_AT_abstract_origin	(cu + 0x1b9d "encryption_key_size")

0x00000b23:           DW_TAG_variable
                        DW_AT_location	(0x0000024e
                           0x0000000000000ceb - 0x0000000000000d1d: DW_OP_breg1 ECX+0
                           0x0000000000000d40 - 0x0000000000000d61: DW_OP_reg7 EDI
                           0x0000000000000d79 - 0x0000000000000d81: DW_OP_reg2 EDX)
                        DW_AT_abstract_origin	(cu + 0x1ba9 "authenticated")

0x00000b2c:           DW_TAG_variable
                        DW_AT_location	(0x00000278
                           0x0000000000000ceb - 0x0000000000000d1d: DW_OP_breg2 EDX+0
                           0x0000000000000d43 - 0x0000000000000d61: DW_OP_reg3 EBX
                           0x0000000000000d87 - 0x0000000000000d96: DW_OP_reg6 ESI)
                        DW_AT_abstract_origin	(cu + 0x1bb5 "authorized")

0x00000b35:           NULL

0x00000b36:         DW_TAG_inlined_subroutine
                      DW_AT_abstract_origin	(cu + 0x1b53 "sm_reset_setup")
                      DW_AT_low_pc	(0x0000000000000dad)
                      DW_AT_high_pc	(0x0000000000000de5)
                      DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                      DW_AT_call_line	(2602)

0x00000b46:           DW_TAG_inlined_subroutine
                        DW_AT_abstract_origin	(cu + 0x1b5c "sm_reset_tk")
                        DW_AT_low_pc	(0x0000000000000dbe)
                        DW_AT_high_pc	(0x0000000000000de5)
                        DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                        DW_AT_call_line	(1445)

0x00000b56:             DW_TAG_variable
                          DW_AT_const_value	(0)
                          DW_AT_abstract_origin	(cu + 0x1b65 "i")

0x00000b5c:             NULL

0x00000b5d:           NULL

0x00000b5e:         NULL

0x00000b5f:       DW_TAG_inlined_subroutine
                    DW_AT_abstract_origin	(cu + 0x1bc2 "sm_get_connection_for_handle")
                    DW_AT_low_pc	(0x0000000000000e58)
                    DW_AT_high_pc	(0x0000000000000e89)
                    DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_call_line	(2659)

0x00000b6f:         DW_TAG_formal_parameter
                      DW_AT_abstract_origin	(cu + 0x1bcf "con_handle")

0x00000b74:         DW_TAG_variable
                      DW_AT_location	(0x000002a2
                         0x0000000000000e78 - 0x0000000000000e98: DW_OP_reg0 EAX)
                      DW_AT_abstract_origin	(cu + 0x1bdb "hci_con")

0x00000b7d:         NULL

0x00000b7e:       DW_TAG_lexical_block
                    DW_AT_low_pc	(0x0000000000000f39)
                    DW_AT_high_pc	(0x0000000000000f91)

0x00000b87:         DW_TAG_variable
                      DW_AT_location	(DW_OP_fbreg -132)
                      DW_AT_name	("buffer")
                      DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                      DW_AT_decl_line	(2688)
                      DW_AT_type	(cu + 0x3f0e "uint8_t[]")

0x00000b97:         NULL

0x00000b98:       DW_TAG_lexical_block
                    DW_AT_low_pc	(0x0000000000000fec)
                    DW_AT_high_pc	(0x00000000000010b7)

0x00000ba1:         DW_TAG_variable
                      DW_AT_location	(DW_OP_fbreg -150)
                      DW_AT_name	("buffer")
                      DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                      DW_AT_decl_line	(2707)
                      DW_AT_type	(cu + 0x3f0e "uint8_t[]")

0x00000bb1:         NULL

0x00000bb2:       DW_TAG_lexical_block
                    DW_AT_low_pc	(0x00000000000010bd)
                    DW_AT_high_pc	(0x00000000000011c0)

0x00000bbb:         DW_TAG_variable
                      DW_AT_location	(DW_OP_fbreg -166)
                      DW_AT_name	("peer_ltk_flipped")
                      DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                      DW_AT_decl_line	(2817)
                      DW_AT_type	(cu + 0x05ff "sm_key_t")

0x00000bcb:         DW_TAG_variable
                      DW_AT_location	(0x000002d5
                         0x0000000000001110 - 0x000000000000112d: DW_OP_reg0 EAX
                         0x000000000000112d - 0x00000000000022d1: DW_OP_breg5 EBP-828)
                      DW_AT_name	("rand_high")
                      DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                      DW_AT_decl_line	(2820)
                      DW_AT_type	(cu + 0x008a "uint32_t")

0x00000bdb:         DW_TAG_variable
                      DW_AT_location	(0x000002f5
                         0x0000000000001138 - 0x0000000000001157: DW_OP_reg0 EAX)
                      DW_AT_name	("rand_low")
                      DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                      DW_AT_decl_line	(2821)
                      DW_AT_type	(cu + 0x008a "uint32_t")

0x00000beb:         NULL

0x00000bec:       DW_TAG_inlined_subroutine
                    DW_AT_abstract_origin	(cu + 0x1be8 "sm_timeout_reset")
                    DW_AT_low_pc	(0x0000000000001228)
                    DW_AT_high_pc	(0x0000000000001239)
                    DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_call_line	(2835)

0x00000bfc:         DW_TAG_formal_parameter
                      DW_AT_location	(DW_OP_fbreg -752)
                      DW_AT_abstract_origin	(cu + 0x1bf1 "sm_conn")

0x00000c05:         NULL

0x00000c06:       DW_TAG_inlined_subroutine
                    DW_AT_abstract_origin	(cu + 0x1bfe "sm_key_distribution_flags_for_auth_req")
                    DW_AT_low_pc	(0x0000000000001262)
                    DW_AT_high_pc	(0x0000000000001277)
                    DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_call_line	(2951)

0x00000c16:         DW_TAG_variable
                      DW_AT_location	(0x00000308
                         0x0000000000001262 - 0x0000000000001271: DW_OP_consts +6, DW_OP_stack_value
                         0x0000000000001271 - 0x0000000000001277: DW_OP_consts +7, DW_OP_stack_value
                         0x0000000000001277 - 0x0000000000001327: DW_OP_reg7 EDI)
                      DW_AT_abstract_origin	(cu + 0x1c0b "flags")

0x00000c1f:         NULL

0x00000c20:       DW_TAG_inlined_subroutine
                    DW_AT_abstract_origin	(cu + 0x1c18 "sm_setup_key_distribution")
                    DW_AT_low_pc	(0x0000000000001327)
                    DW_AT_high_pc	(0x0000000000001365)
                    DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_call_line	(2965)
                    DW_AT_GNU_discriminator	(0x01)

0x00000c31:         DW_TAG_formal_parameter
                      DW_AT_location	(0x0000036d
                         0x0000000000001327 - 0x0000000000001334: DW_OP_reg0 EAX)
                      DW_AT_abstract_origin	(cu + 0x1c21 "key_set")

0x00000c3a:         DW_TAG_inlined_subroutine
                      DW_AT_abstract_origin	(cu + 0x1c2e "sm_key_distribution_flags_for_set")
                      DW_AT_low_pc	(0x0000000000001331)
                      DW_AT_high_pc	(0x0000000000001357)
                      DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                      DW_AT_call_line	(1095)

0x00000c4a:           DW_TAG_formal_parameter
                        DW_AT_location	(0x00000380
                           0x0000000000001331 - 0x0000000000001334: DW_OP_reg0 EAX)
                        DW_AT_abstract_origin	(cu + 0x1c3b "key_set")

0x00000c53:           DW_TAG_variable
                        DW_AT_location	(0x00000393
                           0x0000000000001331 - 0x0000000000001339: DW_OP_consts +0, DW_OP_stack_value
                           0x0000000000001339 - 0x0000000000001339: DW_OP_consts +1, DW_OP_stack_value
                           0x0000000000001339 - 0x000000000000133f: DW_OP_consts +3, DW_OP_stack_value
                           0x000000000000133f - 0x0000000000001349: DW_OP_reg6 ESI
                           0x0000000000001349 - 0x000000000000136e: DW_OP_reg3 EBX)
                        DW_AT_abstract_origin	(cu + 0x1c47 "flags")

0x00000c5c:           NULL

0x00000c5d:         NULL

0x00000c5e:       DW_TAG_inlined_subroutine
                    DW_AT_abstract_origin	(cu + 0x1be8 "sm_timeout_reset")
                    DW_AT_low_pc	(0x000000000000139c)
                    DW_AT_high_pc	(0x00000000000013ad)
                    DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_call_line	(2968)

0x00000c6e:         DW_TAG_formal_parameter
                      DW_AT_location	(DW_OP_fbreg -752)
                      DW_AT_abstract_origin	(cu + 0x1bf1 "sm_conn")

0x00000c77:         NULL

0x00000c78:       DW_TAG_lexical_block
                    DW_AT_low_pc	(0x00000000000013e2)
                    DW_AT_high_pc	(0x0000000000001476)

0x00000c81:         DW_TAG_variable
                      DW_AT_location	(DW_OP_fbreg -183)
                      DW_AT_name	("buffer")
                      DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                      DW_AT_decl_line	(2977)
                      DW_AT_type	(cu + 0x3f1a "uint8_t[]")

0x00000c91:         DW_TAG_inlined_subroutine
                      DW_AT_abstract_origin	(cu + 0x1be8 "sm_timeout_reset")
                      DW_AT_low_pc	(0x0000000000001460)
                      DW_AT_high_pc	(0x0000000000001476)
                      DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                      DW_AT_call_line	(2986)

0x00000ca1:           DW_TAG_formal_parameter
                        DW_AT_location	(DW_OP_fbreg -752)
                        DW_AT_abstract_origin	(cu + 0x1bf1 "sm_conn")

0x00000caa:           NULL

0x00000cab:         NULL

0x00000cac:       DW_TAG_inlined_subroutine
                    DW_AT_abstract_origin	(cu + 0x1c54 "sm_next_responding_state")
                    DW_AT_low_pc	(0x0000000000001476)
                    DW_AT_high_pc	(0x0000000000001487)
                    DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_call_line	(2995)

0x00000cbc:         DW_TAG_formal_parameter
                      DW_AT_location	(DW_OP_fbreg -752)
                      DW_AT_abstract_origin	(cu + 0x1c5d "sm_conn")

0x00000cc5:         NULL

0x00000cc6:       DW_TAG_inlined_subroutine
                    DW_AT_abstract_origin	(cu + 0x1ac8 "sm_random_start")
                    DW_AT_low_pc	(0x0000000000001487)
                    DW_AT_high_pc	(0x000000000000149e)
                    DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_call_line	(2996)

0x00000cd6:       DW_TAG_inlined_subroutine
                    DW_AT_abstract_origin	(cu + 0x1c54 "sm_next_responding_state")
                    DW_AT_low_pc	(0x00000000000014bc)
                    DW_AT_high_pc	(0x00000000000014cd)
                    DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_call_line	(3005)

0x00000ce6:         DW_TAG_formal_parameter
                      DW_AT_location	(DW_OP_fbreg -752)
                      DW_AT_abstract_origin	(cu + 0x1c5d "sm_conn")

0x00000cef:         NULL

0x00000cf0:       DW_TAG_lexical_block
                    DW_AT_low_pc	(0x000000000000150f)
                    DW_AT_high_pc	(0x000000000000156a)

0x00000cf9:         DW_TAG_variable
                      DW_AT_location	(DW_OP_fbreg -199)
                      DW_AT_name	("d_prime")
                      DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                      DW_AT_decl_line	(3013)
                      DW_AT_type	(cu + 0x05ff "sm_key_t")

0x00000d09:         DW_TAG_inlined_subroutine
                      DW_AT_abstract_origin	(cu + 0x1c54 "sm_next_responding_state")
                      DW_AT_low_pc	(0x000000000000152a)
                      DW_AT_high_pc	(0x0000000000001537)
                      DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                      DW_AT_call_line	(3015)

0x00000d19:           DW_TAG_formal_parameter
                        DW_AT_location	(DW_OP_fbreg -752)
                        DW_AT_abstract_origin	(cu + 0x1c5d "sm_conn")

0x00000d22:           NULL

0x00000d23:         NULL

0x00000d24:       DW_TAG_lexical_block
                    DW_AT_low_pc	(0x0000000000001588)
                    DW_AT_high_pc	(0x00000000000015e3)

0x00000d2d:         DW_TAG_variable
                      DW_AT_location	(DW_OP_fbreg -215)
                      DW_AT_name	("d_prime")
                      DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                      DW_AT_decl_line	(3024)
                      DW_AT_type	(cu + 0x05ff "sm_key_t")

0x00000d3d:         DW_TAG_inlined_subroutine
                      DW_AT_abstract_origin	(cu + 0x1c54 "sm_next_responding_state")
                      DW_AT_low_pc	(0x00000000000015a3)
                      DW_AT_high_pc	(0x00000000000015b0)
                      DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                      DW_AT_call_line	(3026)

0x00000d4d:           DW_TAG_formal_parameter
                        DW_AT_location	(DW_OP_fbreg -752)
                        DW_AT_abstract_origin	(cu + 0x1c5d "sm_conn")

0x00000d56:           NULL

0x00000d57:         NULL

0x00000d58:       DW_TAG_inlined_subroutine
                    DW_AT_abstract_origin	(cu + 0x1c54 "sm_next_responding_state")
                    DW_AT_low_pc	(0x000000000000165d)
                    DW_AT_high_pc	(0x000000000000166a)
                    DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_call_line	(3039)

0x00000d68:         DW_TAG_formal_parameter
                      DW_AT_location	(DW_OP_fbreg -752)
                      DW_AT_abstract_origin	(cu + 0x1c5d "sm_conn")

0x00000d71:         NULL

0x00000d72:       DW_TAG_inlined_subroutine
                    DW_AT_abstract_origin	(cu + 0x1c54 "sm_next_responding_state")
                    DW_AT_low_pc	(0x0000000000001714)
                    DW_AT_high_pc	(0x0000000000001721)
                    DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_call_line	(3049)

0x00000d82:         DW_TAG_formal_parameter
                      DW_AT_location	(DW_OP_fbreg -752)
                      DW_AT_abstract_origin	(cu + 0x1c5d "sm_conn")

0x00000d8b:         NULL

0x00000d8c:       DW_TAG_inlined_subroutine
                    DW_AT_abstract_origin	(cu + 0x1c6a "sm_s1_r_prime")
                    DW_AT_low_pc	(0x00000000000017c1)
                    DW_AT_high_pc	(0x00000000000017df)
                    DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_call_line	(3061)

0x00000d9c:         DW_TAG_formal_parameter
                      DW_AT_location	(0x000003d8
                         0x00000000000017a9 - 0x00000000000017b5: DW_OP_reg0 EAX)
                      DW_AT_abstract_origin	(cu + 0x1c73 "r1")

0x00000da5:         DW_TAG_formal_parameter
                      DW_AT_location	(0x000003eb
                         0x00000000000017a9 - 0x00000000000017b5: DW_OP_reg1 ECX)
                      DW_AT_abstract_origin	(cu + 0x1c7f "r2")

0x00000dae:         DW_TAG_formal_parameter
                      DW_AT_location	(0x000003fe
                         0x00000000000017a9 - 0x00000000000022d1: DW_OP_breg5 EBP-592)
                      DW_AT_abstract_origin	(cu + 0x1c8b "r_prime")

0x00000db7:         NULL

0x00000db8:       DW_TAG_inlined_subroutine
                    DW_AT_abstract_origin	(cu + 0x1c54 "sm_next_responding_state")
                    DW_AT_low_pc	(0x00000000000017df)
                    DW_AT_high_pc	(0x00000000000017ec)
                    DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_call_line	(3063)

0x00000dc8:         DW_TAG_formal_parameter
                      DW_AT_location	(DW_OP_fbreg -752)
                      DW_AT_abstract_origin	(cu + 0x1c5d "sm_conn")

0x00000dd1:         NULL

0x00000dd2:       DW_TAG_inlined_subroutine
                    DW_AT_abstract_origin	(cu + 0x1c98 "sm_dm_r_prime")
                    DW_AT_low_pc	(0x0000000000001823)
                    DW_AT_high_pc	(0x0000000000001849)
                    DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_call_line	(3073)

0x00000de2:         DW_TAG_formal_parameter
                      DW_AT_location	(DW_OP_fbreg -760, DW_OP_plus_uconst 0xb4, DW_OP_stack_value)
                      DW_AT_abstract_origin	(cu + 0x1ca1 "r")

0x00000def:         NULL

0x00000df0:       DW_TAG_inlined_subroutine
                    DW_AT_abstract_origin	(cu + 0x1c54 "sm_next_responding_state")
                    DW_AT_low_pc	(0x0000000000001849)
                    DW_AT_high_pc	(0x0000000000001856)
                    DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                    DW_AT_call_line	(3074)

0x00000e00:         DW_TAG_formal_parameter
                      DW_AT_location	(DW_OP_fbreg -752)
                      DW_AT_abstract_origin	(cu + 0x1c5d "sm_conn")

0x00000e09:         NULL

0x00000e0a:       DW_TAG_lexical_block
                    DW_AT_low_pc	(0x000000000000187c)
                    DW_AT_high_pc	(0x0000000000001913)

0x00000e13:         DW_TAG_variable
                      DW_AT_location	(DW_OP_fbreg -232)
                      DW_AT_name	("buffer")
                      DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Protocol/BLE/sm.c")
                      DW_AT_decl_line	(3078)
                      DW_AT_type	(cu + 0x3f1a "uint8_t[]")

0x00000e23:         DW_TAG_inlined_subroutine
                      DW_AT_abstract_origin	(cu + 0x1be8 "sm_timeout_reset")
                      DW_AT_low_pc	(0x00000000000018fd)
                      DW_AT_high_pc	(0x0000000000001913)
