; ModuleID = 'vCard.c.o'
source_filename = "/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/vCard.c"
target datalayout = "e-m:e-p:32:32-i1:32-i64:32:32-f64:32:32-n8:16:32-a:0:32"
target triple = "q32s"

%struct.contact_t = type { i32, i32, %struct.tel_name, %struct.tel_number, %struct.call_info, i8* }
%struct.tel_name = type { i16, i8, i8, i8, i32, i32, i8*, i8*, i8*, i8*, i8*, i8* }
%struct.tel_number = type { i16, i8, i8, i8, i8, i32, i32, i8* }
%struct.call_info = type { i8, i8* }

@app_info_debug_enable = weak hidden local_unnamed_addr global i32 0, align 4, !dbg !0
@profile_debug_enable = external local_unnamed_addr global i8, align 1
@.str = private unnamed_addr constant [34 x i8] c"<pro-error> :need malloc = 0x%x\0A\0A\00", align 1
@last_ptr_data_ptr = internal unnamed_addr global i8* null, align 4, !dbg !73
@last_ptr_data_len = internal unnamed_addr global i16 0, align 2, !dbg !75
@.str.2 = private unnamed_addr constant [6 x i8] c"close\00", align 1
@.str.3 = private unnamed_addr constant [12 x i8] c"BEGIN:VCARD\00", align 1
@l2cap_debug_enable = external local_unnamed_addr global i8, align 1
@.str.4 = private unnamed_addr constant [22 x i8] c"The vcard is invalid.\00", align 1
@.str.5 = private unnamed_addr constant [32 x i8] c"<BT-log> :(%s) -> %s() return\0A\0A\00", align 1
@.str.6 = private unnamed_addr constant [14 x i8] c"NULL == vcard\00", align 1

!123 = !DILocation(line: 50, column: 5, scope: !122)
!124 = !DILocation(line: 51, column: 9, scope: !125)
!125 = distinct !DILexicalBlock(scope: !126, file: !3, line: 51, column: 9)
!126 = distinct !DILexicalBlock(scope: !119, file: !3, line: 50, column: 12)
!127 = !{!128, !128, i64 0}
!128 = !{!"omnipotent char", !129, i64 0}
!129 = !{!"Simple C/C++ TBAA"}
!130 = !DILocation(line: 51, column: 9, scope: !126)
!131 = !DILocation(line: 51, column: 9, scope: !132)
!132 = !DILexicalBlockFile(scope: !125, file: !3, discriminator: 1)
!133 = !DILocation(line: 54, column: 5, scope: !109)
!134 = distinct !DISubprogram(name: "strdup", scope: !3, file: !3, line: 116, type: !135, isLocal: false, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !137)
!135 = !DISubroutineType(types: !136)
!136 = !{!60, !68}
!137 = !{!138, !139}
!138 = !DILocalVariable(name: "s", arg: 1, scope: !134, file: !3, line: 116, type: !68)
!139 = !DILocalVariable(name: "t", scope: !134, file: !3, line: 118, type: !60)
!140 = !DILocation(line: 116, column: 26, scope: !134)
!141 = !DILocation(line: 118, column: 11, scope: !134)
!142 = !DILocation(line: 119, column: 9, scope: !143)
!143 = distinct !DILexicalBlock(scope: !134, file: !3, line: 119, column: 9)
!144 = !DILocation(line: 119, column: 11, scope: !143)
!145 = !DILocation(line: 119, column: 41, scope: !146)
!146 = !DILexicalBlockFile(scope: !143, file: !3, discriminator: 1)
!147 = !DILocation(line: 119, column: 51, scope: !146)
!148 = !DILocation(line: 119, column: 27, scope: !149)
!149 = !DILexicalBlockFile(scope: !143, file: !3, discriminator: 2)
!150 = !DILocation(line: 119, column: 17, scope: !146)
!151 = !DILocation(line: 119, column: 9, scope: !152)
!152 = !DILexicalBlockFile(scope: !134, file: !3, discriminator: 1)
!153 = !DILocation(line: 120, column: 9, scope: !154)
!154 = distinct !DILexicalBlock(scope: !143, file: !3, line: 119, column: 59)
!155 = !DILocation(line: 121, column: 5, scope: !154)
!156 = !DILocation(line: 122, column: 5, scope: !134)
!157 = distinct !DISubprogram(name: "phonebook_packet_handler", scope: !3, file: !3, line: 805, type: !158, isLocal: false, isDefinition: true, scopeLine: 806, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !160)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !64, !62, !62, !68}
!160 = !{!161, !162, !163, !164}
!161 = !DILocalVariable(name: "type", arg: 1, scope: !157, file: !3, line: 805, type: !64)
!162 = !DILocalVariable(name: "name", arg: 2, scope: !157, file: !3, line: 805, type: !62)
!163 = !DILocalVariable(name: "number", arg: 3, scope: !157, file: !3, line: 805, type: !62)
!164 = !DILocalVariable(name: "date", arg: 4, scope: !157, file: !3, line: 805, type: !68)
!165 = !DILocation(line: 805, column: 34, scope: !157)
!166 = !DILocation(line: 805, column: 50, scope: !157)
!167 = !DILocation(line: 805, column: 66, scope: !157)
!168 = !DILocation(line: 805, column: 86, scope: !157)
!169 = !DILocation(line: 807, column: 1, scope: !157)
!170 = distinct !DISubprogram(name: "pbap_close_status_update_to_user", scope: !3, file: !3, line: 825, type: !171, isLocal: false, isDefinition: true, scopeLine: 826, isOptimized: true, unit: !2, variables: !173)
!171 = !DISubroutineType(types: !172)
!172 = !{null}
!173 = !{}
!174 = !DILocation(line: 827, column: 9, scope: !175)
!175 = distinct !DILexicalBlock(scope: !170, file: !3, line: 827, column: 9)
!176 = !{!177, !177, i64 0}
!177 = !{!"any pointer", !128, i64 0}
!178 = !DILocation(line: 827, column: 9, scope: !170)
!179 = !DILocation(line: 828, column: 9, scope: !180)
!180 = distinct !DILexicalBlock(scope: !181, file: !3, line: 828, column: 9)
!181 = distinct !DILexicalBlock(scope: !175, file: !3, line: 827, column: 28)
!182 = !DILocation(line: 828, column: 9, scope: !181)
!183 = !DILocation(line: 828, column: 9, scope: !184)
!184 = !DILexicalBlockFile(scope: !180, file: !3, discriminator: 1)
!185 = !DILocation(line: 829, column: 20, scope: !181)
!186 = !DILocation(line: 30, column: 23, scope: !101, inlinedAt: !187)
!187 = distinct !DILocation(line: 829, column: 9, scope: !181)
!188 = !DILocation(line: 33, column: 5, scope: !101, inlinedAt: !187)
!189 = !DILocation(line: 830, column: 27, scope: !181)
!190 = !DILocation(line: 831, column: 27, scope: !181)
!191 = !{!192, !192, i64 0}
!192 = !{!"short", !128, i64 0}
!193 = !DILocation(line: 832, column: 5, scope: !181)
!194 = !DILocation(line: 834, column: 9, scope: !195)
!195 = distinct !DILexicalBlock(scope: !196, file: !3, line: 833, column: 23)
!196 = distinct !DILexicalBlock(scope: !170, file: !3, line: 833, column: 9)
!197 = !DILocation(line: 836, column: 1, scope: !170)
!198 = distinct !DISubprogram(name: "vcard_parse", scope: !3, file: !3, line: 838, type: !199, isLocal: false, isDefinition: true, scopeLine: 839, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !203)
!199 = !DISubroutineType(types: !200)
!200 = !{!71, !201, !71}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!203 = !{!204, !205, !206, !207, !208, !250, !251, !252, !253}
!204 = !DILocalVariable(name: "vcard_stream", arg: 1, scope: !198, file: !3, line: 838, type: !201)
!205 = !DILocalVariable(name: "flags", arg: 2, scope: !198, file: !3, line: 838, type: !71)
!206 = !DILocalVariable(name: "ret", scope: !198, file: !3, line: 840, type: !71)
!207 = !DILocalVariable(name: "ver", scope: !198, file: !3, line: 840, type: !71)
!208 = !DILocalVariable(name: "result", scope: !198, file: !3, line: 841, type: !209)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "contact_t", file: !36, line: 87, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 80, size: 640, elements: !211)
!211 = !{!212, !213, !214, !231, !243, !249}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !210, file: !36, line: 81, baseType: !71, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "is_restricted", scope: !210, file: !36, line: 82, baseType: !71, size: 32, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !210, file: !36, line: 83, baseType: !215, size: 320, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "tel_name", file: !36, line: 63, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 50, size: 320, elements: !217)
!217 = !{!218, !219, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v_type", scope: !216, file: !36, line: 51, baseType: !71, size: 16, flags: DIFlagBitField, extraData: i64 0)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "embedded", scope: !216, file: !36, line: 52, baseType: !220, size: 8, offset: 16)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !65, line: 44, baseType: !66)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "deleted", scope: !216, file: !36, line: 53, baseType: !220, size: 8, offset: 24)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "is_changed", scope: !216, file: !36, line: 54, baseType: !220, size: 8, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !216, file: !36, line: 55, baseType: !71, size: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "lang_type", scope: !216, file: !36, line: 56, baseType: !71, size: 32, offset: 96)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !216, file: !36, line: 57, baseType: !60, size: 32, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !216, file: !36, line: 58, baseType: !60, size: 32, offset: 160)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "addition", scope: !216, file: !36, line: 59, baseType: !60, size: 32, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !216, file: !36, line: 60, baseType: !60, size: 32, offset: 224)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !216, file: !36, line: 61, baseType: !60, size: 32, offset: 256)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "suffix", scope: !216, file: !36, line: 62, baseType: !60, size: 32, offset: 288)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !210, file: !36, line: 84, baseType: !232, size: 160, offset: 384)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "tel_number", file: !36, line: 75, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 65, size: 160, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "v_type", scope: !233, file: !36, line: 66, baseType: !71, size: 16, flags: DIFlagBitField, extraData: i64 0)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "embedded", scope: !233, file: !36, line: 67, baseType: !220, size: 8, offset: 16)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "deleted", scope: !233, file: !36, line: 68, baseType: !220, size: 8, offset: 24)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "is_default", scope: !233, file: !36, line: 69, baseType: !220, size: 8, offset: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "is_favorite", scope: !233, file: !36, line: 70, baseType: !220, size: 8, offset: 40)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !233, file: !36, line: 71, baseType: !71, size: 32, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !233, file: !36, line: 72, baseType: !71, size: 32, offset: 96)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !233, file: !36, line: 73, baseType: !60, size: 32, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !210, file: !36, line: 85, baseType: !244, size: 64, offset: 544)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "call_info", file: !36, line: 79, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 76, size: 64, elements: !246)
!246 = !{!247, !248}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "call_type", scope: !245, file: !36, line: 77, baseType: !64, size: 8)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "call_date", scope: !245, file: !36, line: 78, baseType: !60, size: 32, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "nicknames", scope: !210, file: !36, line: 86, baseType: !60, size: 32, offset: 608)
!250 = !DILocalVariable(name: "val_begin", scope: !198, file: !3, line: 842, type: !60)
!251 = !DILocalVariable(name: "new_start", scope: !198, file: !3, line: 842, type: !60)
!252 = !DILocalVariable(name: "val", scope: !198, file: !3, line: 842, type: !60)
!253 = !DILocalVariable(name: "vcard", scope: !198, file: !3, line: 843, type: !60)
!254 = !DILocation(line: 838, column: 29, scope: !198)
!255 = !DILocation(line: 838, column: 48, scope: !198)
!256 = !DILocation(line: 842, column: 5, scope: !198)
!257 = !DILocation(line: 843, column: 11, scope: !198)
!258 = !DILocation(line: 845, column: 14, scope: !259)
!259 = distinct !DILexicalBlock(scope: !198, file: !3, line: 845, column: 9)
!260 = !DILocation(line: 845, column: 9, scope: !198)
!261 = !DILocation(line: 764, column: 17, scope: !262, inlinedAt: !264)
!262 = distinct !DILexicalBlock(scope: !263, file: !3, line: 764, column: 9)
!263 = distinct !DISubprogram(name: "vcard_initial", scope: !3, file: !3, line: 762, type: !171, isLocal: true, isDefinition: true, scopeLine: 763, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !173)
!264 = distinct !DILocation(line: 848, column: 5, scope: !198)
!265 = !DILocation(line: 764, column: 14, scope: !262, inlinedAt: !264)
!266 = !DILocation(line: 764, column: 9, scope: !263, inlinedAt: !264)
!267 = !DILocation(line: 768, column: 38, scope: !268, inlinedAt: !264)
!268 = distinct !DILexicalBlock(scope: !262, file: !3, line: 764, column: 32)
!269 = !DILocation(line: 769, column: 37, scope: !268, inlinedAt: !264)
!270 = !DILocation(line: 770, column: 44, scope: !268, inlinedAt: !264)
!271 = !DILocation(line: 771, column: 41, scope: !268, inlinedAt: !264)
!272 = !DILocation(line: 772, column: 40, scope: !268, inlinedAt: !264)
!273 = !DILocation(line: 773, column: 39, scope: !268, inlinedAt: !264)
!274 = !DILocation(line: 774, column: 41, scope: !268, inlinedAt: !264)
!275 = !DILocation(line: 775, column: 39, scope: !268, inlinedAt: !264)
!276 = !DILocation(line: 776, column: 41, scope: !268, inlinedAt: !264)
!277 = !DILocation(line: 780, column: 41, scope: !268, inlinedAt: !264)
!278 = !DILocation(line: 781, column: 40, scope: !268, inlinedAt: !264)
!279 = !DILocation(line: 784, column: 39, scope: !268, inlinedAt: !264)
!280 = !DILocation(line: 786, column: 40, scope: !268, inlinedAt: !264)
!281 = !DILocation(line: 788, column: 39, scope: !268, inlinedAt: !264)
!282 = !DILocation(line: 791, column: 39, scope: !268, inlinedAt: !264)
!283 = !DILocation(line: 792, column: 39, scope: !268, inlinedAt: !264)
!284 = !DILocation(line: 796, column: 49, scope: !268, inlinedAt: !264)
!285 = !DILocation(line: 798, column: 47, scope: !268, inlinedAt: !264)
!286 = !DILocation(line: 799, column: 56, scope: !268, inlinedAt: !264)
!287 = !DILocation(line: 800, column: 39, scope: !268, inlinedAt: !264)
!288 = !DILocation(line: 801, column: 5, scope: !268, inlinedAt: !264)
!289 = !DILocation(line: 849, column: 13, scope: !198)
!290 = !DILocation(line: 850, column: 5, scope: !291)
!291 = !DILexicalBlockFile(scope: !292, file: !3, discriminator: 1)
!292 = distinct !DILexicalBlock(scope: !293, file: !3, line: 850, column: 5)
!293 = distinct !DILexicalBlock(scope: !198, file: !3, line: 850, column: 5)
!294 = !DILocation(line: 850, column: 5, scope: !295)
!295 = !DILexicalBlockFile(scope: !293, file: !3, discriminator: 1)
!296 = !DILocation(line: 850, column: 5, scope: !297)
!297 = !DILexicalBlockFile(scope: !298, file: !3, discriminator: 2)
!298 = distinct !DILexicalBlock(scope: !299, file: !3, line: 850, column: 5)
!299 = distinct !DILexicalBlock(scope: !292, file: !3, line: 850, column: 5)
!300 = !DILocation(line: 850, column: 5, scope: !301)
!301 = !DILexicalBlockFile(scope: !299, file: !3, discriminator: 2)
!302 = !DILocation(line: 850, column: 5, scope: !303)
!303 = !DILexicalBlockFile(scope: !298, file: !3, discriminator: 3)
