temp.o:	file format ELF32-i386

.debug_info contents:
0x00000000: Compile Unit: length = 0x00000f84 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x00000f88)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("clang version 4.0.1 (git@192.168.8.109:huangzhenyu/clang.git d97b416c061747718623e97046d5e7dcb4c75555) (git@192.168.8.109:huangzhenyu/llvm.git 64c6917899f78226b6d3cf2b78db54d02abf7c85)")
              DW_AT_language	(DW_LANG_C99)
              DW_AT_name	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/vCard.c")
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make")
              DW_AT_GNU_pubnames	(true)
              DW_AT_low_pc	(0x0000000000000000)
              DW_AT_high_pc	(0x0000000000002633)

0x00000026:   DW_TAG_variable
                DW_AT_name	("app_info_debug_enable")
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_external	(true)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/profile_stack_debug.h")
                DW_AT_decl_line	(190)
                DW_AT_location	(DW_OP_addr 0x0)

0x00000037:   DW_TAG_base_type
                DW_AT_name	("int")
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_byte_size	(0x04)


                DW_AT_decl_line	(30)
                DW_AT_prototyped	(true)
                DW_AT_external	(true)
                DW_AT_inline	(DW_INL_inlined)

0x00000308:     DW_TAG_formal_parameter
                  DW_AT_name	("p")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/vCard.c")
                  DW_AT_decl_line	(30)
                  DW_AT_type	(cu + 0x0217 "*")

0x00000313:     NULL

0x00000314:   DW_TAG_subprogram
                DW_AT_low_pc	(0x00000000000000f5)
                DW_AT_high_pc	(0x000000000000017a)
                DW_AT_frame_base	(DW_OP_reg5 EBP)
                DW_AT_name	("pbap_close_status_update_to_user")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/vCard.c")
                DW_AT_decl_line	(825)
                DW_AT_external	(true)

0x00000326:     DW_TAG_inlined_subroutine
                  DW_AT_abstract_origin	(cu + 0x0300 "vcard_free")
                  DW_AT_low_pc	(0x000000000000013e)
                  DW_AT_high_pc	(0x0000000000000146)
                  DW_AT_call_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/vCard.c")
                  DW_AT_call_line	(829)

0x00000336:       DW_TAG_formal_parameter
                    DW_AT_location	(0x00000092
                       0x000000000000013e - 0x0000000000000146: DW_OP_reg0 EAX)
                    DW_AT_abstract_origin	(cu + 0x0308 "p")

0x0000033f:       NULL

0x00000340:     NULL

0x00000341:   DW_TAG_subprogram
                DW_AT_name	("vcard_initial")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/vCard.c")
                DW_AT_decl_line	(762)
                DW_AT_prototyped	(true)
                DW_AT_inline	(DW_INL_inlined)

0x0000034a:   DW_TAG_subprogram
                DW_AT_name	("vcard_get_contact")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/vCard.c")
                DW_AT_decl_line	(703)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_inline	(DW_INL_inlined)

0x00000357:     DW_TAG_formal_parameter
                  DW_AT_name	("ver")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/vCard.c")
                  DW_AT_decl_line	(703)
                  DW_AT_type	(cu + 0x0037 "int")

0x00000363:     DW_TAG_formal_parameter
                  DW_AT_name	("flags")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/vCard.c")
                  DW_AT_decl_line	(703)
                  DW_AT_type	(cu + 0x0037 "int")

0x0000036f:     DW_TAG_formal_parameter
                  DW_AT_name	("vcard")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/vCard.c")
                  DW_AT_decl_line	(704)
                  DW_AT_type	(cu + 0x0208 "char*")

0x0000037b:     DW_TAG_formal_parameter
                  DW_AT_name	("contact")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/vCard.c")
                  DW_AT_decl_line	(704)
                  DW_AT_type	(cu + 0x03b8 "contact_t*")

0x00000387:     DW_TAG_variable
                  DW_AT_name	("cursor")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/vCard.c")
                  DW_AT_decl_line	(707)
                  DW_AT_type	(cu + 0x0208 "char*")

0x00000393:     DW_TAG_variable
                  DW_AT_name	("val")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/vCard.c")
                  DW_AT_decl_line	(707)
                  DW_AT_type	(cu + 0x0208 "char*")

0x0000039f:     DW_TAG_variable
                  DW_AT_name	("new_start")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/vCard.c")
                  DW_AT_decl_line	(707)
                  DW_AT_type	(cu + 0x0208 "char*")

0x000003ab:     DW_TAG_variable
                  DW_AT_name	("type")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/vCard.c")
                  DW_AT_decl_line	(706)
                  DW_AT_type	(cu + 0x0037 "int")

0x000003b7:     NULL

0x000003b8:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x03bd "contact_t")

0x000003bd:   DW_TAG_typedef
                DW_AT_type	(cu + 0x03c8 "structure ")
                DW_AT_name	("contact_t")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                DW_AT_decl_line	(87)

0x000003c8:   DW_TAG_structure_type
                DW_AT_byte_size	(0x50)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                DW_AT_decl_line	(80)

0x000003cc:     DW_TAG_member
                  DW_AT_name	("s_type")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(81)
                  DW_AT_data_member_location	(0x00)

0x000003d8:     DW_TAG_member
                  DW_AT_name	("is_restricted")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(82)
                  DW_AT_data_member_location	(0x04)

0x000003e4:     DW_TAG_member
                  DW_AT_name	("name")
                  DW_AT_type	(cu + 0x0415 "tel_name")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(83)
                  DW_AT_data_member_location	(0x08)

0x000003f0:     DW_TAG_member
                  DW_AT_name	("numbers")
                  DW_AT_type	(cu + 0x04c3 "tel_number")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(84)
                  DW_AT_data_member_location	(0x30)

0x000003fc:     DW_TAG_member
                  DW_AT_name	("call")
                  DW_AT_type	(cu + 0x0536 "call_info")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(85)
                  DW_AT_data_member_location	(0x44)

0x00000408:     DW_TAG_member
                  DW_AT_name	("nicknames")
                  DW_AT_type	(cu + 0x0208 "char*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(86)
                  DW_AT_data_member_location	(0x4c)

0x00000414:     NULL

0x00000415:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0420 "structure ")
                DW_AT_name	("tel_name")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                DW_AT_decl_line	(63)

0x00000420:   DW_TAG_structure_type
                DW_AT_byte_size	(0x28)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                DW_AT_decl_line	(50)

0x00000424:     DW_TAG_member
                  DW_AT_name	("v_type")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(51)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x10)
                  DW_AT_bit_offset	(0x10)
                  DW_AT_data_member_location	(0x00)

0x00000433:     DW_TAG_member
                  DW_AT_name	("embedded")
                  DW_AT_type	(cu + 0x04b8 "bool")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(52)
                  DW_AT_data_member_location	(0x02)

0x0000043f:     DW_TAG_member
                  DW_AT_name	("deleted")
                  DW_AT_type	(cu + 0x04b8 "bool")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(53)
                  DW_AT_data_member_location	(0x03)

0x0000044b:     DW_TAG_member
                  DW_AT_name	("is_changed")
                  DW_AT_type	(cu + 0x04b8 "bool")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(54)
                  DW_AT_data_member_location	(0x04)

0x00000457:     DW_TAG_member
                  DW_AT_name	("id")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(55)
                  DW_AT_data_member_location	(0x08)

0x00000463:     DW_TAG_member
                  DW_AT_name	("lang_type")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(56)
                  DW_AT_data_member_location	(0x0c)

0x0000046f:     DW_TAG_member
                  DW_AT_name	("first")
                  DW_AT_type	(cu + 0x0208 "char*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(57)
                  DW_AT_data_member_location	(0x10)

0x0000047b:     DW_TAG_member
                  DW_AT_name	("last")
                  DW_AT_type	(cu + 0x0208 "char*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(58)
                  DW_AT_data_member_location	(0x14)

0x00000487:     DW_TAG_member
                  DW_AT_name	("addition")
                  DW_AT_type	(cu + 0x0208 "char*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(59)
                  DW_AT_data_member_location	(0x18)

0x00000493:     DW_TAG_member
                  DW_AT_name	("display")
                  DW_AT_type	(cu + 0x0208 "char*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(60)
                  DW_AT_data_member_location	(0x1c)

0x0000049f:     DW_TAG_member
                  DW_AT_name	("prefix")
                  DW_AT_type	(cu + 0x0208 "char*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(61)
                  DW_AT_data_member_location	(0x20)

0x000004ab:     DW_TAG_member
                  DW_AT_name	("suffix")
                  DW_AT_type	(cu + 0x0208 "char*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(62)
                  DW_AT_data_member_location	(0x24)

0x000004b7:     NULL

0x000004b8:   DW_TAG_typedef
                DW_AT_type	(cu + 0x005f "unsigned char")
                DW_AT_name	("bool")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btcommon/typedef.h")
                DW_AT_decl_line	(44)

0x000004c3:   DW_TAG_typedef
                DW_AT_type	(cu + 0x04ce "structure ")
                DW_AT_name	("tel_number")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                DW_AT_decl_line	(75)

0x000004ce:   DW_TAG_structure_type
                DW_AT_byte_size	(0x14)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                DW_AT_decl_line	(65)

0x000004d2:     DW_TAG_member
                  DW_AT_name	("v_type")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(66)
                  DW_AT_byte_size	(0x04)
                  DW_AT_bit_size	(0x10)
                  DW_AT_bit_offset	(0x10)
                  DW_AT_data_member_location	(0x00)

0x000004e1:     DW_TAG_member
                  DW_AT_name	("embedded")
                  DW_AT_type	(cu + 0x04b8 "bool")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(67)
                  DW_AT_data_member_location	(0x02)

0x000004ed:     DW_TAG_member
                  DW_AT_name	("deleted")
                  DW_AT_type	(cu + 0x04b8 "bool")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(68)
                  DW_AT_data_member_location	(0x03)

0x000004f9:     DW_TAG_member
                  DW_AT_name	("is_default")
                  DW_AT_type	(cu + 0x04b8 "bool")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(69)
                  DW_AT_data_member_location	(0x04)

0x00000505:     DW_TAG_member
                  DW_AT_name	("is_favorite")
                  DW_AT_type	(cu + 0x04b8 "bool")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(70)
                  DW_AT_data_member_location	(0x05)

0x00000511:     DW_TAG_member
                  DW_AT_name	("id")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(71)
                  DW_AT_data_member_location	(0x08)

0x0000051d:     DW_TAG_member
                  DW_AT_name	("type")
                  DW_AT_type	(cu + 0x0037 "int")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(72)
                  DW_AT_data_member_location	(0x0c)

0x00000529:     DW_TAG_member
                  DW_AT_name	("number")
                  DW_AT_type	(cu + 0x0208 "char*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(73)
                  DW_AT_data_member_location	(0x10)

0x00000535:     NULL

0x00000536:   DW_TAG_typedef
                DW_AT_type	(cu + 0x0541 "structure ")
                DW_AT_name	("call_info")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                DW_AT_decl_line	(79)

0x00000541:   DW_TAG_structure_type
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                DW_AT_decl_line	(76)

0x00000545:     DW_TAG_member
                  DW_AT_name	("call_type")
                  DW_AT_type	(cu + 0x0054 "u8")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(77)
                  DW_AT_data_member_location	(0x00)

0x00000551:     DW_TAG_member
                  DW_AT_name	("call_date")
                  DW_AT_type	(cu + 0x0208 "char*")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/make/../btstack/Profile/include/bredr/vcard.h")
                  DW_AT_decl_line	(78)
                  DW_AT_data_member_location	(0x04)

0x0000055d:     NULL

0x0000055e:   DW_TAG_subprogram
                DW_AT_name	("vcard_check_version")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/vCard.c")
                DW_AT_decl_line	(160)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_inline	(DW_INL_inlined)

0x0000056a:     DW_TAG_formal_parameter
                  DW_AT_name	("src")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/vCard.c")
                  DW_AT_decl_line	(160)
                  DW_AT_type	(cu + 0x00a6 "const char*")

0x00000575:     DW_TAG_variable
                  DW_AT_name	("start")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/vCard.c")
                  DW_AT_decl_line	(162)
                  DW_AT_type	(cu + 0x04b8 "bool")

0x00000580:     DW_TAG_variable
                  DW_AT_name	("ver3")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/vCard.c")
                  DW_AT_decl_line	(163)
                  DW_AT_type	(cu + 0x00a6 "const char*")

0x0000058b:     NULL

0x0000058c:   DW_TAG_subprogram
                DW_AT_name	("vcard_check_content_type")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/vCard.c")
                DW_AT_decl_line	(526)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0037 "int")
                DW_AT_inline	(DW_INL_inlined)

0x00000599:     DW_TAG_formal_parameter
                  DW_AT_name	("vcard")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/vCard.c")
                  DW_AT_decl_line	(526)
                  DW_AT_type	(cu + 0x05be "char**")

0x000005a5:     DW_TAG_variable
                  DW_AT_name	("new_start")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/vCard.c")
                  DW_AT_decl_line	(529)
                  DW_AT_type	(cu + 0x0208 "char*")

0x000005b1:     DW_TAG_variable
                  DW_AT_name	("i")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/vCard.c")
                  DW_AT_decl_line	(528)
                  DW_AT_type	(cu + 0x0037 "int")

0x000005bd:     NULL

0x000005be:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0208 "char*")

0x000005c3:   DW_TAG_subprogram
                DW_AT_name	("vcard_pass_unsupported")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/vCard.c")
                DW_AT_decl_line	(515)
                DW_AT_prototyped	(true)
                DW_AT_type	(cu + 0x0208 "char*")
                DW_AT_inline	(DW_INL_inlined)

0x000005d0:     DW_TAG_formal_parameter
                  DW_AT_name	("vcard")
                  DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/vCard.c")
                  DW_AT_decl_line	(515)
                  DW_AT_type	(cu + 0x0208 "char*")

0x000005dc:     NULL

0x000005dd:   DW_TAG_subprogram
                DW_AT_name	("get_content_value")
                DW_AT_decl_file	("/jks/jenkins/workspace/data_trans_sdk_export_gitlab/data_trans_sdk/lib/bt_protocol/btstack/Profile/BR_EDR/vCard.c")
                DW_AT_decl_line	(234)
                DW_AT_prototyped	(true)
